{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-120",
   "self_type" : "type-272",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-1044",
   "self_type" : "type-1298",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-4",
   "self_type" : "type-12",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [32]",
   "name" : "unsigned char [32]",
   "referenced_type" : "type-90",
   "self_type" : "type-1105",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-90",
   "self_type" : "type-270",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [8]",
   "name" : "unsigned int [8]",
   "referenced_type" : "type-2",
   "self_type" : "type-1291",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,

   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-971",
   "self_type" : "type-970",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-90",
   "self_type" : "type-1123",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-545",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-5",
   "self_type" : "type-1065",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-233",
   "self_type" : "type-1060",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-252",
   "self_type" : "type-1173",
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-13",
   "self_type" : "type-646",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-4",
   "self_type" : "type-561",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-645"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-557"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-551", "type-522" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-866"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-865",
   "self_type" : "type-865",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-867" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-860"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-859",
   "self_type" : "type-859",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-861" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-542"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-541",
   "self_type" : "type-541",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-1307"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-1306",
   "self_type" : "type-1306",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-865"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-390"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-867",
   "self_type" : "type-867",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-1312"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-1311",
   "self_type" : "type-1311",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-1315"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-1314",
   "self_type" : "type-1314",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-1315"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-1317",
   "self_type" : "type-1317",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-1076",
   "self_type" : "type-1076",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-1071",
   "self_type" : "type-1071",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTag",
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::ScopedTrace",
   "name" : "android::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "type-1319",
   "self_type" : "type-1319",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Trace.h",
   "unique_id" : "_ZTSN7android11ScopedTraceE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-559" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-544"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-552"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-27"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "type-643"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "type-251"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-541"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "type-644"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "type-646"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "type-646"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "type-640"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-642",
   "self_type" : "type-642",
   "size" : 44,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-544"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "type-543",
   "self_type" : "type-543",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-546" ],
   "unique_id" : "_ZTSN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-251"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-545"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-859"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-861",
   "self_type" : "type-861",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-35"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 96,
     "referenced_type" : "type-250"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "type-251"
    }
   ],
   "linker_set_key" : "android::hardware::BHwBinder",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 28,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware9BHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-27"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 96,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwRefBase",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware11BpHwRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-150"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::camera::device::V3_2::ICameraDevice>",
   "name" : "android::hardware::BpInterface<android::hardware::camera::device::V3_2::ICameraDevice>",
   "record_kind" : "class",
   "referenced_type" : "type-1210",
   "self_type" : "type-1210",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-150" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_213ICameraDevice8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice15getResourceCostENSt3__18functionIFvNS1_6common4V1_06StatusERKNS8_18CameraResourceCostEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice24getCameraCharacteristicsENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice12setTorchModeENS1_6common4V1_09TorchModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice4openERKNS_2spINS3_21ICameraDeviceCallbackEEENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_INS3_20ICameraDeviceSessionEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice9dumpStateERKNS0_11hidl_handleE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-25"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::camera::device::V3_2::ICameraDeviceCallback>",
   "name" : "android::hardware::BpInterface<android::hardware::camera::device::V3_2::ICameraDeviceCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-1208",
   "self_type" : "type-1208",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_221ICameraDeviceCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback20processCaptureResultERKNS0_8hidl_vecINS3_13CaptureResultEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback6notifyERKNS0_8hidl_vecINS3_9NotifyMsgEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-308"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::camera::device::V3_2::ICameraDeviceSession>",
   "name" : "android::hardware::BpInterface<android::hardware::camera::device::V3_2::ICameraDeviceSession>",
   "record_kind" : "class",
   "referenced_type" : "type-1209",
   "self_type" : "type-1209",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-308" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_220ICameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession31constructDefaultRequestSettingsENS3_15RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession16configureStreamsERKNS3_19StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS3_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS3_14CaptureRequestEEERKNS5_INS3_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession5closeEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-307"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::camera::device::V3_3::ICameraDeviceSession>",
   "name" : "android::hardware::BpInterface<android::hardware::camera::device::V3_3::ICameraDeviceSession>",
   "record_kind" : "class",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-307" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_320ICameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession31constructDefaultRequestSettingsENS2_4V3_215RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession16configureStreamsERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS2_4V3_214CaptureRequestEEERKNS5_INS6_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession20configureStreams_3_3ERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS3_22HalStreamConfigurationEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-24"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::camera::device::V3_4::ICameraDeviceCallback>",
   "name" : "android::hardware::BpInterface<android::hardware::camera::device::V3_4::ICameraDeviceCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_421ICameraDeviceCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback20processCaptureResultERKNS0_8hidl_vecINS2_4V3_213CaptureResultEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback6notifyERKNS0_8hidl_vecINS2_4V3_29NotifyMsgEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback24processCaptureResult_3_4ERKNS0_8hidl_vecINS3_13CaptureResultEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-306"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::camera::device::V3_4::ICameraDeviceSession>",
   "name" : "android::hardware::BpInterface<android::hardware::camera::device::V3_4::ICameraDeviceSession>",
   "record_kind" : "class",
   "referenced_type" : "type-397",
   "self_type" : "type-397",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-306" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_420ICameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession31constructDefaultRequestSettingsENS2_4V3_215RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession16configureStreamsERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS2_4V3_214CaptureRequestEEERKNS5_INS6_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession20configureStreams_3_3ERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS2_4V3_322HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession20configureStreams_3_4ERKNS3_19StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS3_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession25processCaptureRequest_3_4ERKNS0_8hidl_vecINS3_14CaptureRequestEEERKNS5_INS2_4V3_211BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-149"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::camera::device::V3_5::ICameraDevice>",
   "name" : "android::hardware::BpInterface<android::hardware::camera::device::V3_5::ICameraDevice>",
   "record_kind" : "class",
   "referenced_type" : "type-410",
   "self_type" : "type-410",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-149" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_513ICameraDevice8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice15getResourceCostENSt3__18functionIFvNS1_6common4V1_06StatusERKNS8_18CameraResourceCostEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice24getCameraCharacteristicsENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice12setTorchModeENS1_6common4V1_09TorchModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice4openERKNS_2spINS2_4V3_221ICameraDeviceCallbackEEENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_INS6_20ICameraDeviceSessionEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice9dumpStateERKNS0_11hidl_handleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice32getPhysicalCameraCharacteristicsERKNS0_11hidl_stringENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_513ICameraDevice28isStreamCombinationSupportedERKNS2_4V3_419StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusEbEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-23"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::camera::device::V3_5::ICameraDeviceCallback>",
   "name" : "android::hardware::BpInterface<android::hardware::camera::device::V3_5::ICameraDeviceCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-23" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_521ICameraDeviceCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback20processCaptureResultERKNS0_8hidl_vecINS2_4V3_213CaptureResultEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback6notifyERKNS0_8hidl_vecINS2_4V3_29NotifyMsgEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback24processCaptureResult_3_4ERKNS0_8hidl_vecINS2_4V3_413CaptureResultEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback20requestStreamBuffersERKNS0_8hidl_vecINS3_13BufferRequestEEENSt3__18functionIFvNS3_19BufferRequestStatusERKNS5_INS3_15StreamBufferRetEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_521ICameraDeviceCallback19returnStreamBuffersERKNS0_8hidl_vecINS2_4V3_212StreamBufferEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-305"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::camera::device::V3_5::ICameraDeviceSession>",
   "name" : "android::hardware::BpInterface<android::hardware::camera::device::V3_5::ICameraDeviceSession>",
   "record_kind" : "class",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-305" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_520ICameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession31constructDefaultRequestSettingsENS2_4V3_215RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession16configureStreamsERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS2_4V3_214CaptureRequestEEERKNS5_INS6_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession20configureStreams_3_3ERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS2_4V3_322HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession20configureStreams_3_4ERKNS2_4V3_419StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession25processCaptureRequest_3_4ERKNS0_8hidl_vecINS2_4V3_414CaptureRequestEEERKNS5_INS2_4V3_211BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession20configureStreams_3_5ERKNS3_19StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS2_4V3_422HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession17signalStreamFlushERKNS0_8hidl_vecIiEEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_520ICameraDeviceSession25isReconfigurationRequiredERKNS0_8hidl_vecIhEES8_NSt3__18functionIFvNS1_6common4V1_06StatusEbEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6camera6device4V3_520ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-26"
    },
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "name" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1207",
   "self_type" : "type-1207",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-26" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1230"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1231"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "record_kind" : "class",
   "referenced_type" : "type-1229",
   "self_type" : "type-1229",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-67", "type-1232" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEENS0_7details9SchedPrioEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1242"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1243"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-1241",
   "self_type" : "type-1241",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-67", "type-13" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEEbEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1247"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1248"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "name" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-1246",
   "self_type" : "type-1246",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-519", "type-314" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1266"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1267"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-1265",
   "self_type" : "type-1265",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-1268", "type-1269" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS_4hidl4base4V1_05IBaseEEEPvEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1253"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1254"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-1252",
   "self_type" : "type-1252",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-1255", "type-1256" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS0_7IBinderEEEPvEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-1077"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-1085",
   "self_type" : "type-1085",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder::DeathRecipient",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::hardware::IInterface",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "unique_id" : "_ZTSN7android8hardware10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "type-383"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "type-388"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "name" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "type-1182",
   "self_type" : "type-1182",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "type-120" ],
   "unique_id" : "_ZTSN7android8hardware12MQDescriptorIcLNS0_8MQFlavorE1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "type-383"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "type-388"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::MQDescriptor<unsigned char, android::hardware::kSynchronizedReadWrite>",
   "name" : "android::hardware::MQDescriptor<unsigned char, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "type-382",
   "self_type" : "type-382",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN7android8hardware12MQDescriptorIhLNS0_8MQFlavorE1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 32,
     "referenced_type" : "type-1213"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 160,
     "referenced_type" : "type-89"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 288,
     "referenced_type" : "type-1214"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 448,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 456,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 464,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 480,
     "referenced_type" : "type-1215"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 512,
     "referenced_type" : "type-251"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-1212",
   "self_type" : "type-1212",
   "size" : 68,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel::BufferInfo",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "type-1219",
   "self_type" : "type-1219",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6Parcel10BufferInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-27"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 64,
     "referenced_type" : "type-251"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 96,
     "referenced_type" : "type-538"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 128,
     "referenced_type" : "type-539"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 256,
     "referenced_type" : "type-540"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 320,
     "referenced_type" : "type-541"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 352,
     "referenced_type" : "type-543"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 512,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 544,
     "referenced_type" : "type-547"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 576,
     "referenced_type" : "type-251"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 608,
     "referenced_type" : "type-556"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 768,
     "referenced_type" : "type-560"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 800,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 808,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 832,
     "referenced_type" : "type-561"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 864,
     "referenced_type" : "type-545"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 896,
     "referenced_type" : "type-562"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "type-537",
   "self_type" : "type-537",
   "size" : 128,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessStateE",
   "vtable_components" :
   [
    {
     "component_value" : 116,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -116,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -116,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "refs",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState::handle_entry",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessState12handle_entryE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-58"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-810"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::camera::common::V1_0::Status>",
   "name" : "android::hardware::Return<android::hardware::camera::common::V1_0::Status>",
   "record_kind" : "class",
   "referenced_type" : "type-809",
   "self_type" : "type-809",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-810" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_6camera6common4V1_06StatusEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-58"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-147"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::camera::device::V3_5::ICameraDevice> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::camera::device::V3_5::ICameraDevice> >",
   "record_kind" : "class",
   "referenced_type" : "type-838",
   "self_type" : "type-838",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-147" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_6camera6device4V3_513ICameraDeviceEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-58"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::camera::device::V3_5::ICameraDeviceCallback> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::camera::device::V3_5::ICameraDeviceCallback> >",
   "record_kind" : "class",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-48" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_6camera6device4V3_521ICameraDeviceCallbackEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-58"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-303"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::camera::device::V3_5::ICameraDeviceSession> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::camera::device::V3_5::ICameraDeviceSession> >",
   "record_kind" : "class",
   "referenced_type" : "type-343",
   "self_type" : "type-343",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-303" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_6camera6device4V3_520ICameraDeviceSessionEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-58"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 168,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::hardware::Return<bool>",
   "name" : "android::hardware::Return<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-772",
   "self_type" : "type-772",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIbEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-58"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-855",
   "self_type" : "type-855",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-252" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "resourceCost",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "conflictingDevices",
     "field_offset" : 64,
     "referenced_type" : "type-1089"
    }
   ],
   "linker_set_key" : "android::hardware::camera::common::V1_0::CameraResourceCost",
   "name" : "android::hardware::camera::common::V1_0::CameraResourceCost",
   "referenced_type" : "type-1340",
   "self_type" : "type-1340",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/common/1.0/android.hardware.camera.common@1.0_genc++_headers/gen/android/hardware/camera/common/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6common4V1_018CameraResourceCostE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tagId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tagName",
     "field_offset" : 64,
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "tagType",
     "field_offset" : 192,
     "referenced_type" : "type-1118"
    }
   ],
   "linker_set_key" : "android::hardware::camera::common::V1_0::VendorTag",
   "name" : "android::hardware::camera::common::V1_0::VendorTag",
   "referenced_type" : "type-1117",
   "self_type" : "type-1117",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/common/1.0/android.hardware.camera.common@1.0_genc++_headers/gen/android/hardware/camera/common/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6common4V1_09VendorTagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sectionName",
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "tags",
     "field_offset" : 128,
     "referenced_type" : "type-1113"
    }
   ],
   "linker_set_key" : "android::hardware::camera::common::V1_0::VendorTagSection",
   "name" : "android::hardware::camera::common::V1_0::VendorTagSection",
   "referenced_type" : "type-1336",
   "self_type" : "type-1336",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/common/1.0/android.hardware.camera.common@1.0_genc++_headers/gen/android/hardware/camera/common/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6common4V1_016VendorTagSectionE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-247"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-733"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::BnHwCameraDevice",
   "name" : "android::hardware::camera::device::V3_2::BnHwCameraDevice",
   "referenced_type" : "type-1456",
   "self_type" : "type-1456",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/BnHwCameraDevice.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_216BnHwCameraDeviceE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_216BnHwCameraDeviceE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BnHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BnHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BnHwCameraDevice10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_216BnHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_216BnHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_216BnHwCameraDeviceD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_216BnHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_216BnHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_216BnHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-247"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-455"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::BnHwCameraDeviceCallback",
   "name" : "android::hardware::camera::device::V3_2::BnHwCameraDeviceCallback",
   "referenced_type" : "type-1440",
   "self_type" : "type-1440",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/BnHwCameraDeviceCallback.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BnHwCameraDeviceCallback10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_224BnHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-247"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-491"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::BnHwCameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_2::BnHwCameraDeviceSession",
   "referenced_type" : "type-1449",
   "self_type" : "type-1449",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/BnHwCameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BnHwCameraDeviceSession10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_223BnHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1210"
    },
    {
     "referenced_type" : "type-15"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-1460"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-1461"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::BpHwCameraDevice",
   "name" : "android::hardware::camera::device::V3_2::BpHwCameraDevice",
   "referenced_type" : "type-1459",
   "self_type" : "type-1459",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/BpHwCameraDevice.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_216BpHwCameraDeviceE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_216BpHwCameraDeviceE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_216BpHwCameraDevice8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice15getResourceCostENSt3__18functionIFvNS1_6common4V1_06StatusERKNS8_18CameraResourceCostEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice24getCameraCharacteristicsENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice12setTorchModeENS1_6common4V1_09TorchModeE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice4openERKNS_2spINS3_21ICameraDeviceCallbackEEENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_INS3_20ICameraDeviceSessionEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_216BpHwCameraDevice9dumpStateERKNS0_11hidl_handleE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_216BpHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_216BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_216BpHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_213ICameraDeviceEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_216BpHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_216BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_216BpHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_216BpHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_216BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_216BpHwCameraDeviceD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_216BpHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_216BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_216BpHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1208"
    },
    {
     "referenced_type" : "type-15"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-1444"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-1445"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::BpHwCameraDeviceCallback",
   "name" : "android::hardware::camera::device::V3_2::BpHwCameraDeviceCallback",
   "referenced_type" : "type-1443",
   "self_type" : "type-1443",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/BpHwCameraDeviceCallback.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback20processCaptureResultERKNS0_8hidl_vecINS3_13CaptureResultEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallback6notifyERKNS0_8hidl_vecINS3_9NotifyMsgEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_221ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_224BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1209"
    },
    {
     "referenced_type" : "type-15"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-1452"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-1453"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::BpHwCameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_2::BpHwCameraDeviceSession",
   "referenced_type" : "type-1451",
   "self_type" : "type-1451",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/BpHwCameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_223BpHwCameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession31constructDefaultRequestSettingsENS3_15RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession16configureStreamsERKNS3_19StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS3_22HalStreamConfigurationEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS3_14CaptureRequestEEERKNS5_INS3_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession5flushEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_223BpHwCameraDeviceSession5closeEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_220ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_223BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streamId",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bufferId",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::BufferCache",
   "name" : "android::hardware::camera::device::V3_2::BufferCache",
   "referenced_type" : "type-287",
   "self_type" : "type-287",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_211BufferCacheE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "blobId",
     "referenced_type" : "type-1394"
    },
    {
     "field_name" : "blobSize",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::CameraBlob",
   "name" : "android::hardware::camera::device::V3_2::CameraBlob",
   "referenced_type" : "type-1395",
   "self_type" : "type-1395",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_210CameraBlobE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fmqSettingsSize",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "settings",
     "field_offset" : 128,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "inputBuffer",
     "field_offset" : 256,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "outputBuffers",
     "field_offset" : 832,
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::CaptureRequest",
   "name" : "android::hardware::camera::device::V3_2::CaptureRequest",
   "referenced_type" : "type-283",
   "self_type" : "type-283",
   "size" : 120,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_214CaptureRequestE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fmqResultSize",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "result",
     "field_offset" : 128,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "outputBuffers",
     "field_offset" : 256,
     "referenced_type" : "type-91"
    },
    {
     "field_name" : "inputBuffer",
     "field_offset" : 384,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "partialResult",
     "field_offset" : 960,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::CaptureResult",
   "name" : "android::hardware::camera::device::V3_2::CaptureResult",
   "referenced_type" : "type-85",
   "self_type" : "type-85",
   "size" : 128,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_213CaptureResultE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "errorStreamId",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "errorCode",
     "field_offset" : 64,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::ErrorMsg",
   "name" : "android::hardware::camera::device::V3_2::ErrorMsg",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_28ErrorMsgE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "overrideFormat",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "producerUsage",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "consumerUsage",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "maxBuffers",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::HalStream",
   "name" : "android::hardware::camera::device::V3_2::HalStream",
   "referenced_type" : "type-679",
   "self_type" : "type-679",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_29HalStreamE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streams",
     "referenced_type" : "type-1130"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::HalStreamConfiguration",
   "name" : "android::hardware::camera::device::V3_2::HalStreamConfiguration",
   "referenced_type" : "type-1393",
   "self_type" : "type-1393",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_222HalStreamConfigurationE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::ICameraDevice",
   "name" : "android::hardware::camera::device::V3_2::ICameraDevice",
   "referenced_type" : "type-150",
   "self_type" : "type-150",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/ICameraDevice.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_213ICameraDeviceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_213ICameraDeviceE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_213ICameraDevice8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDeviceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice15getResourceCostENSt3__18functionIFvNS1_6common4V1_06StatusERKNS8_18CameraResourceCostEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice24getCameraCharacteristicsENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice12setTorchModeENS1_6common4V1_09TorchModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice4openERKNS_2spINS3_21ICameraDeviceCallbackEEENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_INS3_20ICameraDeviceSessionEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_213ICameraDevice9dumpStateERKNS0_11hidl_handleE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_213ICameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_213ICameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_213ICameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::ICameraDeviceCallback",
   "name" : "android::hardware::camera::device::V3_2::ICameraDeviceCallback",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/ICameraDeviceCallback.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_221ICameraDeviceCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_221ICameraDeviceCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_221ICameraDeviceCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback20processCaptureResultERKNS0_8hidl_vecINS3_13CaptureResultEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_221ICameraDeviceCallback6notifyERKNS0_8hidl_vecINS3_9NotifyMsgEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_221ICameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_221ICameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_221ICameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::ICameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_2::ICameraDeviceSession",
   "referenced_type" : "type-308",
   "self_type" : "type-308",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/ICameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_220ICameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_220ICameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_220ICameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSessionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession31constructDefaultRequestSettingsENS3_15RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession16configureStreamsERKNS3_19StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS3_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS3_14CaptureRequestEEERKNS5_INS3_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_220ICameraDeviceSession5closeEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_220ICameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_220ICameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_220ICameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "msg",
     "field_offset" : 64,
     "referenced_type" : "type-101"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::NotifyMsg",
   "name" : "android::hardware::camera::device::V3_2::NotifyMsg",
   "referenced_type" : "type-99",
   "self_type" : "type-99",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_29NotifyMsgE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "error",
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "shutter",
     "referenced_type" : "type-104"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::NotifyMsg::Message",
   "name" : "android::hardware::camera::device::V3_2::NotifyMsg::Message",
   "record_kind" : "union",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_29NotifyMsg7MessageE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::ShutterMsg",
   "name" : "android::hardware::camera::device::V3_2::ShutterMsg",
   "referenced_type" : "type-104",
   "self_type" : "type-104",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_210ShutterMsgE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "streamType",
     "field_offset" : 32,
     "referenced_type" : "type-225"
    },
    {
     "field_name" : "width",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "usage",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "dataSpace",
     "field_offset" : 256,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "rotation",
     "field_offset" : 288,
     "referenced_type" : "type-227"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::Stream",
   "name" : "android::hardware::camera::device::V3_2::Stream",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_26StreamE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streamId",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bufferId",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "status",
     "field_offset" : 256,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "acquireFence",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "releaseFence",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::StreamBuffer",
   "name" : "android::hardware::camera::device::V3_2::StreamBuffer",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 72,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_212StreamBufferE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streams",
     "referenced_type" : "type-501"
    },
    {
     "field_name" : "operationMode",
     "field_offset" : 128,
     "referenced_type" : "type-228"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_2::StreamConfiguration",
   "name" : "android::hardware::camera::device::V3_2::StreamConfiguration",
   "referenced_type" : "type-500",
   "self_type" : "type-500",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.2/android.hardware.camera.device@3.2_genc++_headers/gen/android/hardware/camera/device/3.2/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_219StreamConfigurationE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-247"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-325"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_3::BnHwCameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_3::BnHwCameraDeviceSession",
   "referenced_type" : "type-477",
   "self_type" : "type-477",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.3/android.hardware.camera.device@3.3_genc++_headers/gen/android/hardware/camera/device/3.3/BnHwCameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BnHwCameraDeviceSession10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_323BnHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-396"
    },
    {
     "referenced_type" : "type-15"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-481"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-482"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_3::BpHwCameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_3::BpHwCameraDeviceSession",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.3/android.hardware.camera.device@3.3_genc++_headers/gen/android/hardware/camera/device/3.3/BpHwCameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_323BpHwCameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession31constructDefaultRequestSettingsENS2_4V3_215RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession16configureStreamsERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_22HalStreamConfigurationEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS2_4V3_214CaptureRequestEEERKNS5_INS6_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession5flushEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession5closeEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_323BpHwCameraDeviceSession20configureStreams_3_3ERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS3_22HalStreamConfigurationEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_320ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_323BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v3_2",
     "referenced_type" : "type-679"
    },
    {
     "field_name" : "overrideDataSpace",
     "field_offset" : 256,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_3::HalStream",
   "name" : "android::hardware::camera::device::V3_3::HalStream",
   "referenced_type" : "type-678",
   "self_type" : "type-678",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.3/android.hardware.camera.device@3.3_genc++_headers/gen/android/hardware/camera/device/3.3/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_39HalStreamE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streams",
     "referenced_type" : "type-1141"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_3::HalStreamConfiguration",
   "name" : "android::hardware::camera::device::V3_3::HalStreamConfiguration",
   "referenced_type" : "type-1430",
   "self_type" : "type-1430",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.3/android.hardware.camera.device@3.3_genc++_headers/gen/android/hardware/camera/device/3.3/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_322HalStreamConfigurationE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-308"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_3::ICameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_3::ICameraDeviceSession",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.3/android.hardware.camera.device@3.3_genc++_headers/gen/android/hardware/camera/device/3.3/ICameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_320ICameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_320ICameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_320ICameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSessionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession31constructDefaultRequestSettingsENS2_4V3_215RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession16configureStreamsERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS2_4V3_214CaptureRequestEEERKNS5_INS6_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_320ICameraDeviceSession20configureStreams_3_3ERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS3_22HalStreamConfigurationEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_320ICameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_320ICameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_320ICameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-247"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::BnHwCameraDeviceCallback",
   "name" : "android::hardware::camera::device::V3_4::BnHwCameraDeviceCallback",
   "referenced_type" : "type-246",
   "self_type" : "type-246",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/BnHwCameraDeviceCallback.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BnHwCameraDeviceCallback10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_424BnHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-247"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-331"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::BnHwCameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_4::BnHwCameraDeviceSession",
   "referenced_type" : "type-485",
   "self_type" : "type-485",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/BnHwCameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BnHwCameraDeviceSession10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_423BnHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    },
    {
     "referenced_type" : "type-15"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-255"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-256"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::BpHwCameraDeviceCallback",
   "name" : "android::hardware::camera::device::V3_4::BpHwCameraDeviceCallback",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/BpHwCameraDeviceCallback.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback20processCaptureResultERKNS0_8hidl_vecINS2_4V3_213CaptureResultEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback6notifyERKNS0_8hidl_vecINS2_4V3_29NotifyMsgEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallback24processCaptureResult_3_4ERKNS0_8hidl_vecINS3_13CaptureResultEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_421ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_424BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-397"
    },
    {
     "referenced_type" : "type-15"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-488"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-489"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::BpHwCameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_4::BpHwCameraDeviceSession",
   "referenced_type" : "type-487",
   "self_type" : "type-487",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/BpHwCameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_423BpHwCameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession31constructDefaultRequestSettingsENS2_4V3_215RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession16configureStreamsERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_22HalStreamConfigurationEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS2_4V3_214CaptureRequestEEERKNS5_INS6_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession5flushEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession5closeEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession20configureStreams_3_3ERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS2_4V3_322HalStreamConfigurationEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession20configureStreams_3_4ERKNS3_19StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS3_22HalStreamConfigurationEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_423BpHwCameraDeviceSession25processCaptureRequest_3_4ERKNS0_8hidl_vecINS3_14CaptureRequestEEERKNS5_INS2_4V3_211BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_420ICameraDeviceSessionEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_423BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v3_2",
     "referenced_type" : "type-283"
    },
    {
     "field_name" : "physicalCameraSettings",
     "field_offset" : 960,
     "referenced_type" : "type-292"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::CaptureRequest",
   "name" : "android::hardware::camera::device::V3_4::CaptureRequest",
   "referenced_type" : "type-291",
   "self_type" : "type-291",
   "size" : 136,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_414CaptureRequestE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v3_2",
     "referenced_type" : "type-85"
    },
    {
     "field_name" : "physicalCameraMetadata",
     "field_offset" : 1024,
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::CaptureResult",
   "name" : "android::hardware::camera::device::V3_4::CaptureResult",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 144,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_413CaptureResultE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v3_3",
     "referenced_type" : "type-678"
    },
    {
     "field_name" : "physicalCameraId",
     "field_offset" : 320,
     "referenced_type" : "type-115"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::HalStream",
   "name" : "android::hardware::camera::device::V3_4::HalStream",
   "referenced_type" : "type-1152",
   "self_type" : "type-1152",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_49HalStreamE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streams",
     "referenced_type" : "type-1148"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::HalStreamConfiguration",
   "name" : "android::hardware::camera::device::V3_4::HalStreamConfiguration",
   "referenced_type" : "type-1431",
   "self_type" : "type-1431",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_422HalStreamConfigurationE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::ICameraDeviceCallback",
   "name" : "android::hardware::camera::device::V3_4::ICameraDeviceCallback",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/ICameraDeviceCallback.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_421ICameraDeviceCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_421ICameraDeviceCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_421ICameraDeviceCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback20processCaptureResultERKNS0_8hidl_vecINS2_4V3_213CaptureResultEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback6notifyERKNS0_8hidl_vecINS2_4V3_29NotifyMsgEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_421ICameraDeviceCallback24processCaptureResult_3_4ERKNS0_8hidl_vecINS3_13CaptureResultEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_421ICameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_421ICameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_421ICameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-307"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::ICameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_4::ICameraDeviceSession",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/ICameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_420ICameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_420ICameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_420ICameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSessionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession31constructDefaultRequestSettingsENS2_4V3_215RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession16configureStreamsERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS2_4V3_214CaptureRequestEEERKNS5_INS6_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession20configureStreams_3_3ERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS2_4V3_322HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession20configureStreams_3_4ERKNS3_19StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS3_22HalStreamConfigurationEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_420ICameraDeviceSession25processCaptureRequest_3_4ERKNS0_8hidl_vecINS3_14CaptureRequestEEERKNS5_INS2_4V3_211BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_420ICameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_420ICameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_420ICameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fmqMetadataSize",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "physicalCameraId",
     "field_offset" : 64,
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "metadata",
     "field_offset" : 192,
     "referenced_type" : "type-86"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::PhysicalCameraMetadata",
   "name" : "android::hardware::camera::device::V3_4::PhysicalCameraMetadata",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_422PhysicalCameraMetadataE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fmqSettingsSize",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "physicalCameraId",
     "field_offset" : 64,
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "settings",
     "field_offset" : 192,
     "referenced_type" : "type-86"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::PhysicalCameraSetting",
   "name" : "android::hardware::camera::device::V3_4::PhysicalCameraSetting",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_421PhysicalCameraSettingE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "v3_2",
     "referenced_type" : "type-224"
    },
    {
     "field_name" : "physicalCameraId",
     "field_offset" : 320,
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "bufferSize",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::Stream",
   "name" : "android::hardware::camera::device::V3_4::Stream",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 64,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_46StreamE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streams",
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "operationMode",
     "field_offset" : 128,
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "sessionParams",
     "field_offset" : 192,
     "referenced_type" : "type-86"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_4::StreamConfiguration",
   "name" : "android::hardware::camera::device::V3_4::StreamConfiguration",
   "referenced_type" : "type-218",
   "self_type" : "type-218",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.4/android.hardware.camera.device@3.4_genc++_headers/gen/android/hardware/camera/device/3.4/types.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_419StreamConfigurationE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-247"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-147"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_5::BnHwCameraDevice",
   "name" : "android::hardware::camera::device::V3_5::BnHwCameraDevice",
   "referenced_type" : "type-342",
   "self_type" : "type-342",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.5/android.hardware.camera.device@3.5_genc++_headers/gen/android/hardware/camera/device/3.5/BnHwCameraDevice.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_516BnHwCameraDeviceE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_516BnHwCameraDeviceE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BnHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BnHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BnHwCameraDevice10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_516BnHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_516BnHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_516BnHwCameraDeviceD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_516BnHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_516BnHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_516BnHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-247"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_5::BnHwCameraDeviceCallback",
   "name" : "android::hardware::camera::device::V3_5::BnHwCameraDeviceCallback",
   "referenced_type" : "type-1493",
   "self_type" : "type-1493",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.5/android.hardware.camera.device@3.5_genc++_headers/gen/android/hardware/camera/device/3.5/BnHwCameraDeviceCallback.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BnHwCameraDeviceCallback10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_524BnHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-247"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-303"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_5::BnHwCameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_5::BnHwCameraDeviceSession",
   "referenced_type" : "type-312",
   "self_type" : "type-312",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.5/android.hardware.camera.device@3.5_genc++_headers/gen/android/hardware/camera/device/3.5/BnHwCameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BnHwCameraDeviceSession10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_523BnHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-410"
    },
    {
     "referenced_type" : "type-15"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-408"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-409"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_5::BpHwCameraDevice",
   "name" : "android::hardware::camera::device::V3_5::BpHwCameraDevice",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.5/android.hardware.camera.device@3.5_genc++_headers/gen/android/hardware/camera/device/3.5/BpHwCameraDevice.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_516BpHwCameraDeviceE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_516BpHwCameraDeviceE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_516BpHwCameraDevice8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice15getResourceCostENSt3__18functionIFvNS1_6common4V1_06StatusERKNS8_18CameraResourceCostEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice24getCameraCharacteristicsENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice12setTorchModeENS1_6common4V1_09TorchModeE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice4openERKNS_2spINS2_4V3_221ICameraDeviceCallbackEEENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_INS6_20ICameraDeviceSessionEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice9dumpStateERKNS0_11hidl_handleE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice32getPhysicalCameraCharacteristicsERKNS0_11hidl_stringENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_516BpHwCameraDevice28isStreamCombinationSupportedERKNS2_4V3_419StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusEbEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_516BpHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_516BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_516BpHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_513ICameraDeviceEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_516BpHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_516BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_516BpHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_516BpHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_516BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_516BpHwCameraDeviceD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_516BpHwCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_516BpHwCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_516BpHwCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-22"
    },
    {
     "referenced_type" : "type-15"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_5::BpHwCameraDeviceCallback",
   "name" : "android::hardware::camera::device::V3_5::BpHwCameraDeviceCallback",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.5/android.hardware.camera.device@3.5_genc++_headers/gen/android/hardware/camera/device/3.5/BpHwCameraDeviceCallback.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback20processCaptureResultERKNS0_8hidl_vecINS2_4V3_213CaptureResultEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback6notifyERKNS0_8hidl_vecINS2_4V3_29NotifyMsgEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback24processCaptureResult_3_4ERKNS0_8hidl_vecINS2_4V3_413CaptureResultEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback20requestStreamBuffersERKNS0_8hidl_vecINS3_13BufferRequestEEENSt3__18functionIFvNS3_19BufferRequestStatusERKNS5_INS3_15StreamBufferRetEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallback19returnStreamBuffersERKNS0_8hidl_vecINS2_4V3_212StreamBufferEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6camera6device4V3_521ICameraDeviceCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6camera6device4V3_524BpHwCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-323"
    },
    {
     "referenced_type" : "type-15"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-321"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-322"
    }
   ],
   "linker_set_key" : "android::hardware::camera::device::V3_5::BpHwCameraDeviceSession",
   "name" : "android::hardware::camera::device::V3_5::BpHwCameraDeviceSession",
   "referenced_type" : "type-320",
   "self_type" : "type-320",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/camera/device/3.5/android.hardware.camera.device@3.5_genc++_headers/gen/android/hardware/camera/device/3.5/BpHwCameraDeviceSession.h",
   "unique_id" : "_ZTSN7android8hardware6camera6device4V3_523BpHwCameraDeviceSessionE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6camera6device4V3_523BpHwCameraDeviceSessionE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6camera6device4V3_523BpHwCameraDeviceSession8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession31constructDefaultRequestSettingsENS2_4V3_215RequestTemplateENSt3__18functionIFvNS1_6common4V1_06StatusERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession16configureStreamsERKNS2_4V3_219StreamConfigurationENSt3__18functionIFvNS1_6common4V1_06StatusERKNS5_22HalStreamConfigurationEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession21processCaptureRequestERKNS0_8hidl_vecINS2_4V3_214CaptureRequestEEERKNS5_INS6_11BufferCacheEEENSt3__18functionIFvNS1_6common4V1_06StatusEjEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession30getCaptureRequestMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession29getCaptureResultMetadataQueueENSt3__18functionIFvRKNS0_12MQDescriptorIhLNS0_8MQFlavorE1EEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession5flushEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6camera6device4V3_523BpHwCameraDeviceSession5closeEv"
    },
    {
