{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-119",
   "self_type" : "type-118",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-767",
   "self_type" : "type-1701",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-22",
   "self_type" : "type-494",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [32]",
   "name" : "int [32]",
   "referenced_type" : "type-22",
   "self_type" : "type-1235",
   "size" : 128,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [32]",
   "name" : "unsigned char [32]",
   "referenced_type" : "type-8",
   "self_type" : "type-7",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-8",
   "self_type" : "type-115",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [64]",

   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-856",
   "self_type" : "type-855",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-8",
   "self_type" : "type-826",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-145",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-9",
   "self_type" : "type-857",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-117",
   "self_type" : "type-850",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-137",
   "self_type" : "type-1280",
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-24",
   "self_type" : "type-268",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-22",
   "self_type" : "type-163",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-267"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-266",
   "self_type" : "type-266",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-157"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-156",
   "self_type" : "type-156",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-151", "type-88" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-551"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-550",
   "self_type" : "type-550",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-552" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-541"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-540",
   "self_type" : "type-540",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-542" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-1726"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-1725",
   "self_type" : "type-1725",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-550"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-553"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-552",
   "self_type" : "type-552",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-1741"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-1740",
   "self_type" : "type-1740",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-1744"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-1743",
   "self_type" : "type-1743",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-1744"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-1748",
   "self_type" : "type-1748",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-894",
   "self_type" : "type-894",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-879",
   "self_type" : "type-879",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTag",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::ScopedTrace",
   "name" : "android::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "type-1753",
   "self_type" : "type-1753",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Trace.h",
   "unique_id" : "_ZTSN7android11ScopedTraceE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-158"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "type-157",
   "self_type" : "type-157",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-159" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-152"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-16"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "type-265"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-141"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "type-266"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "type-22"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "type-268"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "type-268"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "type-262"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-264",
   "self_type" : "type-264",
   "size" : 44,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-146" ],
   "unique_id" : "_ZTSN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-145"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-540"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-542",
   "self_type" : "type-542",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 32,
     "referenced_type" : "type-22"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 64,
     "referenced_type" : "type-22"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 96,
     "referenced_type" : "type-211"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "android::hardware::BHwBinder",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-210",
   "self_type" : "type-210",
   "size" : 28,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware9BHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-16"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 96,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwRefBase",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware11BpHwRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IAcousticEchoCancelerEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IAcousticEchoCancelerEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect12setEchoDelayEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAcousticEchoCancelerEffect12getEchoDelayENSt3__18functionIFvNS3_6ResultEjEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-13"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IAutomaticGainControlEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IAutomaticGainControlEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect14setTargetLevelEs"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect14getTargetLevelENSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect11setCompGainEs"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect11getCompGainENSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect17setLimiterEnabledEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect16isLimiterEnabledENSt3__18functionIFvNS3_6ResultEbEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect16setAllPropertiesERKNS4_13AllPropertiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_027IAutomaticGainControlEffect16getAllPropertiesENSt3__18functionIFvNS3_6ResultERKNS4_13AllPropertiesEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_027IAutomaticGainControlEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-206"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IBassBoostEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IBassBoostEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-220",
   "self_type" : "type-220",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-206" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_016IBassBoostEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect19isStrengthSupportedENSt3__18functionIFvNS3_6ResultEbEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect11setStrengthEt"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IBassBoostEffect11getStrengthENSt3__18functionIFvNS3_6ResultEtEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IBassBoostEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-362"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IDownmixEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IDownmixEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-374",
   "self_type" : "type-374",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-362" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_014IDownmixEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect7setTypeENS4_4TypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_014IDownmixEffect7getTypeENSt3__18functionIFvNS3_6ResultENS4_4TypeEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_014IDownmixEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-14"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-538",
   "self_type" : "type-538",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_07IEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_07IEffect5closeEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_07IEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-61"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEffectBufferProviderCallback>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEffectBufferProviderCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-547",
   "self_type" : "type-547",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback9getBufferENSt3__18functionIFvRKNS3_11AudioBufferEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029IEffectBufferProviderCallback9putBufferERKNS3_11AudioBufferE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-861"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEffectsFactory>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEffectsFactory>",
   "record_kind" : "class",
   "referenced_type" : "type-873",
   "self_type" : "type-873",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-861" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_015IEffectsFactory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory17getAllDescriptorsENSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_16EffectDescriptorEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory13getDescriptorERKNS1_6common4V4_04UuidENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_015IEffectsFactory12createEffectERKNS1_6common4V4_04UuidEiiNSt3__18functionIFvNS3_6ResultERKNS_2spINS3_7IEffectEEEyEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_015IEffectsFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1029"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEnvironmentalReverbEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEnvironmentalReverbEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-1042",
   "self_type" : "type-1042",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-1029" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect9setBypassEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect9getBypassENSt3__18functionIFvNS3_6ResultEbEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12setRoomLevelEs"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12getRoomLevelENSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect14setRoomHfLevelEs"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect14getRoomHfLevelENSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12setDecayTimeEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12getDecayTimeENSt3__18functionIFvNS3_6ResultEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect15setDecayHfRatioEs"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect15getDecayHfRatioENSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect19setReflectionsLevelEs"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect19getReflectionsLevelENSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect19setReflectionsDelayEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect19getReflectionsDelayENSt3__18functionIFvNS3_6ResultEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect14setReverbLevelEs"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect14getReverbLevelENSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect14setReverbDelayEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect14getReverbDelayENSt3__18functionIFvNS3_6ResultEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12setDiffusionEs"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect12getDiffusionENSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect10setDensityEs"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect10getDensityENSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect16setAllPropertiesERKNS4_13AllPropertiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_026IEnvironmentalReverbEffect16getAllPropertiesENSt3__18functionIFvNS3_6ResultERKNS4_13AllPropertiesEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1192"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEqualizerEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IEqualizerEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-1204",
   "self_type" : "type-1204",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-1192" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_016IEqualizerEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect11getNumBandsENSt3__18functionIFvNS3_6ResultEtEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect13getLevelRangeENSt3__18functionIFvNS3_6ResultEssEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect12setBandLevelEts"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect12getBandLevelEtNSt3__18functionIFvNS3_6ResultEsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect22getBandCenterFrequencyEtNSt3__18functionIFvNS3_6ResultEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect21getBandFrequencyRangeEtNSt3__18functionIFvNS3_6ResultEjjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect19getBandForFrequencyEjNSt3__18functionIFvNS3_6ResultEtEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect14getPresetNamesENSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect16setCurrentPresetEt"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect16getCurrentPresetENSt3__18functionIFvNS3_6ResultEtEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect16setAllPropertiesERKNS4_13AllPropertiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_016IEqualizerEffect16getAllPropertiesENSt3__18functionIFvNS3_6ResultERKNS4_13AllPropertiesEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_016IEqualizerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1363"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::ILoudnessEnhancerEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::ILoudnessEnhancerEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-1376",
   "self_type" : "type-1376",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-1363" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect13setTargetGainEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023ILoudnessEnhancerEffect13getTargetGainENSt3__18functionIFvNS3_6ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1520"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::INoiseSuppressionEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::INoiseSuppressionEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-1533",
   "self_type" : "type-1533",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-1520" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_023INoiseSuppressionEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect19setSuppressionLevelENS4_5LevelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect19getSuppressionLevelENSt3__18functionIFvNS3_6ResultENS4_5LevelEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect18setSuppressionTypeENS4_4TypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect18getSuppressionTypeENSt3__18functionIFvNS3_6ResultENS4_4TypeEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect16setAllPropertiesERKNS4_13AllPropertiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_023INoiseSuppressionEffect16getAllPropertiesENSt3__18functionIFvNS3_6ResultERKNS4_13AllPropertiesEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_023INoiseSuppressionEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1691"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IPresetReverbEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IPresetReverbEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-1705",
   "self_type" : "type-1705",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-1691" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_019IPresetReverbEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect9setPresetENS4_6PresetE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019IPresetReverbEffect9getPresetENSt3__18functionIFvNS3_6ResultENS4_6PresetEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_019IPresetReverbEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1852"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IVirtualizerEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IVirtualizerEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-1865",
   "self_type" : "type-1865",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-1852" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_018IVirtualizerEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect19isStrengthSupportedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect11setStrengthEt"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect11getStrengthENSt3__18functionIFvNS3_6ResultEtEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect23getVirtualSpeakerAnglesEjNS1_6common4V4_011AudioDeviceENSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS4_12SpeakerAngleEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect23forceVirtualizationModeENS1_6common4V4_011AudioDeviceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018IVirtualizerEffect21getVirtualizationModeENSt3__18functionIFvNS3_6ResultENS1_6common4V4_011AudioDeviceEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_018IVirtualizerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2028"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IVisualizerEffect>",
   "name" : "android::hardware::BpInterface<android::hardware::audio::effect::V4_0::IVisualizerEffect>",
   "record_kind" : "class",
   "referenced_type" : "type-2041",
   "self_type" : "type-2041",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-2028" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5audio6effect4V4_017IVisualizerEffect8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect4initEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect9setConfigERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect6enableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect7disableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect9setDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect15setAndGetVolumeERKNS0_8hidl_vecIjEENSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect24volumeChangeNotificationERKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect12setAudioModeENS1_6common4V4_09AudioModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect16setConfigReverseERKNS3_12EffectConfigERKNS_2spINS3_29IEffectBufferProviderCallbackEEESC_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect14setInputDeviceEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect9getConfigENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect16getConfigReverseENSt3__18functionIFvNS3_6ResultERKNS3_12EffectConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect30getSupportedAuxChannelsConfigsEjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecINS3_23EffectAuxChannelsConfigEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect20getAuxChannelsConfigENSt3__18functionIFvNS3_6ResultERKNS3_23EffectAuxChannelsConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect20setAuxChannelsConfigERKNS3_23EffectAuxChannelsConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect14setAudioSourceENS1_6common4V4_011AudioSourceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect7offloadERKNS3_22EffectOffloadParameterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect13getDescriptorENSt3__18functionIFvNS3_6ResultERKNS3_16EffectDescriptorEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect20prepareForProcessingENSt3__18functionIFvNS3_6ResultERKNS0_12MQDescriptorIS7_LNS0_8MQFlavorE1EEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect17setProcessBuffersERKNS3_11AudioBufferES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect7commandEjRKNS0_8hidl_vecIhEEjNSt3__18functionIFviS8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect12setParameterERKNS0_8hidl_vecIhEES8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect12getParameterERKNS0_8hidl_vecIhEEjNSt3__18functionIFvNS3_6ResultES8_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect29getSupportedConfigsForFeatureEjjjNSt3__18functionIFvNS3_6ResultEjRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect26getCurrentConfigForFeatureEjjNSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect26setCurrentConfigForFeatureEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect14setCaptureSizeEt"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect14getCaptureSizeENSt3__18functionIFvNS3_6ResultEtEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect14setScalingModeENS4_11ScalingModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect14getScalingModeENSt3__18functionIFvNS3_6ResultENS4_11ScalingModeEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect10setLatencyEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect10getLatencyENSt3__18functionIFvNS3_6ResultEjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect18setMeasurementModeENS4_15MeasurementModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect18getMeasurementModeENSt3__18functionIFvNS3_6ResultENS4_15MeasurementModeEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect7captureENSt3__18functionIFvNS3_6ResultERKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017IVisualizerEffect7measureENSt3__18functionIFvNS3_6ResultERKNS4_11MeasurementEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_5audio6effect4V4_017IVisualizerEffectEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-15"
    },
    {
     "referenced_type" : "type-32"
    },
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "name" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1415",
   "self_type" : "type-1415",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1505"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1506"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "record_kind" : "class",
   "referenced_type" : "type-1504",
   "self_type" : "type-1504",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-395", "type-1507" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEENS0_7details9SchedPrioEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1522"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1523"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-1521",
   "self_type" : "type-1521",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-395", "type-24" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEEbEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1537"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1538"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "name" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-1536",
   "self_type" : "type-1536",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-74", "type-1539" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1575"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1576"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-1574",
   "self_type" : "type-1574",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-1577", "type-1578" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS_4hidl4base4V1_05IBaseEEEPvEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1555"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-1556"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-1554",
   "self_type" : "type-1554",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-1557", "type-1558" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS0_7IBinderEEEPvEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-572",
   "self_type" : "type-572",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-919"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-933",
   "self_type" : "type-933",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder::DeathRecipient",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::hardware::IInterface",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "unique_id" : "_ZTSN7android8hardware10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "type-574"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "type-611"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::MQDescriptor<android::hardware::audio::effect::V4_0::Result, android::hardware::kSynchronizedReadWrite>",
   "name" : "android::hardware::MQDescriptor<android::hardware::audio::effect::V4_0::Result, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "type-615",
   "self_type" : "type-615",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "type-446" ],
   "unique_id" : "_ZTSN7android8hardware12MQDescriptorINS0_5audio6effect4V4_06ResultELNS0_8MQFlavorE1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "type-574"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "type-611"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "name" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "type-1350",
   "self_type" : "type-1350",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "type-119" ],
   "unique_id" : "_ZTSN7android8hardware12MQDescriptorIcLNS0_8MQFlavorE1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 32,
     "referenced_type" : "type-1418"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 128,
     "referenced_type" : "type-22"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 160,
     "referenced_type" : "type-601"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 288,
     "referenced_type" : "type-1419"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 448,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 456,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 464,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 480,
     "referenced_type" : "type-1420"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 512,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-1417",
   "self_type" : "type-1417",
   "size" : 68,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel::BufferInfo",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "type-1440",
   "self_type" : "type-1440",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6Parcel10BufferInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-16"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 32,
     "referenced_type" : "type-22"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 64,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 96,
     "referenced_type" : "type-138"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 128,
     "referenced_type" : "type-139"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 256,
     "referenced_type" : "type-140"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 320,
     "referenced_type" : "type-141"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 352,
     "referenced_type" : "type-143"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 512,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 544,
     "referenced_type" : "type-147"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 576,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 608,
     "referenced_type" : "type-156"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 768,
     "referenced_type" : "type-160"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 800,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 808,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 832,
     "referenced_type" : "type-163"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 864,
     "referenced_type" : "type-145"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 896,
     "referenced_type" : "type-164"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 128,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessStateE",
   "vtable_components" :
   [
    {
     "component_value" : 116,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -116,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -116,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "refs",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState::handle_entry",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessState12handle_entryE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-446"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::audio::effect::V4_0::Result>",
   "name" : "android::hardware::Return<android::hardware::audio::effect::V4_0::Result>",
   "record_kind" : "class",
   "referenced_type" : "type-445",
   "self_type" : "type-445",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-446" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_5audio6effect4V4_06ResultEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-376"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IAcousticEchoCancelerEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IAcousticEchoCancelerEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-482",
   "self_type" : "type-482",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-376" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_027IAcousticEchoCancelerEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IAutomaticGainControlEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IAutomaticGainControlEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_027IAutomaticGainControlEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IBassBoostEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IBassBoostEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-204" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_016IBassBoostEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-360"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IDownmixEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IDownmixEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-360" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_014IDownmixEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-353"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-353" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_07IEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEffectBufferProviderCallback> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEffectBufferProviderCallback> >",
   "record_kind" : "class",
   "referenced_type" : "type-738",
   "self_type" : "type-738",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_029IEffectBufferProviderCallbackEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-859"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEffectsFactory> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEffectsFactory> >",
   "record_kind" : "class",
   "referenced_type" : "type-886",
   "self_type" : "type-886",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-859" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_015IEffectsFactoryEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-1027"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEnvironmentalReverbEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEnvironmentalReverbEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-1055",
   "self_type" : "type-1055",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1027" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_026IEnvironmentalReverbEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-1190"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEqualizerEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IEqualizerEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-1215",
   "self_type" : "type-1215",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1190" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_016IEqualizerEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-1361"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::ILoudnessEnhancerEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::ILoudnessEnhancerEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-1390",
   "self_type" : "type-1390",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1361" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_023ILoudnessEnhancerEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-1518"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::INoiseSuppressionEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::INoiseSuppressionEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-1548",
   "self_type" : "type-1548",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1518" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_023INoiseSuppressionEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-1689"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IPresetReverbEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IPresetReverbEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-1717",
   "self_type" : "type-1717",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1689" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_019IPresetReverbEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-1850"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IVirtualizerEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IVirtualizerEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-1878",
   "self_type" : "type-1878",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1850" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_018IVirtualizerEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-2026"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IVisualizerEffect> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::audio::effect::V4_0::IVisualizerEffect> >",
   "record_kind" : "class",
   "referenced_type" : "type-2056",
   "self_type" : "type-2056",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-2026" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_5audio6effect4V4_017IVisualizerEffectEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 168,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::hardware::Return<bool>",
   "name" : "android::hardware::Return<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIbEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-529",
   "self_type" : "type-529",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-137" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-22"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-22"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "type-1067"
    },
    {
     "field_name" : "offloadInfo",
     "field_offset" : 128,
     "referenced_type" : "type-1868"
    },
    {
     "field_name" : "frameCount",
     "field_offset" : 512,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioConfig",
   "name" : "android::hardware::audio::common::V4_0::AudioConfig",
   "referenced_type" : "type-1869",
   "self_type" : "type-1869",
   "size" : 72,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_011AudioConfigE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minValue",
     "field_offset" : 64,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "maxValue",
     "field_offset" : 96,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "defaultValue",
     "field_offset" : 128,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "stepValue",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minRampMs",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxRampMs",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioGain",
   "name" : "android::hardware::audio::common::V4_0::AudioGain",
   "referenced_type" : "type-1084",
   "self_type" : "type-1084",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_09AudioGainE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "mode",
     "field_offset" : 32,
     "referenced_type" : "type-1870"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 64,
     "referenced_type" : "type-1842"
    },
    {
     "field_name" : "values",
     "field_offset" : 96,
     "referenced_type" : "type-1234"
    },
    {
     "field_name" : "rampDurationMs",
     "field_offset" : 1120,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioGainConfig",
   "name" : "android::hardware::audio::common::V4_0::AudioGainConfig",
   "referenced_type" : "type-1875",
   "self_type" : "type-1875",
   "size" : 144,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_015AudioGainConfigE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "type-1067"
    },
    {
     "field_name" : "streamType",
     "field_offset" : 96,
     "referenced_type" : "type-1838"
    },
    {
     "field_name" : "bitRatePerSecond",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "durationMicroseconds",
     "field_offset" : 192,
     "referenced_type" : "type-140"
    },
    {
     "field_name" : "hasVideo",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "isStreaming",
     "field_offset" : 264,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "bitWidth",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bufferSize",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "usage",
     "field_offset" : 352,
     "referenced_type" : "type-1855"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioOffloadInfo",
   "name" : "android::hardware::audio::common::V4_0::AudioOffloadInfo",
   "referenced_type" : "type-1868",
   "self_type" : "type-1868",
   "size" : 48,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_016AudioOffloadInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "type-1876"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "type-900"
    },
    {
     "field_name" : "sampleRates",
     "field_offset" : 192,
     "referenced_type" : "type-1047"
    },
    {
     "field_name" : "channelMasks",
     "field_offset" : 320,
     "referenced_type" : "type-1047"
    },
    {
     "field_name" : "formats",
     "field_offset" : 448,
     "referenced_type" : "type-1063"
    },
    {
     "field_name" : "gains",
     "field_offset" : 576,
     "referenced_type" : "type-1080"
    },
    {
     "field_name" : "activeConfig",
     "field_offset" : 704,
     "referenced_type" : "type-1889"
    },
    {
     "field_name" : "type",
     "field_offset" : 2400,
     "referenced_type" : "type-1877"
    },
    {
     "field_name" : "ext",
     "field_offset" : 2432,
     "referenced_type" : "type-1915"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPort",
   "name" : "android::hardware::audio::common::V4_0::AudioPort",
   "referenced_type" : "type-1914",
   "self_type" : "type-1914",
   "size" : 344,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_09AudioPortE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "type-1906"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "type-1912"
    },
    {
     "field_name" : "session",
     "referenced_type" : "type-1913"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPort::Ext",
   "name" : "android::hardware::audio::common::V4_0::AudioPort::Ext",
   "record_kind" : "union",
   "referenced_type" : "type-1915",
   "self_type" : "type-1915",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_09AudioPort3ExtE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "configMask",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleRateHz",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "type-1067"
    },
    {
     "field_name" : "gain",
     "field_offset" : 160,
     "referenced_type" : "type-1875"
    },
    {
     "field_name" : "type",
     "field_offset" : 1312,
     "referenced_type" : "type-1877"
    },
    {
     "field_name" : "role",
     "field_offset" : 1344,
     "referenced_type" : "type-1876"
    },
    {
     "field_name" : "ext",
     "field_offset" : 1376,
     "referenced_type" : "type-1890"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPortConfig",
   "name" : "android::hardware::audio::common::V4_0::AudioPortConfig",
   "referenced_type" : "type-1889",
   "self_type" : "type-1889",
   "size" : 212,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_015AudioPortConfigE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "type-1884"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "type-1891"
    },
    {
     "field_name" : "session",
     "referenced_type" : "type-1885"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPortConfig::Ext",
   "name" : "android::hardware::audio::common::V4_0::AudioPortConfig::Ext",
   "record_kind" : "union",
   "referenced_type" : "type-1890",
   "self_type" : "type-1890",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_015AudioPortConfig3ExtE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hwModule",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "ioHandle",
     "field_offset" : 32,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "useCase",
     "field_offset" : 64,
     "referenced_type" : "type-1892"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPortConfig::Ext::AudioPortConfigMixExt",
   "name" : "android::hardware::audio::common::V4_0::AudioPortConfig::Ext::AudioPortConfigMixExt",
   "referenced_type" : "type-1891",
   "self_type" : "type-1891",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_015AudioPortConfig3Ext21AudioPortConfigMixExtE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "type-1838"
    },
    {
     "field_name" : "source",
     "referenced_type" : "type-1839"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPortConfig::Ext::AudioPortConfigMixExt::UseCase",
   "name" : "android::hardware::audio::common::V4_0::AudioPortConfig::Ext::AudioPortConfigMixExt::UseCase",
   "record_kind" : "union",
   "referenced_type" : "type-1892",
   "self_type" : "type-1892",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_015AudioPortConfig3Ext21AudioPortConfigMixExt7UseCaseE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hwModule",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "type-1844"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPortConfigDeviceExt",
   "name" : "android::hardware::audio::common::V4_0::AudioPortConfigDeviceExt",
   "referenced_type" : "type-1884",
   "self_type" : "type-1884",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_024AudioPortConfigDeviceExtE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPortConfigSessionExt",
   "name" : "android::hardware::audio::common::V4_0::AudioPortConfigSessionExt",
   "referenced_type" : "type-1885",
   "self_type" : "type-1885",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_025AudioPortConfigSessionExtE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hwModule",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "type-1844"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPortDeviceExt",
   "name" : "android::hardware::audio::common::V4_0::AudioPortDeviceExt",
   "referenced_type" : "type-1906",
   "self_type" : "type-1906",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_018AudioPortDeviceExtE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hwModule",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "ioHandle",
     "field_offset" : 32,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "latencyClass",
     "field_offset" : 64,
     "referenced_type" : "type-1911"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPortMixExt",
   "name" : "android::hardware::audio::common::V4_0::AudioPortMixExt",
   "referenced_type" : "type-1912",
   "self_type" : "type-1912",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_015AudioPortMixExtE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::AudioPortSessionExt",
   "name" : "android::hardware::audio::common::V4_0::AudioPortSessionExt",
   "referenced_type" : "type-1913",
   "self_type" : "type-1913",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_019AudioPortSessionExtE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-140"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-140"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::ThreadInfo",
   "name" : "android::hardware::audio::common::V4_0::ThreadInfo",
   "referenced_type" : "type-1919",
   "self_type" : "type-1919",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_010ThreadInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "timeLow",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "timeMid",
     "field_offset" : 32,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "versionAndTimeHigh",
     "field_offset" : 48,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "variantAndClockSeqHigh",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "type-915"
    }
   ],
   "linker_set_key" : "android::hardware::audio::common::V4_0::Uuid",
   "name" : "android::hardware::audio::common::V4_0::Uuid",
   "referenced_type" : "type-914",
   "self_type" : "type-914",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/common/4.0/android.hardware.audio.common@4.0_genc++_headers/gen/android/hardware/audio/common/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6common4V4_04UuidE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "frameCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "data",
     "field_offset" : 128,
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::AudioBuffer",
   "name" : "android::hardware::audio::effect::V4_0::AudioBuffer",
   "referenced_type" : "type-2109",
   "self_type" : "type-2109",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_011AudioBufferE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-376"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwAcousticEchoCancelerEffect",
   "name" : "android::hardware::audio::effect::V4_0::BnHwAcousticEchoCancelerEffect",
   "referenced_type" : "type-2248",
   "self_type" : "type-2248",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwAcousticEchoCancelerEffect.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffect10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_030BnHwAcousticEchoCancelerEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwAutomaticGainControlEffect",
   "name" : "android::hardware::audio::effect::V4_0::BnHwAutomaticGainControlEffect",
   "referenced_type" : "type-2261",
   "self_type" : "type-2261",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwAutomaticGainControlEffect.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffect10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_030BnHwAutomaticGainControlEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwBassBoostEffect",
   "name" : "android::hardware::audio::effect::V4_0::BnHwBassBoostEffect",
   "referenced_type" : "type-208",
   "self_type" : "type-208",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwBassBoostEffect.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_019BnHwBassBoostEffectE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_019BnHwBassBoostEffectE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019BnHwBassBoostEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019BnHwBassBoostEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019BnHwBassBoostEffect10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_019BnHwBassBoostEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_019BnHwBassBoostEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_019BnHwBassBoostEffectD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_019BnHwBassBoostEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_019BnHwBassBoostEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_019BnHwBassBoostEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-360"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwDownmixEffect",
   "name" : "android::hardware::audio::effect::V4_0::BnHwDownmixEffect",
   "referenced_type" : "type-366",
   "self_type" : "type-366",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwDownmixEffect.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_017BnHwDownmixEffectE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_017BnHwDownmixEffectE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017BnHwDownmixEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017BnHwDownmixEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_017BnHwDownmixEffect10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_017BnHwDownmixEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_017BnHwDownmixEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_017BnHwDownmixEffectD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_017BnHwDownmixEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_017BnHwDownmixEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_017BnHwDownmixEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-353"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwEffect",
   "name" : "android::hardware::audio::effect::V4_0::BnHwEffect",
   "referenced_type" : "type-2224",
   "self_type" : "type-2224",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwEffect.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_010BnHwEffectE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_010BnHwEffectE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_010BnHwEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_010BnHwEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_010BnHwEffect10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_010BnHwEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_010BnHwEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_010BnHwEffectD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_010BnHwEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_010BnHwEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_010BnHwEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwEffectBufferProviderCallback",
   "name" : "android::hardware::audio::effect::V4_0::BnHwEffectBufferProviderCallback",
   "referenced_type" : "type-2220",
   "self_type" : "type-2220",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwEffectBufferProviderCallback.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallback10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_032BnHwEffectBufferProviderCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-859"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwEffectsFactory",
   "name" : "android::hardware::audio::effect::V4_0::BnHwEffectsFactory",
   "referenced_type" : "type-865",
   "self_type" : "type-865",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwEffectsFactory.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_018BnHwEffectsFactoryE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_018BnHwEffectsFactoryE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018BnHwEffectsFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018BnHwEffectsFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_018BnHwEffectsFactory10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_018BnHwEffectsFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_018BnHwEffectsFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_018BnHwEffectsFactoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_018BnHwEffectsFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_018BnHwEffectsFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_018BnHwEffectsFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-1027"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwEnvironmentalReverbEffect",
   "name" : "android::hardware::audio::effect::V4_0::BnHwEnvironmentalReverbEffect",
   "referenced_type" : "type-1035",
   "self_type" : "type-1035",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwEnvironmentalReverbEffect.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffect10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_029BnHwEnvironmentalReverbEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-1190"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwEqualizerEffect",
   "name" : "android::hardware::audio::effect::V4_0::BnHwEqualizerEffect",
   "referenced_type" : "type-1196",
   "self_type" : "type-1196",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwEqualizerEffect.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_019BnHwEqualizerEffectE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_019BnHwEqualizerEffectE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019BnHwEqualizerEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019BnHwEqualizerEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5audio6effect4V4_019BnHwEqualizerEffect10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_019BnHwEqualizerEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_019BnHwEqualizerEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware5audio6effect4V4_019BnHwEqualizerEffectD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5audio6effect4V4_019BnHwEqualizerEffectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_019BnHwEqualizerEffectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware5audio6effect4V4_019BnHwEqualizerEffectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-209"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-1361"
    }
   ],
   "linker_set_key" : "android::hardware::audio::effect::V4_0::BnHwLoudnessEnhancerEffect",
   "name" : "android::hardware::audio::effect::V4_0::BnHwLoudnessEnhancerEffect",
   "referenced_type" : "type-1367",
   "self_type" : "type-1367",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/audio/effect/4.0/android.hardware.audio.effect@4.0_genc++_headers/gen/android/hardware/audio/effect/4.0/BnHwLoudnessEnhancerEffect.h",
   "unique_id" : "_ZTSN7android8hardware5audio6effect4V4_026BnHwLoudnessEnhancerEffectE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
