{
 "array_types" :
 [
  {
   "linker_set_key" : "char *[]",
   "name" : "char *[]",
   "referenced_type" : "type-96",
   "self_type" : "type-198",
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/time.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [120]",
   "name" : "char [120]",
   "referenced_type" : "type-92",
   "self_type" : "type-192",
   "size" : 120,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [32]",
   "name" : "char [32]",
   "referenced_type" : "type-92",
   "self_type" : "type-185",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [4]",
   "name" : "char [4]",
   "referenced_type" : "type-92",
   "self_type" : "type-152",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "const char *[65]",
   "name" : "const char *[65]",
   "referenced_type" : "type-90",
   "self_type" : "type-195",
   "size" : 260,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/signal.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "double [32]",

   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_arm64",
   "name" : "const libunwind::Registers_arm64",
   "referenced_type" : "type-290",
   "self_type" : "type-385",
   "size" : 528,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_mips_newabi",
   "name" : "const libunwind::Registers_mips_newabi",
   "referenced_type" : "type-30",
   "self_type" : "type-31",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_mips_o32",
   "name" : "const libunwind::Registers_mips_o32",
   "referenced_type" : "type-24",
   "self_type" : "type-25",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_or1k",
   "name" : "const libunwind::Registers_or1k",
   "referenced_type" : "type-19",
   "self_type" : "type-20",
   "size" : 136,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_ppc",
   "name" : "const libunwind::Registers_ppc",
   "referenced_type" : "type-272",
   "self_type" : "type-377",
   "size" : 936,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_ppc64",
   "name" : "const libunwind::Registers_ppc64",
   "referenced_type" : "type-282",
   "self_type" : "type-382",
   "size" : 1336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_sparc",
   "name" : "const libunwind::Registers_sparc",
   "referenced_type" : "type-34",
   "self_type" : "type-36",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_x86",
   "name" : "const libunwind::Registers_x86",
   "referenced_type" : "type-262",
   "self_type" : "type-370",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_x86_64",
   "name" : "const libunwind::Registers_x86_64",
   "referenced_type" : "type-267",
   "self_type" : "type-373",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::UnwindInfoSections",
   "name" : "const libunwind::UnwindInfoSections",
   "referenced_type" : "type-102",
   "self_type" : "type-211",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-12",
   "self_type" : "type-248",
   "size" : 4,
   "source_file" : "/external/libunwind_llvm/src/config.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-134",
   "self_type" : "type-233",
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const void *const",
   "name" : "const void *const",
   "referenced_type" : "type-232",
   "self_type" : "type-362",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/string.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-239",
   "self_type" : "type-241",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "type-230",
   "self_type" : "type-234",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "type-242",
   "self_type" : "type-244",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned int, const void *)",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "type-235",
   "self_type" : "type-237",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-145",
   "self_type" : "type-363",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dli_fname",
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "dli_fbase",
     "field_offset" : 32,
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "dli_sname",
     "field_offset" : 64,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "dli_saddr",
     "field_offset" : 96,
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "Dl_info",
   "name" : "Dl_info",
   "referenced_type" : "type-366",
   "self_type" : "type-366",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/dlfcn.h",
   "unique_id" : "Dl_info"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Chdr",
   "name" : "Elf32_Chdr",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Chdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Lib",
   "name" : "Elf32_Lib",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS9Elf32_Lib"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 128,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 144,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "Elf32_Move",
   "name" : "Elf32_Move",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Move"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "Elf32_Syminfo",
   "name" : "Elf32_Syminfo",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Syminfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Verdaux",
   "name" : "Elf32_Verdaux",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verdaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Verdef",
   "name" : "Elf32_Verdef",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS12Elf32_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Vernaux",
   "name" : "Elf32_Vernaux",
   "referenced_type" : "type-86",
   "self_type" : "type-86",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Vernaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Verneed",
   "name" : "Elf32_Verneed",
   "referenced_type" : "type-85",
   "self_type" : "type-85",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verneed"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 32,
     "referenced_type" : "type-70"
    }
   ],
   "linker_set_key" : "Elf32_auxv_t",
   "name" : "Elf32_auxv_t",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS12Elf32_auxv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf32_auxv_t::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h:49:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h:49:3",
   "name" : "Elf32_auxv_t::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h:49:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h:49:3",
   "record_kind" : "union",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTSN12Elf32_auxv_tUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ch_reserved",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "Elf64_Chdr",
   "name" : "Elf64_Chdr",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Chdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 64,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "Elf64_Dyn",
   "name" : "Elf64_Dyn",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS9Elf64_Dyn"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_Dyn::(anonymous union at bionic/libc/kernel/uapi/linux/elf.h:126:3) at bionic/libc/kernel/uapi/linux/elf.h:126:3",
   "name" : "Elf64_Dyn::(anonymous union at bionic/libc/kernel/uapi/linux/elf.h:126:3) at bionic/libc/kernel/uapi/linux/elf.h:126:3",
   "record_kind" : "union",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTSN9Elf64_DynUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Lib",
   "name" : "Elf64_Lib",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS9Elf64_Lib"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 192,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 208,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "Elf64_Move",
   "name" : "Elf64_Move",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Move"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "Elf64_Syminfo",
   "name" : "Elf64_Syminfo",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Syminfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Verdaux",
   "name" : "Elf64_Verdaux",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verdaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Verdef",
   "name" : "Elf64_Verdef",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS12Elf64_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Vernaux",
   "name" : "Elf64_Vernaux",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Vernaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Verneed",
   "name" : "Elf64_Verneed",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verneed"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 64,
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "Elf64_auxv_t",
   "name" : "Elf64_auxv_t",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTS12Elf64_auxv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_auxv_t::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h:56:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h:56:3",
   "name" : "Elf64_auxv_t::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h:56:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h:56:3",
   "record_kind" : "union",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/elf.h",
   "unique_id" : "_ZTSN12Elf64_auxv_tUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "exception_cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-250"
    },
    {
     "field_name" : "unwinder_cache",
     "field_offset" : 96,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "barrier_cache",
     "field_offset" : 256,
     "referenced_type" : "type-254"
    },
    {
     "field_name" : "cleanup_cache",
     "field_offset" : 448,
     "referenced_type" : "type-256"
    },
    {
     "field_name" : "pr_cache",
     "field_offset" : 576,
     "referenced_type" : "type-258"
    },
    {
     "field_offset" : 704,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_Unwind_Control_Block",
   "name" : "_Unwind_Control_Block",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 88,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTS21_Unwind_Control_Block"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "exception_cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-320"
    },
    {
     "field_name" : "unwinder_cache",
     "field_offset" : 96,
     "referenced_type" : "type-322"
    },
    {
     "field_name" : "barrier_cache",
     "field_offset" : 256,
     "referenced_type" : "type-323"
    },
    {
     "field_name" : "cleanup_cache",
     "field_offset" : 448,
     "referenced_type" : "type-324"
    },
    {
     "field_name" : "pr_cache",
     "field_offset" : 576,
     "referenced_type" : "type-325"
    },
    {
     "field_offset" : 704,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_Unwind_Control_Block",
   "name" : "_Unwind_Control_Block",
   "referenced_type" : "type-319",
   "self_type" : "type-319",
   "size" : 88,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved1",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved4",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved5",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved1",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved4",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved5",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "referenced_type" : "type-322",
   "self_type" : "type-322",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sp",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "bitpattern",
     "field_offset" : 32,
     "referenced_type" : "type-255"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 24,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sp",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "bitpattern",
     "field_offset" : 32,
     "referenced_type" : "type-255"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 24,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitpattern",
     "referenced_type" : "type-257"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitpattern",
     "referenced_type" : "type-257"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "referenced_type" : "type-324",
   "self_type" : "type-324",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fnstart",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ehtp",
     "field_offset" : 32,
     "referenced_type" : "type-259"
    },
    {
     "field_name" : "additional",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fnstart",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ehtp",
     "field_offset" : 32,
     "referenced_type" : "type-259"
    },
    {
     "field_name" : "additional",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "referenced_type" : "type-325",
   "self_type" : "type-325",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-327",
   "self_type" : "type-327",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-328",
   "self_type" : "type-328",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "__kernel_fsid_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-126"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-126"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-157"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-130",
   "self_type" : "type-130",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-135"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3) at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3) at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3",
   "record_kind" : "union",
   "referenced_type" : "type-131",
   "self_type" : "type-131",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h",
   "unique_id" : "_ZTSN18__kernel_sigactionUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "type-201"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "type-202"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/pthread.h",
   "unique_id" : "__pthread_cleanup_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-143"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-146"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-147"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-154"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS10__sifields"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-39"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-144"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-118"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-145"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-149"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-151"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-153"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "record_kind" : "union",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-145"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "referenced_type" : "type-153",
   "self_type" : "type-153",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt5_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-297",
   "self_type" : "type-297",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "referenced_type" : "type-293",
   "self_type" : "type-293",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-290" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-294",
   "self_type" : "type-294",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<libunwind::Registers_mips_newabi>",
   "name" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<libunwind::Registers_mips_newabi>",
   "referenced_type" : "type-305",
   "self_type" : "type-305",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind21Registers_mips_newabiE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind21Registers_mips_newabiE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "referenced_type" : "type-302",
   "self_type" : "type-302",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "referenced_type" : "type-299",
   "self_type" : "type-299",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-300",
   "self_type" : "type-300",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "referenced_type" : "type-279",
   "self_type" : "type-279",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-272" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-280",
   "self_type" : "type-280",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<libunwind::Registers_ppc64>",
   "name" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<libunwind::Registers_ppc64>",
   "referenced_type" : "type-287",
   "self_type" : "type-287",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-282" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_ppc64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-288",
   "self_type" : "type-288",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_ppc64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_sparc, unw_context_t>::blk_count<libunwind::Registers_sparc>",
   "name" : "check_fit<Registers_sparc, unw_context_t>::blk_count<libunwind::Registers_sparc>",
   "referenced_type" : "type-376",
   "self_type" : "type-376",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_sparcE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_sparc, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_sparc, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-381",
   "self_type" : "type-381",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_sparcE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "referenced_type" : "type-264",
   "self_type" : "type-264",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-262" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-265",
   "self_type" : "type-265",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "referenced_type" : "type-269",
   "self_type" : "type-269",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-267" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-270",
   "self_type" : "type-270",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "referenced_type" : "type-204",
   "self_type" : "type-204",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-51" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS4_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "referenced_type" : "type-214",
   "self_type" : "type-214",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-56" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS5_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "referenced_type" : "type-295",
   "self_type" : "type-295",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-9", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_armE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-290", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_arm64E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_newabi, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_newabi, unw_context_t>",
   "referenced_type" : "type-304",
   "self_type" : "type-304",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-30", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind21Registers_mips_newabiE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-24", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "referenced_type" : "type-298",
   "self_type" : "type-298",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-19", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind14Registers_or1kE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "referenced_type" : "type-271",
   "self_type" : "type-271",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-272", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_ppcE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_ppc64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_ppc64, unw_context_t>",
   "referenced_type" : "type-281",
   "self_type" : "type-281",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-282", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_ppc64E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_sparc, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_sparc, unw_context_t>",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-34", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_sparcE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "referenced_type" : "type-261",
   "self_type" : "type-261",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-262", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_x86E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "referenced_type" : "type-266",
   "self_type" : "type-266",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-267", "type-4" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "name" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-51", "type-56" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-121"
    }
   ],
   "linker_set_key" : "cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sched.h",
   "unique_id" : "cpu_set_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-245",
   "self_type" : "type-245",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "addressSpace",
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "sects",
     "field_offset" : 32,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "targetAddr",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "dl_iterate_cb_data",
   "name" : "dl_iterate_cb_data",
   "referenced_type" : "type-106",
   "self_type" : "type-106",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSZN9libunwind17LocalAddressSpace18findUnwindSectionsEjRNS_18UnwindInfoSectionsEE18dl_iterate_cb_data"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dlpi_addr",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "dlpi_name",
     "field_offset" : 32,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "dlpi_phdr",
     "field_offset" : 64,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "dlpi_phnum",
     "field_offset" : 96,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "dl_phdr_info",
   "name" : "dl_phdr_info",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/link.h",
   "unique_id" : "dl_phdr_info"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tbase",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "dbase",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "func",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "dwarf_eh_bases",
   "name" : "dwarf_eh_bases",
   "referenced_type" : "type-353",
   "self_type" : "type-353",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "dwarf_eh_bases"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 32,
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "dynamic",
   "name" : "dynamic",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS7dynamic"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "dynamic::(anonymous union at bionic/libc/kernel/uapi/linux/elf.h:119:3) at bionic/libc/kernel/uapi/linux/elf.h:119:3",
   "name" : "dynamic::(anonymous union at bionic/libc/kernel/uapi/linux/elf.h:119:3) at bionic/libc/kernel/uapi/linux/elf.h:119:3",
   "record_kind" : "union",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTSN7dynamicUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 320,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 336,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 352,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 368,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 384,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 400,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "elf32_hdr",
   "name" : "elf32_hdr",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 52,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS9elf32_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf32_note",
   "name" : "elf32_note",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS10elf32_note"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf32_phdr",
   "name" : "elf32_phdr",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS10elf32_phdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf32_rel",
   "name" : "elf32_rel",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS9elf32_rel"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 64,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "elf32_rela",
   "name" : "elf32_rela",
   "referenced_type" : "type-45",
   "self_type" : "type-45",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS10elf32_rela"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf32_shdr",
   "name" : "elf32_shdr",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 40,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS10elf32_shdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 104,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 112,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "elf32_sym",
   "name" : "elf32_sym",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS9elf32_sym"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 384,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 416,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 432,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 448,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 464,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 480,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 496,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "elf64_hdr",
   "name" : "elf64_hdr",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS9elf64_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf64_note",
   "name" : "elf64_note",
   "referenced_type" : "type-68",
   "self_type" : "type-68",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS10elf64_note"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "elf64_phdr",
   "name" : "elf64_phdr",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 56,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS10elf64_phdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "elf64_rel",
   "name" : "elf64_rel",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS9elf64_rel"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "elf64_rela",
   "name" : "elf64_rela",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS10elf64_rela"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 320,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 352,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "elf64_shdr",
   "name" : "elf64_shdr",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS10elf64_shdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 32,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 40,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 48,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "elf64_sym",
   "name" : "elf64_sym",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/linux/elf.h",
   "unique_id" : "_ZTS9elf64_sym"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-197",
   "self_type" : "type-197",
   "size" : 128,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-326",
   "self_type" : "type-326",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/inttypes.h",
   "unique_id" : "imaxdiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-367",
   "self_type" : "type-367",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/inttypes.h",
   "unique_id" : "_ZTS9imaxdiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-246",
   "self_type" : "type-246",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "libunwind::AbstractUnwindCursor",
   "name" : "libunwind::AbstractUnwindCursor",
   "record_kind" : "class",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 4,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind20AbstractUnwindCursorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind20AbstractUnwindCursorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::EHABIIndexEntry",
   "name" : "libunwind::EHABIIndexEntry",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind15EHABIIndexEntryE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_i",
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "_sects",
     "field_offset" : 64,
     "referenced_type" : "type-218"
    }
   ],
   "linker_set_key" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "name" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-53" ],
   "unique_id" : "_ZTSN9libunwind20EHABISectionIteratorINS_17LocalAddressSpaceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "libunwind::LocalAddressSpace",
   "name" : "libunwind::LocalAddressSpace",
   "record_kind" : "class",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind17LocalAddressSpaceE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_lock",
     "referenced_type" : "type-206"
    }
   ],
   "linker_set_key" : "libunwind::RWMutex",
   "name" : "libunwind::RWMutex",
   "record_kind" : "class",
   "referenced_type" : "type-205",
   "self_type" : "type-205",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/src/RWMutex.hpp",
   "unique_id" : "_ZTSN9libunwind7RWMutexE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "_use_X_for_vfp_save",
     "field_offset" : 512,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d0_d15",
     "field_offset" : 520,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d16_d31",
     "field_offset" : 528,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d0_d15_pad",
     "field_offset" : 576,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d16_d31",
     "field_offset" : 1664,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm",
   "name" : "libunwind::Registers_arm",
   "record_kind" : "class",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_armE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-291"
    },
    {
     "access" : "private",
     "field_name" : "_vectorHalfRegisters",
     "field_offset" : 2176,
     "referenced_type" : "type-275"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64",
   "name" : "libunwind::Registers_arm64",
   "record_kind" : "class",
   "referenced_type" : "type-290",
   "self_type" : "type-290",
   "size" : 528,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__x",
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "__fp",
     "field_offset" : 1856,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1920,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 1984,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__ra_sign_state",
     "field_offset" : 2112,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64::GPRs",
   "name" : "libunwind::Registers_arm64::GPRs",
   "referenced_type" : "type-291",
   "self_type" : "type-291",
   "size" : 272,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm644GPRsE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 416,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 448,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 480,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm::GPRs",
   "name" : "libunwind::Registers_arm::GPRs",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_arm4GPRsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_newabi",
   "name" : "libunwind::Registers_mips_newabi",
   "record_kind" : "class",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind21Registers_mips_newabiE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 2112,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 2176,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_newabi::mips_newabi_thread_state_t",
   "name" : "libunwind::Registers_mips_newabi::mips_newabi_thread_state_t",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind21Registers_mips_newabi26mips_newabi_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32",
   "name" : "libunwind::Registers_mips_o32",
   "record_kind" : "class",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o32E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 1024,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 1056,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 1088,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "name" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o3223mips_o32_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k",
   "name" : "libunwind::Registers_or1k",
   "record_kind" : "class",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 136,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1kE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 1024,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__epcr",
     "field_offset" : 1056,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "name" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 136,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1k19or1k_thread_state_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-273"
    },
    {
     "access" : "private",
     "field_name" : "_floatRegisters",
     "field_offset" : 1280,
     "referenced_type" : "type-274"
    },
    {
     "access" : "private",
     "field_name" : "_vectorRegisters",
     "field_offset" : 3392,
     "referenced_type" : "type-277"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc",
   "name" : "libunwind::Registers_ppc",
   "record_kind" : "class",
   "referenced_type" : "type-272",
   "self_type" : "type-272",
   "size" : 936,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppcE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-283"
    },
    {
     "access" : "private",
     "field_name" : "_vectorScalarRegisters",
     "field_offset" : 2496,
     "referenced_type" : "type-284"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64",
   "name" : "libunwind::Registers_ppc64",
   "record_kind" : "class",
   "referenced_type" : "type-282",
   "self_type" : "type-282",
   "size" : 1336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__srr0",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__srr1",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r0",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r1",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r2",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r3",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r4",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r5",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r6",
     "field_offset" : 512,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r7",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 640,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 704,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 768,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 832,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 896,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 960,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 1024,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 1088,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r16",
     "field_offset" : 1152,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r17",
     "field_offset" : 1216,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r18",
     "field_offset" : 1280,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r19",
     "field_offset" : 1344,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r20",
     "field_offset" : 1408,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r21",
     "field_offset" : 1472,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r22",
     "field_offset" : 1536,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r23",
     "field_offset" : 1600,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r24",
     "field_offset" : 1664,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r25",
     "field_offset" : 1728,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r26",
     "field_offset" : 1792,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r27",
     "field_offset" : 1856,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r28",
     "field_offset" : 1920,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r29",
     "field_offset" : 1984,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r30",
     "field_offset" : 2048,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r31",
     "field_offset" : 2112,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__cr",
     "field_offset" : 2176,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__xer",
     "field_offset" : 2240,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 2304,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__ctr",
     "field_offset" : 2368,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__vrsave",
     "field_offset" : 2432,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64::ppc64_thread_state_t",
   "name" : "libunwind::Registers_ppc64::ppc64_thread_state_t",
   "referenced_type" : "type-283",
   "self_type" : "type-283",
   "size" : 312,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc6420ppc64_thread_state_tE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "asfloat",
     "referenced_type" : "type-286"
    },
    {
     "field_name" : "v",
     "referenced_type" : "type-278"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64::ppc64_vsr_t",
   "name" : "libunwind::Registers_ppc64::ppc64_vsr_t",
   "record_kind" : "union",
   "referenced_type" : "type-285",
   "self_type" : "type-285",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc6411ppc64_vsr_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-276"
    },
    {
     "field_name" : "v2",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64::ppc64_vsr_t::asfloat_s",
   "name" : "libunwind::Registers_ppc64::ppc64_vsr_t::asfloat_s",
   "referenced_type" : "type-286",
   "self_type" : "type-286",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc6411ppc64_vsr_t9asfloat_sE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__fpregs",
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "__fpscr_pad",
     "field_offset" : 2048,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__fpscr",
     "field_offset" : 2080,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_float_state_t",
   "name" : "libunwind::Registers_ppc::ppc_float_state_t",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 264,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc17ppc_float_state_tE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__srr0",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__srr1",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r0",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r1",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r2",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r3",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r4",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r5",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r6",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r7",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 320,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 352,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 384,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 416,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 448,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 480,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 512,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 544,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r16",
     "field_offset" : 576,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r17",
     "field_offset" : 608,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r18",
     "field_offset" : 640,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r19",
     "field_offset" : 672,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r20",
     "field_offset" : 704,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r21",
     "field_offset" : 736,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r22",
     "field_offset" : 768,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r23",
     "field_offset" : 800,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r24",
     "field_offset" : 832,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r25",
     "field_offset" : 864,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r26",
     "field_offset" : 896,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r27",
     "field_offset" : 928,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r28",
     "field_offset" : 960,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r29",
     "field_offset" : 992,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r30",
     "field_offset" : 1024,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r31",
     "field_offset" : 1056,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__cr",
     "field_offset" : 1088,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__xer",
     "field_offset" : 1120,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1152,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ctr",
     "field_offset" : 1184,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__mq",
     "field_offset" : 1216,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__vrsave",
     "field_offset" : 1248,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "name" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "referenced_type" : "type-273",
   "self_type" : "type-273",
   "size" : 160,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc18ppc_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "libunwind::Registers_sparc",
   "name" : "libunwind::Registers_sparc",
   "record_kind" : "class",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_sparcE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__regs",
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "libunwind::Registers_sparc::sparc_thread_state_t",
   "name" : "libunwind::Registers_sparc::sparc_thread_state_t",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_sparc20sparc_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-263"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86",
   "name" : "libunwind::Registers_x86",
   "record_kind" : "class",
   "referenced_type" : "type-262",
   "self_type" : "type-262",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x86E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__eax",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ebx",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ecx",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__edx",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__edi",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__esi",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ebp",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__esp",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ss",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__eflags",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__eip",
     "field_offset" : 320,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 352,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ds",
     "field_offset" : 384,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__es",
     "field_offset" : 416,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 448,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 480,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86::GPRs",
   "name" : "libunwind::Registers_x86::GPRs",
   "referenced_type" : "type-263",
   "self_type" : "type-263",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x864GPRsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-268"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64",
   "name" : "libunwind::Registers_x86_64",
   "record_kind" : "class",
   "referenced_type" : "type-267",
   "self_type" : "type-267",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__rax",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__rbx",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__rcx",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__rdx",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__rdi",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__rsi",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__rbp",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__rsp",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 512,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 640,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 704,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 768,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 832,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 896,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 960,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__rip",
     "field_offset" : 1024,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__rflags",
     "field_offset" : 1088,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 1152,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 1216,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 1280,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64::GPRs",
   "name" : "libunwind::Registers_x86_64::GPRs",
   "referenced_type" : "type-268",
   "self_type" : "type-268",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_644GPRsE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-55"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-52"
    },
    {
     "access" : "private",
     "field_name" : "_registers",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "_info",
     "field_offset" : 2752,
     "referenced_type" : "type-54"
    },
    {
     "access" : "private",
     "field_name" : "_unwindInfoMissing",
     "field_offset" : 3072,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "_isSignalFrame",
     "field_offset" : 3080,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "name" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "record_kind" : "class",
   "referenced_type" : "type-51",
   "self_type" : "type-51",
   "size" : 392,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-53", "type-9" ],
   "unique_id" : "_ZTSN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arm_section",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "arm_section_length",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::UnwindInfoSections",
   "name" : "libunwind::UnwindInfoSections",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind18UnwindInfoSectionsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vec",
     "referenced_type" : "type-257"
    }
   ],
   "linker_set_key" : "libunwind::v128",
   "name" : "libunwind::v128",
   "referenced_type" : "type-278",
   "self_type" : "type-278",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind4v128E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_addr",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_name",
     "field_offset" : 32,
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "l_ld",
     "field_offset" : 64,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "l_next",
     "field_offset" : 96,
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "l_prev",
     "field_offset" : 128,
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "link_map",
   "name" : "link_map",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/link.h",
   "unique_id" : "link_map"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-229",
   "self_type" : "type-229",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.2/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-168",
   "self_type" : "type-168",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-330",
   "self_type" : "type-330",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS17pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-331",
   "self_type" : "type-331",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-212",
   "self_type" : "type-212",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-332",
   "self_type" : "type-332",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-207"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-207"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-334",
   "self_type" : "type-334",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS18pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-335",
   "self_type" : "type-335",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_version",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "r_map",
     "field_offset" : 32,
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "r_brk",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_state",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_ldbase",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "r_debug",
   "name" : "r_debug",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/link.h",
   "unique_id" : "r_debug"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "sched_param",
   "name" : "sched_param",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sched.h",
   "unique_id" : "sched_param"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-157"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-174"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-169"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-135"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h:116:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h:116:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-174",
   "self_type" : "type-174",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-135"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h:105:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h:105:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-172",
   "self_type" : "type-172",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-159",
   "self_type" : "type-159",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 84,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "type-163"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-164"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-165"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3",
   "record_kind" : "union",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 52,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-166"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "type-145"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5",
   "referenced_type" : "type-165",
   "self_type" : "type-165",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-139"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-140"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "type-156"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3",
   "record_kind" : "union",
   "referenced_type" : "type-139",
   "self_type" : "type-139",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "type-141"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5 <Spelling=bionic/libc/kernel/uapi/asm-generic/siginfo.h:95:19>",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5 <Spelling=bionic/libc/kernel/uapi/asm-generic/siginfo.h:95:19>",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-170"
    }
   ],
   "linker_set_key" : "sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTS10sigset64_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "timespec",
   "name" : "timespec",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/bits/timespec.h",
   "unique_id" : "_ZTS8timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "timeval",
   "name" : "timeval",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS7timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "timezone",
   "name" : "timezone",
   "referenced_type" : "type-123",
   "self_type" : "type-123",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS8timezone"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "tm",
   "name" : "tm",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 44,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/time.h",
   "unique_id" : "tm"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-189"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "type-129"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "type-190"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "type-193"
    }
   ],
   "linker_set_key" : "ucontext",
   "name" : "ucontext",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 744,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "ucontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "type-169"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:90:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:90:3",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:90:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:90:3",
   "record_kind" : "union",
   "referenced_type" : "type-190",
   "self_type" : "type-190",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:90:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:91:5) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:91:5",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:91:5) at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:91:5",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/ucontext.h:91:5)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "unw_context_t",
   "name" : "unw_context_t",
   "referenced_type" : "type-340",
   "self_type" : "type-340",
   "size" : 1336,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "unw_context_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "unw_context_t",
   "name" : "unw_context_t",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 1336,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS13unw_context_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-57"
    }
   ],
   "linker_set_key" : "unw_cursor_t",
   "name" : "unw_cursor_t",
   "referenced_type" : "type-341",
   "self_type" : "type-341",
   "size" : 1432,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "unw_cursor_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-57"
    }
   ],
   "linker_set_key" : "unw_cursor_t",
   "name" : "unw_cursor_t",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 1432,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS12unw_cursor_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_ip",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "end_ip",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lsda",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "handler",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "gp",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "unwind_info_size",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "unwind_info",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "extra",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unw_proc_info_t",
   "name" : "unw_proc_info_t",
   "referenced_type" : "type-343",
   "self_type" : "type-343",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "unw_proc_info_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_ip",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "end_ip",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lsda",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "handler",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "gp",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "unwind_info_size",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "unwind_info",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "extra",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unw_proc_info_t",
   "name" : "unw_proc_info_t",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS15unw_proc_info_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "entryPageOffset",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "entryCount",
     "field_offset" : 48,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "encodingsPageOffset",
     "field_offset" : 64,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "encodingsCount",
     "field_offset" : 80,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "unwind_info_compressed_second_level_page_header",
   "name" : "unwind_info_compressed_second_level_page_header",
   "referenced_type" : "type-116",
   "self_type" : "type-116",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS47unwind_info_compressed_second_level_page_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unwind_info_regular_second_level_entry",
   "name" : "unwind_info_regular_second_level_entry",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS38unwind_info_regular_second_level_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "entryPageOffset",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "entryCount",
     "field_offset" : 48,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "unwind_info_regular_second_level_page_header",
   "name" : "unwind_info_regular_second_level_page_header",
   "referenced_type" : "type-115",
   "self_type" : "type-115",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS44unwind_info_regular_second_level_page_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "commonEncodingsArraySectionOffset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "commonEncodingsArrayCount",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "personalityArraySectionOffset",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "personalityArrayCount",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "indexSectionOffset",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "indexCount",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unwind_info_section_header",
   "name" : "unwind_info_section_header",
   "referenced_type" : "type-108",
   "self_type" : "type-108",
   "size" : 28,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS26unwind_info_section_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "secondLevelPagesSectionOffset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lsdaIndexArraySectionOffset",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unwind_info_section_header_index_entry",
   "name" : "unwind_info_section_header_index_entry",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS38unwind_info_section_header_index_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lsdaOffset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unwind_info_section_header_lsda_index_entry",
   "name" : "unwind_info_section_header_lsda_index_entry",
   "referenced_type" : "type-113",
   "self_type" : "type-113",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS43unwind_info_section_header_lsda_index_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "type-186"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "type-175"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "type-187"
    }
   ],
   "linker_set_key" : "user",
   "name" : "user",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 296,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-176"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "type-178"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "type-175",
   "self_type" : "type-175",
   "size" : 116,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user_fpregs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "user_fpregs::fp_reg",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user_fpregs::fp_reg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "user_regs",
   "name" : "user_regs",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 72,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user_regs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "type-181",
   "self_type" : "type-181",
   "size" : 264,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user_vfp"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_arm_armv8-a_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user_vfp_exc"
  }
 ],
 "rvalue_reference_types" : []
}
