{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "android::StopWatch::lap_t [8]",
   "name" : "android::StopWatch::lap_t [8]",
   "referenced_type" : "type-190",
   "self_type" : "type-189",
   "size" : 128,
   "source_file" : "/system/core/libutils/include/utils/StopWatch.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-3",
   "self_type" : "type-91",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [20]",
   "name" : "char [20]",
   "referenced_type" : "type-3",
   "self_type" : "type-93",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Printer.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-33",
   "self_type" : "type-256",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-21",
   "self_type" : "type-59",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-10",
   "self_type" : "type-115",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [8]",

   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-3",
   "self_type" : "type-8",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/FileMap.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const char16_t",
   "name" : "const char16_t",
   "referenced_type" : "type-199",
   "self_type" : "type-198",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const char32_t",
   "name" : "const char32_t",
   "referenced_type" : "type-203",
   "self_type" : "type-202",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const double",
   "name" : "const double",
   "referenced_type" : "type-36",
   "self_type" : "type-35",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const float",
   "name" : "const float",
   "referenced_type" : "type-33",
   "self_type" : "type-32",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-21",
   "self_type" : "type-20",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const log_msg",
   "name" : "const log_msg",
   "referenced_type" : "type-113",
   "self_type" : "type-144",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const long long",
   "name" : "const long long",
   "referenced_type" : "type-7",
   "self_type" : "type-26",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const native_handle",
   "name" : "const native_handle",
   "referenced_type" : "type-58",
   "self_type" : "type-64",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const short",
   "name" : "const short",
   "referenced_type" : "type-13",
   "self_type" : "type-12",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const signed char",
   "name" : "const signed char",
   "referenced_type" : "type-322",
   "self_type" : "type-321",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-10",
   "self_type" : "type-9",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-6",
   "self_type" : "type-23",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-29",
   "self_type" : "type-28",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-18",
   "self_type" : "type-17",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-5",
   "self_type" : "type-43",
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-16",
   "self_type" : "type-261",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFrameLines",
     "referenced_type" : "type-168"
    }
   ],
   "linker_set_key" : "android::CallStack",
   "name" : "android::CallStack",
   "record_kind" : "class",
   "referenced_type" : "type-172",
   "self_type" : "type-172",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/CallStack.h",
   "unique_id" : "_ZTSN7android9CallStackE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CallStack::StackDeleter",
   "name" : "android::CallStack::StackDeleter",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/CallStack.h",
   "unique_id" : "_ZTSN7android9CallStack12StackDeleterE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-225"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFd",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mIndent",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mPrefix",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mFormatString",
     "field_offset" : 128,
     "referenced_type" : "type-93"
    }
   ],
   "linker_set_key" : "android::FdPrinter",
   "name" : "android::FdPrinter",
   "record_kind" : "class",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 36,
   "source_file" : "/system/core/libutils/include/utils/Printer.h",
   "unique_id" : "_ZTSN7android9FdPrinterE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9FdPrinterE"
    },
    {
     "mangled_component_name" : "_ZN7android9FdPrinter9printLineEPKc"
    },
    {
     "mangled_component_name" : "_ZN7android7Printer15printFormatLineEPKcz"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android9FdPrinterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android9FdPrinterD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFileName",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mBasePtr",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mBaseLength",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mDataOffset",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mDataPtr",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mDataLength",
     "field_offset" : 224,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::FileMap",
   "name" : "android::FileMap",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 32,
   "source_file" : "/system/core/libutils/include/utils/FileMap.h",
   "unique_id" : "_ZTSN7android7FileMapE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-120"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String8, android::String8>",
   "name" : "android::KeyedVector<android::String8, android::String8>",
   "record_kind" : "class",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-84", "type-84" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_7String8ES1_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-370"
    }
   ],
   "linker_set_key" : "android::KeyedVector<int, android::Looper::Request>",
   "name" : "android::KeyedVector<int, android::Looper::Request>",
   "record_kind" : "class",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-21", "type-372" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIiNS_6Looper7RequestEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-66" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-42" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLogTag",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mPriority",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    },
    {
     "access" : "private",
     "field_name" : "mPrefix",
     "field_offset" : 96,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mIgnoreBlankLines",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::LogPrinter",
   "name" : "android::LogPrinter",
   "record_kind" : "class",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Printer.h",
   "unique_id" : "_ZTSN7android10LogPrinterE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10LogPrinterE"
    },
    {
     "mangled_component_name" : "_ZN7android10LogPrinter9printLineEPKc"
    },
    {
     "mangled_component_name" : "_ZN7android7Printer15printFormatLineEPKcz"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10LogPrinterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10LogPrinterD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-48"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAllowNonCallbacks",
     "field_offset" : 64,
     "referenced_type" : "type-273"
    },
    {
     "access" : "private",
     "field_name" : "mWakeEventFd",
     "field_offset" : 96,
     "referenced_type" : "type-360"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 128,
     "referenced_type" : "type-178"
    },
    {
     "access" : "private",
     "field_name" : "mMessageEnvelopes",
     "field_offset" : 160,
     "referenced_type" : "type-361"
    },
    {
     "access" : "private",
     "field_name" : "mSendingMessage",
     "field_offset" : 320,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mPolling",
     "field_offset" : 328,
     "referenced_type" : "type-261"
    },
    {
     "access" : "private",
     "field_name" : "mEpollFd",
     "field_offset" : 352,
     "referenced_type" : "type-368"
    },
    {
     "access" : "private",
     "field_name" : "mEpollRebuildRequired",
     "field_offset" : 384,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mRequests",
     "field_offset" : 416,
     "referenced_type" : "type-369"
    },
    {
     "access" : "private",
     "field_name" : "mNextRequestSeq",
     "field_offset" : 576,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mResponses",
     "field_offset" : 608,
     "referenced_type" : "type-377"
    },
    {
     "access" : "private",
     "field_name" : "mResponseIndex",
     "field_offset" : 768,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mNextMessageUptime",
     "field_offset" : 832,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::Looper",
   "name" : "android::Looper",
   "record_kind" : "class",
   "referenced_type" : "type-358",
   "self_type" : "type-358",
   "size" : 112,
   "source_file" : "/system/core/libutils/include/utils/Looper.h",
   "unique_id" : "_ZTSN7android6LooperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6LooperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6LooperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6LooperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uptime",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "handler",
     "field_offset" : 64,
     "referenced_type" : "type-363"
    },
    {
     "field_name" : "message",
     "field_offset" : 96,
     "referenced_type" : "type-366"
    }
   ],
   "linker_set_key" : "android::Looper::MessageEnvelope",
   "name" : "android::Looper::MessageEnvelope",
   "referenced_type" : "type-362",
   "self_type" : "type-362",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/Looper.h",
   "unique_id" : "_ZTSN7android6Looper15MessageEnvelopeE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "ident",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "events",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "seq",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "callback",
     "field_offset" : 128,
     "referenced_type" : "type-373"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::Looper::Request",
   "name" : "android::Looper::Request",
   "referenced_type" : "type-372",
   "self_type" : "type-372",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/Looper.h",
   "unique_id" : "_ZTSN7android6Looper7RequestE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "events",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "request",
     "field_offset" : 32,
     "referenced_type" : "type-372"
    }
   ],
   "linker_set_key" : "android::Looper::Response",
   "name" : "android::Looper::Response",
   "referenced_type" : "type-378",
   "self_type" : "type-378",
   "size" : 28,
   "source_file" : "/system/core/libutils/include/utils/Looper.h",
   "unique_id" : "_ZTSN7android6Looper8ResponseE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "android::LooperCallback",
   "name" : "android::LooperCallback",
   "record_kind" : "class",
   "referenced_type" : "type-375",
   "self_type" : "type-375",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/Looper.h",
   "unique_id" : "_ZTSN7android14LooperCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14LooperCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14LooperCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14LooperCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14LooperCallback11handleEventEiiPv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14LooperCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14LooperCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14LooperCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "what",
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::Message",
   "name" : "android::Message",
   "referenced_type" : "type-366",
   "self_type" : "type-366",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Looper.h",
   "unique_id" : "_ZTSN7android7MessageE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "android::MessageHandler",
   "name" : "android::MessageHandler",
   "record_kind" : "class",
   "referenced_type" : "type-365",
   "self_type" : "type-365",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/Looper.h",
   "unique_id" : "_ZTSN7android14MessageHandlerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MessageHandlerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MessageHandlerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MessageHandlerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14MessageHandler13handleMessageERKNS_7MessageE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MessageHandlerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14MessageHandlerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14MessageHandlerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-179"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-178",
   "self_type" : "type-178",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-182"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-181",
   "self_type" : "type-181",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-67"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPrinter",
     "field_offset" : 32,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "mPrefix",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::PrefixPrinter",
   "name" : "android::PrefixPrinter",
   "record_kind" : "class",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/Printer.h",
   "unique_id" : "_ZTSN7android13PrefixPrinterE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13PrefixPrinterE"
    },
    {
     "mangled_component_name" : "_ZN7android13PrefixPrinter9printLineEPKc"
    },
    {
     "mangled_component_name" : "_ZN7android7Printer15printFormatLineEPKcz"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13PrefixPrinterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13PrefixPrinterD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::Printer",
   "name" : "android::Printer",
   "record_kind" : "class",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Printer.h",
   "unique_id" : "_ZTSN7android7PrinterE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7PrinterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7Printer9printLineEPKc"
    },
    {
     "mangled_component_name" : "_ZN7android7Printer15printFormatLineEPKcz"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7PrinterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7PrinterD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mProperties",
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::PropertyMap",
   "name" : "android::PropertyMap",
   "record_kind" : "class",
   "referenced_type" : "type-133",
   "self_type" : "type-133",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/PropertyMap.h",
   "unique_id" : "_ZTSN7android11PropertyMapE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMap",
     "referenced_type" : "type-134"
    },
    {
     "access" : "private",
     "field_name" : "mTokenizer",
     "field_offset" : 32,
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "android::PropertyMap::Parser",
   "name" : "android::PropertyMap::Parser",
   "record_kind" : "class",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/PropertyMap.h",
   "unique_id" : "_ZTSN7android11PropertyMap6ParserE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-477"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-480"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-479",
   "self_type" : "type-479",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-480"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-482",
   "self_type" : "type-482",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-45",
   "self_type" : "type-45",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTag",
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::ScopedTrace",
   "name" : "android::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "type-508",
   "self_type" : "type-508",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Trace.h",
   "unique_id" : "_ZTSN7android11ScopedTraceE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-375"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCallback",
     "field_offset" : 32,
     "referenced_type" : "type-468"
    }
   ],
   "linker_set_key" : "android::SimpleLooperCallback",
   "name" : "android::SimpleLooperCallback",
   "record_kind" : "class",
   "referenced_type" : "type-501",
   "self_type" : "type-501",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/Looper.h",
   "unique_id" : "_ZTSN7android20SimpleLooperCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android20SimpleLooperCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android20SimpleLooperCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android20SimpleLooperCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android20SimpleLooperCallback11handleEventEiiPv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android20SimpleLooperCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android20SimpleLooperCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android20SimpleLooperCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-119"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String8, android::String8> >",
   "record_kind" : "class",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_compareEPKvS6_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-119"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<int, android::Looper::Request> >",
   "name" : "android::SortedVector<android::key_value_pair_t<int, android::Looper::Request> >",
   "record_kind" : "class",
   "referenced_type" : "type-370",
   "self_type" : "type-370",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNS_6Looper7RequestEEEE10do_compareEPKvS7_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mName",
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mClock",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mStartTime",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mLaps",
     "field_offset" : 128,
     "referenced_type" : "type-189"
    },
    {
     "access" : "private",
     "field_name" : "mNumLaps",
     "field_offset" : 1152,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::StopWatch",
   "name" : "android::StopWatch",
   "record_kind" : "class",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 152,
   "source_file" : "/system/core/libutils/include/utils/StopWatch.h",
   "unique_id" : "_ZTSN7android9StopWatchE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "soFar",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "thisLap",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::StopWatch::lap_t",
   "name" : "android::StopWatch::lap_t",
   "referenced_type" : "type-190",
   "self_type" : "type-190",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/StopWatch.h",
   "unique_id" : "_ZTSN7android9StopWatch5lap_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTarget",
     "field_offset" : 32,
     "referenced_type" : "type-96"
    },
    {
     "access" : "private",
     "field_name" : "mPrefix",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::String8Printer",
   "name" : "android::String8Printer",
   "record_kind" : "class",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/Printer.h",
   "unique_id" : "_ZTSN7android14String8PrinterE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14String8PrinterE"
    },
    {
     "mangled_component_name" : "_ZN7android14String8Printer9printLineEPKc"
    },
    {
     "mangled_component_name" : "_ZN7android7Printer15printFormatLineEPKcz"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14String8PrinterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14String8PrinterD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-48"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "type-273"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-178"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "type-224"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "type-261"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "type-261"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "type-274"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-272",
   "self_type" : "type-272",
   "size" : 44,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFilename",
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "mFileMap",
     "field_offset" : 32,
     "referenced_type" : "type-129"
    },
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mLength",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mCurrent",
     "field_offset" : 160,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mLineNumber",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::Tokenizer",
   "name" : "android::Tokenizer",
   "record_kind" : "class",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 28,
   "source_file" : "/system/core/libutils/include/utils/Tokenizer.h",
   "unique_id" : "_ZTSN7android9TokenizerE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "android::Vector<android::Looper::MessageEnvelope>",
   "name" : "android::Vector<android::Looper::MessageEnvelope>",
   "record_kind" : "class",
   "referenced_type" : "type-361",
   "self_type" : "type-361",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-362" ],
   "unique_id" : "_ZTSN7android6VectorINS_6Looper15MessageEnvelopeEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_6Looper15MessageEnvelopeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_6Looper15MessageEnvelopeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_6Looper15MessageEnvelopeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper15MessageEnvelopeEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper15MessageEnvelopeEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper15MessageEnvelopeEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper15MessageEnvelopeEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper15MessageEnvelopeEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper15MessageEnvelopeEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "android::Vector<android::Looper::Response>",
   "name" : "android::Vector<android::Looper::Response>",
   "record_kind" : "class",
   "referenced_type" : "type-377",
   "self_type" : "type-377",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-378" ],
   "unique_id" : "_ZTSN7android6VectorINS_6Looper8ResponseEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_6Looper8ResponseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_6Looper8ResponseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_6Looper8ResponseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper8ResponseEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper8ResponseEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper8ResponseEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper8ResponseEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper8ResponseEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_6Looper8ResponseEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "android::Vector<android::String8>",
   "name" : "android::Vector<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "type-168",
   "self_type" : "type-168",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android6VectorINS_7String8EEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "android::Vector<android::sysprop_change_callback_info>",
   "name" : "android::Vector<android::sysprop_change_callback_info>",
   "record_kind" : "class",
   "referenced_type" : "type-656",
   "self_type" : "type-656",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-657" ],
   "unique_id" : "_ZTSN7android6VectorINS_28sysprop_change_callback_infoEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_28sysprop_change_callback_infoEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_28sysprop_change_callback_infoEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_28sysprop_change_callback_infoEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_28sysprop_change_callback_infoEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_28sysprop_change_callback_infoEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_28sysprop_change_callback_infoEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_28sysprop_change_callback_infoEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_28sysprop_change_callback_infoEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_28sysprop_change_callback_infoEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-23"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-116",
   "self_type" : "type-116",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-365"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandler",
     "field_offset" : 32,
     "referenced_type" : "type-462"
    }
   ],
   "linker_set_key" : "android::WeakMessageHandler",
   "name" : "android::WeakMessageHandler",
   "record_kind" : "class",
   "referenced_type" : "type-461",
   "self_type" : "type-461",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Looper.h",
   "unique_id" : "_ZTSN7android18WeakMessageHandlerE",
   "vtable_components" :
   [
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android18WeakMessageHandlerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android18WeakMessageHandlerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android18WeakMessageHandlerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android18WeakMessageHandler13handleMessageERKNS_7MessageE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -12,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -12,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android18WeakMessageHandlerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android18WeakMessageHandlerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android18WeakMessageHandlerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<android::String8, android::String8>",
   "name" : "android::aggregate_traits<android::String8, android::String8>",
   "referenced_type" : "type-157",
   "self_type" : "type-157",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-84", "type-84" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsINS_7String8ES1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<int, android::Looper::Request>",
   "name" : "android::aggregate_traits<int, android::Looper::Request>",
   "referenced_type" : "type-414",
   "self_type" : "type-414",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21", "type-372" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsIiNS_6Looper7RequestEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "android::key_value_pair_t<android::String8, android::String8>",
   "name" : "android::key_value_pair_t<android::String8, android::String8>",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-84", "type-84" ],
   "unique_id" : "_ZTSN7android16key_value_pair_tINS_7String8ES1_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "type-372"
    }
   ],
   "linker_set_key" : "android::key_value_pair_t<int, android::Looper::Request>",
   "name" : "android::key_value_pair_t<int, android::Looper::Request>",
   "referenced_type" : "type-371",
   "self_type" : "type-371",
   "size" : 28,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21", "type-372" ],
   "unique_id" : "_ZTSN7android16key_value_pair_tIiNS_6Looper7RequestEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "android::sp<android::Looper>",
   "name" : "android::sp<android::Looper>",
   "record_kind" : "class",
   "referenced_type" : "type-356",
   "self_type" : "type-356",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-358" ],
   "unique_id" : "_ZTSN7android2spINS_6LooperEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-374"
    }
   ],
   "linker_set_key" : "android::sp<android::LooperCallback>",
   "name" : "android::sp<android::LooperCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-375" ],
   "unique_id" : "_ZTSN7android2spINS_14LooperCallbackEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-364"
    }
   ],
   "linker_set_key" : "android::sp<android::MessageHandler>",
   "name" : "android::sp<android::MessageHandler>",
   "record_kind" : "class",
   "referenced_type" : "type-363",
   "self_type" : "type-363",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-365" ],
   "unique_id" : "_ZTSN7android2spINS_14MessageHandlerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "android::sp<android::NativeHandle>",
   "name" : "android::sp<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-66" ],
   "unique_id" : "_ZTSN7android2spINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-271"
    }
   ],
   "linker_set_key" : "android::sp<android::Thread>",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-272" ],
   "unique_id" : "_ZTSN7android2spINS_6ThreadEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::Looper::MessageEnvelope>",
   "name" : "android::trait_pointer<android::Looper::MessageEnvelope>",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-362" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_6Looper15MessageEnvelopeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::Looper::Request>",
   "name" : "android::trait_pointer<android::Looper::Request>",
   "referenced_type" : "type-406",
   "self_type" : "type-406",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-372" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_6Looper7RequestEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::Looper::Response>",
   "name" : "android::trait_pointer<android::Looper::Response>",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-378" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_6Looper8ResponseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::String8>",
   "name" : "android::trait_pointer<android::String8>",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-153",
   "self_type" : "type-153",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<int, android::Looper::Request> >",
   "name" : "android::trait_pointer<android::key_value_pair_t<int, android::Looper::Request> >",
   "referenced_type" : "type-404",
   "self_type" : "type-404",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tIiNS_6Looper7RequestEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::sysprop_change_callback_info>",
   "name" : "android::trait_pointer<android::sysprop_change_callback_info>",
   "referenced_type" : "type-342",
   "self_type" : "type-342",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-343" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_28sysprop_change_callback_infoEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<int>",
   "name" : "android::trait_pointer<int>",
   "referenced_type" : "type-405",
   "self_type" : "type-405",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android13trait_pointerIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::Looper::MessageEnvelope>",
   "name" : "android::trait_trivial_copy<android::Looper::MessageEnvelope>",
   "referenced_type" : "type-394",
   "self_type" : "type-394",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-362" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_6Looper15MessageEnvelopeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::Looper::Request>",
   "name" : "android::trait_trivial_copy<android::Looper::Request>",
   "referenced_type" : "type-395",
   "self_type" : "type-395",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-372" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_6Looper7RequestEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::Looper::Response>",
   "name" : "android::trait_trivial_copy<android::Looper::Response>",
   "referenced_type" : "type-397",
   "self_type" : "type-397",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-378" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_6Looper8ResponseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::String8>",
   "name" : "android::trait_trivial_copy<android::String8>",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-150",
   "self_type" : "type-150",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<int, android::Looper::Request> >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<int, android::Looper::Request> >",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tIiNS_6Looper7RequestEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::sysprop_change_callback_info>",
   "name" : "android::trait_trivial_copy<android::sysprop_change_callback_info>",
   "referenced_type" : "type-337",
   "self_type" : "type-337",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-338" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_28sysprop_change_callback_infoEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-318",
   "self_type" : "type-318",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-314",
   "self_type" : "type-314",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-268",
   "self_type" : "type-268",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-304",
   "self_type" : "type-304",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-294",
   "self_type" : "type-294",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-73" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-219",
   "self_type" : "type-219",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-309",
   "self_type" : "type-309",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-299",
   "self_type" : "type-299",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-297" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-290",
   "self_type" : "type-290",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::Looper::MessageEnvelope>",
   "name" : "android::trait_trivial_ctor<android::Looper::MessageEnvelope>",
   "referenced_type" : "type-385",
   "self_type" : "type-385",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-362" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_6Looper15MessageEnvelopeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::Looper::Request>",
   "name" : "android::trait_trivial_ctor<android::Looper::Request>",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-372" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_6Looper7RequestEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::Looper::Response>",
   "name" : "android::trait_trivial_ctor<android::Looper::Response>",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-378" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_6Looper8ResponseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::String8>",
   "name" : "android::trait_trivial_ctor<android::String8>",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<int, android::Looper::Request> >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<int, android::Looper::Request> >",
   "referenced_type" : "type-386",
   "self_type" : "type-386",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tIiNS_6Looper7RequestEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::sysprop_change_callback_info>",
   "name" : "android::trait_trivial_ctor<android::sysprop_change_callback_info>",
   "referenced_type" : "type-331",
   "self_type" : "type-331",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-332" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_28sysprop_change_callback_infoEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-310",
   "self_type" : "type-310",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-316",
   "self_type" : "type-316",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-312",
   "self_type" : "type-312",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-302",
   "self_type" : "type-302",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-292",
   "self_type" : "type-292",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-73" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-209",
   "self_type" : "type-209",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-284",
   "self_type" : "type-284",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-297" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-185",
   "self_type" : "type-185",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::Looper::MessageEnvelope>",
   "name" : "android::trait_trivial_dtor<android::Looper::MessageEnvelope>",
   "referenced_type" : "type-390",
   "self_type" : "type-390",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-362" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_6Looper15MessageEnvelopeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::Looper::Request>",
   "name" : "android::trait_trivial_dtor<android::Looper::Request>",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-372" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_6Looper7RequestEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::Looper::Response>",
   "name" : "android::trait_trivial_dtor<android::Looper::Response>",
   "referenced_type" : "type-393",
   "self_type" : "type-393",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-378" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_6Looper8ResponseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::String8>",
   "name" : "android::trait_trivial_dtor<android::String8>",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<int, android::Looper::Request> >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<int, android::Looper::Request> >",
   "referenced_type" : "type-392",
   "self_type" : "type-392",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tIiNS_6Looper7RequestEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::sysprop_change_callback_info>",
   "name" : "android::trait_trivial_dtor<android::sysprop_change_callback_info>",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-334" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_28sysprop_change_callback_infoEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-317",
   "self_type" : "type-317",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-313",
   "self_type" : "type-313",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-293",
   "self_type" : "type-293",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-73" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-218",
   "self_type" : "type-218",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-214",
   "self_type" : "type-214",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-288",
   "self_type" : "type-288",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-308",
   "self_type" : "type-308",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-298",
   "self_type" : "type-298",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-297" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-222",
   "self_type" : "type-222",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-229",
   "self_type" : "type-229",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::Looper::MessageEnvelope>",
   "name" : "android::trait_trivial_move<android::Looper::MessageEnvelope>",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-362" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_6Looper15MessageEnvelopeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::Looper::Request>",
   "name" : "android::trait_trivial_move<android::Looper::Request>",
   "referenced_type" : "type-400",
   "self_type" : "type-400",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-372" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_6Looper7RequestEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::Looper::Response>",
   "name" : "android::trait_trivial_move<android::Looper::Response>",
   "referenced_type" : "type-402",
   "self_type" : "type-402",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-378" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_6Looper8ResponseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String16>",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "type-213",
   "self_type" : "type-213",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "template_args" : [ "type-196" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String8>",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<int, android::Looper::Request> >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<int, android::Looper::Request> >",
   "referenced_type" : "type-401",
   "self_type" : "type-401",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tIiNS_6Looper7RequestEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::sysprop_change_callback_info>",
   "name" : "android::trait_trivial_move<android::sysprop_change_callback_info>",
   "referenced_type" : "type-340",
   "self_type" : "type-340",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-341" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_28sysprop_change_callback_infoEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-319",
   "self_type" : "type-319",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-315",
   "self_type" : "type-315",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-275",
   "self_type" : "type-275",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-305",
   "self_type" : "type-305",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-295",
   "self_type" : "type-295",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-73" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-220",
   "self_type" : "type-220",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-291",
   "self_type" : "type-291",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-311",
   "self_type" : "type-311",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-297" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-239",
   "self_type" : "type-239",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-300",
   "self_type" : "type-300",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::Looper::MessageEnvelope>",
   "name" : "android::traits<android::Looper::MessageEnvelope>",
   "referenced_type" : "type-408",
   "self_type" : "type-408",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-362" ],
   "unique_id" : "_ZTSN7android6traitsINS_6Looper15MessageEnvelopeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::Looper::Request>",
   "name" : "android::traits<android::Looper::Request>",
   "referenced_type" : "type-412",
   "self_type" : "type-412",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-372" ],
   "unique_id" : "_ZTSN7android6traitsINS_6Looper7RequestEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::Looper::Response>",
   "name" : "android::traits<android::Looper::Response>",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-378" ],
   "unique_id" : "_ZTSN7android6traitsINS_6Looper8ResponseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::String8>",
   "name" : "android::traits<android::String8>",
   "referenced_type" : "type-156",
   "self_type" : "type-156",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android6traitsINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::traits<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<int, android::Looper::Request> >",
   "name" : "android::traits<android::key_value_pair_t<int, android::Looper::Request> >",
   "referenced_type" : "type-409",
   "self_type" : "type-409",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tIiNS_6Looper7RequestEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::sysprop_change_callback_info>",
   "name" : "android::traits<android::sysprop_change_callback_info>",
   "referenced_type" : "type-344",
   "self_type" : "type-344",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-345" ],
   "unique_id" : "_ZTSN7android6traitsINS_28sysprop_change_callback_infoEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<int>",
   "name" : "android::traits<int>",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android6traitsIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-427"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::Looper::MessageEnvelope>",
   "name" : "android::use_trivial_move<android::Looper::MessageEnvelope>",
   "referenced_type" : "type-426",
   "self_type" : "type-426",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-362" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_6Looper15MessageEnvelopeEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-433"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::Looper::Response>",
   "name" : "android::use_trivial_move<android::Looper::Response>",
   "referenced_type" : "type-432",
   "self_type" : "type-432",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-378" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_6Looper8ResponseEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-109"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::use_trivial_move<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-108",
   "self_type" : "type-108",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-429"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::key_value_pair_t<int, android::Looper::Request> >",
   "name" : "android::use_trivial_move<android::key_value_pair_t<int, android::Looper::Request> >",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_16key_value_pair_tIiNS_6Looper7RequestEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-353"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::sysprop_change_callback_info>",
   "name" : "android::use_trivial_move<android::sysprop_change_callback_info>",
   "referenced_type" : "type-352",
   "self_type" : "type-352",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-354" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_28sysprop_change_callback_infoEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-364"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-164"
    }
   ],
   "linker_set_key" : "android::wp<android::MessageHandler>",
   "name" : "android::wp<android::MessageHandler>",
   "record_kind" : "class",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-365" ],
   "unique_id" : "_ZTSN7android2wpINS_14MessageHandlerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-271"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-164"
    }
   ],
   "linker_set_key" : "android::wp<android::Thread>",
   "name" : "android::wp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "type-270",
   "self_type" : "type-270",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-272" ],
   "unique_id" : "_ZTSN7android2wpINS_6ThreadEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-259",
   "self_type" : "type-259",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-247"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-256"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-255",
   "self_type" : "type-255",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-252"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-254"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 12,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-251"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "type-248"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-250",
   "self_type" : "type-250",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-257",
   "self_type" : "type-257",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "type-247"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-246",
   "self_type" : "type-246",
   "size" : 56,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-114"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-113",
   "self_type" : "type-113",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-90"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-104",
   "self_type" : "type-104",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-111",
   "self_type" : "type-111",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "android::FileMap &&",
   "name" : "android::FileMap &&",
   "referenced_type" : "type-1",
   "self_type" : "type-183",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/FileMap.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::Looper> &&",
   "name" : "android::sp<android::Looper> &&",
   "referenced_type" : "type-356",
   "self_type" : "type-507",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::MessageHandler> &&",
   "name" : "android::sp<android::MessageHandler> &&",
   "referenced_type" : "type-363",
   "self_type" : "type-492",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::Thread> &&",
   "name" : "android::sp<android::Thread> &&",
   "referenced_type" : "type-274",
   "self_type" : "type-282",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  }
 ]
}
