{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [120]",
   "name" : "char [120]",
   "referenced_type" : "type-92",
   "self_type" : "type-338",
   "size" : 120,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextArm64.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [16]",
   "name" : "unsigned int [16]",
   "referenced_type" : "type-3",
   "self_type" : "type-633",
   "size" : 64,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextArm.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [18]",
   "name" : "unsigned int [18]",
   "referenced_type" : "type-3",
   "self_type" : "type-607",
   "size" : 72,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UserArm.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [45]",
   "name" : "unsigned int [45]",
   "referenced_type" : "type-3",
   "self_type" : "type-612",
   "size" : 180,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UserMips.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned long long [2]",
   "name" : "unsigned long long [2]",
   "referenced_type" : "type-6",
   "self_type" : "type-274",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfLocation.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned long long [31]",
   "name" : "unsigned long long [31]",
   "referenced_type" : "type-6",

   "source_file" : "/system/core/libunwindstack/include/unwindstack/Unwinder.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "const std::vector<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-965",
   "self_type" : "type-964",
   "size" : 12,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/LocalUnwinder.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unwindstack::FrameData, std::allocator<unwindstack::FrameData> >",
   "name" : "const std::vector<unwindstack::FrameData, std::allocator<unwindstack::FrameData> >",
   "referenced_type" : "type-1174",
   "self_type" : "type-1173",
   "size" : 12,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Unwinder.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unwindstack::FrameData, std::allocator<unwindstack::FrameData> >",
   "name" : "const std::vector<unwindstack::FrameData, std::allocator<unwindstack::FrameData> >",
   "referenced_type" : "type-771",
   "self_type" : "type-770",
   "size" : 12,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Unwinder.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-10",
   "self_type" : "type-239",
   "size" : 1,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-3",
   "self_type" : "type-133",
   "size" : 4,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-2",
   "self_type" : "type-281",
   "size" : 2,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfStructs.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::DwarfCie",
   "name" : "const unwindstack::DwarfCie",
   "referenced_type" : "type-9",
   "self_type" : "type-8",
   "size" : 64,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfLocation.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::DwarfFde",
   "name" : "const unwindstack::DwarfFde",
   "referenced_type" : "type-5",
   "self_type" : "type-4",
   "size" : 56,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfSection.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::DwarfSection::iterator",
   "name" : "const unwindstack::DwarfSection::iterator",
   "referenced_type" : "type-283",
   "self_type" : "type-288",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfSection.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::ErrorData",
   "name" : "const unwindstack::ErrorData",
   "referenced_type" : "type-14",
   "self_type" : "type-30",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/ElfInterface.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::FileMaps",
   "name" : "const unwindstack::FileMaps",
   "referenced_type" : "type-185",
   "self_type" : "type-189",
   "size" : 28,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::FrameData",
   "name" : "const unwindstack::FrameData",
   "referenced_type" : "type-756",
   "self_type" : "type-772",
   "size" : 120,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Unwinder.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::LocalUpdatableMaps",
   "name" : "const unwindstack::LocalUpdatableMaps",
   "referenced_type" : "type-179",
   "self_type" : "type-265",
   "size" : 28,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::MapInfo",
   "name" : "const unwindstack::MapInfo",
   "referenced_type" : "type-78",
   "self_type" : "type-77",
   "size" : 96,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Elf.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::Maps",
   "name" : "const unwindstack::Maps",
   "referenced_type" : "type-167",
   "self_type" : "type-173",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::Regs::Location",
   "name" : "const unwindstack::Regs::Location",
   "referenced_type" : "type-64",
   "self_type" : "type-103",
   "size" : 4,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Regs.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unwindstack::RemoteMaps",
   "name" : "const unwindstack::RemoteMaps",
   "referenced_type" : "type-175",
   "self_type" : "type-263",
   "size" : 20,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-167"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 128,
     "referenced_type" : "type-93"
    }
   ],
   "linker_set_key" : "unwindstack::BufferMaps",
   "name" : "unwindstack::BufferMaps",
   "record_kind" : "class",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 20,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h",
   "unique_id" : "_ZTSN11unwindstack10BufferMapsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack10BufferMapsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10BufferMapsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10BufferMapsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10BufferMaps5ParseEv"
    },
    {
     "mangled_component_name" : "_ZNK11unwindstack4Maps11GetMapsFileEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-159"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "lock_",
     "field_offset" : 224,
     "referenced_type" : "type-749"
    },
    {
     "access" : "private",
     "field_name" : "initialized_",
     "field_offset" : 256,
     "referenced_type" : "type-72"
    },
    {
     "access" : "private",
     "field_name" : "files_",
     "field_offset" : 288,
     "referenced_type" : "type-750"
    },
    {
     "access" : "private",
     "field_name" : "entry_addr_",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "read_entry_ptr_func_",
     "field_offset" : 512,
     "referenced_type" : "type-751"
    },
    {
     "access" : "private",
     "field_name" : "read_entry_func_",
     "field_offset" : 576,
     "referenced_type" : "type-752"
    },
    {
     "access" : "private",
     "field_name" : "addrs_",
     "field_offset" : 640,
     "referenced_type" : "type-753"
    }
   ],
   "linker_set_key" : "unwindstack::DexFiles",
   "name" : "unwindstack::DexFiles",
   "record_kind" : "class",
   "referenced_type" : "type-748",
   "self_type" : "type-748",
   "size" : 96,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DexFiles.h",
   "unique_id" : "_ZTSN11unwindstack8DexFilesE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8DexFilesE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8DexFilesD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8DexFilesD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8DexFiles16ReadVariableDataEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8DexFiles11ProcessArchEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "fde_address_encoding",
     "field_offset" : 8,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "lsda_encoding",
     "field_offset" : 16,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "segment_size",
     "field_offset" : 24,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "augmentation_string",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "personality_handler",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "cfa_instructions_offset",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "cfa_instructions_end",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "code_alignment_factor",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "data_alignment_factor",
     "field_offset" : 384,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "return_address_register",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfCie",
   "name" : "unwindstack::DwarfCie",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 64,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfStructs.h",
   "unique_id" : "_ZTSN11unwindstack8DwarfCieE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "code",
     "referenced_type" : "type-50"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfErrorData",
   "name" : "unwindstack::DwarfErrorData",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfError.h",
   "unique_id" : "_ZTSN11unwindstack14DwarfErrorDataE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cie_offset",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "cfa_instructions_offset",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "cfa_instructions_end",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pc_start",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pc_end",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "lsda_address",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "cie",
     "field_offset" : 384,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfFde",
   "name" : "unwindstack::DwarfFde",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 56,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfStructs.h",
   "unique_id" : "_ZTSN11unwindstack8DwarfFdeE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-267"
    },
    {
     "field_name" : "values",
     "field_offset" : 64,
     "referenced_type" : "type-274"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfLocation",
   "name" : "unwindstack::DwarfLocation",
   "referenced_type" : "type-273",
   "self_type" : "type-273",
   "size" : 24,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfLocation.h",
   "unique_id" : "_ZTSN11unwindstack13DwarfLocationE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-279"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "cie",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pc_start",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pc_end",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfLocations",
   "name" : "unwindstack::DwarfLocations",
   "referenced_type" : "type-278",
   "self_type" : "type-278",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfLocation.h",
   "unique_id" : "_ZTSN11unwindstack14DwarfLocationsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "memory_",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "cur_offset_",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "pc_offset_",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "data_offset_",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "func_offset_",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "text_offset_",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfMemory",
   "name" : "unwindstack::DwarfMemory",
   "record_kind" : "class",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 48,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfMemory.h",
   "unique_id" : "_ZTSN11unwindstack11DwarfMemoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack11DwarfMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11DwarfMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11DwarfMemoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 64,
     "referenced_type" : "type-48"
    },
    {
     "access" : "protected",
     "field_name" : "last_error_",
     "field_offset" : 448,
     "referenced_type" : "type-49"
    },
    {
     "access" : "protected",
     "field_name" : "cie32_value_",
     "field_offset" : 576,
     "referenced_type" : "type-3"
    },
    {
     "access" : "protected",
     "field_name" : "cie64_value_",
     "field_offset" : 640,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "fde_entries_",
     "field_offset" : 704,
     "referenced_type" : "type-51"
    },
    {
     "access" : "protected",
     "field_name" : "cie_entries_",
     "field_offset" : 864,
     "referenced_type" : "type-52"
    },
    {
     "access" : "protected",
     "field_name" : "cie_loc_regs_",
     "field_offset" : 1024,
     "referenced_type" : "type-53"
    },
    {
     "access" : "protected",
     "field_name" : "loc_regs_",
     "field_offset" : 1184,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfSection",
   "name" : "unwindstack::DwarfSection",
   "record_kind" : "class",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 160,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfSection.h",
   "unique_id" : "_ZTSN11unwindstack12DwarfSectionE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack12DwarfSectionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12DwarfSectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12DwarfSectionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection4InitEyyy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection4EvalEPKNS_8DwarfCieEPNS_6MemoryERKNS_14DwarfLocationsEPNS_4RegsEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection3LogEhyPKNS_8DwarfFdeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection7GetFdesEPNSt3__16vectorIPKNS_8DwarfFdeENS1_9allocatorIS5_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection12GetFdeFromPcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection18GetCfaLocationInfoEyPKNS_8DwarfFdeEPNS_14DwarfLocationsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde32Ej"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde64Ey"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection15AdjustPcFromFdeEy"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-285"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fdes_",
     "referenced_type" : "type-284"
    },
    {
     "access" : "private",
     "field_name" : "index_",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfSection::iterator",
   "name" : "unwindstack::DwarfSection::iterator",
   "record_kind" : "class",
   "referenced_type" : "type-283",
   "self_type" : "type-283",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfSection.h",
   "unique_id" : "_ZTSN11unwindstack12DwarfSection8iteratorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-47"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "load_bias_",
     "field_offset" : 1280,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "entries_offset_",
     "field_offset" : 1344,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "entries_end_",
     "field_offset" : 1408,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "pc_offset_",
     "field_offset" : 1472,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfSectionImpl<unsigned int>",
   "name" : "unwindstack::DwarfSectionImpl<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 192,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfSection.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN11unwindstack16DwarfSectionImplIjEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack16DwarfSectionImplIjEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIjED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIjED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection4InitEyyy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIjE4EvalEPKNS_8DwarfCieEPNS_6MemoryERKNS_14DwarfLocationsEPNS_4RegsEPb"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIjE3LogEhyPKNS_8DwarfFdeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection7GetFdesEPNSt3__16vectorIPKNS_8DwarfFdeENS1_9allocatorIS5_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection12GetFdeFromPcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIjE18GetCfaLocationInfoEyPKNS_8DwarfFdeEPNS_14DwarfLocationsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde32Ej"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde64Ey"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection15AdjustPcFromFdeEy"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-47"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "load_bias_",
     "field_offset" : 1280,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "entries_offset_",
     "field_offset" : 1344,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "entries_end_",
     "field_offset" : 1408,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "pc_offset_",
     "field_offset" : 1472,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfSectionImpl<unsigned long long>",
   "name" : "unwindstack::DwarfSectionImpl<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 192,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfSection.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN11unwindstack16DwarfSectionImplIyEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack16DwarfSectionImplIyEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIyED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIyED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection4InitEyyy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIyE4EvalEPKNS_8DwarfCieEPNS_6MemoryERKNS_14DwarfLocationsEPNS_4RegsEPb"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIyE3LogEhyPKNS_8DwarfFdeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection7GetFdesEPNSt3__16vectorIPKNS_8DwarfFdeENS1_9allocatorIS5_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection12GetFdeFromPcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIyE18GetCfaLocationInfoEyPKNS_8DwarfFdeEPNS_14DwarfLocationsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde32Ej"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde64Ey"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection15AdjustPcFromFdeEy"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-46"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "next_entries_offset_",
     "field_offset" : 1536,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "fdes_",
     "field_offset" : 1600,
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfSectionImplNoHdr<unsigned int>",
   "name" : "unwindstack::DwarfSectionImplNoHdr<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 216,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfSection.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN11unwindstack21DwarfSectionImplNoHdrIjEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack21DwarfSectionImplNoHdrIjEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIjED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIjED0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIjE4InitEyyy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIjE4EvalEPKNS_8DwarfCieEPNS_6MemoryERKNS_14DwarfLocationsEPNS_4RegsEPb"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIjE3LogEhyPKNS_8DwarfFdeE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIjE7GetFdesEPNSt3__16vectorIPKNS_8DwarfFdeENS2_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIjE12GetFdeFromPcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIjE18GetCfaLocationInfoEyPKNS_8DwarfFdeEPNS_14DwarfLocationsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde32Ej"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde64Ey"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection15AdjustPcFromFdeEy"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-56"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "next_entries_offset_",
     "field_offset" : 1536,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "fdes_",
     "field_offset" : 1600,
     "referenced_type" : "type-114"
    }
   ],
   "linker_set_key" : "unwindstack::DwarfSectionImplNoHdr<unsigned long long>",
   "name" : "unwindstack::DwarfSectionImplNoHdr<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-113",
   "self_type" : "type-113",
   "size" : 216,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/DwarfSection.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN11unwindstack21DwarfSectionImplNoHdrIyEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack21DwarfSectionImplNoHdrIyEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIyED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIyED0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIyE4InitEyyy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIyE4EvalEPKNS_8DwarfCieEPNS_6MemoryERKNS_14DwarfLocationsEPNS_4RegsEPb"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIyE3LogEhyPKNS_8DwarfFdeE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIyE7GetFdesEPNSt3__16vectorIPKNS_8DwarfFdeENS2_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack21DwarfSectionImplNoHdrIyE12GetFdeFromPcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack16DwarfSectionImplIyE18GetCfaLocationInfoEyPKNS_8DwarfFdeEPNS_14DwarfLocationsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde32Ej"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection21GetCieOffsetFromFde64Ey"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12DwarfSection15AdjustPcFromFdeEy"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "valid_",
     "field_offset" : 32,
     "referenced_type" : "type-72"
    },
    {
     "access" : "protected",
     "field_name" : "load_bias_",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "interface_",
     "field_offset" : 128,
     "referenced_type" : "type-193"
    },
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 160,
     "referenced_type" : "type-194"
    },
    {
     "access" : "protected",
     "field_name" : "machine_type_",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "access" : "protected",
     "field_name" : "class_type_",
     "field_offset" : 224,
     "referenced_type" : "type-10"
    },
    {
     "access" : "protected",
     "field_name" : "arch_",
     "field_offset" : 232,
     "referenced_type" : "type-34"
    },
    {
     "access" : "protected",
     "field_name" : "lock_",
     "field_offset" : 256,
     "referenced_type" : "type-195"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_memory_",
     "field_offset" : 288,
     "referenced_type" : "type-196"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_interface_",
     "field_offset" : 320,
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "unwindstack::Elf",
   "name" : "unwindstack::Elf",
   "record_kind" : "class",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 48,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Elf.h",
   "unique_id" : "_ZTSN11unwindstack3ElfE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack3ElfE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack3ElfD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack3ElfD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    },
    {
     "access" : "protected",
     "field_name" : "pt_loads_",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "access" : "protected",
     "field_name" : "dynamic_offset_",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "dynamic_vaddr_",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "dynamic_size_",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_hdr_offset_",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_hdr_size_",
     "field_offset" : 512,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_offset_",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_size_",
     "field_offset" : 640,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_offset_",
     "field_offset" : 704,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_size_",
     "field_offset" : 768,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_offset_",
     "field_offset" : 832,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_size_",
     "field_offset" : 896,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_build_id_offset_",
     "field_offset" : 960,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_build_id_size_",
     "field_offset" : 1024,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "soname_type_",
     "field_offset" : 1088,
     "referenced_type" : "type-10"
    },
    {
     "access" : "protected",
     "field_name" : "soname_",
     "field_offset" : 1120,
     "referenced_type" : "type-20"
    },
    {
     "access" : "protected",
     "field_name" : "last_error_",
     "field_offset" : 1216,
     "referenced_type" : "type-14"
    },
    {
     "access" : "protected",
     "field_name" : "eh_frame_",
     "field_offset" : 1344,
     "referenced_type" : "type-21"
    },
    {
     "access" : "protected",
     "field_name" : "debug_frame_",
     "field_offset" : 1376,
     "referenced_type" : "type-22"
    },
    {
     "access" : "protected",
     "field_name" : "gnu_debugdata_interface_",
     "field_offset" : 1408,
     "referenced_type" : "type-23"
    },
    {
     "access" : "protected",
     "field_name" : "symbols_",
     "field_offset" : 1440,
     "referenced_type" : "type-24"
    },
    {
     "access" : "protected",
     "field_name" : "strtabs_",
     "field_offset" : 1536,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "unwindstack::ElfInterface",
   "name" : "unwindstack::ElfInterface",
   "record_kind" : "class",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 208,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/ElfInterface.h",
   "unique_id" : "_ZTSN11unwindstack12ElfInterfaceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack12ElfInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12ElfInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12ElfInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface4InitEPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface11InitHeadersEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface9GetSonameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface15GetFunctionNameEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface17GetGlobalVariableERKNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEPy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface10GetBuildIDEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface4StepEyPNS_4RegsEPNS_6MemoryEPb"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface9IsValidPcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface17HandleUnknownTypeEjyy"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "unwindstack::ElfInterface32",
   "name" : "unwindstack::ElfInterface32",
   "record_kind" : "class",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 208,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/ElfInterface.h",
   "unique_id" : "_ZTSN11unwindstack14ElfInterface32E",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack14ElfInterface32E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface32D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface32D0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface324InitEPy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface3211InitHeadersEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface329GetSonameEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface3215GetFunctionNameEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEPy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface3217GetGlobalVariableERKNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEPy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface3210GetBuildIDEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface4StepEyPNS_4RegsEPNS_6MemoryEPb"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface9IsValidPcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface17HandleUnknownTypeEjyy"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "unwindstack::ElfInterface64",
   "name" : "unwindstack::ElfInterface64",
   "record_kind" : "class",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 208,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/ElfInterface.h",
   "unique_id" : "_ZTSN11unwindstack14ElfInterface64E",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack14ElfInterface64E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface64D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface64D0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface644InitEPy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface6411InitHeadersEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface649GetSonameEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface6415GetFunctionNameEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEPy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface6417GetGlobalVariableERKNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEPy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack14ElfInterface6410GetBuildIDEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface4StepEyPNS_4RegsEPNS_6MemoryEPb"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface9IsValidPcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12ElfInterface17HandleUnknownTypeEjyy"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "code",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::ErrorData",
   "name" : "unwindstack::ErrorData",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Error.h",
   "unique_id" : "_ZTSN11unwindstack9ErrorDataE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-167"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "file_",
     "field_offset" : 128,
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "unwindstack::FileMaps",
   "name" : "unwindstack::FileMaps",
   "record_kind" : "class",
   "referenced_type" : "type-185",
   "self_type" : "type-185",
   "size" : 28,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h",
   "unique_id" : "_ZTSN11unwindstack8FileMapsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8FileMapsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8FileMapsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8FileMapsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Maps5ParseEv"
    },
    {
     "mangled_component_name" : "_ZNK11unwindstack8FileMaps11GetMapsFileEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "rel_pc",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pc",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sp",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "function_name",
     "field_offset" : 256,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "function_offset",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "map_name",
     "field_offset" : 448,
     "referenced_type" : "type-758"
    },
    {
     "field_name" : "map_elf_start_offset",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "map_exact_offset",
     "field_offset" : 640,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "map_start",
     "field_offset" : 704,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "map_end",
     "field_offset" : 768,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "map_load_bias",
     "field_offset" : 832,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "map_flags",
     "field_offset" : 896,
     "referenced_type" : "type-153"
    }
   ],
   "linker_set_key" : "unwindstack::FrameData",
   "name" : "unwindstack::FrameData",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 120,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Unwinder.h",
   "unique_id" : "_ZTSN11unwindstack9FrameDataE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "arch_",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "access" : "protected",
     "field_name" : "memory_",
     "field_offset" : 64,
     "referenced_type" : "type-160"
    },
    {
     "access" : "protected",
     "field_name" : "search_libs_",
     "field_offset" : 128,
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "unwindstack::Global",
   "name" : "unwindstack::Global",
   "record_kind" : "class",
   "referenced_type" : "type-159",
   "self_type" : "type-159",
   "size" : 28,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Global.h",
   "unique_id" : "_ZTSN11unwindstack6GlobalE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack6GlobalE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6GlobalD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6GlobalD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack6Global16ReadVariableDataEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack6Global11ProcessArchEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-159"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "read_descriptor_func_",
     "field_offset" : 224,
     "referenced_type" : "type-214"
    },
    {
     "access" : "private",
     "field_name" : "read_entry_func_",
     "field_offset" : 288,
     "referenced_type" : "type-215"
    },
    {
     "access" : "private",
     "field_name" : "entry_addr_",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "initialized_",
     "field_offset" : 448,
     "referenced_type" : "type-72"
    },
    {
     "access" : "private",
     "field_name" : "elf_list_",
     "field_offset" : 480,
     "referenced_type" : "type-216"
    },
    {
     "access" : "private",
     "field_name" : "lock_",
     "field_offset" : 576,
     "referenced_type" : "type-217"
    }
   ],
   "linker_set_key" : "unwindstack::JitDebug",
   "name" : "unwindstack::JitDebug",
   "record_kind" : "class",
   "referenced_type" : "type-213",
   "self_type" : "type-213",
   "size" : 80,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/JitDebug.h",
   "unique_id" : "_ZTSN11unwindstack8JitDebugE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8JitDebugE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8JitDebugD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8JitDebugD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8JitDebug16ReadVariableDataEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8JitDebug11ProcessArchEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "table_offset",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "table_size",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "unwindstack::LoadInfo",
   "name" : "unwindstack::LoadInfo",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 24,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/ElfInterface.h",
   "unique_id" : "_ZTSN11unwindstack8LoadInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "map_info",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "pc",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rel_pc",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "function_name",
     "field_offset" : 192,
     "referenced_type" : "type-569"
    },
    {
     "field_name" : "function_offset",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::LocalFrameData",
   "name" : "unwindstack::LocalFrameData",
   "referenced_type" : "type-568",
   "self_type" : "type-568",
   "size" : 48,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/LocalUnwinder.h",
   "unique_id" : "_ZTSN11unwindstack14LocalFrameDataE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-175"
    }
   ],
   "linker_set_key" : "unwindstack::LocalMaps",
   "name" : "unwindstack::LocalMaps",
   "record_kind" : "class",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 20,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h",
   "unique_id" : "_ZTSN11unwindstack9LocalMapsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack9LocalMapsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack9LocalMapsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack9LocalMapsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Maps5ParseEv"
    },
    {
     "mangled_component_name" : "_ZNK11unwindstack10RemoteMaps11GetMapsFileEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "maps_rwlock_",
     "referenced_type" : "type-572"
    },
    {
     "access" : "private",
     "field_name" : "maps_",
     "field_offset" : 320,
     "referenced_type" : "type-573"
    },
    {
     "access" : "private",
     "field_name" : "process_memory_",
     "field_offset" : 352,
     "referenced_type" : "type-574"
    },
    {
     "access" : "private",
     "field_name" : "skip_libraries_",
     "field_offset" : 416,
     "referenced_type" : "type-575"
    },
    {
     "access" : "private",
     "field_name" : "last_error_",
     "field_offset" : 512,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "unwindstack::LocalUnwinder",
   "name" : "unwindstack::LocalUnwinder",
   "record_kind" : "class",
   "referenced_type" : "type-571",
   "self_type" : "type-571",
   "size" : 80,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/LocalUnwinder.h",
   "unique_id" : "_ZTSN11unwindstack13LocalUnwinderE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-167"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_maps_",
     "field_offset" : 128,
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "unwindstack::LocalUpdatableMaps",
   "name" : "unwindstack::LocalUpdatableMaps",
   "record_kind" : "class",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 28,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h",
   "unique_id" : "_ZTSN11unwindstack18LocalUpdatableMapsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack18LocalUpdatableMapsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack18LocalUpdatableMapsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack18LocalUpdatableMapsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Maps5ParseEv"
    },
    {
     "mangled_component_name" : "_ZNK11unwindstack18LocalUpdatableMaps11GetMapsFileEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "end",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "name",
     "field_offset" : 224,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "elf",
     "field_offset" : 320,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "elf_offset",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "elf_start_offset",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "prev_map",
     "field_offset" : 512,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "load_bias",
     "field_offset" : 576,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "build_id",
     "field_offset" : 640,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "memory_backed_elf",
     "field_offset" : 672,
     "referenced_type" : "type-72"
    },
    {
     "access" : "private",
     "field_name" : "mutex_",
     "field_offset" : 704,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "unwindstack::MapInfo",
   "name" : "unwindstack::MapInfo",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 96,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/MapInfo.h",
   "unique_id" : "_ZTSN11unwindstack7MapInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "maps_",
     "field_offset" : 32,
     "referenced_type" : "type-168"
    }
   ],
   "linker_set_key" : "unwindstack::Maps",
   "name" : "unwindstack::Maps",
   "record_kind" : "class",
   "referenced_type" : "type-167",
   "self_type" : "type-167",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h",
   "unique_id" : "_ZTSN11unwindstack4MapsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack4MapsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4MapsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4MapsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Maps5ParseEv"
    },
    {
     "mangled_component_name" : "_ZNK11unwindstack4Maps11GetMapsFileEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unwindstack::Memory",
   "name" : "unwindstack::Memory",
   "record_kind" : "class",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 4,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack6MemoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack6MemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6MemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack6MemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack6Memory4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "raw_",
     "field_offset" : 32,
     "referenced_type" : "type-135"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryBuffer",
   "name" : "unwindstack::MemoryBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-134",
   "self_type" : "type-134",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack12MemoryBufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack12MemoryBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12MemoryBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12MemoryBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12MemoryBuffer4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "cache_",
     "field_offset" : 32,
     "referenced_type" : "type-75"
    },
    {
     "access" : "private",
     "field_name" : "impl_",
     "field_offset" : 192,
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryCache",
   "name" : "unwindstack::MemoryCache",
   "record_kind" : "class",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 28,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack11MemoryCacheE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack11MemoryCacheE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11MemoryCacheD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11MemoryCacheD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack11MemoryCache5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack11MemoryCache4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "access" : "protected",
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "access" : "protected",
     "field_name" : "data_",
     "field_offset" : 96,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryFileAtOffset",
   "name" : "unwindstack::MemoryFileAtOffset",
   "record_kind" : "class",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack18MemoryFileAtOffsetE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack18MemoryFileAtOffsetE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack18MemoryFileAtOffsetD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack18MemoryFileAtOffsetD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack18MemoryFileAtOffset5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack18MemoryFileAtOffset4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryLocal",
   "name" : "unwindstack::MemoryLocal",
   "record_kind" : "class",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 4,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack11MemoryLocalE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack11MemoryLocalE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11MemoryLocalD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11MemoryLocalD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack11MemoryLocal4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "memory_",
     "field_offset" : 32,
     "referenced_type" : "type-227"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryOffline",
   "name" : "unwindstack::MemoryOffline",
   "record_kind" : "class",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 8,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack13MemoryOfflineE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack13MemoryOfflineE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack13MemoryOfflineD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack13MemoryOfflineD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack13MemoryOffline4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 32,
     "referenced_type" : "type-238"
    },
    {
     "access" : "private",
     "field_name" : "start_",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "end_",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryOfflineBuffer",
   "name" : "unwindstack::MemoryOfflineBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-237",
   "self_type" : "type-237",
   "size" : 24,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack19MemoryOfflineBufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack19MemoryOfflineBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack19MemoryOfflineBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack19MemoryOfflineBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack19MemoryOfflineBuffer4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "memories_",
     "field_offset" : 32,
     "referenced_type" : "type-257"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryOfflineParts",
   "name" : "unwindstack::MemoryOfflineParts",
   "record_kind" : "class",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack18MemoryOfflinePartsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack18MemoryOfflinePartsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack18MemoryOfflinePartsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack18MemoryOfflinePartsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack18MemoryOfflineParts4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "memory_",
     "field_offset" : 32,
     "referenced_type" : "type-207"
    },
    {
     "access" : "private",
     "field_name" : "begin_",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "length_",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryRange",
   "name" : "unwindstack::MemoryRange",
   "record_kind" : "class",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack11MemoryRangeE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack11MemoryRangeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11MemoryRangeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack11MemoryRangeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack11MemoryRange4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "maps_",
     "field_offset" : 32,
     "referenced_type" : "type-219"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryRanges",
   "name" : "unwindstack::MemoryRanges",
   "record_kind" : "class",
   "referenced_type" : "type-218",
   "self_type" : "type-218",
   "size" : 16,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack12MemoryRangesE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack12MemoryRangesE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12MemoryRangesD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12MemoryRangesD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12MemoryRanges4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pid_",
     "field_offset" : 32,
     "referenced_type" : "type-153"
    },
    {
     "access" : "private",
     "field_name" : "read_redirect_func_",
     "field_offset" : 64,
     "referenced_type" : "type-154"
    }
   ],
   "linker_set_key" : "unwindstack::MemoryRemote",
   "name" : "unwindstack::MemoryRemote",
   "record_kind" : "class",
   "referenced_type" : "type-152",
   "self_type" : "type-152",
   "size" : 12,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Memory.h",
   "unique_id" : "_ZTSN11unwindstack12MemoryRemoteE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack12MemoryRemoteE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12MemoryRemoteD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack12MemoryRemoteD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory10ReadStringEyPNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack6Memory5ClearEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack12MemoryRemote4ReadEyPvj"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "total_regs_",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "return_loc_",
     "field_offset" : 48,
     "referenced_type" : "type-64"
    },
    {
     "access" : "protected",
     "field_name" : "dex_pc_",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::Regs",
   "name" : "unwindstack::Regs",
   "record_kind" : "class",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 24,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Regs.h",
   "unique_id" : "_ZTSN11unwindstack4RegsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack4RegsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4RegsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack4RegsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs7Is32BitEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs15GetPcAdjustmentEyPNS_3ElfE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "value",
     "field_offset" : 16,
     "referenced_type" : "type-66"
    }
   ],
   "linker_set_key" : "unwindstack::Regs::Location",
   "name" : "unwindstack::Regs::Location",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 4,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Regs.h",
   "unique_id" : "_ZTSN11unwindstack4Regs8LocationE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "unwindstack::RegsArm",
   "name" : "unwindstack::RegsArm",
   "record_kind" : "class",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/RegsArm.h",
   "unique_id" : "_ZTSN11unwindstack7RegsArmE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack7RegsArmE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack7RegsArmD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack7RegsArmD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm4ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE7Is32BitEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE7RawDataEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm2pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm2spEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm6set_pcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm6set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm15GetPcAdjustmentEyPNS_3ElfE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsArm5CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-67"
    }
   ],
   "linker_set_key" : "unwindstack::RegsArm64",
   "name" : "unwindstack::RegsArm64",
   "record_kind" : "class",
   "referenced_type" : "type-596",
   "self_type" : "type-596",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/RegsArm64.h",
   "unique_id" : "_ZTSN11unwindstack9RegsArm64E",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack9RegsArm64E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack9RegsArm64D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack9RegsArm64D0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm644ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7Is32BitEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7RawDataEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm642pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm642spEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm646set_pcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm646set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6415GetPcAdjustmentEyPNS_3ElfE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6419StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6422SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm6416IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack9RegsArm645CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-63"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "regs_",
     "field_offset" : 192,
     "referenced_type" : "type-107"
    }
   ],
   "linker_set_key" : "unwindstack::RegsImpl<unsigned int>",
   "name" : "unwindstack::RegsImpl<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-106",
   "self_type" : "type-106",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Regs.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN11unwindstack8RegsImplIjEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8RegsImplIjEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE7Is32BitEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs15GetPcAdjustmentEyPNS_3ElfE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-63"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "regs_",
     "field_offset" : 192,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "unwindstack::RegsImpl<unsigned long long>",
   "name" : "unwindstack::RegsImpl<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Regs.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN11unwindstack8RegsImplIyEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8RegsImplIyEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs4ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7Is32BitEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7RawDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2pcEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs2spEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_pcEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs6set_spEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs15GetPcAdjustmentEyPNS_3ElfE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11unwindstack4Regs5CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "unwindstack::RegsMips",
   "name" : "unwindstack::RegsMips",
   "record_kind" : "class",
   "referenced_type" : "type-598",
   "self_type" : "type-598",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/RegsMips.h",
   "unique_id" : "_ZTSN11unwindstack8RegsMipsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8RegsMipsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsMipsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8RegsMipsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips4ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE7Is32BitEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE7RawDataEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips2pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips2spEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips6set_pcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips6set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips15GetPcAdjustmentEyPNS_3ElfE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips19StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips22SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips16IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsMips5CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-67"
    }
   ],
   "linker_set_key" : "unwindstack::RegsMips64",
   "name" : "unwindstack::RegsMips64",
   "record_kind" : "class",
   "referenced_type" : "type-600",
   "self_type" : "type-600",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/RegsMips64.h",
   "unique_id" : "_ZTSN11unwindstack10RegsMips64E",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack10RegsMips64E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10RegsMips64D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10RegsMips64D0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips644ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7Is32BitEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7RawDataEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips642pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips642spEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips646set_pcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips646set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips6415GetPcAdjustmentEyPNS_3ElfE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips6419StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips6422SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips6416IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsMips645CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "unwindstack::RegsX86",
   "name" : "unwindstack::RegsX86",
   "record_kind" : "class",
   "referenced_type" : "type-602",
   "self_type" : "type-602",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/RegsX86.h",
   "unique_id" : "_ZTSN11unwindstack7RegsX86E",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack7RegsX86E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack7RegsX86D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack7RegsX86D0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX864ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE7Is32BitEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIjE7RawDataEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX862pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX862spEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX866set_pcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX866set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX8615GetPcAdjustmentEyPNS_3ElfE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX8619StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX8622SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX8616IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack7RegsX865CloneEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-67"
    }
   ],
   "linker_set_key" : "unwindstack::RegsX86_64",
   "name" : "unwindstack::RegsX86_64",
   "record_kind" : "class",
   "referenced_type" : "type-604",
   "self_type" : "type-604",
   "size" : 40,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/RegsX86_64.h",
   "unique_id" : "_ZTSN11unwindstack10RegsX86_64E",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack10RegsX86_64E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_64D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_64D0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_644ArchEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7Is32BitEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack8RegsImplIyE7RawDataEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_642pcEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_642spEv"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_646set_pcEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_646set_spEy"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_6415GetPcAdjustmentEyPNS_3ElfE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_6419StepIfSignalHandlerEyPNS_3ElfEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_6422SetPcFromReturnAddressEPNS_6MemoryE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_6416IterateRegistersENSt3__18functionIFvPKcyEEE"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack10RegsX86_645CloneEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-167"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pid_",
     "field_offset" : 128,
     "referenced_type" : "type-153"
    }
   ],
   "linker_set_key" : "unwindstack::RemoteMaps",
   "name" : "unwindstack::RemoteMaps",
   "record_kind" : "class",
   "referenced_type" : "type-175",
   "self_type" : "type-175",
   "size" : 20,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h",
   "unique_id" : "_ZTSN11unwindstack10RemoteMapsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack10RemoteMapsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10RemoteMapsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack10RemoteMapsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN11unwindstack4Maps5ParseEv"
    },
    {
     "mangled_component_name" : "_ZNK11unwindstack10RemoteMaps11GetMapsFileEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "max_frames_",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "access" : "protected",
     "field_name" : "maps_",
     "field_offset" : 64,
     "referenced_type" : "type-169"
    },
    {
     "access" : "protected",
     "field_name" : "regs_",
     "field_offset" : 96,
     "referenced_type" : "type-94"
    },
    {
     "access" : "protected",
     "field_name" : "frames_",
     "field_offset" : 128,
     "referenced_type" : "type-762"
    },
    {
     "access" : "protected",
     "field_name" : "process_memory_",
     "field_offset" : 224,
     "referenced_type" : "type-763"
    },
    {
     "access" : "protected",
     "field_name" : "jit_debug_",
     "field_offset" : 288,
     "referenced_type" : "type-220"
    },
    {
     "access" : "protected",
     "field_name" : "resolve_names_",
     "field_offset" : 320,
     "referenced_type" : "type-72"
    },
    {
     "access" : "protected",
     "field_name" : "embedded_soname_",
     "field_offset" : 328,
     "referenced_type" : "type-72"
    },
    {
     "access" : "protected",
     "field_name" : "display_build_id_",
     "field_offset" : 336,
     "referenced_type" : "type-72"
    },
    {
     "access" : "protected",
     "field_name" : "elf_from_memory_not_file_",
     "field_offset" : 344,
     "referenced_type" : "type-72"
    },
    {
     "access" : "protected",
     "field_name" : "last_error_",
     "field_offset" : 384,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "unwindstack::Unwinder",
   "name" : "unwindstack::Unwinder",
   "record_kind" : "class",
   "referenced_type" : "type-759",
   "self_type" : "type-759",
   "size" : 64,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Unwinder.h",
   "unique_id" : "_ZTSN11unwindstack8UnwinderE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack8UnwinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8UnwinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack8UnwinderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-759"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pid_",
     "field_offset" : 512,
     "referenced_type" : "type-153"
    },
    {
     "access" : "private",
     "field_name" : "maps_ptr_",
     "field_offset" : 544,
     "referenced_type" : "type-778"
    },
    {
     "access" : "private",
     "field_name" : "jit_debug_ptr_",
     "field_offset" : 576,
     "referenced_type" : "type-779"
    }
   ],
   "linker_set_key" : "unwindstack::UnwinderFromPid",
   "name" : "unwindstack::UnwinderFromPid",
   "record_kind" : "class",
   "referenced_type" : "type-777",
   "self_type" : "type-777",
   "size" : 80,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Unwinder.h",
   "unique_id" : "_ZTSN11unwindstack15UnwinderFromPidE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11unwindstack15UnwinderFromPidE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack15UnwinderFromPidD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11unwindstack15UnwinderFromPidD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::arm64_mcontext_t",
   "name" : "unwindstack::arm64_mcontext_t",
   "referenced_type" : "type-335",
   "self_type" : "type-335",
   "size" : 280,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextArm64.h",
   "unique_id" : "_ZTSN11unwindstack16arm64_mcontext_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::arm64_sigset_t",
   "name" : "unwindstack::arm64_sigset_t",
   "referenced_type" : "type-334",
   "self_type" : "type-334",
   "size" : 8,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextArm64.h",
   "unique_id" : "_ZTSN11unwindstack14arm64_sigset_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::arm64_stack_t",
   "name" : "unwindstack::arm64_stack_t",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 24,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextArm64.h",
   "unique_id" : "_ZTSN11unwindstack13arm64_stack_tE"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "type-333"
    },
    {
     "field_name" : "uc_sigmask",
     "field_offset" : 320,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "type-338"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "type-335"
    }
   ],
   "linker_set_key" : "unwindstack::arm64_ucontext_t",
   "name" : "unwindstack::arm64_ucontext_t",
   "referenced_type" : "type-337",
   "self_type" : "type-337",
   "size" : 464,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextArm64.h",
   "unique_id" : "_ZTSN11unwindstack16arm64_ucontext_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-609"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::arm64_user_regs",
   "name" : "unwindstack::arm64_user_regs",
   "referenced_type" : "type-608",
   "self_type" : "type-608",
   "size" : 272,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UserArm64.h",
   "unique_id" : "_ZTSN11unwindstack15arm64_user_regsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "regs",
     "field_offset" : 96,
     "referenced_type" : "type-633"
    },
    {
     "field_name" : "cpsr",
     "field_offset" : 608,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "unwindstack::arm_mcontext_t",
   "name" : "unwindstack::arm_mcontext_t",
   "referenced_type" : "type-632",
   "self_type" : "type-632",
   "size" : 84,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextArm.h",
   "unique_id" : "_ZTSN11unwindstack14arm_mcontext_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "unwindstack::arm_stack_t",
   "name" : "unwindstack::arm_stack_t",
   "referenced_type" : "type-631",
   "self_type" : "type-631",
   "size" : 12,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextArm.h",
   "unique_id" : "_ZTSN11unwindstack11arm_stack_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "type-632"
    }
   ],
   "linker_set_key" : "unwindstack::arm_ucontext_t",
   "name" : "unwindstack::arm_ucontext_t",
   "referenced_type" : "type-634",
   "self_type" : "type-634",
   "size" : 104,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextArm.h",
   "unique_id" : "_ZTSN11unwindstack14arm_ucontext_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-607"
    }
   ],
   "linker_set_key" : "unwindstack::arm_user_regs",
   "name" : "unwindstack::arm_user_regs",
   "referenced_type" : "type-606",
   "self_type" : "type-606",
   "size" : 72,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UserArm.h",
   "unique_id" : "_ZTSN11unwindstack13arm_user_regsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sc_regs",
     "referenced_type" : "type-712"
    },
    {
     "field_name" : "sc_fpregs",
     "field_offset" : 2048,
     "referenced_type" : "type-712"
    },
    {
     "field_name" : "sc_mdhi",
     "field_offset" : 4096,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sc_hi1",
     "field_offset" : 4160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sc_hi2",
     "field_offset" : 4224,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sc_hi3",
     "field_offset" : 4288,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sc_mdlo",
     "field_offset" : 4352,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sc_lo1",
     "field_offset" : 4416,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sc_lo2",
     "field_offset" : 4480,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sc_lo3",
     "field_offset" : 4544,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sc_pc",
     "field_offset" : 4608,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::mips64_mcontext_t",
   "name" : "unwindstack::mips64_mcontext_t",
   "referenced_type" : "type-733",
   "self_type" : "type-733",
   "size" : 584,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextMips64.h",
   "unique_id" : "_ZTSN11unwindstack17mips64_mcontext_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 128,
     "referenced_type" : "type-153"
    }
   ],
   "linker_set_key" : "unwindstack::mips64_stack_t",
   "name" : "unwindstack::mips64_stack_t",
   "referenced_type" : "type-732",
   "self_type" : "type-732",
   "size" : 24,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextMips64.h",
   "unique_id" : "_ZTSN11unwindstack14mips64_stack_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "type-732"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 320,
     "referenced_type" : "type-733"
    }
   ],
   "linker_set_key" : "unwindstack::mips64_ucontext_t",
   "name" : "unwindstack::mips64_ucontext_t",
   "referenced_type" : "type-734",
   "self_type" : "type-734",
   "size" : 624,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextMips64.h",
   "unique_id" : "_ZTSN11unwindstack17mips64_ucontext_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-615"
    }
   ],
   "linker_set_key" : "unwindstack::mips64_user_regs",
   "name" : "unwindstack::mips64_user_regs",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 360,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UserMips64.h",
   "unique_id" : "_ZTSN11unwindstack16mips64_user_regsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sc_regmask",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sc_status",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sc_pc",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sc_regs",
     "field_offset" : 128,
     "referenced_type" : "type-712"
    }
   ],
   "linker_set_key" : "unwindstack::mips_mcontext_t",
   "name" : "unwindstack::mips_mcontext_t",
   "referenced_type" : "type-711",
   "self_type" : "type-711",
   "size" : 272,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextMips.h",
   "unique_id" : "_ZTSN11unwindstack15mips_mcontext_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "type-153"
    }
   ],
   "linker_set_key" : "unwindstack::mips_stack_t",
   "name" : "unwindstack::mips_stack_t",
   "referenced_type" : "type-710",
   "self_type" : "type-710",
   "size" : 12,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextMips.h",
   "unique_id" : "_ZTSN11unwindstack12mips_stack_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-710"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 192,
     "referenced_type" : "type-711"
    }
   ],
   "linker_set_key" : "unwindstack::mips_ucontext_t",
   "name" : "unwindstack::mips_ucontext_t",
   "referenced_type" : "type-713",
   "self_type" : "type-713",
   "size" : 296,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextMips.h",
   "unique_id" : "_ZTSN11unwindstack15mips_ucontext_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-612"
    }
   ],
   "linker_set_key" : "unwindstack::mips_user_regs",
   "name" : "unwindstack::mips_user_regs",
   "referenced_type" : "type-611",
   "self_type" : "type-611",
   "size" : 180,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UserMips.h",
   "unique_id" : "_ZTSN11unwindstack14mips_user_regsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r8",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r9",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r10",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r11",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r12",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r13",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r14",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r15",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rdi",
     "field_offset" : 512,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rsi",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rbp",
     "field_offset" : 640,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rbx",
     "field_offset" : 704,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rdx",
     "field_offset" : 768,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rax",
     "field_offset" : 832,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rcx",
     "field_offset" : 896,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rsp",
     "field_offset" : 960,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rip",
     "field_offset" : 1024,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "efl",
     "field_offset" : 1088,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "csgsfs",
     "field_offset" : 1152,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "err",
     "field_offset" : 1216,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 1280,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 1344,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 1408,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::x86_64_mcontext_t",
   "name" : "unwindstack::x86_64_mcontext_t",
   "referenced_type" : "type-375",
   "self_type" : "type-375",
   "size" : 184,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextX86_64.h",
   "unique_id" : "_ZTSN11unwindstack17x86_64_mcontext_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "pad",
     "field_offset" : 96,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::x86_64_stack_t",
   "name" : "unwindstack::x86_64_stack_t",
   "referenced_type" : "type-374",
   "self_type" : "type-374",
   "size" : 24,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextX86_64.h",
   "unique_id" : "_ZTSN11unwindstack14x86_64_stack_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "type-374"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 320,
     "referenced_type" : "type-375"
    }
   ],
   "linker_set_key" : "unwindstack::x86_64_ucontext_t",
   "name" : "unwindstack::x86_64_ucontext_t",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 224,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextX86_64.h",
   "unique_id" : "_ZTSN11unwindstack17x86_64_ucontext_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r15",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r14",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r13",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r12",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rbp",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rbx",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r11",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r10",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r9",
     "field_offset" : 512,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "r8",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rax",
     "field_offset" : 640,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rcx",
     "field_offset" : 704,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rdx",
     "field_offset" : 768,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rsi",
     "field_offset" : 832,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rdi",
     "field_offset" : 896,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "orig_rax",
     "field_offset" : 960,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rip",
     "field_offset" : 1024,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "cs",
     "field_offset" : 1088,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 1152,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rsp",
     "field_offset" : 1216,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ss",
     "field_offset" : 1280,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "fs_base",
     "field_offset" : 1344,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "gs_base",
     "field_offset" : 1408,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ds",
     "field_offset" : 1472,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "es",
     "field_offset" : 1536,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "fs",
     "field_offset" : 1600,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "gs",
     "field_offset" : 1664,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "unwindstack::x86_64_user_regs",
   "name" : "unwindstack::x86_64_user_regs",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 216,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UserX86_64.h",
   "unique_id" : "_ZTSN11unwindstack16x86_64_user_regsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gs",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "fs",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "es",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ds",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "edi",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "esi",
     "field_offset" : 160,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ebp",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "esp",
     "field_offset" : 224,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ebx",
     "field_offset" : 256,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "edx",
     "field_offset" : 288,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ecx",
     "field_offset" : 320,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eax",
     "field_offset" : 352,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 384,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "err",
     "field_offset" : 416,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eip",
     "field_offset" : 448,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "cs",
     "field_offset" : 480,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "efl",
     "field_offset" : 512,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uesp",
     "field_offset" : 544,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ss",
     "field_offset" : 576,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "unwindstack::x86_mcontext_t",
   "name" : "unwindstack::x86_mcontext_t",
   "referenced_type" : "type-354",
   "self_type" : "type-354",
   "size" : 76,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextX86.h",
   "unique_id" : "_ZTSN11unwindstack14x86_mcontext_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "unwindstack::x86_stack_t",
   "name" : "unwindstack::x86_stack_t",
   "referenced_type" : "type-353",
   "self_type" : "type-353",
   "size" : 12,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextX86.h",
   "unique_id" : "_ZTSN11unwindstack11x86_stack_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-353"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "type-354"
    }
   ],
   "linker_set_key" : "unwindstack::x86_ucontext_t",
   "name" : "unwindstack::x86_ucontext_t",
   "referenced_type" : "type-352",
   "self_type" : "type-352",
   "size" : 96,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UcontextX86.h",
   "unique_id" : "_ZTSN11unwindstack14x86_ucontext_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ebx",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ecx",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "edx",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "esi",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "edi",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ebp",
     "field_offset" : 160,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eax",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "xds",
     "field_offset" : 224,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "xes",
     "field_offset" : 256,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "xfs",
     "field_offset" : 288,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "xgs",
     "field_offset" : 320,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "orig_eax",
     "field_offset" : 352,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eip",
     "field_offset" : 384,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "xcs",
     "field_offset" : 416,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 448,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "esp",
     "field_offset" : 480,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "xss",
     "field_offset" : 512,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "unwindstack::x86_user_regs",
   "name" : "unwindstack::x86_user_regs",
   "referenced_type" : "type-616",
   "self_type" : "type-616",
   "size" : 68,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/UserX86.h",
   "unique_id" : "_ZTSN11unwindstack13x86_user_regsE"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "unwindstack::Maps &&",
   "name" : "unwindstack::Maps &&",
   "referenced_type" : "type-167",
   "self_type" : "type-171",
   "size" : 4,
   "source_file" : "/system/core/libunwindstack/include/unwindstack/Maps.h"
  }
 ]
}
