{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA32_h",
   "name" : "unsigned char [32]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA32_h",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA3_h",
   "name" : "unsigned char [3]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA3_h",
   "size" : 3,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA5121_h",
   "name" : "unsigned char [5121]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA5121_h",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA7_h",
   "name" : "unsigned char [7]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA7_h",
   "size" : 7,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,

   "linker_set_key" : "_ZTIKPKN7android4hidl4base4V1_05IBaseE",
   "name" : "const android::hidl::base::V1_0::IBase *const",
   "referenced_type" : "_ZTIPKN7android4hidl4base4V1_05IBaseE",
   "self_type" : "_ZTIKPKN7android4hidl4base4V1_05IBaseE",
   "size" : 4,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android8hardware7IBinderE",
   "name" : "android::hardware::IBinder *const",
   "referenced_type" : "_ZTIPN7android8hardware7IBinderE",
   "self_type" : "_ZTIKPN7android8hardware7IBinderE",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt16initializer_listIN7android8hardware10hidl_arrayIhLj32EJEEEE",
   "name" : "const std::initializer_list<android::hardware::hidl_array<unsigned char, 32> >",
   "referenced_type" : "_ZTISt16initializer_listIN7android8hardware10hidl_arrayIhLj32EJEEEE",
   "self_type" : "_ZTIKSt16initializer_listIN7android8hardware10hidl_arrayIhLj32EJEEEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt16initializer_listIN7android8hardware11hidl_stringEE",
   "name" : "const std::initializer_list<android::hardware::hidl_string>",
   "referenced_type" : "_ZTISt16initializer_listIN7android8hardware11hidl_stringEE",
   "self_type" : "_ZTIKSt16initializer_listIN7android8hardware11hidl_stringEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVb",
   "name" : "volatile bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIVb",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVi",
   "name" : "volatile int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIVi",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 56,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 12,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10VectorImplE",
   "self_type" : "_ZTIN7android10VectorImplE",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE",
   "self_type" : "_ZTIN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIN7android8String16E", "_ZTIN7android2spINS_8hardware7IBinderEEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTag",
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN7android11ScopedTraceE",
   "name" : "android::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11ScopedTraceE",
   "self_type" : "_ZTIN7android11ScopedTraceE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Trace.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android12NativeHandleE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12NativeHandleE",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12NativeHandleE",
   "self_type" : "_ZTIN7android12NativeHandleE",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16SortedVectorImplE",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16SortedVectorImplE",
   "self_type" : "_ZTIN7android16SortedVectorImplE",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "template_args" : [ "_ZTIN7android8String16E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl4base4V1_05IBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl7manager4V1_015IServiceManagerE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl7manager4V1_015IServiceManagerEEE",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceManager>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl7manager4V1_015IServiceManagerEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl7manager4V1_015IServiceManagerEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl7manager4V1_015IServiceManagerE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl7manager4V1_020IServiceNotificationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android6ThreadE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_6ThreadEEE",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "self_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android6ThreadE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware10IInterfaceEEE",
   "name" : "android::sp<android::hardware::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware10IInterfaceEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware10IInterfaceEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware10IInterfaceE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware12ProcessStateE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware12ProcessStateEEE",
   "name" : "android::sp<android::hardware::ProcessState>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware12ProcessStateEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware12ProcessStateEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessStateE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware20hidl_death_recipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware20hidl_death_recipientE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware27hidl_binder_death_recipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware27hidl_binder_death_recipientEEE",
   "name" : "android::sp<android::hardware::hidl_binder_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware27hidl_binder_death_recipientEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware27hidl_binder_death_recipientEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware27hidl_binder_death_recipientE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware6health4V2_019IHealthInfoCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware6health4V2_019IHealthInfoCallbackEEE",
   "name" : "android::sp<android::hardware::health::V2_0::IHealthInfoCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_019IHealthInfoCallbackEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware6health4V2_019IHealthInfoCallbackEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_019IHealthInfoCallbackE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware6health4V2_07IHealthE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware6health4V2_07IHealthEEE",
   "name" : "android::sp<android::hardware::health::V2_0::IHealth>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_07IHealthEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware6health4V2_07IHealthEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_07IHealthE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware6health4V2_119IHealthInfoCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware6health4V2_119IHealthInfoCallbackEEE",
   "name" : "android::sp<android::hardware::health::V2_1::IHealthInfoCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_119IHealthInfoCallbackEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware6health4V2_119IHealthInfoCallbackEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_119IHealthInfoCallbackE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware6health4V2_17IHealthE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware6health4V2_17IHealthEEE",
   "name" : "android::sp<android::hardware::health::V2_1::IHealth>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_17IHealthEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware6health4V2_17IHealthEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_17IHealthE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware7IBinder14DeathRecipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware7IBinder14DeathRecipientEEE",
   "name" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware7IBinder14DeathRecipientEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware7IBinder14DeathRecipientEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware7IBinder14DeathRecipientE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware7IBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware7IBinderEEE",
   "name" : "android::sp<android::hardware::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware7IBinderEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware7IBinderEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware7IBinderE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware9BHwBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware9BHwBinderEEE",
   "name" : "android::sp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware9BHwBinderEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl4base4V1_05IBaseE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_4hidl4base4V1_05IBaseEEE",
   "name" : "android::wp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_4hidl4base4V1_05IBaseEEE",
   "self_type" : "_ZTIN7android2wpINS_4hidl4base4V1_05IBaseEEE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android4hidl4base4V1_05IBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware20hidl_death_recipientE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_8hardware20hidl_death_recipientEEE",
   "name" : "android::wp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_8hardware20hidl_death_recipientEEE",
   "self_type" : "_ZTIN7android2wpINS_8hardware20hidl_death_recipientEEE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android8hardware20hidl_death_recipientE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_8hardware7IBinder14DeathRecipientEEE",
   "name" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_8hardware7IBinder14DeathRecipientEEE",
   "self_type" : "_ZTIN7android2wpINS_8hardware7IBinder14DeathRecipientEEE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android8hardware7IBinder14DeathRecipientE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware9BHwBinderE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_8hardware9BHwBinderEEE",
   "name" : "android::wp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android2wpINS_8hardware9BHwBinderEEE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "self_type" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE",
   "name" : "android::hidl::base::V1_0::BnHwBase",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE",
   "self_type" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE",
   "size" : 76,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/BnHwBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 68,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_08BnHwBase13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBase10onTransactEjRKNS_8hardware6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -68,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -68,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2spINS1_8hardware27hidl_binder_death_recipientEEENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE",
   "name" : "android::hidl::base::V1_0::BpHwBase",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE",
   "self_type" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/BpHwBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_08BpHwBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase15onLastStrongRefEPKv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android4hidl4base4V1_08BpHwBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android4hidl4base4V1_08BpHwBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfo12ArchitectureE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "self_type" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interfaceName",
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "instanceName",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "pid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "clientPids",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android8hardware8hidl_vecIiEE"
    },
    {
     "field_name" : "arch",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfo12ArchitectureE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl7manager4V1_015IServiceManager17InstanceDebugInfoE",
   "name" : "android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo",
   "referenced_type" : "_ZTIN7android4hidl7manager4V1_015IServiceManager17InstanceDebugInfoE",
   "self_type" : "_ZTIN7android4hidl7manager4V1_015IServiceManager17InstanceDebugInfoE",
   "size" : 64,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE",
   "name" : "android::hidl::manager::V1_0::IServiceManager",
   "referenced_type" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE",
   "self_type" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_015IServiceManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager3getERKNS_8hardware11hidl_stringES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager3addERKNS_8hardware11hidl_stringERKNS_2spINS0_4base4V1_05IBaseEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getTransportERKNS_8hardware11hidl_stringES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager4listENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager15listByInterfaceERKNS_8hardware11hidl_stringENSt3__18functionIFvRKNS4_8hidl_vecIS5_EEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager24registerForNotificationsERKNS_8hardware11hidl_stringES7_RKNS_2spINS2_20IServiceNotificationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager9debugDumpENSt3__18functionIFvRKNS_8hardware8hidl_vecINS3_17InstanceDebugInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager25registerPassthroughClientERKNS_8hardware11hidl_stringES7_"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_015IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_015IServiceManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "self_type" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android5MutexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android5Mutex8AutolockE",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5Mutex8AutolockE",
   "self_type" : "_ZTIN7android5Mutex8AutolockE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTI15pthread_mutex_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android5MutexE",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5MutexE",
   "self_type" : "_ZTIN7android5MutexE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoRLockE",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoWLockE",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "_ZTI16pthread_rwlock_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLockE",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLockE",
   "self_type" : "_ZTIN7android6RWLockE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android9ConditionE"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android6ThreadE",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6ThreadE",
   "self_type" : "_ZTIN7android6ThreadE",
   "size" : 44,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "self_type" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessState12handle_entryE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN7android7String8E",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7String8E",
   "self_type" : "_ZTIN7android7String8E",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKDs"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String16E",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8String16E",
   "self_type" : "_ZTIN7android8String16E",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String16.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10HidlMemoryE",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware10HidlMemoryE",
   "self_type" : "_ZTIN7android8hardware10HidlMemoryE",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10IInterfaceE",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware10IInterfaceE",
   "self_type" : "_ZTIN7android8hardware10IInterfaceE",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10hidl_arrayIhLj32EJEEE",
   "name" : "android::hardware::hidl_array<unsigned char, 32>",
   "referenced_type" : "_ZTIN7android8hardware10hidl_arrayIhLj32EJEEE",
   "self_type" : "_ZTIN7android8hardware10hidl_arrayIhLj32EJEEE",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPN7android8hardware7IBinderE"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11BpHwRefBaseE",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware11BpHwRefBaseE",
   "self_type" : "_ZTIN7android8hardware11BpHwRefBaseE",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware6health4V2_019IHealthInfoCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware11BpHwRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEEE",
   "name" : "android::hardware::BpInterface<android::hardware::health::V2_0::IHealthInfoCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEEE",
   "self_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEEE",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_019IHealthInfoCallbackE" ],
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_019IHealthInfoCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware6health4V2_07IHealthE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware11BpHwRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEEE",
   "name" : "android::hardware::BpInterface<android::hardware::health::V2_0::IHealth>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEEE",
   "self_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEEE",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_07IHealthE" ],
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_07IHealth8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth16registerCallbackERKNS_2spINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth18unregisterCallbackERKNS_2spINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth16getChargeCounterENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth13getCurrentNowENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth17getCurrentAverageENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth11getCapacityENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth16getEnergyCounterENSt3__18functionIFvNS2_6ResultExEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth15getChargeStatusENSt3__18functionIFvNS2_6ResultENS1_4V1_013BatteryStatusEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth14getStorageInfoENSt3__18functionIFvNS2_6ResultERKNS0_8hidl_vecINS2_11StorageInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth12getDiskStatsENSt3__18functionIFvNS2_6ResultERKNS0_8hidl_vecINS2_9DiskStatsEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth13getHealthInfoENSt3__18functionIFvNS2_6ResultERKNS2_10HealthInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware6health4V2_119IHealthInfoCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware11BpHwRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEEE",
   "name" : "android::hardware::BpInterface<android::hardware::health::V2_1::IHealthInfoCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEEE",
   "self_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEEE",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_119IHealthInfoCallbackE" ],
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_119IHealthInfoCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback17healthInfoChangedERKNS1_4V2_010HealthInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback21healthInfoChanged_2_1ERKNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware6health4V2_17IHealthE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware11BpHwRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEEE",
   "name" : "android::hardware::BpInterface<android::hardware::health::V2_1::IHealth>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEEE",
   "self_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEEE",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_17IHealthE" ],
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_17IHealth8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth16registerCallbackERKNS_2spINS1_4V2_019IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth18unregisterCallbackERKNS_2spINS1_4V2_019IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth16getChargeCounterENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth13getCurrentNowENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth17getCurrentAverageENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth11getCapacityENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth16getEnergyCounterENSt3__18functionIFvNS1_4V2_06ResultExEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth15getChargeStatusENSt3__18functionIFvNS1_4V2_06ResultENS1_4V1_013BatteryStatusEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth14getStorageInfoENSt3__18functionIFvNS1_4V2_06ResultERKNS0_8hidl_vecINS6_11StorageInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth12getDiskStatsENSt3__18functionIFvNS1_4V2_06ResultERKNS0_8hidl_vecINS6_9DiskStatsEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth13getHealthInfoENSt3__18functionIFvNS1_4V2_06ResultERKNS6_10HealthInfoEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth15getHealthConfigENSt3__18functionIFvNS1_4V2_06ResultERKNS2_12HealthConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth17getHealthInfo_2_1ENSt3__18functionIFvNS1_4V2_06ResultERKNS2_10HealthInfoEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth18shouldKeepScreenOnENSt3__18functionIFvNS1_4V2_06ResultEbEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware11BpHwRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE",
   "name" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE",
   "self_type" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "_ZTIN7android4hidl4base4V1_05IBaseE" ],
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 72,
     "referenced_type" : "_ZTIA7_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_handleE",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "_ZTIN7android8hardware11hidl_handleE",
   "self_type" : "_ZTIN7android8hardware11hidl_handleE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware11hidl_handleE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_memoryE",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "self_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_stringE",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "_ZTIN7android8hardware11hidl_stringE",
   "self_type" : "_ZTIN7android8hardware11hidl_stringE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12MQDescriptorIcLNS0_8MQFlavorE1EEE",
   "name" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "_ZTIN7android8hardware12MQDescriptorIcLNS0_8MQFlavorE1EEE",
   "self_type" : "_ZTIN7android8hardware12MQDescriptorIcLNS0_8MQFlavorE1EEE",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "_ZTIPN7android8hardware7IBinderE"
    },
    {
     "field_name" : "refs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12ProcessState12handle_entryE",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "_ZTIN7android8hardware12ProcessState12handle_entryE",
   "self_type" : "_ZTIN7android8hardware12ProcessState12handle_entryE",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 96,
     "referenced_type" : "_ZTI15pthread_mutex_t"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 128,
     "referenced_type" : "_ZTI14pthread_cond_t"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 352,
     "referenced_type" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 512,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFbRKN7android8String16ERKNS_2spINS_8hardware7IBinderEEEPvE"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 608,
     "referenced_type" : "_ZTIN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 768,
     "referenced_type" : "_ZTIN7android7String8E"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 800,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 808,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 832,
     "referenced_type" : "_ZTIVi"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 864,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 896,
     "referenced_type" : "_ZTIN7android8hardware12ProcessState15CallRestrictionE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12ProcessStateE",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware12ProcessStateE",
   "self_type" : "_ZTIN7android8hardware12ProcessStateE",
   "size" : 128,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "vtable_components" :
   [
    {
     "component_value" : 116,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -116,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -116,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12hidl_versionE",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "_ZTIN7android8hardware12hidl_versionE",
   "self_type" : "_ZTIN7android8hardware12hidl_versionE",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_8functionIFN7android2spINS8_8hardware7IBinderEEEPvEEENS_4lessIS6_EENS4_INS_4pairIKS6_SF_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS0_7IBinderEEEPvEEEEE",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS0_7IBinderEEEPvEEEEE",
   "self_type" : "_ZTIN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS0_7IBinderEEEPvEEEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTINSt3__18functionIFN7android2spINS1_8hardware7IBinderEEEPvEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_8functionIFN7android2spINS8_4hidl4base4V1_05IBaseEEEPvEEENS_4lessIS6_EENS4_INS_4pairIKS6_SH_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS_4hidl4base4V1_05IBaseEEEPvEEEEE",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS_4hidl4base4V1_05IBaseEEEPvEEEEE",
   "self_type" : "_ZTIN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS_4hidl4base4V1_05IBaseEEEPvEEEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTINSt3__18functionIFN7android2spINS1_4hidl4base4V1_05IBaseEEEPvEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__13mapIPKN7android4hidl4base4V1_05IBaseENS1_2wpINS1_8hardware9BHwBinderEEENS_4lessIS7_EENS_9allocatorINS_4pairIKS7_SB_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE",
   "name" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE",
   "self_type" : "_ZTIN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" :
   [
    "_ZTIPKN7android4hidl4base4V1_05IBaseE",
    "_ZTIN7android2wpINS_8hardware9BHwBinderEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "self_type" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "self_type" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRecipient",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android2wpINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "access" : "private",
     "field_name" : "mCookie",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "mBase",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2wpINS_4hidl4base4V1_05IBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware27hidl_binder_death_recipientE",
   "name" : "android::hardware::hidl_binder_death_recipient",
   "referenced_type" : "_ZTIN7android8hardware27hidl_binder_death_recipientE",
   "self_type" : "_ZTIN7android8hardware27hidl_binder_death_recipientE",
   "size" : 40,
   "source_file" : "/system/libhidl/transport/include/hidl/HidlBinderSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware27hidl_binder_death_recipientE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipient10binderDiedERKNS_2wpINS0_7IBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware27hidl_binder_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware27hidl_binder_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware27hidl_binder_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6Parcel10BufferInfoE",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "_ZTIN7android8hardware6Parcel10BufferInfoE",
   "self_type" : "_ZTIN7android8hardware6Parcel10BufferInfoE",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIN7android8hardware6Parcel10BufferInfoENS_9allocatorIS4_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPy"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 448,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 456,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 464,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFvPN7android8hardware6ParcelEPKhjPKyjPvE"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ParcelE",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ParcelE",
   "self_type" : "_ZTIN7android8hardware6ParcelE",
   "size" : 68,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android8hardware6health4V2_06ResultE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnINS0_6health4V2_06ResultEEE",
   "name" : "android::hardware::Return<android::hardware::health::V2_0::Result>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnINS0_6health4V2_06ResultEEE",
   "self_type" : "_ZTIN7android8hardware6ReturnINS0_6health4V2_06ResultEEE",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_06ResultE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_119IHealthInfoCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnINS_2spINS0_6health4V2_119IHealthInfoCallbackEEEEE",
   "name" : "android::hardware::Return<android::sp<android::hardware::health::V2_1::IHealthInfoCallback> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnINS_2spINS0_6health4V2_119IHealthInfoCallbackEEEEE",
   "self_type" : "_ZTIN7android8hardware6ReturnINS_2spINS0_6health4V2_119IHealthInfoCallbackEEEEE",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware6health4V2_119IHealthInfoCallbackEEE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_17IHealthEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnINS_2spINS0_6health4V2_17IHealthEEEEE",
   "name" : "android::hardware::Return<android::sp<android::hardware::health::V2_1::IHealth> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnINS_2spINS0_6health4V2_17IHealthEEEEE",
   "self_type" : "_ZTIN7android8hardware6ReturnINS_2spINS0_6health4V2_17IHealthEEEEE",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware6health4V2_17IHealthEEE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 168,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnIbEE",
   "name" : "android::hardware::Return<bool>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnIbEE",
   "self_type" : "_ZTIN7android8hardware6ReturnIbEE",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnIvEE",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnIvEE",
   "self_type" : "_ZTIN7android8hardware6ReturnIvEE",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6StatusE",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6StatusE",
   "self_type" : "_ZTIN7android8hardware6StatusE",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "chargerAcOnline",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "chargerUsbOnline",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "chargerWirelessOnline",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "maxChargingCurrent",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxChargingVoltage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryStatus",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android8hardware6health4V1_013BatteryStatusE"
    },
    {
     "field_name" : "batteryHealth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android8hardware6health4V1_013BatteryHealthE"
    },
    {
     "field_name" : "batteryPresent",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "batteryLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryVoltage",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryTemperature",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryCurrent",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryCycleCount",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryFullCharge",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryChargeCounter",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryTechnology",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V1_010HealthInfoE",
   "name" : "android::hardware::health::V1_0::HealthInfo",
   "referenced_type" : "_ZTIN7android8hardware6health4V1_010HealthInfoE",
   "self_type" : "_ZTIN7android8hardware6health4V1_010HealthInfoE",
   "size" : 72,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/1.0/android.hardware.health@1.0_genc++_headers/gen/android/hardware/health/1.0/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "periodicChoresIntervalFast",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "periodicChoresIntervalSlow",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryStatusPath",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryHealthPath",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryPresentPath",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryCapacityPath",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryVoltagePath",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryTemperaturePath",
     "field_offset" : 704,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryTechnologyPath",
     "field_offset" : 832,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryCurrentNowPath",
     "field_offset" : 960,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryCurrentAvgPath",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryChargeCounterPath",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryFullChargePath",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "batteryCycleCountPath",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V1_012HealthConfigE",
   "name" : "android::hardware::health::V1_0::HealthConfig",
   "referenced_type" : "_ZTIN7android8hardware6health4V1_012HealthConfigE",
   "self_type" : "_ZTIN7android8hardware6health4V1_012HealthConfigE",
   "size" : 200,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/1.0/android.hardware.health@1.0_genc++_headers/gen/android/hardware/health/1.0/types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_07IHealthEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_010BnHwHealthE",
   "name" : "android::hardware::health::V2_0::BnHwHealth",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_010BnHwHealthE",
   "self_type" : "_ZTIN7android8hardware6health4V2_010BnHwHealthE",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/BnHwHealth.h",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_010BnHwHealthE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_08BnHwBase13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BnHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BnHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BnHwHealth10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_010BnHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6health4V2_010BnHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6health4V2_010BnHwHealthD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_010BnHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_010BnHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_010BnHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEEE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2spINS1_8hardware27hidl_binder_death_recipientEEENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_010BpHwHealthE",
   "name" : "android::hardware::health::V2_0::BpHwHealth",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_010BpHwHealthE",
   "self_type" : "_ZTIN7android8hardware6health4V2_010BpHwHealthE",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/BpHwHealth.h",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_010BpHwHealthE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_010BpHwHealth8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth16registerCallbackERKNS_2spINS2_19IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth18unregisterCallbackERKNS_2spINS2_19IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth6updateEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth16getChargeCounterENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth13getCurrentNowENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth17getCurrentAverageENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth11getCapacityENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth16getEnergyCounterENSt3__18functionIFvNS2_6ResultExEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth15getChargeStatusENSt3__18functionIFvNS2_6ResultENS1_4V1_013BatteryStatusEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth14getStorageInfoENSt3__18functionIFvNS2_6ResultERKNS0_8hidl_vecINS2_11StorageInfoEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth12getDiskStatsENSt3__18functionIFvNS2_6ResultERKNS0_8hidl_vecINS2_9DiskStatsEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth13getHealthInfoENSt3__18functionIFvNS2_6ResultERKNS2_10HealthInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_010BpHwHealth15onLastStrongRefEPKv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_010BpHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_010BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_010BpHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_07IHealthEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_010BpHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_010BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_010BpHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_010BpHwHealth15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_010BpHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6health4V2_010BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6health4V2_010BpHwHealthD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_010BpHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_010BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_010BpHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware6health4V2_010BpHwHealth15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "legacy",
     "referenced_type" : "_ZTIN7android8hardware6health4V1_010HealthInfoE"
    },
    {
     "field_name" : "batteryCurrentAverage",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "diskStats",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_6health4V2_09DiskStatsEEE"
    },
    {
     "field_name" : "storageInfos",
     "field_offset" : 768,
     "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_6health4V2_011StorageInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_010HealthInfoE",
   "name" : "android::hardware::health::V2_0::HealthInfo",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_010HealthInfoE",
   "self_type" : "_ZTIN7android8hardware6health4V2_010HealthInfoE",
   "size" : 112,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "attr",
     "referenced_type" : "_ZTIN7android8hardware6health4V2_016StorageAttributeE"
    },
    {
     "field_name" : "eol",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "lifetimeA",
     "field_offset" : 208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "lifetimeB",
     "field_offset" : 224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "version",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_011StorageInfoE",
   "name" : "android::hardware::health::V2_0::StorageInfo",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_011StorageInfoE",
   "self_type" : "_ZTIN7android8hardware6health4V2_011StorageInfoE",
   "size" : 48,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "isInternal",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "isBootDevice",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_016StorageAttributeE",
   "name" : "android::hardware::health::V2_0::StorageAttribute",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_016StorageAttributeE",
   "self_type" : "_ZTIN7android8hardware6health4V2_016StorageAttributeE",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_019IHealthInfoCallbackE",
   "name" : "android::hardware::health::V2_0::IHealthInfoCallback",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_019IHealthInfoCallbackE",
   "self_type" : "_ZTIN7android8hardware6health4V2_019IHealthInfoCallbackE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/IHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_019IHealthInfoCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_019IHealthInfoCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_019IHealthInfoCallback17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_019IHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_019IHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_019IHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_019IHealthInfoCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_022BnHwHealthInfoCallbackE",
   "name" : "android::hardware::health::V2_0::BnHwHealthInfoCallback",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_022BnHwHealthInfoCallbackE",
   "self_type" : "_ZTIN7android8hardware6health4V2_022BnHwHealthInfoCallbackE",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/BnHwHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_022BnHwHealthInfoCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_08BnHwBase13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BnHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BnHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BnHwHealthInfoCallback10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_022BnHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6health4V2_022BnHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6health4V2_022BnHwHealthInfoCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_022BnHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_022BnHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_022BnHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEEE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2spINS1_8hardware27hidl_binder_death_recipientEEENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_022BpHwHealthInfoCallbackE",
   "name" : "android::hardware::health::V2_0::BpHwHealthInfoCallback",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_022BpHwHealthInfoCallbackE",
   "self_type" : "_ZTIN7android8hardware6health4V2_022BpHwHealthInfoCallbackE",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/BpHwHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_022BpHwHealthInfoCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_022BpHwHealthInfoCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_022BpHwHealthInfoCallback15onLastStrongRefEPKv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_022BpHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_022BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_022BpHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_019IHealthInfoCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_022BpHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_022BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_022BpHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_022BpHwHealthInfoCallback15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_022BpHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6health4V2_022BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6health4V2_022BpHwHealthInfoCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_022BpHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_022BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_022BpHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware6health4V2_022BpHwHealthInfoCallback15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_07IHealthE",
   "name" : "android::hardware::health::V2_0::IHealth",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_07IHealthE",
   "self_type" : "_ZTIN7android8hardware6health4V2_07IHealthE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/IHealth.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_07IHealthE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_07IHealth8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealthD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth16registerCallbackERKNS_2spINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth18unregisterCallbackERKNS_2spINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth16getChargeCounterENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth13getCurrentNowENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth17getCurrentAverageENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth11getCapacityENSt3__18functionIFvNS2_6ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth16getEnergyCounterENSt3__18functionIFvNS2_6ResultExEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth15getChargeStatusENSt3__18functionIFvNS2_6ResultENS1_4V1_013BatteryStatusEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth14getStorageInfoENSt3__18functionIFvNS2_6ResultERKNS0_8hidl_vecINS2_11StorageInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth12getDiskStatsENSt3__18functionIFvNS2_6ResultERKNS0_8hidl_vecINS2_9DiskStatsEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_07IHealth13getHealthInfoENSt3__18functionIFvNS2_6ResultERKNS2_10HealthInfoEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_07IHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_07IHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_07IHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reads",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "readMerges",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "readSectors",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "readTicks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "writes",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "writeMerges",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "writeSectors",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "writeTicks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ioInFlight",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ioTicks",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ioInQueue",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "attr",
     "field_offset" : 704,
     "referenced_type" : "_ZTIN7android8hardware6health4V2_016StorageAttributeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_09DiskStatsE",
   "name" : "android::hardware::health::V2_0::DiskStats",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_09DiskStatsE",
   "self_type" : "_ZTIN7android8hardware6health4V2_09DiskStatsE",
   "size" : 112,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.0/android.hardware.health@2.0_genc++_headers/gen/android/hardware/health/2.0/types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_17IHealthEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_110BnHwHealthE",
   "name" : "android::hardware::health::V2_1::BnHwHealth",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_110BnHwHealthE",
   "self_type" : "_ZTIN7android8hardware6health4V2_110BnHwHealthE",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/BnHwHealth.h",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_110BnHwHealthE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_08BnHwBase13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BnHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BnHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BnHwHealth10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_110BnHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6health4V2_110BnHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6health4V2_110BnHwHealthD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_110BnHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_110BnHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_110BnHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEEE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2spINS1_8hardware27hidl_binder_death_recipientEEENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_110BpHwHealthE",
   "name" : "android::hardware::health::V2_1::BpHwHealth",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_110BpHwHealthE",
   "self_type" : "_ZTIN7android8hardware6health4V2_110BpHwHealthE",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/BpHwHealth.h",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_110BpHwHealthE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_110BpHwHealth8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth16registerCallbackERKNS_2spINS1_4V2_019IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth18unregisterCallbackERKNS_2spINS1_4V2_019IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth6updateEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth16getChargeCounterENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth13getCurrentNowENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth17getCurrentAverageENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth11getCapacityENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth16getEnergyCounterENSt3__18functionIFvNS1_4V2_06ResultExEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth15getChargeStatusENSt3__18functionIFvNS1_4V2_06ResultENS1_4V1_013BatteryStatusEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth14getStorageInfoENSt3__18functionIFvNS1_4V2_06ResultERKNS0_8hidl_vecINS6_11StorageInfoEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth12getDiskStatsENSt3__18functionIFvNS1_4V2_06ResultERKNS0_8hidl_vecINS6_9DiskStatsEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth13getHealthInfoENSt3__18functionIFvNS1_4V2_06ResultERKNS6_10HealthInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth15getHealthConfigENSt3__18functionIFvNS1_4V2_06ResultERKNS2_12HealthConfigEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth17getHealthInfo_2_1ENSt3__18functionIFvNS1_4V2_06ResultERKNS2_10HealthInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth18shouldKeepScreenOnENSt3__18functionIFvNS1_4V2_06ResultEbEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_110BpHwHealth15onLastStrongRefEPKv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_110BpHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_110BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_110BpHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_17IHealthEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_110BpHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_110BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_110BpHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_110BpHwHealth15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_110BpHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6health4V2_110BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6health4V2_110BpHwHealthD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_110BpHwHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_110BpHwHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_110BpHwHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware6health4V2_110BpHwHealth15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "legacy",
     "referenced_type" : "_ZTIN7android8hardware6health4V2_010HealthInfoE"
    },
    {
     "field_name" : "batteryCapacityLevel",
     "field_offset" : 896,
     "referenced_type" : "_ZTIN7android8hardware6health4V2_120BatteryCapacityLevelE"
    },
    {
     "field_name" : "batteryChargeTimeToFullNowSeconds",
     "field_offset" : 960,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "batteryFullChargeDesignCapacityUah",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_110HealthInfoE",
   "name" : "android::hardware::health::V2_1::HealthInfo",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_110HealthInfoE",
   "self_type" : "_ZTIN7android8hardware6health4V2_110HealthInfoE",
   "size" : 136,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "battery",
     "referenced_type" : "_ZTIN7android8hardware6health4V1_012HealthConfigE"
    },
    {
     "field_name" : "bootMinCap",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_112HealthConfigE",
   "name" : "android::hardware::health::V2_1::HealthConfig",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_112HealthConfigE",
   "self_type" : "_ZTIN7android8hardware6health4V2_112HealthConfigE",
   "size" : 208,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware6health4V2_019IHealthInfoCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_119IHealthInfoCallbackE",
   "name" : "android::hardware::health::V2_1::IHealthInfoCallback",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_119IHealthInfoCallbackE",
   "self_type" : "_ZTIN7android8hardware6health4V2_119IHealthInfoCallbackE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/IHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_119IHealthInfoCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_119IHealthInfoCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback17healthInfoChangedERKNS1_4V2_010HealthInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_119IHealthInfoCallback21healthInfoChanged_2_1ERKNS2_10HealthInfoE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_119IHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_119IHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_119IHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware6health4V2_119IHealthInfoCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "_ZTIKN7android2spINS_8hardware6health4V2_119IHealthInfoCallbackEEE"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "_ZTIN7android8hardware7details10TaskRunnerE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_120BsHealthInfoCallbackE",
   "name" : "android::hardware::health::V2_1::BsHealthInfoCallback",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_120BsHealthInfoCallbackE",
   "self_type" : "_ZTIN7android8hardware6health4V2_120BsHealthInfoCallbackE",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/BsHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_120BsHealthInfoCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_119IHealthInfoCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback17healthInfoChangedERKNS1_4V2_010HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_120BsHealthInfoCallback21healthInfoChanged_2_1ERKNS2_10HealthInfoE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_120BsHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_120BsHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_120BsHealthInfoCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_120BsHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_120BsHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_120BsHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "_ZTIN7android2spINS_8hardware6health4V2_119IHealthInfoCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_122BnHwHealthInfoCallbackE",
   "name" : "android::hardware::health::V2_1::BnHwHealthInfoCallback",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_122BnHwHealthInfoCallbackE",
   "self_type" : "_ZTIN7android8hardware6health4V2_122BnHwHealthInfoCallbackE",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/BnHwHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_122BnHwHealthInfoCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_08BnHwBase13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BnHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BnHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BnHwHealthInfoCallback10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_122BnHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6health4V2_122BnHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6health4V2_122BnHwHealthInfoCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_122BnHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_122BnHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_122BnHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEEE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2spINS1_8hardware27hidl_binder_death_recipientEEENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_122BpHwHealthInfoCallbackE",
   "name" : "android::hardware::health::V2_1::BpHwHealthInfoCallback",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_122BpHwHealthInfoCallbackE",
   "self_type" : "_ZTIN7android8hardware6health4V2_122BpHwHealthInfoCallbackE",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/BpHwHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_122BpHwHealthInfoCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_122BpHwHealthInfoCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback17healthInfoChangedERKNS1_4V2_010HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback21healthInfoChanged_2_1ERKNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_122BpHwHealthInfoCallback15onLastStrongRefEPKv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_122BpHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_122BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_122BpHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6health4V2_119IHealthInfoCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_122BpHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_122BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_122BpHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware6health4V2_122BpHwHealthInfoCallback15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_122BpHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6health4V2_122BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6health4V2_122BpHwHealthInfoCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_122BpHwHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_122BpHwHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_122BpHwHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware6health4V2_122BpHwHealthInfoCallback15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware6health4V2_07IHealthE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_17IHealthE",
   "name" : "android::hardware::health::V2_1::IHealth",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_17IHealthE",
   "self_type" : "_ZTIN7android8hardware6health4V2_17IHealthE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/IHealth.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_17IHealthE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_17IHealth8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealthD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth16registerCallbackERKNS_2spINS1_4V2_019IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth18unregisterCallbackERKNS_2spINS1_4V2_019IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth16getChargeCounterENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth13getCurrentNowENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth17getCurrentAverageENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth11getCapacityENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth16getEnergyCounterENSt3__18functionIFvNS1_4V2_06ResultExEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth15getChargeStatusENSt3__18functionIFvNS1_4V2_06ResultENS1_4V1_013BatteryStatusEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth14getStorageInfoENSt3__18functionIFvNS1_4V2_06ResultERKNS0_8hidl_vecINS6_11StorageInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth12getDiskStatsENSt3__18functionIFvNS1_4V2_06ResultERKNS0_8hidl_vecINS6_9DiskStatsEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth13getHealthInfoENSt3__18functionIFvNS1_4V2_06ResultERKNS6_10HealthInfoEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth15getHealthConfigENSt3__18functionIFvNS1_4V2_06ResultERKNS2_12HealthConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth17getHealthInfo_2_1ENSt3__18functionIFvNS1_4V2_06ResultERKNS2_10HealthInfoEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6health4V2_17IHealth18shouldKeepScreenOnENSt3__18functionIFvNS1_4V2_06ResultEbEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_17IHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_17IHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_17IHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware6health4V2_17IHealthE"
    },
    {
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "_ZTIKN7android2spINS_8hardware6health4V2_17IHealthEEE"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "_ZTIN7android8hardware7details10TaskRunnerE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6health4V2_18BsHealthE",
   "name" : "android::hardware::health::V2_1::BsHealth",
   "referenced_type" : "_ZTIN7android8hardware6health4V2_18BsHealthE",
   "self_type" : "_ZTIN7android8hardware6health4V2_18BsHealthE",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/health/2.1/android.hardware.health@2.1_genc++_headers/gen/android/hardware/health/2.1/BsHealth.h",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_18BsHealthE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6health4V2_17IHealth8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth16registerCallbackERKNS_2spINS1_4V2_019IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth18unregisterCallbackERKNS_2spINS1_4V2_019IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth6updateEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth16getChargeCounterENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth13getCurrentNowENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth17getCurrentAverageENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth11getCapacityENSt3__18functionIFvNS1_4V2_06ResultEiEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth16getEnergyCounterENSt3__18functionIFvNS1_4V2_06ResultExEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth15getChargeStatusENSt3__18functionIFvNS1_4V2_06ResultENS1_4V1_013BatteryStatusEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth14getStorageInfoENSt3__18functionIFvNS1_4V2_06ResultERKNS0_8hidl_vecINS6_11StorageInfoEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth12getDiskStatsENSt3__18functionIFvNS1_4V2_06ResultERKNS0_8hidl_vecINS6_9DiskStatsEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth13getHealthInfoENSt3__18functionIFvNS1_4V2_06ResultERKNS6_10HealthInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth15getHealthConfigENSt3__18functionIFvNS1_4V2_06ResultERKNS2_12HealthConfigEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth17getHealthInfo_2_1ENSt3__18functionIFvNS1_4V2_06ResultERKNS2_10HealthInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6health4V2_18BsHealth18shouldKeepScreenOnENSt3__18functionIFvNS1_4V2_06ResultEbEEE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_18BsHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_18BsHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6health4V2_18BsHealthD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6health4V2_18BsHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_18BsHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6health4V2_18BsHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7IBinder14DeathRecipientE",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware7IBinder14DeathRecipientE",
   "self_type" : "_ZTIN7android8hardware7IBinder14DeathRecipientE",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7IBinderE",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware7IBinderE",
   "self_type" : "_ZTIN7android8hardware7IBinderE",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mQueue",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN7android8hardware7details17SynchronizedQueueINS_8functionIFvvEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details10TaskRunnerE",
   "name" : "android::hardware::details::TaskRunner",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware7details10TaskRunnerE",
   "self_type" : "_ZTIN7android8hardware7details10TaskRunnerE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/TaskRunner.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTI13native_handle" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIK13native_handle" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPK13native_handle"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIKc" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEE",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<unsigned char, 32> >",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIN7android8hardware10hidl_arrayIhLj32EJEEE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPN7android8hardware10hidl_arrayIhLj32EJEEE"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEUt_E",
   "name" : "android::hardware::details::hidl_pointer<hidl_array<unsigned char, 32> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIN7android8hardware11hidl_stringE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E",
   "name" : "android::hardware::details::hidl_pointer<hidl_string>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIN7android8hardware17GrantorDescriptorE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPN7android8hardware17GrantorDescriptorE"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_011StorageInfoEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_011StorageInfoEEE",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::health::V2_0::StorageInfo>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_011StorageInfoEEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_011StorageInfoEEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_011StorageInfoE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPN7android8hardware6health4V2_011StorageInfoE"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_011StorageInfoEEUt_E",
   "name" : "android::hardware::details::hidl_pointer<StorageInfo>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_011StorageInfoEEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_011StorageInfoEEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_09DiskStatsEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_09DiskStatsEEE",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::health::V2_0::DiskStats>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_09DiskStatsEEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_09DiskStatsEEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_09DiskStatsE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPN7android8hardware6health4V2_09DiskStatsE"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_09DiskStatsEEUt_E",
   "name" : "android::hardware::details::hidl_pointer<DiskStats>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_09DiskStatsEEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_09DiskStatsEEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIcEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIcEE",
   "name" : "android::hardware::details::hidl_pointer<char>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIcEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIcEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIcEUt_E",
   "name" : "android::hardware::details::hidl_pointer<char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIcEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIcEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIiEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIiEE",
   "name" : "android::hardware::details::hidl_pointer<int>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIiEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIiEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIiEUt_E",
   "name" : "android::hardware::details::hidl_pointer<int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIiEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIiEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer",
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details13DoNotDestructINS0_13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEEEE",
   "name" : "android::hardware::details::DoNotDestruct<android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware7details13DoNotDestructINS0_13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEEEE",
   "self_type" : "_ZTIN7android8hardware7details13DoNotDestructINS0_13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" :
   [
    "_ZTIN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "_ZTIN7android8hardware6StatusE"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details13return_statusE",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware7details13return_statusE",
   "self_type" : "_ZTIN7android8hardware7details13return_statusE",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "self_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "size" : 44,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details5i_tagE",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "_ZTIN7android8hardware7details5i_tagE",
   "self_type" : "_ZTIN7android8hardware7details5i_tagE",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details6bs_tagE",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "_ZTIN7android8hardware7details6bs_tagE",
   "self_type" : "_ZTIN7android8hardware7details6bs_tagE",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "self_type" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details8bphw_tagE",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "_ZTIN7android8hardware7details8bphw_tagE",
   "self_type" : "_ZTIN7android8hardware7details8bphw_tagE",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details9std_arrayIhLj32EJEEE",
   "name" : "android::hardware::details::std_array<unsigned char, 32>",
   "referenced_type" : "_ZTIN7android8hardware7details9std_arrayIhLj32EJEEE",
   "self_type" : "_ZTIN7android8hardware7details9std_arrayIhLj32EJEEE",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEE",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_array<unsigned char, 32> >",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEE",
   "self_type" : "_ZTIN7android8hardware8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIN7android8hardware10hidl_arrayIhLj32EJEEE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecINS0_11hidl_stringEEE",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_string>",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_11hidl_stringEEE",
   "self_type" : "_ZTIN7android8hardware8hidl_vecINS0_11hidl_stringEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIN7android8hardware11hidl_stringE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "self_type" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIN7android8hardware17GrantorDescriptorE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_011StorageInfoEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecINS0_6health4V2_011StorageInfoEEE",
   "name" : "android::hardware::hidl_vec<android::hardware::health::V2_0::StorageInfo>",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_6health4V2_011StorageInfoEEE",
   "self_type" : "_ZTIN7android8hardware8hidl_vecINS0_6health4V2_011StorageInfoEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_011StorageInfoE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_6health4V2_09DiskStatsEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecINS0_6health4V2_09DiskStatsEEE",
   "name" : "android::hardware::hidl_vec<android::hardware::health::V2_0::DiskStats>",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_6health4V2_09DiskStatsEEE",
   "self_type" : "_ZTIN7android8hardware8hidl_vecINS0_6health4V2_09DiskStatsEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIN7android8hardware6health4V2_09DiskStatsE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIcEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecIcEE",
   "name" : "android::hardware::hidl_vec<char>",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecIcEE",
   "self_type" : "_ZTIN7android8hardware8hidl_vecIcEE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIiEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecIiEE",
   "name" : "android::hardware::hidl_vec<int>",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecIiEE",
   "self_type" : "_ZTIN7android8hardware8hidl_vecIiEE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7IBinderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16atomicIPN7android8hardware9BHwBinder6ExtrasEEE"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware9BHwBinderE",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware9BHwBinderE",
   "self_type" : "_ZTIN7android8hardware9BHwBinderE",
   "size" : 28,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
