{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA512_11__bpf_label",
   "name" : "__bpf_label [512]",
   "referenced_type" : "_ZTI11__bpf_label",
   "self_type" : "_ZTIA512_11__bpf_label",
   "size" : 4096,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA6_y",
   "name" : "unsigned long long [6]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA6_y",
   "size" : 48,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "linker_set_key" : "_ZTIA_13syscall_entry",
   "name" : "syscall_entry []",
   "referenced_type" : "_ZTI13syscall_entry",
   "self_type" : "_ZTIA_13syscall_entry",
   "source_file" : "/external/minijail/libsyscalls.h"
  },
  {
   "linker_set_key" : "_ZTIA_14constant_entry",
   "name" : "constant_entry []",
   "referenced_type" : "_ZTI14constant_entry",
   "self_type" : "_ZTIA_14constant_entry",
   "source_file" : "/external/minijail/libconstants.h"
  },
  {
   "linker_set_key" : "_ZTIA_PKc",
   "name" : "const char *[]",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIA_PKc",
   "source_file" : "/external/minijail/util.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",

   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiPvE",
   "name" : "int (*)(void *)",
   "referenced_type" : "_ZTIFiPvE",
   "self_type" : "_ZTIPFiPvE",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK10sock_fprog",
   "name" : "const sock_fprog *",
   "referenced_type" : "_ZTIK10sock_fprog",
   "self_type" : "_ZTIPK10sock_fprog",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK14filter_options",
   "name" : "const filter_options *",
   "referenced_type" : "_ZTIK14filter_options",
   "self_type" : "_ZTIPK14filter_options",
   "size" : 4,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK8minijail",
   "name" : "const minijail *",
   "referenced_type" : "_ZTIK8minijail",
   "self_type" : "_ZTIPK8minijail",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKPc",
   "name" : "char *const *",
   "referenced_type" : "_ZTIKPc",
   "self_type" : "_ZTIPKPc",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKj",
   "name" : "const unsigned int *",
   "referenced_type" : "_ZTIKj",
   "self_type" : "_ZTIPKj",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP11sock_filter",
   "name" : "sock_filter **",
   "referenced_type" : "_ZTIP11sock_filter",
   "self_type" : "_ZTIPP11sock_filter",
   "size" : 4,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP12filter_block",
   "name" : "filter_block **",
   "referenced_type" : "_ZTIP12filter_block",
   "self_type" : "_ZTIPP12filter_block",
   "size" : 4,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPPc",
   "name" : "char ***",
   "referenced_type" : "_ZTIPPc",
   "self_type" : "_ZTIPPPc",
   "size" : 4,
   "source_file" : "/external/minijail/util.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIPPc",
   "size" : 4,
   "source_file" : "/external/minijail/util.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "/external/minijail/system.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 4,
   "source_file" : "/external/minijail/system.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIA_K13syscall_entry",
   "name" : "syscall_entry const[]",
   "referenced_type" : "_ZTIA_13syscall_entry",
   "self_type" : "_ZTIA_K13syscall_entry",
   "source_file" : "/external/minijail/libsyscalls.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIA_K14constant_entry",
   "name" : "constant_entry const[]",
   "referenced_type" : "_ZTIA_14constant_entry",
   "self_type" : "_ZTIA_K14constant_entry",
   "source_file" : "/external/minijail/libconstants.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10sock_fprog",
   "name" : "const sock_fprog",
   "referenced_type" : "_ZTI10sock_fprog",
   "self_type" : "_ZTIK10sock_fprog",
   "size" : 8,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK14filter_options",
   "name" : "const filter_options",
   "referenced_type" : "_ZTI14filter_options",
   "self_type" : "_ZTIK14filter_options",
   "size" : 12,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8minijail",
   "name" : "const minijail",
   "referenced_type" : "_ZTI8minijail",
   "self_type" : "_ZTIK8minijail",
   "size" : 832,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPc",
   "name" : "char *const",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIKPc",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/external/minijail/util.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "labels",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA512_11__bpf_label"
    }
   ],
   "linker_set_key" : "_ZTI10bpf_labels",
   "name" : "bpf_labels",
   "referenced_type" : "_ZTI10bpf_labels",
   "self_type" : "_ZTI10bpf_labels",
   "size" : 4100,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "label",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "location",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11__bpf_label",
   "name" : "__bpf_label",
   "referenced_type" : "_ZTI11__bpf_label",
   "self_type" : "_ZTI11__bpf_label",
   "size" : 8,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "instrs",
     "referenced_type" : "_ZTIP11sock_filter"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12filter_block"
    },
    {
     "field_name" : "last",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP12filter_block"
    },
    {
     "field_name" : "total_len",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12filter_block",
   "name" : "filter_block",
   "referenced_type" : "_ZTI12filter_block",
   "self_type" : "_ZTI12filter_block",
   "size" : 20,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "filename",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line_number",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12parser_state",
   "name" : "parser_state",
   "referenced_type" : "_ZTI12parser_state",
   "self_type" : "_ZTI12parser_state",
   "size" : 8,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nr",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "arch",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "instruction_pointer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "args",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA6_y"
    }
   ],
   "linker_set_key" : "_ZTI12seccomp_data",
   "name" : "seccomp_data",
   "referenced_type" : "_ZTI12seccomp_data",
   "self_type" : "_ZTI12seccomp_data",
   "size" : 64,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "nr",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI13syscall_entry",
   "name" : "syscall_entry",
   "referenced_type" : "_ZTI13syscall_entry",
   "self_type" : "_ZTI13syscall_entry",
   "size" : 8,
   "source_file" : "/external/minijail/libsyscalls.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI14constant_entry",
   "name" : "constant_entry",
   "referenced_type" : "_ZTI14constant_entry",
   "self_type" : "_ZTI14constant_entry",
   "size" : 8,
   "source_file" : "/external/minijail/libconstants.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "action",
     "referenced_type" : "_ZTI12block_action"
    },
    {
     "field_name" : "allow_logging",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "allow_syscalls_for_logging",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14filter_options",
   "name" : "filter_options",
   "referenced_type" : "_ZTI14filter_options",
   "self_type" : "_ZTI14filter_options",
   "size" : 12,
   "source_file" : "/external/minijail/syscall_filter.h"
  }
 ],
 "rvalue_reference_types" : []
}
