{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-594",
   "self_type" : "type-594",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 1
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "char16_t",
   "name" : "char16_t",
   "referenced_type" : "type-640",
   "self_type" : "type-640",
   "size" : 2
  },
  {
   "alignment" : 8,
   "linker_set_key" : "double",
   "name" : "double",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float",
   "name" : "float",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "long",
   "name" : "long",
   "referenced_type" : "type-691",
   "self_type" : "type-691",
   "size" : 4
  },
  {
   "alignment" : 8,
   "linker_set_key" : "long double",
   "name" : "long double",
   "referenced_type" : "type-690",
   "self_type" : "type-690",

   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_ibinder.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AStatus",
   "name" : "const AStatus",
   "referenced_type" : "type-559",
   "self_type" : "type-558",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AStatus",
   "name" : "const AStatus",
   "referenced_type" : "type-575",
   "self_type" : "type-574",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_status.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AStatus",
   "name" : "const AStatus",
   "referenced_type" : "type-614",
   "self_type" : "type-613",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AStatus",
   "name" : "const AStatus",
   "referenced_type" : "type-685",
   "self_type" : "type-684",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_status.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const JNIInvokeInterface",
   "name" : "const JNIInvokeInterface",
   "referenced_type" : "type-526",
   "self_type" : "type-525",
   "size" : 32,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const JNINativeInterface",
   "name" : "const JNINativeInterface",
   "referenced_type" : "type-10",
   "self_type" : "type-9",
   "size" : 932,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const JNINativeMethod",
   "name" : "const JNINativeMethod",
   "referenced_type" : "type-514",
   "self_type" : "type-513",
   "size" : 12,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-22",
   "self_type" : "type-21",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_ibinder.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const char16_t",
   "name" : "const char16_t",
   "referenced_type" : "type-640",
   "self_type" : "type-651",
   "size" : 2,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const double",
   "name" : "const double",
   "referenced_type" : "type-80",
   "self_type" : "type-509",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const float",
   "name" : "const float",
   "referenced_type" : "type-79",
   "self_type" : "type-505",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-15",
   "self_type" : "type-497",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const jvalue",
   "name" : "const jvalue",
   "referenced_type" : "type-75",
   "self_type" : "type-74",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const long long",
   "name" : "const long long",
   "referenced_type" : "type-78",
   "self_type" : "type-501",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const short",
   "name" : "const short",
   "referenced_type" : "type-77",
   "self_type" : "type-493",
   "size" : 2,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const signed char",
   "name" : "const signed char",
   "referenced_type" : "type-25",
   "self_type" : "type-24",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-38",
   "self_type" : "type-485",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-555",
   "self_type" : "type-645",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-639",
   "self_type" : "type-647",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-76",
   "self_type" : "type-369",
   "size" : 2,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-12",
   "self_type" : "type-622",
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 96,
     "referenced_type" : "type-527"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 128,
     "referenced_type" : "type-529"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 160,
     "referenced_type" : "type-527"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 192,
     "referenced_type" : "type-532"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 224,
     "referenced_type" : "type-529"
    }
   ],
   "linker_set_key" : "JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 32,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNIInvokeInterface"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 192,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 224,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 256,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 288,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 320,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 352,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 384,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 416,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 448,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 480,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 512,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 544,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 576,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 608,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 640,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 672,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 704,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 736,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 768,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 800,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 832,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 864,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 896,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 928,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 960,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 992,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 1024,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 1056,
     "referenced_type" : "type-85"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 1088,
     "referenced_type" : "type-87"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 1120,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 1152,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 1184,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 1216,
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 1248,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 1280,
     "referenced_type" : "type-101"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 1312,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 1344,
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 1376,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 1408,
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 1440,
     "referenced_type" : "type-113"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 1472,
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 1504,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 1536,
     "referenced_type" : "type-120"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 1568,
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 1600,
     "referenced_type" : "type-124"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 1632,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 1664,
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 1696,
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 1728,
     "referenced_type" : "type-134"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 1760,
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 1792,
     "referenced_type" : "type-138"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 1824,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 1856,
     "referenced_type" : "type-143"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 1888,
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 1920,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 1952,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 1984,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 2016,
     "referenced_type" : "type-155"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 2048,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 2080,
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 2112,
     "referenced_type" : "type-162"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 2144,
     "referenced_type" : "type-164"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 2176,
     "referenced_type" : "type-166"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 2208,
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 2240,
     "referenced_type" : "type-171"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 2272,
     "referenced_type" : "type-173"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 2304,
     "referenced_type" : "type-176"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 2336,
     "referenced_type" : "type-178"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 2368,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 2400,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 2432,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 2464,
     "referenced_type" : "type-187"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 2496,
     "referenced_type" : "type-190"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 2528,
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 2560,
     "referenced_type" : "type-194"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 2592,
     "referenced_type" : "type-197"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 2624,
     "referenced_type" : "type-199"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 2656,
     "referenced_type" : "type-201"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 2688,
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 2720,
     "referenced_type" : "type-206"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 2752,
     "referenced_type" : "type-208"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 2784,
     "referenced_type" : "type-211"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 2816,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 2848,
     "referenced_type" : "type-215"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 2880,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 2912,
     "referenced_type" : "type-220"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 2944,
     "referenced_type" : "type-222"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 2976,
     "referenced_type" : "type-225"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 3008,
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 3040,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 3072,
     "referenced_type" : "type-231"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 3104,
     "referenced_type" : "type-233"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 3136,
     "referenced_type" : "type-235"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 3168,
     "referenced_type" : "type-237"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 3200,
     "referenced_type" : "type-239"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 3232,
     "referenced_type" : "type-241"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 3264,
     "referenced_type" : "type-243"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 3296,
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 3328,
     "referenced_type" : "type-247"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 3360,
     "referenced_type" : "type-249"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 3392,
     "referenced_type" : "type-251"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 3424,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 3456,
     "referenced_type" : "type-255"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 3488,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 3520,
     "referenced_type" : "type-259"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 3552,
     "referenced_type" : "type-261"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 3584,
     "referenced_type" : "type-263"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 3616,
     "referenced_type" : "type-85"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 3648,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 3680,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 3712,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 3744,
     "referenced_type" : "type-265"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 3776,
     "referenced_type" : "type-267"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 3808,
     "referenced_type" : "type-270"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 3840,
     "referenced_type" : "type-272"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 3872,
     "referenced_type" : "type-274"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 3904,
     "referenced_type" : "type-277"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 3936,
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 3968,
     "referenced_type" : "type-281"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 4000,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 4032,
     "referenced_type" : "type-286"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 4064,
     "referenced_type" : "type-288"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 4096,
     "referenced_type" : "type-291"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 4128,
     "referenced_type" : "type-293"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 4160,
     "referenced_type" : "type-295"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 4192,
     "referenced_type" : "type-298"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 4224,
     "referenced_type" : "type-300"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 4256,
     "referenced_type" : "type-302"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 4288,
     "referenced_type" : "type-305"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 4320,
     "referenced_type" : "type-307"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 4352,
     "referenced_type" : "type-309"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 4384,
     "referenced_type" : "type-312"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 4416,
     "referenced_type" : "type-314"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 4448,
     "referenced_type" : "type-316"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 4480,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 4512,
     "referenced_type" : "type-321"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 4544,
     "referenced_type" : "type-323"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 4576,
     "referenced_type" : "type-326"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 4608,
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 4640,
     "referenced_type" : "type-328"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 4672,
     "referenced_type" : "type-330"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 4704,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 4736,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 4768,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 4800,
     "referenced_type" : "type-338"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 4832,
     "referenced_type" : "type-340"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 4864,
     "referenced_type" : "type-342"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 4896,
     "referenced_type" : "type-344"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 4928,
     "referenced_type" : "type-346"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 4960,
     "referenced_type" : "type-348"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 4992,
     "referenced_type" : "type-350"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 5024,
     "referenced_type" : "type-352"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 5056,
     "referenced_type" : "type-354"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 5088,
     "referenced_type" : "type-356"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 5120,
     "referenced_type" : "type-358"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 5152,
     "referenced_type" : "type-360"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 5184,
     "referenced_type" : "type-362"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 5216,
     "referenced_type" : "type-364"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 5248,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 5280,
     "referenced_type" : "type-372"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 5312,
     "referenced_type" : "type-375"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 5344,
     "referenced_type" : "type-377"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 5376,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 5408,
     "referenced_type" : "type-379"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 5440,
     "referenced_type" : "type-381"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 5472,
     "referenced_type" : "type-383"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 5504,
     "referenced_type" : "type-387"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 5536,
     "referenced_type" : "type-391"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 5568,
     "referenced_type" : "type-393"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 5600,
     "referenced_type" : "type-395"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 5632,
     "referenced_type" : "type-399"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 5664,
     "referenced_type" : "type-403"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 5696,
     "referenced_type" : "type-407"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 5728,
     "referenced_type" : "type-411"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 5760,
     "referenced_type" : "type-415"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 5792,
     "referenced_type" : "type-419"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 5824,
     "referenced_type" : "type-423"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 5856,
     "referenced_type" : "type-427"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 5888,
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 5920,
     "referenced_type" : "type-432"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 5952,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 5984,
     "referenced_type" : "type-438"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 6016,
     "referenced_type" : "type-441"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 6048,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 6080,
     "referenced_type" : "type-447"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 6112,
     "referenced_type" : "type-450"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 6144,
     "referenced_type" : "type-452"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 6176,
     "referenced_type" : "type-454"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 6208,
     "referenced_type" : "type-456"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 6240,
     "referenced_type" : "type-458"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 6272,
     "referenced_type" : "type-460"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 6304,
     "referenced_type" : "type-462"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 6336,
     "referenced_type" : "type-464"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 6368,
     "referenced_type" : "type-466"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 6400,
     "referenced_type" : "type-468"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 6432,
     "referenced_type" : "type-470"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 6464,
     "referenced_type" : "type-472"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 6496,
     "referenced_type" : "type-474"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 6528,
     "referenced_type" : "type-476"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 6560,
     "referenced_type" : "type-478"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 6592,
     "referenced_type" : "type-480"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 6624,
     "referenced_type" : "type-482"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 6656,
     "referenced_type" : "type-486"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 6688,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 6720,
     "referenced_type" : "type-490"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 6752,
     "referenced_type" : "type-494"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 6784,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 6816,
     "referenced_type" : "type-502"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 6848,
     "referenced_type" : "type-506"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 6880,
     "referenced_type" : "type-510"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 6912,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 6944,
     "referenced_type" : "type-517"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 6976,
     "referenced_type" : "type-517"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 7008,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 7040,
     "referenced_type" : "type-535"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 7072,
     "referenced_type" : "type-537"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 7104,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 7136,
     "referenced_type" : "type-542"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 7168,
     "referenced_type" : "type-372"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 7200,
     "referenced_type" : "type-375"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 7232,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 7264,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 7296,
     "referenced_type" : "type-544"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 7328,
     "referenced_type" : "type-546"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 7360,
     "referenced_type" : "type-548"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 7392,
     "referenced_type" : "type-550"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 7424,
     "referenced_type" : "type-552"
    }
   ],
   "linker_set_key" : "JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 932,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNINativeInterface"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "signature",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "type-514",
   "self_type" : "type-514",
   "size" : 12,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS15JNINativeMethod"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "group",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "type-606",
   "self_type" : "type-606",
   "size" : 12,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS16JavaVMAttachArgs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "type-609"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 96,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "type-608",
   "self_type" : "type-608",
   "size" : 16,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14JavaVMInitArgs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "type-607",
   "self_type" : "type-607",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12JavaVMOption"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JNIEnv"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-524"
    }
   ],
   "linker_set_key" : "_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "type-523",
   "self_type" : "type-523",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JavaVM"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "type-386",
   "self_type" : "type-386",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jarray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14_jbooleanArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "type-402",
   "self_type" : "type-402",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jbyteArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "type-406",
   "self_type" : "type-406",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jcharArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jclass"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "type-426",
   "self_type" : "type-426",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jdoubleArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "type-422",
   "self_type" : "type-422",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jfloatArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "type-414",
   "self_type" : "type-414",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
