{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_c",
   "name" : "char [128]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA128_c",
   "size" : 128,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA16_10audio_gain",
   "name" : "audio_gain [16]",
   "referenced_type" : "_ZTI10audio_gain",
   "self_type" : "_ZTIA16_10audio_gain",
   "size" : 512,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA16_17audio_port_config",
   "name" : "audio_port_config [16]",
   "referenced_type" : "_ZTI17audio_port_config",
   "self_type" : "_ZTIA16_17audio_port_config",
   "size" : 3456,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA19_c",
   "name" : "char [19]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA19_c",
   "size" : 19,
   "source_file" : "/system/media/audio_utils/include/audio_utils/clock.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_j",
   "name" : "unsigned int [1]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA1_j",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio-base-utils.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA256_c",
   "name" : "char [256]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA256_c",
   "size" : 256,

   "name" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::audio_utils::metadata::Datum, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::audio_utils::metadata::Datum> > >",
   "referenced_type" : "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumENS_4lessIS6_EENS4_INS_4pairIKS6_SA_EEEEEE",
   "self_type" : "_ZTIKNSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumENS_4lessIS6_EENS4_INS_4pairIKS6_SA_EEEEEE",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__13mapIdiNS_4lessIdEENS_9allocatorINS_4pairIKdiEEEEEE",
   "name" : "const std::map<double, int, std::less<double>, std::allocator<std::pair<const double, int> > >",
   "referenced_type" : "_ZTINSt3__13mapIdiNS_4lessIdEENS_9allocatorINS_4pairIKdiEEEEEE",
   "self_type" : "_ZTIKNSt3__13mapIdiNS_4lessIdEENS_9allocatorINS_4pairIKdiEEEEEE",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/LogPlot.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumEEE",
   "name" : "const std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::audio_utils::metadata::Datum>",
   "referenced_type" : "_ZTINSt3__14pairIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumEEE",
   "self_type" : "_ZTIKNSt3__14pairIKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumEEE",
   "size" : 28,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18functionIFffEEE",
   "name" : "const std::function<float (float)>",
   "referenced_type" : "_ZTINSt3__18functionIFffEEE",
   "self_type" : "_ZTIKNSt3__18functionIFffEEE",
   "size" : 24,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Balance.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP22audio_utils_fifo_index",
   "name" : "audio_utils_fifo_index *const",
   "referenced_type" : "_ZTIP22audio_utils_fifo_index",
   "self_type" : "_ZTIKP22audio_utils_fifo_index",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIKPv",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/primitives.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "/system/media/audio_utils/include/audio_utils/primitives.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "min_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max_value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "default_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "step_value",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "min_ramp_ms",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_ramp_ms",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10audio_gain",
   "name" : "audio_gain",
   "referenced_type" : "_ZTI10audio_gain",
   "self_type" : "_ZTI10audio_gain",
   "size" : 32,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "_ZTI17audio_port_role_t"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI17audio_port_type_t"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA128_c"
    },
    {
     "field_name" : "num_sample_rates",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sample_rates",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "field_name" : "num_channel_masks",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_masks",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "field_name" : "num_formats",
     "field_offset" : 3232,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "formats",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIA32_14audio_format_t"
    },
    {
     "field_name" : "num_gains",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gains",
     "field_offset" : 4320,
     "referenced_type" : "_ZTIA16_10audio_gain"
    },
    {
     "field_name" : "active_config",
     "field_offset" : 8416,
     "referenced_type" : "_ZTI17audio_port_config"
    },
    {
     "field_name" : "ext",
     "field_offset" : 10144,
     "referenced_type" : "_ZTIN10audio_portUt_E"
    }
   ],
   "linker_set_key" : "_ZTI10audio_port",
   "name" : "audio_port",
   "referenced_type" : "_ZTI10audio_port",
   "self_type" : "_ZTI10audio_port",
   "size" : 1308,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_sources",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sources",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA16_17audio_port_config"
    },
    {
     "field_name" : "num_sinks",
     "field_offset" : 27712,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sinks",
     "field_offset" : 27744,
     "referenced_type" : "_ZTIA16_17audio_port_config"
    }
   ],
   "linker_set_key" : "_ZTI11audio_patch",
   "name" : "audio_patch",
   "referenced_type" : "_ZTI11audio_patch",
   "self_type" : "_ZTI11audio_patch",
   "size" : 6924,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sample_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "offload_info",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20audio_offload_info_t"
    },
    {
     "field_name" : "frame_count",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12audio_config",
   "name" : "audio_config",
   "referenced_type" : "_ZTI12audio_config",
   "self_type" : "_ZTI12audio_config",
   "size" : 88,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "timeLow",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "timeMid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "timeHiAndVersion",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "clockSeq",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA6_h"
    }
   ],
   "linker_set_key" : "_ZTI12audio_uuid_s",
   "name" : "audio_uuid_s",
   "referenced_type" : "_ZTI12audio_uuid_s",
   "self_type" : "_ZTI12audio_uuid_s",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input",
     "referenced_type" : "_ZTI19audio_input_flags_t"
    },
    {
     "field_name" : "output",
     "referenced_type" : "_ZTI20audio_output_flags_t"
    }
   ],
   "linker_set_key" : "_ZTI14audio_io_flags",
   "name" : "audio_io_flags",
   "record_kind" : "union",
   "referenced_type" : "_ZTI14audio_io_flags",
   "self_type" : "_ZTI14audio_io_flags",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reset",
     "referenced_type" : "_ZTIPFvP14resampler_itfeE"
    },
    {
     "field_name" : "resample_from_provider",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP14resampler_itfePsPjE"
    },
    {
     "field_name" : "resample_from_input",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP14resampler_itfePsPjS1_S2_E"
    },
    {
     "field_name" : "delay_ns",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP14resampler_itfeE"
    }
   ],
   "linker_set_key" : "_ZTI14resampler_itfe",
   "name" : "resampler_itfe",
   "referenced_type" : "_ZTI14resampler_itfe",
   "self_type" : "_ZTI14resampler_itfe",
   "size" : 16,
   "source_file" : "/system/media/audio_utils/include/audio_utils/resampler.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI21audio_utils_fifo_base"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFrameSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "field_offset" : 288,
     "referenced_type" : "_ZTIKPv"
    },
    {
     "access" : "private",
     "field_name" : "mSingleProcessSharedRear",
     "field_offset" : 320,
     "referenced_type" : "_ZTI22audio_utils_fifo_index"
    },
    {
     "access" : "private",
     "field_name" : "mSingleProcessSharedFront",
     "field_offset" : 352,
     "referenced_type" : "_ZTI22audio_utils_fifo_index"
    }
   ],
   "linker_set_key" : "_ZTI16audio_utils_fifo",
   "name" : "audio_utils_fifo",
   "record_kind" : "class",
   "referenced_type" : "_ZTI16audio_utils_fifo",
   "self_type" : "_ZTI16audio_utils_fifo",
   "size" : 48,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN16resampler_bufferUt_E"
    },
    {
     "field_name" : "frame_count",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16resampler_buffer",
   "name" : "resampler_buffer",
   "referenced_type" : "_ZTI16resampler_buffer",
   "self_type" : "_ZTI16resampler_buffer",
   "size" : 8,
   "source_file" : "/system/media/audio_utils/include/audio_utils/resampler.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sample_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14audio_format_t"
    }
   ],
   "linker_set_key" : "_ZTI17audio_config_base",
   "name" : "audio_config_base",
   "referenced_type" : "_ZTI17audio_config_base",
   "self_type" : "_ZTI17audio_config_base",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "values",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA32_i"
    },
    {
     "field_name" : "ramp_duration_ms",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17audio_gain_config",
   "name" : "audio_gain_config",
   "referenced_type" : "_ZTI17audio_gain_config",
   "self_type" : "_ZTI17audio_gain_config",
   "size" : 144,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "_ZTI17audio_port_role_t"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI17audio_port_type_t"
    },
    {
     "field_name" : "config_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "gain",
     "field_offset" : 224,
     "referenced_type" : "_ZTI17audio_gain_config"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1376,
     "referenced_type" : "_ZTI14audio_io_flags"
    },
    {
     "field_name" : "ext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIN17audio_port_configUt_E"
    }
   ],
   "linker_set_key" : "_ZTI17audio_port_config",
   "name" : "audio_port_config",
   "referenced_type" : "_ZTI17audio_port_config",
   "self_type" : "_ZTI17audio_port_config",
   "size" : 216,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mLength",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17audio_utils_iovec",
   "name" : "audio_utils_iovec",
   "referenced_type" : "_ZTI17audio_utils_iovec",
   "self_type" : "_ZTI17audio_utils_iovec",
   "size" : 8,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "content_type",
     "referenced_type" : "_ZTI20audio_content_type_t"
    },
    {
     "field_name" : "usage",
     "field_offset" : 32,
     "referenced_type" : "_ZTI13audio_usage_t"
    },
    {
     "field_name" : "source",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14audio_source_t"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI18audio_attributes_t",
   "name" : "audio_attributes_t",
   "referenced_type" : "_ZTI18audio_attributes_t",
   "self_type" : "_ZTI18audio_attributes_t",
   "size" : 272,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "handle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "latency_class",
     "field_offset" : 64,
     "referenced_type" : "_ZTI25audio_mix_latency_class_t"
    }
   ],
   "linker_set_key" : "_ZTI18audio_port_mix_ext",
   "name" : "audio_port_mix_ext",
   "referenced_type" : "_ZTI18audio_port_mix_ext",
   "self_type" : "_ZTI18audio_port_mix_ext",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "time_nanoseconds",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "position_frames",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI19audio_mmap_position",
   "name" : "audio_mmap_position",
   "referenced_type" : "_ZTI19audio_mmap_position",
   "self_type" : "_ZTI19audio_mmap_position",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mSpeed",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "mPitch",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "mStretchMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI32audio_timestretch_stretch_mode_t"
    },
    {
     "field_name" : "mFallbackMode",
     "field_offset" : 96,
     "referenced_type" : "_ZTI33audio_timestretch_fallback_mode_t"
    }
   ],
   "linker_set_key" : "_ZTI19audio_playback_rate",
   "name" : "audio_playback_rate",
   "referenced_type" : "_ZTI19audio_playback_rate",
   "self_type" : "_ZTI19audio_playback_rate",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "read",
     "referenced_type" : "_ZTIPFiP19echo_reference_itfeP21echo_reference_bufferE"
    },
    {
     "field_name" : "write",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP19echo_reference_itfeP21echo_reference_bufferE"
    }
   ],
   "linker_set_key" : "_ZTI19echo_reference_itfe",
   "name" : "echo_reference_itfe",
   "referenced_type" : "_ZTI19echo_reference_itfe",
   "self_type" : "_ZTI19echo_reference_itfe",
   "size" : 8,
   "source_file" : "/system/media/audio_utils/include/audio_utils/echo_reference.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "stream_type",
     "field_offset" : 128,
     "referenced_type" : "_ZTI19audio_stream_type_t"
    },
    {
     "field_name" : "bit_rate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "duration_us",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "has_video",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "is_streaming",
     "field_offset" : 264,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "bit_width",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offload_buffer_size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usage",
     "field_offset" : 352,
     "referenced_type" : "_ZTI13audio_usage_t"
    },
    {
     "field_name" : "encapsulation_mode",
     "field_offset" : 384,
     "referenced_type" : "_ZTI26audio_encapsulation_mode_t"
    },
    {
     "field_name" : "content_id",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sync_id",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20audio_offload_info_t",
   "name" : "audio_offload_info_t",
   "referenced_type" : "_ZTI20audio_offload_info_t",
   "self_type" : "_ZTI20audio_offload_info_t",
   "size" : 64,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTI21audio_port_device_ext",
   "name" : "audio_port_device_ext",
   "referenced_type" : "_ZTI21audio_port_device_ext",
   "self_type" : "_ZTI21audio_port_device_ext",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFrameCount",
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "mFrameCountP2",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "mFudgeFactor",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "mWriterRear",
     "field_offset" : 96,
     "referenced_type" : "_ZTIR22audio_utils_fifo_index"
    },
    {
     "access" : "protected",
     "field_name" : "mWriterRearSync",
     "field_offset" : 128,
     "referenced_type" : "_ZTIK21audio_utils_fifo_sync"
    },
    {
     "access" : "protected",
     "field_name" : "mThrottleFront",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKP22audio_utils_fifo_index"
    },
    {
     "access" : "protected",
     "field_name" : "mThrottleFrontSync",
     "field_offset" : 192,
     "referenced_type" : "_ZTIK21audio_utils_fifo_sync"
    },
    {
     "access" : "protected",
     "field_name" : "mIsShutdown",
     "field_offset" : 224,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI21audio_utils_fifo_base",
   "name" : "audio_utils_fifo_base",
   "record_kind" : "class",
   "referenced_type" : "_ZTI21audio_utils_fifo_base",
   "self_type" : "_ZTI21audio_utils_fifo_base",
   "size" : 32,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "raw",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "frame_count",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "delay_ns",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "time_stamp",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI21echo_reference_buffer",
   "name" : "echo_reference_buffer",
   "referenced_type" : "_ZTI21echo_reference_buffer",
   "self_type" : "_ZTI21echo_reference_buffer",
   "size" : 20,
   "source_file" : "/system/media/audio_utils/include/audio_utils/echo_reference.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "source",
     "referenced_type" : "_ZTI14audio_source_t"
    },
    {
     "field_name" : "gain",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "dest_device",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dest_device_address",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTI21record_track_metadata",
   "name" : "record_track_metadata",
   "referenced_type" : "_ZTI21record_track_metadata",
   "self_type" : "_ZTI21record_track_metadata",
   "size" : 44,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shared_memory_address",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "shared_memory_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "buffer_size_frames",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "burst_size_frames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22audio_mmap_buffer_flag"
    }
   ],
   "linker_set_key" : "_ZTI22audio_mmap_buffer_info",
   "name" : "audio_mmap_buffer_info",
   "referenced_type" : "_ZTI22audio_mmap_buffer_info",
   "self_type" : "_ZTI22audio_mmap_buffer_info",
   "size" : 20,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI15audio_session_t"
    }
   ],
   "linker_set_key" : "_ZTI22audio_port_session_ext",
   "name" : "audio_port_session_ext",
   "referenced_type" : "_ZTI22audio_port_session_ext",
   "self_type" : "_ZTI22audio_port_session_ext",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mIndex",
     "referenced_type" : "_ZTINSt3__16atomicIjEE"
    }
   ],
   "linker_set_key" : "_ZTI22audio_utils_fifo_index",
   "name" : "audio_utils_fifo_index",
   "record_kind" : "class",
   "referenced_type" : "_ZTI22audio_utils_fifo_index",
   "self_type" : "_ZTI22audio_utils_fifo_index",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo_index.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI25audio_utils_fifo_provider"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLocalFront",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mThrottleFront",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP22audio_utils_fifo_index"
    },
    {
     "access" : "private",
     "field_name" : "mFlush",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mArmLevel",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mTriggerLevel",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mIsArmed",
     "field_offset" : 352,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mTotalLost",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "mTotalFlushed",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI23audio_utils_fifo_reader",
   "name" : "audio_utils_fifo_reader",
   "record_kind" : "class",
   "referenced_type" : "_ZTI23audio_utils_fifo_reader",
   "self_type" : "_ZTI23audio_utils_fifo_reader",
   "size" : 64,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI23audio_utils_fifo_reader"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN23audio_utils_fifo_readerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN23audio_utils_fifo_readerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_reader6obtainEP17audio_utils_iovecjPK8timespec"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_reader7releaseEj"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_reader9availableEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI25audio_utils_fifo_provider"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLocalRear",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mArmLevel",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mTriggerLevel",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mIsArmed",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mEffectiveFrames",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23audio_utils_fifo_writer",
   "name" : "audio_utils_fifo_writer",
   "record_kind" : "class",
   "referenced_type" : "_ZTI23audio_utils_fifo_writer",
   "self_type" : "_ZTI23audio_utils_fifo_writer",
   "size" : 48,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI23audio_utils_fifo_writer"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN23audio_utils_fifo_writerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN23audio_utils_fifo_writerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_writer6obtainEP17audio_utils_iovecjPK8timespec"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_writer7releaseEj"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_writer9availableEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "time",
     "referenced_type" : "_ZTIA19_c"
    }
   ],
   "linker_set_key" : "_ZTI23audio_utils_time_string",
   "name" : "audio_utils_time_string",
   "referenced_type" : "_ZTI23audio_utils_time_string",
   "self_type" : "_ZTI23audio_utils_time_string",
   "size" : 19,
   "source_file" : "/system/media/audio_utils/include/audio_utils/clock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "usage",
     "referenced_type" : "_ZTI13audio_usage_t"
    },
    {
     "field_name" : "content_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTI20audio_content_type_t"
    },
    {
     "field_name" : "gain",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI23playback_track_metadata",
   "name" : "playback_track_metadata",
   "referenced_type" : "_ZTI23playback_track_metadata",
   "self_type" : "_ZTI23playback_track_metadata",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "handle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usecase",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN25audio_port_config_mix_extUt_E"
    }
   ],
   "linker_set_key" : "_ZTI25audio_port_config_mix_ext",
   "name" : "audio_port_config_mix_ext",
   "referenced_type" : "_ZTI25audio_port_config_mix_ext",
   "self_type" : "_ZTI25audio_port_config_mix_ext",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFifo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIR16audio_utils_fifo"
    },
    {
     "access" : "protected",
     "field_name" : "mObtained",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mTotalReleased",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI25audio_utils_fifo_provider",
   "name" : "audio_utils_fifo_provider",
   "record_kind" : "class",
   "referenced_type" : "_ZTI25audio_utils_fifo_provider",
   "self_type" : "_ZTI25audio_utils_fifo_provider",
   "size" : 24,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25audio_utils_fifo_provider"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25audio_utils_fifo_providerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25audio_utils_fifo_providerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN25audio_utils_fifo_provider6obtainEP17audio_utils_iovecjPK8timespec"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN25audio_utils_fifo_provider7releaseEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN25audio_utils_fifo_provider9availableEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_next_buffer",
     "referenced_type" : "_ZTIPFiP25resampler_buffer_providerP16resampler_bufferE"
    },
    {
     "field_name" : "release_buffer",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvP25resampler_buffer_providerP16resampler_bufferE"
    }
   ],
   "linker_set_key" : "_ZTI25resampler_buffer_provider",
   "name" : "resampler_buffer_provider",
   "referenced_type" : "_ZTI25resampler_buffer_provider",
   "self_type" : "_ZTI25resampler_buffer_provider",
   "size" : 8,
   "source_file" : "/system/media/audio_utils/include/audio_utils/resampler.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI27audio_microphone_coordinate",
   "name" : "audio_microphone_coordinate",
   "referenced_type" : "_ZTI27audio_microphone_coordinate",
   "self_type" : "_ZTI27audio_microphone_coordinate",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTI28audio_port_config_device_ext",
   "name" : "audio_port_config_device_ext",
   "referenced_type" : "_ZTI28audio_port_config_device_ext",
   "self_type" : "_ZTI28audio_port_config_device_ext",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI15audio_session_t"
    }
   ],
   "linker_set_key" : "_ZTI29audio_port_config_session_ext",
   "name" : "audio_port_config_session_ext",
   "referenced_type" : "_ZTI29audio_port_config_session_ext",
   "self_type" : "_ZTI29audio_port_config_session_ext",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device_id",
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "id",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "device",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "address",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "channel_mapping",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA30_34audio_microphone_channel_mapping_t"
    },
    {
     "field_name" : "location",
     "field_offset" : 1536,
     "referenced_type" : "_ZTI27audio_microphone_location_t"
    },
    {
     "field_name" : "group",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "index_in_the_group",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sensitivity",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "max_spl",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "min_spl",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "directionality",
     "field_offset" : 1728,
     "referenced_type" : "_ZTI33audio_microphone_directionality_t"
    },
    {
     "field_name" : "num_frequency_responses",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "frequency_responses",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIA2_A256_f"
    },
    {
     "field_name" : "geometric_location",
     "field_offset" : 18176,
     "referenced_type" : "_ZTI27audio_microphone_coordinate"
    },
    {
     "field_name" : "orientation",
     "field_offset" : 18272,
     "referenced_type" : "_ZTI27audio_microphone_coordinate"
    }
   ],
   "linker_set_key" : "_ZTI33audio_microphone_characteristic_t",
   "name" : "audio_microphone_characteristic_t",
   "referenced_type" : "_ZTI33audio_microphone_characteristic_t",
   "self_type" : "_ZTI33audio_microphone_characteristic_t",
   "size" : 2296,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mIndex",
     "referenced_type" : "_ZTIR22audio_utils_fifo_index"
    },
    {
     "access" : "private",
     "field_name" : "mValue",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mLoaded",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI37RefIndexCachedLoadAcquireDeferredWait",
   "name" : "RefIndexCachedLoadAcquireDeferredWait",
   "record_kind" : "class",
   "referenced_type" : "_ZTI37RefIndexCachedLoadAcquireDeferredWait",
   "self_type" : "_ZTI37RefIndexCachedLoadAcquireDeferredWait",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo_index.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mIndex",
     "referenced_type" : "_ZTIR22audio_utils_fifo_index"
    },
    {
     "access" : "private",
     "field_name" : "mValue",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mWriteback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mWaiters",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mWakeOp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI40RefIndexDeferredStoreReleaseDeferredWake",
   "name" : "RefIndexDeferredStoreReleaseDeferredWake",
   "record_kind" : "class",
   "referenced_type" : "_ZTI40RefIndexDeferredStoreReleaseDeferredWake",
   "self_type" : "_ZTI40RefIndexDeferredStoreReleaseDeferredWake",
   "size" : 20,
   "source_file" : "/system/media/audio_utils/include/audio_utils/fifo_index.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "_ZTI21audio_port_device_ext"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "_ZTI18audio_port_mix_ext"
    },
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI22audio_port_session_ext"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10audio_portUt_E",
   "name" : "audio_port::(anonymous union at system/media/audio/include/system/audio.h:562:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10audio_portUt_E",
   "self_type" : "_ZTIN10audio_portUt_E",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "raw",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "i16",
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "i8",
     "referenced_type" : "_ZTIPa"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN16resampler_bufferUt_E",
   "name" : "resampler_buffer::(anonymous union at system/media/audio_utils/include/audio_utils/resampler.h:33:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN16resampler_bufferUt_E",
   "self_type" : "_ZTIN16resampler_bufferUt_E",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/resampler.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "_ZTI28audio_port_config_device_ext"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "_ZTI25audio_port_config_mix_ext"
    },
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI29audio_port_config_session_ext"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN17audio_port_configUt_E",
   "name" : "audio_port_config::(anonymous union at system/media/audio/include/system/audio.h:511:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN17audio_port_configUt_E",
   "self_type" : "_ZTIN17audio_port_configUt_E",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "_ZTI19audio_stream_type_t"
    },
    {
     "field_name" : "source",
     "referenced_type" : "_ZTI14audio_source_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN25audio_port_config_mix_extUt_E",
   "name" : "audio_port_config_mix_ext::(anonymous union at system/media/audio/include/system/audio.h:484:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN25audio_port_config_mix_extUt_E",
   "self_type" : "_ZTIN25audio_port_config_mix_extUt_E",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBalance",
     "referenced_type" : "_ZTIf"
    },
    {
     "access" : "private",
     "field_name" : "mVolumes",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mChannelMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mChannelCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mSides",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mRamp",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mRampBalance",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    },
    {
     "access" : "private",
     "field_name" : "mRampVolumes",
     "field_offset" : 352,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mCurve",
     "field_offset" : 448,
     "referenced_type" : "_ZTIKNSt3__18functionIFffEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils7BalanceE",
   "name" : "android::audio_utils::Balance",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils7BalanceE",
   "self_type" : "_ZTIN7android11audio_utils7BalanceE",
   "size" : 80,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Balance.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata13compound_typeIJEEE",
   "name" : "android::audio_utils::metadata::compound_type<>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJEEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJEEE",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdEEE",
   "name" : "android::audio_utils::metadata::compound_type<int, long long, float, double>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdEEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdEEE",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_4DataEEEE",
   "name" : "android::audio_utils::metadata::compound_type<int, long long, float, double, basic_string<char>, Data>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_4DataEEEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_4DataEEEE",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEENS3_6vectorEEE",
   "name" : "android::audio_utils::metadata::is_specialization<std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::audio_utils::metadata::Datum, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::audio_utils::metadata::Datum> > >, std::vector>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEENS3_6vectorEEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEENS3_6vectorEEE",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumENS_4lessIS6_EENS4_INS_4pairIKS6_SA_EEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEES4_EE",
   "name" : "android::audio_utils::metadata::is_specialization<std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::audio_utils::metadata::Datum, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::audio_utils::metadata::Datum> > >, std::map>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEES4_EE",
   "self_type" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEES4_EE",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumENS_4lessIS6_EENS4_INS_4pairIKS6_SA_EEEEEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyINS1_4DataEvEE",
   "name" : "android::audio_utils::metadata::Key<android::audio_utils::metadata::Data, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyINS1_4DataEvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyINS1_4DataEvEE",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" : [ "_ZTIN7android11audio_utils8metadata4DataE", "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE",
   "name" : "android::audio_utils::metadata::Key<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyIdvEE",
   "name" : "android::audio_utils::metadata::Key<double, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyIdvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyIdvEE",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" : [ "_ZTId", "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyIfvEE",
   "name" : "android::audio_utils::metadata::Key<float, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyIfvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyIfvEE",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" : [ "_ZTIf", "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyIivEE",
   "name" : "android::audio_utils::metadata::Key<int, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyIivEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyIivEE",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" : [ "_ZTIi", "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyIxvEE",
   "name" : "android::audio_utils::metadata::Key<long long, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyIxvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyIxvEE",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" : [ "_ZTIx", "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumENS_4lessIS6_EENS4_INS_4pairIKS6_SA_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata4DataE",
   "name" : "android::audio_utils::metadata::Data",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata4DataE",
   "self_type" : "_ZTIN7android11audio_utils8metadata4DataE",
   "size" : 12,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__13anyE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata5DatumE",
   "name" : "android::audio_utils::metadata::Datum",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata5DatumE",
   "self_type" : "_ZTIN7android11audio_utils8metadata5DatumE",
   "size" : 16,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata8any_typeE",
   "name" : "android::audio_utils::metadata::any_type",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata8any_typeE",
   "self_type" : "_ZTIN7android11audio_utils8metadata8any_typeE",
   "size" : 1,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mCode",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mFirstTime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "mLastTime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN7android8ErrorLogIiE5EntryE",
   "name" : "android::ErrorLog<int>::Entry",
   "referenced_type" : "_ZTIN7android8ErrorLogIiE5EntryE",
   "self_type" : "_ZTIN7android8ErrorLogIiE5EntryE",
   "size" : 24,
   "source_file" : "/system/media/audio_utils/include/audio_utils/ErrorLog.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mErrors",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "mIdx",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mAggregateNs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKx"
    },
    {
     "access" : "private",
     "field_name" : "mEntries",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIN7android8ErrorLogIiE5EntryENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8ErrorLogIiEE",
   "name" : "android::ErrorLog<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8ErrorLogIiEE",
   "self_type" : "_ZTIN7android8ErrorLogIiEE",
   "size" : 48,
   "source_file" : "/system/media/audio_utils/include/audio_utils/ErrorLog.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentTime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentEnergy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentFrames",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mIdx",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mConsecutiveZeroes",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mSampleRate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mChannelCount",
     "field_offset" : 288,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTIK14audio_format_t"
    },
    {
     "access" : "private",
     "field_name" : "mFramesPerEntry",
     "field_offset" : 352,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mEntries",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairIxfEENS_9allocatorIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8PowerLogE",
   "name" : "android::PowerLog",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8PowerLogE",
   "self_type" : "_ZTIN7android8PowerLogE",
   "size" : 64,
   "source_file" : "/system/media/audio_utils/include/audio_utils/PowerLog.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIA5121_h"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "_ZTI12logger_entry"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7log_msgUt_E",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:77:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7log_msgUt_E",
   "self_type" : "_ZTIN7log_msgUt_E",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android11audio_utils8metadata4DataE",
   "name" : "android::audio_utils::metadata::Data &&",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata4DataE",
   "self_type" : "_ZTION7android11audio_utils8metadata4DataE",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char> > &&",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIOd",
   "name" : "double &&",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIOd",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIOf",
   "name" : "float &&",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIOf",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIOi",
   "name" : "int &&",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIOi",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIOx",
   "name" : "long long &&",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIOx",
   "size" : 4,
   "source_file" : "/system/media/audio_utils/include/audio_utils/Metadata.h"
  }
 ]
}
