{
 "array_types" :
 [
  {
   "linker_set_key" : "char []",
   "name" : "char []",
   "referenced_type" : "type-9",
   "self_type" : "type-8",
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-86",
   "self_type" : "type-85",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "double",
   "name" : "double",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float",
   "name" : "float",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "long",
   "name" : "long",

   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-370",
   "self_type" : "type-369",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-379",
   "self_type" : "type-378",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-383",
   "self_type" : "type-382",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-396",
   "self_type" : "type-395",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-411",
   "self_type" : "type-410",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-414",
   "self_type" : "type-413",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-418",
   "self_type" : "type-417",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-430",
   "self_type" : "type-429",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-437",
   "self_type" : "type-436",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-446",
   "self_type" : "type-445",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-44",
   "self_type" : "type-43",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-456",
   "self_type" : "type-455",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-464",
   "self_type" : "type-463",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-472",
   "self_type" : "type-471",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-475",
   "self_type" : "type-474",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-47",
   "self_type" : "type-46",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-61",
   "self_type" : "type-60",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-80",
   "self_type" : "type-79",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-88",
   "self_type" : "type-87",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-99",
   "self_type" : "type-98",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-131",
   "size" : 4,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-50",
   "self_type" : "type-49",
   "source_file" : "/system/core/liblog/include/log/log.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "uid",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pid",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tid",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tag",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "tagLen",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "messageLen",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "message",
     "field_offset" : 288,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "AndroidLogEntry_t",
   "name" : "AndroidLogEntry_t",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 40,
   "source_file" : "/system/core/liblog/include/log/logprint.h",
   "unique_id" : "AndroidLogEntry_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android_event_header_t",
   "name" : "android_event_header_t",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 4,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_header_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android_event_int_t",
   "name" : "android_event_int_t",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_int_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "android_event_long_t",
   "name" : "android_event_long_t",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_long_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "length",
     "field_offset" : 8,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "data",
     "field_offset" : 40,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "android_event_string_t",
   "name" : "android_event_string_t",
   "referenced_type" : "type-164",
   "self_type" : "type-164",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_string_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "payload",
     "field_offset" : 32,
     "referenced_type" : "type-160"
    }
   ],
   "linker_set_key" : "android_log_event_int_t",
   "name" : "android_log_event_int_t",
   "referenced_type" : "type-161",
   "self_type" : "type-161",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_event_int_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx",
     "referenced_type" : "type-147"
    },
    {
     "access" : "private",
     "field_name" : "ret",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android_log_event_list",
   "name" : "android_log_event_list",
   "record_kind" : "class",
   "referenced_type" : "type-150",
   "self_type" : "type-150",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h",
   "unique_id" : "_ZTS22android_log_event_list"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "payload",
     "field_offset" : 32,
     "referenced_type" : "type-162"
    }
   ],
   "linker_set_key" : "android_log_event_long_t",
   "name" : "android_log_event_long_t",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 13,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_event_long_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "length",
     "field_offset" : 40,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "data",
     "field_offset" : 72,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "android_log_event_string_t",
   "name" : "android_log_event_string_t",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_event_string_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "tid",
     "field_offset" : 8,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "realtime",
     "field_offset" : 24,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android_log_header_t",
   "name" : "android_log_header_t",
   "referenced_type" : "type-159",
   "self_type" : "type-159",
   "size" : 11,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_header_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-126"
    },
    {
     "field_name" : "complete",
     "field_offset" : 32,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "len",
     "field_offset" : 48,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "android_log_list_element",
   "name" : "android_log_list_element",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h",
   "unique_id" : "android_log_list_element"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int32",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "int64",
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "string",
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "float32",
     "referenced_type" : "type-146"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:53:3) at system/core/liblog/include/log/log_event_list.h:53:3",
   "name" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:53:3) at system/core/liblog/include/log/log_event_list.h:53:3",
   "record_kind" : "union",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h",
   "unique_id" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:53:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "len",
     "field_offset" : 8,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "uid",
     "field_offset" : 24,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pid",
     "field_offset" : 40,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android_pmsg_log_header_t",
   "name" : "android_pmsg_log_header_t",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 7,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_pmsg_log_header_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-85"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-52"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-34"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:139:3) at system/core/liblog/include/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:139:3) at system/core/liblog/include/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h",
   "unique_id" : "log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-53"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-63"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  }
 ],
 "rvalue_reference_types" : []
}
