{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [10]",
   "name" : "char [10]",
   "referenced_type" : "type-294",
   "self_type" : "type-295",
   "size" : 10,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_modf.c"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "double [10]",
   "name" : "double [10]",
   "referenced_type" : "type-4",
   "self_type" : "type-658",
   "size" : 80,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "double [11]",
   "name" : "double [11]",
   "referenced_type" : "type-4",
   "self_type" : "type-118",
   "size" : 88,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_atan.c"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "double [129]",
   "name" : "double [129]",
   "referenced_type" : "type-4",
   "self_type" : "type-41",
   "size" : 1032,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/bsdsrc/b_log.c"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "double [16]",
   "name" : "double [16]",
   "referenced_type" : "type-4",
   "self_type" : "type-113",
   "size" : 128,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_tan.c"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "double [2]",
   "name" : "double [2]",
   "referenced_type" : "type-4",
   "self_type" : "type-19",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {

  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-12",
   "self_type" : "type-106",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_exp.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "is_volatile" : true,
   "linker_set_key" : "const volatile double",
   "name" : "const volatile double",
   "referenced_type" : "type-4",
   "self_type" : "type-57",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/catrig.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "is_volatile" : true,
   "linker_set_key" : "const volatile float",
   "name" : "const volatile float",
   "referenced_type" : "type-8",
   "self_type" : "type-58",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/catrig.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "double const[11]",
   "name" : "double const[11]",
   "referenced_type" : "type-118",
   "self_type" : "type-119",
   "size" : 88,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_atan.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "double const[16]",
   "name" : "double const[16]",
   "referenced_type" : "type-113",
   "self_type" : "type-114",
   "size" : 128,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_tan.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "double const[2]",
   "name" : "double const[2]",
   "referenced_type" : "type-19",
   "self_type" : "type-18",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_fmod.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "double const[4]",
   "name" : "double const[4]",
   "referenced_type" : "type-116",
   "self_type" : "type-117",
   "size" : 32,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_atan.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "double const[5]",
   "name" : "double const[5]",
   "referenced_type" : "type-30",
   "self_type" : "type-31",
   "size" : 40,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_j0.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "double const[6]",
   "name" : "double const[6]",
   "referenced_type" : "type-28",
   "self_type" : "type-29",
   "size" : 48,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_j0.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "double const[8]",
   "name" : "double const[8]",
   "referenced_type" : "type-111",
   "self_type" : "type-112",
   "size" : 64,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_rem_pio2.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "float const[2]",
   "name" : "float const[2]",
   "referenced_type" : "type-23",
   "self_type" : "type-22",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_fmodf.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "float const[4]",
   "name" : "float const[4]",
   "referenced_type" : "type-120",
   "self_type" : "type-121",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_atanf.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "float const[5]",
   "name" : "float const[5]",
   "referenced_type" : "type-35",
   "self_type" : "type-36",
   "size" : 20,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_j0f.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "float const[6]",
   "name" : "float const[6]",
   "referenced_type" : "type-33",
   "self_type" : "type-34",
   "size" : 24,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_j0f.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[4]",
   "name" : "int const[4]",
   "referenced_type" : "type-107",
   "self_type" : "type-108",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_rem_pio2.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[66]",
   "name" : "int const[66]",
   "referenced_type" : "type-109",
   "self_type" : "type-110",
   "size" : 264,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_rem_pio2.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "sincos_t const[2]",
   "name" : "sincos_t const[2]",
   "referenced_type" : "type-670",
   "self_type" : "type-671",
   "size" : 224,
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "unsigned int const[24]",
   "name" : "unsigned int const[24]",
   "referenced_type" : "type-1250",
   "self_type" : "type-1251",
   "size" : 96,
   "source_file" : "/external/arm-optimized-routines/math/sincosf_data.c"
  },
  {
   "is_const" : true,
   "linker_set_key" : "unsigned int const[]",
   "name" : "unsigned int const[]",
   "referenced_type" : "type-672",
   "self_type" : "type-673",
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "volatile double",
   "name" : "volatile double",
   "referenced_type" : "type-4",
   "self_type" : "type-3",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_acos.c"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile float",
   "name" : "volatile float",
   "referenced_type" : "type-8",
   "self_type" : "type-7",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_acosf.c"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "Double",
   "name" : "Double",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/bsdsrc/mathimpl.h",
   "unique_id" : "Double"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-189"
    }
   ],
   "linker_set_key" : "IEEEd2bits",
   "name" : "IEEEd2bits",
   "record_kind" : "union",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEd2bits"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-624"
    }
   ],
   "linker_set_key" : "IEEEd2bits",
   "name" : "IEEEd2bits",
   "record_kind" : "union",
   "referenced_type" : "type-623",
   "self_type" : "type-623",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTS10IEEEd2bits"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "manh",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "exp",
     "field_offset" : 52,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sign",
     "field_offset" : 63,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3) at bionic/libm/fpmath.h:54:3",
   "name" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3) at bionic/libm/fpmath.h:54:3",
   "referenced_type" : "type-189",
   "self_type" : "type-189",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "manh",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "exp",
     "field_offset" : 52,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sign",
     "field_offset" : 63,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3) at bionic/libm/fpmath.h:54:3",
   "name" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3) at bionic/libm/fpmath.h:54:3",
   "referenced_type" : "type-624",
   "self_type" : "type-624",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTSN10IEEEd2bitsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-187"
    }
   ],
   "linker_set_key" : "IEEEf2bits",
   "name" : "IEEEf2bits",
   "record_kind" : "union",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEf2bits"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-627"
    }
   ],
   "linker_set_key" : "IEEEf2bits",
   "name" : "IEEEf2bits",
   "record_kind" : "union",
   "referenced_type" : "type-626",
   "self_type" : "type-626",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTS10IEEEf2bits"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "man",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "exp",
     "field_offset" : 23,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sign",
     "field_offset" : 31,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3) at bionic/libm/fpmath.h:42:3",
   "name" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3) at bionic/libm/fpmath.h:42:3",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "man",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "exp",
     "field_offset" : 23,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sign",
     "field_offset" : 31,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3) at bionic/libm/fpmath.h:42:3",
   "name" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3) at bionic/libm/fpmath.h:42:3",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTSN10IEEEf2bitsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "__kernel_fsid_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "lo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "dd",
   "name" : "dd",
   "referenced_type" : "type-340",
   "self_type" : "type-340",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_fma.c",
   "unique_id" : "dd"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "double_complex",
   "name" : "double_complex",
   "record_kind" : "union",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "double_complex"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-654"
    },
    {
     "field_name" : "shift_scaled",
     "field_offset" : 2048,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "type-633"
    },
    {
     "field_name" : "shift",
     "field_offset" : 2304,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "invln2_scaled",
     "field_offset" : 2368,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly_scaled",
     "field_offset" : 2432,
     "referenced_type" : "type-633"
    }
   ],
   "linker_set_key" : "exp2f_data",
   "name" : "exp2f_data",
   "referenced_type" : "type-653",
   "self_type" : "type-653",
   "size" : 328,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "exp2f_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invln2N",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "shift",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "negln2hiN",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "negln2loN",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 256,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "exp2_shift",
     "field_offset" : 512,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "exp2_poly",
     "field_offset" : 576,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "tab",
     "field_offset" : 896,
     "referenced_type" : "type-645"
    }
   ],
   "linker_set_key" : "exp_data",
   "name" : "exp_data",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 2160,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "exp_data"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "float_complex",
   "name" : "float_complex",
   "record_kind" : "union",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "float_complex"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "parts",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "xparts",
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "ieee_double_shape_type",
   "name" : "ieee_double_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "msw",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3",
   "name" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "w",
     "referenced_type" : "type-14"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3",
   "name" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "msw",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3",
   "name" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "w",
     "referenced_type" : "type-14"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3",
   "name" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "word",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "ieee_float_shape_type",
   "name" : "ieee_float_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_float_shape_type"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "parts32",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "parts64",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "ieee_quad_shape_type",
   "name" : "ieee_quad_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lswlo",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lswhi",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mswlo",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mswhi",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "msw",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lswlo",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lswhi",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mswlo",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mswhi",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "msw",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3",
   "referenced_type" : "type-45",
   "self_type" : "type-45",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invln2hi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "invln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 512,
     "referenced_type" : "type-658"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "type-659"
    },
    {
     "field_name" : "tab2",
     "field_offset" : 9344,
     "referenced_type" : "type-661"
    }
   ],
   "linker_set_key" : "log2_data",
   "name" : "log2_data",
   "referenced_type" : "type-656",
   "self_type" : "type-656",
   "size" : 2192,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log2_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:388:3) at /external/arm-optimized-routines/math/math_config.h:388:3",
   "name" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:388:3) at /external/arm-optimized-routines/math/math_config.h:388:3",
   "referenced_type" : "type-660",
   "self_type" : "type-660",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:388:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "chi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "clo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:390:3) at /external/arm-optimized-routines/math/math_config.h:390:3",
   "name" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:390:3) at /external/arm-optimized-routines/math/math_config.h:390:3",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:390:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-635"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "log2f_data",
   "name" : "log2f_data",
   "referenced_type" : "type-634",
   "self_type" : "type-634",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log2f_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log2f_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:317:3) at /external/arm-optimized-routines/math/math_config.h:317:3",
   "name" : "log2f_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:317:3) at /external/arm-optimized-routines/math/math_config.h:317:3",
   "referenced_type" : "type-636",
   "self_type" : "type-636",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log2f_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:317:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 448,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "type-649"
    },
    {
     "field_name" : "tab2",
     "field_offset" : 17536,
     "referenced_type" : "type-651"
    }
   ],
   "linker_set_key" : "log_data",
   "name" : "log_data",
   "referenced_type" : "type-647",
   "self_type" : "type-647",
   "size" : 4240,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:373:3) at /external/arm-optimized-routines/math/math_config.h:373:3",
   "name" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:373:3) at /external/arm-optimized-routines/math/math_config.h:373:3",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:373:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "chi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "clo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:375:3) at /external/arm-optimized-routines/math/math_config.h:375:3",
   "name" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:375:3) at /external/arm-optimized-routines/math/math_config.h:375:3",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:375:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-630"
    },
    {
     "field_name" : "ln2",
     "field_offset" : 2048,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "type-633"
    }
   ],
   "linker_set_key" : "logf_data",
   "name" : "logf_data",
   "referenced_type" : "type-632",
   "self_type" : "type-632",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "logf_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "logf_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:305:3) at /external/arm-optimized-routines/math/math_config.h:305:3",
   "name" : "logf_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:305:3) at /external/arm-optimized-routines/math/math_config.h:305:3",
   "referenced_type" : "type-629",
   "self_type" : "type-629",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "logf_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:305:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "long_double_complex",
   "name" : "long_double_complex",
   "record_kind" : "union",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "long_double_complex"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-341"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-665"
    },
    {
     "field_name" : "tab",
     "field_offset" : 576,
     "referenced_type" : "type-666"
    }
   ],
   "linker_set_key" : "pow_log_data",
   "name" : "pow_log_data",
   "referenced_type" : "type-664",
   "self_type" : "type-664",
   "size" : 4168,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "pow_log_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pad",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logctail",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3) at /external/arm-optimized-routines/math/math_config.h:402:3",
   "name" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3) at /external/arm-optimized-routines/math/math_config.h:402:3",
   "referenced_type" : "type-667",
   "self_type" : "type-667",
   "size" : 32,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-640"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "powf_log2_data",
   "name" : "powf_log2_data",
   "referenced_type" : "type-639",
   "self_type" : "type-639",
   "size" : 296,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "powf_log2_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "powf_log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:334:3) at /external/arm-optimized-routines/math/math_config.h:334:3",
   "name" : "powf_log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:334:3) at /external/arm-optimized-routines/math/math_config.h:334:3",
   "referenced_type" : "type-641",
   "self_type" : "type-641",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "powf_log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:334:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 24,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-53"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-53"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_spinlock_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sign",
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "hpi_inv",
     "field_offset" : 256,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "hpi",
     "field_offset" : 320,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c0",
     "field_offset" : 384,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c1",
     "field_offset" : 448,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c2",
     "field_offset" : 512,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c3",
     "field_offset" : 576,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c4",
     "field_offset" : 640,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "s1",
     "field_offset" : 704,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "s2",
     "field_offset" : 768,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "s3",
     "field_offset" : 832,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "sincos_t",
   "name" : "sincos_t",
   "referenced_type" : "type-669",
   "self_type" : "type-669",
   "size" : 112,
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h",
   "unique_id" : "sincos_t"
  }
 ],
 "rvalue_reference_types" : []
}
