{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA10_c",
   "name" : "char [10]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA10_c",
   "size" : 10,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA11_c",
   "name" : "char [11]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA11_c",
   "size" : 11,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_m",
   "name" : "unsigned long [128]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA128_m",
   "size" : 512,

  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 4,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 4,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTIVNSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "self_type" : "_ZTIVPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "self_type" : "_ZTIVPFPvjPKvE",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "self_type" : "_ZTIVPFPvjjPKvE",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "_ZTI10__sifields",
   "self_type" : "_ZTI10__sifields",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "referenced_type" : "_ZTI10clone_args",
   "self_type" : "_ZTI10clone_args",
   "size" : 80,
   "source_file" : "/bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10f_owner_ex",
   "name" : "f_owner_ex",
   "referenced_type" : "_ZTI10f_owner_ex",
   "self_type" : "_ZTI10f_owner_ex",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "_ZTI10itimerspec",
   "self_type" : "_ZTI10itimerspec",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "_ZTI10sigcontext",
   "self_type" : "_ZTI10sigcontext",
   "size" : 84,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI10sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "_ZTI10sigset64_t",
   "self_type" : "_ZTI10sigset64_t",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/10.0.5/include/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "referenced_type" : "_ZTI11sched_param",
   "self_type" : "_ZTI11sched_param",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "_ZTI11sigaltstack",
   "self_type" : "_ZTI11sigaltstack",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_N11user_fpregs6fp_regE"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "_ZTI11user_fpregs",
   "self_type" : "_ZTI11user_fpregs",
   "size" : 116,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "_ZTI12user_vfp_exc",
   "self_type" : "_ZTI12user_vfp_exc",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15statx_timestamp",
   "name" : "statx_timestamp",
   "referenced_type" : "_ZTI15statx_timestamp",
   "self_type" : "_ZTI15statx_timestamp",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/stat.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "_ZTI17__kernel_timespec",
   "self_type" : "_ZTI17__kernel_timespec",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "_ZTI18__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "_ZTI19__kernel_itimerspec",
   "self_type" : "_ZTI19__kernel_itimerspec",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "_ZTI19__pthread_cleanup_t",
   "self_type" : "_ZTI19__pthread_cleanup_t",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/pthread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "referenced_type" : "_ZTI21__kernel_old_timespec",
   "self_type" : "_ZTI21__kernel_old_timespec",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "_ZTI21__kernel_sock_timeval",
   "self_type" : "_ZTI21__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 44,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "referenced_type" : "_ZTI4user",
   "self_type" : "_ZTI4user",
   "size" : 296,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5flock",
   "name" : "flock",
   "referenced_type" : "_ZTI5flock",
   "self_type" : "_ZTI5flock",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/flock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5iovec",
   "name" : "iovec",
   "referenced_type" : "_ZTI5iovec",
   "self_type" : "_ZTI5iovec",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/uio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "decimal_point",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_curr_symbol",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "currency_symbol",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_decimal_point",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_thousands_sep",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_grouping",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "positive_sign",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "negative_sign",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_frac_digits",
     "field_offset" : 320,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "frac_digits",
     "field_offset" : 328,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_cs_precedes",
     "field_offset" : 336,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sep_by_space",
     "field_offset" : 344,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_cs_precedes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sep_by_space",
     "field_offset" : 360,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sign_posn",
     "field_offset" : 368,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sign_posn",
     "field_offset" : 376,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_cs_precedes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sep_by_space",
     "field_offset" : 392,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_cs_precedes",
     "field_offset" : 400,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sep_by_space",
     "field_offset" : 408,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sign_posn",
     "field_offset" : 416,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sign_posn",
     "field_offset" : 424,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI5lconv",
   "name" : "lconv",
   "referenced_type" : "_ZTI5lconv",
   "self_type" : "_ZTI5lconv",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/locale.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stx_mask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_blksize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_attributes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_nlink",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_uid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_gid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_mode",
     "field_offset" : 224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__spare0",
     "field_offset" : 240,
     "referenced_type" : "_ZTIA1_t"
    },
    {
     "field_name" : "stx_ino",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_blocks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_attributes_mask",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_atime",
     "field_offset" : 512,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_btime",
     "field_offset" : 640,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_ctime",
     "field_offset" : 768,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_mtime",
     "field_offset" : 896,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_rdev_major",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_rdev_minor",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_dev_major",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_dev_minor",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__spare2",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA14_y"
    }
   ],
   "linker_set_key" : "_ZTI5statx",
   "name" : "statx",
   "referenced_type" : "_ZTI5statx",
   "self_type" : "_ZTI5statx",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/linux/stat.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI6dirent",
   "name" : "dirent",
   "referenced_type" : "_ZTI6dirent",
   "self_type" : "_ZTI6dirent",
   "size" : 280,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/dirent.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/select.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6sigval",
   "self_type" : "_ZTI6sigval",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7flock64",
   "name" : "flock64",
   "referenced_type" : "_ZTI7flock64",
   "self_type" : "_ZTI7flock64",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/flock.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "referenced_type" : "_ZTI7siginfo",
   "self_type" : "_ZTI7siginfo",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "referenced_type" : "_ZTI7timeval",
   "self_type" : "_ZTI7timeval",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI8dirent64",
   "name" : "dirent64",
   "referenced_type" : "_ZTI8dirent64",
   "self_type" : "_ZTI8dirent64",
   "size" : 280,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/dirent.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "referenced_type" : "_ZTI8sigevent",
   "self_type" : "_ZTI8sigevent",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "referenced_type" : "_ZTI8timezone",
   "self_type" : "_ZTI8timezone",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10sigcontext"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIA128_m"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 744,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA32_y"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "_ZTI8user_vfp",
   "self_type" : "_ZTI8user_vfp",
   "size" : 264,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "_ZTI9cpu_set_t",
   "self_type" : "_ZTI9cpu_set_t",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI9imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "_ZTI9imaxdiv_t",
   "self_type" : "_ZTI9imaxdiv_t",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/inttypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "referenced_type" : "_ZTI9itimerval",
   "self_type" : "_ZTI9itimerval",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "_ZTIA18_m"
    }
   ],
   "linker_set_key" : "_ZTI9user_regs",
   "name" : "user_regs",
   "referenced_type" : "_ZTI9user_regs",
   "self_type" : "_ZTI9user_regs",
   "size" : 72,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt0_E",
   "self_type" : "_ZTIN10__sifieldsUt0_E",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt1_E",
   "self_type" : "_ZTIN10__sifieldsUt1_E",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt2_E",
   "self_type" : "_ZTIN10__sifieldsUt2_E",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_E",
   "self_type" : "_ZTIN10__sifieldsUt3_E",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_E",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)",
   "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "self_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt4_E",
   "self_type" : "_ZTIN10__sifieldsUt4_E",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt5_E",
   "self_type" : "_ZTIN10__sifieldsUt5_E",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)",
   "referenced_type" : "_ZTIN10__sifieldsUt_E",
   "self_type" : "_ZTIN10__sifieldsUt_E",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/signal_types.h:100:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11user_fpregs6fp_regE",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "_ZTIN11user_fpregs6fp_regE",
   "self_type" : "_ZTIN11user_fpregs6fp_regE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN18__kernel_sigactionUt_E",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN18__kernel_sigactionUt_E",
   "self_type" : "_ZTIN18__kernel_sigactionUt_E",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android12NativeHandleE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12NativeHandleE",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12NativeHandleE",
   "self_type" : "_ZTIN7android12NativeHandleE",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl4base4V1_05IBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl6memory4V1_07IMapperE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMapperEEE",
   "name" : "android::sp<android::hidl::memory::V1_0::IMapper>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMapperEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMapperEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl6memory4V1_07IMapperE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl6memory4V1_07IMemoryE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "name" : "android::sp<android::hidl::memory::V1_0::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl6memory4V1_07IMemoryE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl7manager4V1_020IServiceNotificationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "self_type" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware20hidl_death_recipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware20hidl_death_recipientE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "self_type" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfo12ArchitectureE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "self_type" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl6memory4V1_07IMapperE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMapperE",
   "name" : "android::hidl::memory::V1_0::implementation::AshmemMapper",
   "referenced_type" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMapperE",
   "self_type" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMapperE",
   "size" : 12,
   "source_file" : "/system/libhidl/transport/memory/1.0/default/AshmemMapper.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMapperE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl6memory4V1_07IMapper8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMapperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMapper9mapMemoryERKNS_8hardware11hidl_memoryE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMapperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl6memory4V1_014implementation12AshmemMapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl6memory4V1_014implementation12AshmemMapperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl6memory4V1_07IMemoryE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMemory",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMemoryE",
   "name" : "android::hidl::memory::V1_0::implementation::AshmemMemory",
   "referenced_type" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMemoryE",
   "self_type" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMemoryE",
   "size" : 64,
   "source_file" : "/system/libhidl/transport/memory/1.0/default/AshmemMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 52,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMemoryE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl6memory4V1_07IMemory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory6updateEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory11updateRangeEyy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory4readEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory9readRangeEyy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory6commitEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory10getPointerEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory7getSizeEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -52,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -52,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl6memory4V1_014implementation12AshmemMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl6memory4V1_014implementation12AshmemMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl6memory4V1_07IMapperE",
   "name" : "android::hidl::memory::V1_0::IMapper",
   "referenced_type" : "_ZTIN7android4hidl6memory4V1_07IMapperE",
   "self_type" : "_ZTIN7android4hidl6memory4V1_07IMapperE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/memory/1.0/android.hidl.memory@1.0_genc++_headers/gen/android/hidl/memory/1.0/IMapper.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_07IMapperE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl6memory4V1_07IMapper8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapperD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper9mapMemoryERKNS_8hardware11hidl_memoryE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_07IMapperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl6memory4V1_07IMapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl6memory4V1_07IMapperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl6memory4V1_07IMemoryE",
   "name" : "android::hidl::memory::V1_0::IMemory",
   "referenced_type" : "_ZTIN7android4hidl6memory4V1_07IMemoryE",
   "self_type" : "_ZTIN7android4hidl6memory4V1_07IMemoryE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/memory/1.0/android.hidl.memory@1.0_genc++_headers/gen/android/hidl/memory/1.0/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_07IMemoryE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl6memory4V1_07IMemory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory11updateRangeEyy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory4readEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory9readRangeEyy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory6commitEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory10getPointerEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory7getSizeEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_07IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl6memory4V1_07IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl6memory4V1_07IMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "self_type" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10HidlMemoryE",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware10HidlMemoryE",
   "self_type" : "_ZTIN7android8hardware10HidlMemoryE",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 72,
     "referenced_type" : "_ZTIA7_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_handleE",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "_ZTIN7android8hardware11hidl_handleE",
   "self_type" : "_ZTIN7android8hardware11hidl_handleE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware11hidl_handleE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_memoryE",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "self_type" : "_ZTIN7android8hardware11hidl_memoryE",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_stringE",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "_ZTIN7android8hardware11hidl_stringE",
   "self_type" : "_ZTIN7android8hardware11hidl_stringE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12hidl_versionE",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "_ZTIN7android8hardware12hidl_versionE",
   "self_type" : "_ZTIN7android8hardware12hidl_versionE",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "self_type" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "self_type" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnINS_2spINS_4hidl6memory4V1_07IMemoryEEEEE",
   "name" : "android::hardware::Return<android::sp<android::hidl::memory::V1_0::IMemory> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnINS_2spINS_4hidl6memory4V1_07IMemoryEEEEE",
   "self_type" : "_ZTIN7android8hardware6ReturnINS_2spINS_4hidl6memory4V1_07IMemoryEEEEE",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIN7android2spINS_4hidl6memory4V1_07IMemoryEEE" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnIPvEE",
   "name" : "android::hardware::Return<void *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnIPvEE",
   "self_type" : "_ZTIN7android8hardware6ReturnIPvEE",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIPv" ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnIvEE",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnIvEE",
   "self_type" : "_ZTIN7android8hardware6ReturnIvEE",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnIyEE",
   "name" : "android::hardware::Return<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ReturnIyEE",
   "self_type" : "_ZTIN7android8hardware6ReturnIyEE",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6StatusE",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6StatusE",
   "self_type" : "_ZTIN7android8hardware6StatusE",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTI13native_handle" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIK13native_handle" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPK13native_handle"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIKc" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "_ZTIN7android8hardware17GrantorDescriptorE" ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPN7android8hardware17GrantorDescriptorE"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "self_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "_ZTIN7android8hardware6StatusE"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details13return_statusE",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware7details13return_statusE",
   "self_type" : "_ZTIN7android8hardware7details13return_statusE",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "self_type" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "size" : 44,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details5i_tagE",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "_ZTIN7android8hardware7details5i_tagE",
   "self_type" : "_ZTIN7android8hardware7details5i_tagE",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details6bs_tagE",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "_ZTIN7android8hardware7details6bs_tagE",
   "self_type" : "_ZTIN7android8hardware7details6bs_tagE",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "self_type" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details8bphw_tagE",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "_ZTIN7android8hardware7details8bphw_tagE",
   "self_type" : "_ZTIN7android8hardware7details8bphw_tagE",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "self_type" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "_ZTIN7android8hardware17GrantorDescriptorE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIA5121_h"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "_ZTI12logger_entry"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7log_msgUt_E",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:77:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7log_msgUt_E",
   "self_type" : "_ZTIN7log_msgUt_E",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7siginfoUt_E",
   "self_type" : "_ZTIN7siginfoUt_E",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)",
   "referenced_type" : "_ZTIN7siginfoUt_Ut_E",
   "self_type" : "_ZTIN7siginfoUt_Ut_E",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA13_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8sigeventUt_E",
   "self_type" : "_ZTIN8sigeventUt_E",
   "size" : 52,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5)",
   "referenced_type" : "_ZTIN8sigeventUt_Ut_E",
   "self_type" : "_ZTIN8sigeventUt_Ut_E",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN8ucontextUt_Ut_E"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/ucontext.h:90:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_Ut_E",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/ucontext.h:91:5)",
   "referenced_type" : "_ZTIN8ucontextUt_Ut_E",
   "self_type" : "_ZTIN8ucontextUt_Ut_E",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/signal_types.h:89:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_vendor.30_arm_armv8-a_shared/gen/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "_ZTINSt3__110__function16__policy_storageE",
   "self_type" : "_ZTINSt3__110__function16__policy_storageE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "referenced_type" : "_ZTINSt3__110__function8__policyE",
   "self_type" : "_ZTINSt3__110__function8__policyE",
   "size" : 16,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj0EEE",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj0EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj1EEE",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "self_type" : "_ZTINSt3__110__get_pairILj1EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "_ZTINSt3__110__ignore_tIhEE",
   "self_type" : "_ZTINSt3__110__ignore_tIhEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000000> >",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000000EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000000000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000> >",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000000EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000> >",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1000EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1> >",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx1ELx1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx3600ELx1EEEEE",
   "name" : "std::__is_ratio<std::ratio<3600, 1> >",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx3600ELx1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx3600ELx1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx3600ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILx60ELx1EEEEE",
   "name" : "std::__is_ratio<std::ratio<60, 1> >",
   "referenced_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx60ELx1EEEEE",
   "self_type" : "_ZTINSt3__110__is_ratioINS_5ratioILx60ELx1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx60ELx1EEE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__loc_",
     "referenced_type" : "_ZTIP10__locale_t"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__time_getE",
   "name" : "std::__time_get",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110__time_getE",
   "self_type" : "_ZTINSt3__110__time_getE",
   "size" : 4,
   "source_file" : "/external/libcxx/include/locale"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__loc_",
     "referenced_type" : "_ZTIP10__locale_t"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__time_putE",
   "name" : "std::__time_put",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110__time_putE",
   "self_type" : "_ZTINSt3__110__time_putE",
   "size" : 4,
   "source_file" : "/external/libcxx/include/locale"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110ctype_baseE",
   "name" : "std::ctype_base",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110ctype_baseE",
   "self_type" : "_ZTINSt3__110ctype_baseE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__locale"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__val_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "__cat_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKNSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110error_codeE",
   "name" : "std::error_code",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110error_codeE",
   "self_type" : "_ZTINSt3__110error_codeE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/system_error"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "referenced_type" : "_ZTINSt3__110in_place_tE",
   "self_type" : "_ZTINSt3__110in_place_tE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_13basic_ostreamIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_base_of<std::ios_base, std::basic_ostream<char, std::char_traits<char> > &>",
   "referenced_type" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_13basic_ostreamIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_13basic_ostreamIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18ios_baseE",
    "_ZTIRNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_19basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::is_base_of<std::ios_base, std::basic_ostringstream<char, std::char_traits<char>, std::allocator<char> > &>",
   "referenced_type" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_19basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "self_type" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_19basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18ios_baseE",
    "_ZTIRNSt3__119basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDiEE",
   "self_type" : "_ZTINSt3__110is_trivialIDiEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIDsEE",
   "self_type" : "_ZTINSt3__110is_trivialIDsEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "referenced_type" : "_ZTINSt3__110is_trivialIcEE",
   "self_type" : "_ZTINSt3__110is_trivialIcEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "referenced_type" : "_ZTINSt3__110is_trivialIwEE",
   "self_type" : "_ZTINSt3__110is_trivialIwEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "referenced_type" : "_ZTINSt3__110less_equalIvEE",
   "self_type" : "_ZTINSt3__110less_equalIvEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "referenced_type" : "_ZTINSt3__110logical_orIvEE",
   "self_type" : "_ZTINSt3__110logical_orIvEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "field",
     "referenced_type" : "_ZTIA4_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110money_base7patternE",
   "name" : "std::money_base::pattern",
   "referenced_type" : "_ZTINSt3__110money_base7patternE",
   "self_type" : "_ZTINSt3__110money_base7patternE",
   "size" : 4,
   "source_file" : "/external/libcxx/include/locale"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110money_baseE",
   "name" : "std::money_base",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110money_baseE",
   "self_type" : "_ZTINSt3__110money_baseE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/locale"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "name" : "std::moneypunct<char, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "self_type" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIcLb0EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb0EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb0EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "name" : "std::moneypunct<char, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "self_type" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIcLb1EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb1EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "name" : "std::moneypunct<wchar_t, false>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "self_type" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIwLb0EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb0EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb0EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "name" : "std::moneypunct<wchar_t, true>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "self_type" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIwLb1EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb1EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "referenced_type" : "_ZTINSt3__110multipliesIvEE",
   "self_type" : "_ZTINSt3__110multipliesIvEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "referenced_type" : "_ZTINSt3__110owner_lessIvEE",
   "self_type" : "_ZTINSt3__110owner_lessIvEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPcPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "name" : "std::unique_ptr<char, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "_ZTIc", "_ZTIPFvPvE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPhPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "name" : "std::unique_ptr<unsigned char, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "_ZTIh", "_ZTIPFvPvE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPjPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "name" : "std::unique_ptr<unsigned int, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "self_type" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "_ZTIj", "_ZTIPFvPvE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_getIcEE",
   "name" : "std::__money_get<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_getIcEE",
   "self_type" : "_ZTINSt3__111__money_getIcEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_getIwEE",
   "name" : "std::__money_get<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_getIwEE",
   "self_type" : "_ZTINSt3__111__money_getIwEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_putIcEE",
   "name" : "std::__money_put<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_putIcEE",
   "self_type" : "_ZTINSt3__111__money_putIcEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/locale",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_putIwEE",
   "name" : "std::__money_put<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111__money_putIwEE",
   "self_type" : "_ZTINSt3__111__money_putIwEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/locale",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEENS1_ILx1ELx1EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1> >",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEENS1_ILx1ELx1EEEEE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEENS1_ILx1ELx1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILx1ELx1000000000EEE",
    "_ZTINSt3__15ratioILx1ELx1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1000000000> >",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000000EEES2_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILx1ELx1000000000EEE",
    "_ZTINSt3__15ratioILx1ELx1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000>, std::ratio<1, 1000000> >",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000000EEES2_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILx1ELx1000000EEE",
    "_ZTINSt3__15ratioILx1ELx1000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000>, std::ratio<1, 1000> >",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1000EEES2_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1000EEE", "_ZTINSt3__15ratioILx1ELx1000EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1>, std::ratio<1, 1> >",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx1ELx1EEES2_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx1ELx1EEE", "_ZTINSt3__15ratioILx1ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx3600ELx1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<3600, 1>, std::ratio<3600, 1> >",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx3600ELx1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx3600ELx1EEES2_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx3600ELx1EEE", "_ZTINSt3__15ratioILx3600ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx60ELx1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<60, 1>, std::ratio<60, 1> >",
   "referenced_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx60ELx1EEES2_EE",
   "self_type" : "_ZTINSt3__111__ratio_gcdINS_5ratioILx60ELx1EEES2_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/ratio",
   "template_args" : [ "_ZTINSt3__15ratioILx60ELx1EEE", "_ZTINSt3__15ratioILx60ELx1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDiEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIDsEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIN7android8hardware17GrantorDescriptorEEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<android::hardware::GrantorDescriptor>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIN7android8hardware17GrantorDescriptorEEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIN7android8hardware17GrantorDescriptorEEEiLb1EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIN7android8hardware17GrantorDescriptorEEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEEiLb1EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS_6vectorIPvNS0_ISA_EEEEEEEEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIcEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, int, true>",
   "referenced_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "self_type" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "_ZTINSt3__19allocatorIwEE", "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat> > > > >",
   "referenced_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat> > > > >",
   "referenced_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "self_type" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<char *, void (*)(void *)> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPcPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned char *, void (*)(void *)> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPhPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned int *, void (*)(void *)> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPjPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_9allocatorIcEEEE",
   "name" : "std::add_pointer<const std::allocator<char> >",
   "referenced_type" : "_ZTINSt3__111add_pointerIKNS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__111add_pointerIKNS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "name" : "std::add_pointer<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> > >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::add_pointer<std::basic_string_view<char, std::char_traits<char> > >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIeEE",
   "name" : "std::add_pointer<long double>",
   "referenced_type" : "_ZTINSt3__111add_pointerIeEE",
   "self_type" : "_ZTINSt3__111add_pointerIeEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIlEE",
   "name" : "std::add_pointer<long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIlEE",
   "self_type" : "_ZTINSt3__111add_pointerIlEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIxEE",
   "name" : "std::add_pointer<long long>",
   "referenced_type" : "_ZTINSt3__111add_pointerIxEE",
   "self_type" : "_ZTINSt3__111add_pointerIxEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "self_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDiEE",
   "self_type" : "_ZTINSt3__111char_traitsIDiEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__string",
   "template_args" : [ "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIDsEE",
   "self_type" : "_ZTINSt3__111char_traitsIDsEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__string",
   "template_args" : [ "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "referenced_type" : "_ZTINSt3__111char_traitsIcEE",
   "self_type" : "_ZTINSt3__111char_traitsIcEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__string",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "referenced_type" : "_ZTINSt3__111char_traitsIwEE",
   "self_type" : "_ZTINSt3__111char_traitsIwEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__string",
   "template_args" : [ "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_17basic_string_viewIcNS_11char_traitsIcEEEES4_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_17basic_string_viewIcNS_11char_traitsIcEEEEEEE",
   "name" : "std::common_type<basic_string_view<char, char_traits<char> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_17basic_string_viewIcNS_11char_traitsIcEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_17basic_string_viewIcNS_11char_traitsIcEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impINS_17basic_string_viewIcNS_11char_traitsIcEEEES4_vEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_17basic_string_viewIcNS_11char_traitsIcEEEES4_EEE",
   "name" : "std::common_type<basic_string_view<char, char_traits<char> >, basic_string_view<char, char_traits<char> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_17basic_string_viewIcNS_11char_traitsIcEEEES4_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_17basic_string_viewIcNS_11char_traitsIcEEEES4_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000000> >, duration<long double, ratio<1, 1000000000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000> >, duration<long double, ratio<1, 1000000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000> >, duration<long double, ratio<1, 1000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1> >, duration<long double, ratio<1, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx1ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<3600, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<3600, 1> >, duration<long double, ratio<3600, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx3600ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<60, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<60, 1> >, duration<long double, ratio<60, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILx60ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long, ratio<3600, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long, ratio<3600, 1> >, duration<long, ratio<3600, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx3600ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long, ratio<60, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long, ratio<60, 1> >, duration<long, ratio<60, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILx60ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEENS2_IxNS3_ILx1ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000> >, duration<long long, ratio<1, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEENS2_IxNS3_ILx1ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEENS2_IxNS3_ILx1ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000> >, duration<long long, ratio<1, 1000000000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000> >, duration<long long, ratio<1, 1000000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000> >, duration<long long, ratio<1, 1000> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1000EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEEEEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1> >, duration<long long, ratio<1, 1> > >",
   "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEES5_EEE",
   "self_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILx1ELx1EEEEES5_EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIeevEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJeeEEE",
   "name" : "std::common_type<long double, long double>",
   "referenced_type" : "_ZTINSt3__111common_typeIJeeEEE",
   "self_type" : "_ZTINSt3__111common_typeIJeeEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIllvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJllEEE",
   "name" : "std::common_type<long, long>",
   "referenced_type" : "_ZTINSt3__111common_typeIJllEEE",
   "self_type" : "_ZTINSt3__111common_typeIJllEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIxxvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJxxEEE",
   "name" : "std::common_type<long long, long long>",
   "referenced_type" : "_ZTINSt3__111common_typeIJxxEEE",
   "self_type" : "_ZTINSt3__111common_typeIJxxEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type_implINS_14__common_typesIJxxxEEEvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJxxxEEE",
   "name" : "std::common_type<long long, long long, long long>",
   "referenced_type" : "_ZTINSt3__111common_typeIJxxxEEE",
   "self_type" : "_ZTINSt3__111common_typeIJxxxEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "name" : "std::conditional<false, std::pointer_traits<char32_t *>::__nat, char32_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDiE5__natE", "_ZTIDi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "name" : "std::conditional<false, std::pointer_traits<char16_t *>::__nat, char16_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPDsE5__natE", "_ZTIDs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "name" : "std::conditional<false, std::pointer_traits<const char *>::__nat, const char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPKcE5__natES2_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPKcE5__natE", "_ZTIKc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN7android8hardware17GrantorDescriptorEE5__natES4_EE",
   "name" : "std::conditional<false, std::pointer_traits<GrantorDescriptor *>::__nat, android::hardware::GrantorDescriptor>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN7android8hardware17GrantorDescriptorEE5__natES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPN7android8hardware17GrantorDescriptorEE5__natES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPN7android8hardware17GrantorDescriptorEE5__natE",
    "_ZTIN7android8hardware17GrantorDescriptorE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPNS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS_9allocatorISB_EEEEEEEE5__natESH_EE",
   "name" : "std::conditional<false, std::pointer_traits<function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *>::__nat, std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPNS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS_9allocatorISB_EEEEEEEE5__natESH_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPNS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS_9allocatorISB_EEEEEEEE5__natESH_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPNS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS_6vectorIPvNS_9allocatorISA_EEEEEEEE5__natE",
    "_ZTINSt3__18functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS7_S7_S7_PNS_6vectorIPvNS_9allocatorIS9_EEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "name" : "std::conditional<false, std::pointer_traits<char *>::__nat, char>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPcE5__natE", "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "name" : "std::conditional<false, std::pointer_traits<wchar_t *>::__nat, wchar_t>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__114pointer_traitsIPwE5__natE", "_ZTIw" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "name" : "std::conditional<false, std::__bit_const_reference<std::__bitset<0, 0> >, std::__bit_reference<std::__bitset<0, 0>, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb0ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__121__bit_const_referenceINS_8__bitsetILj0ELj0EEEEE",
    "_ZTINSt3__115__bit_referenceINS_8__bitsetILj0ELj0EEELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPcPFvPvEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<char *, void (*)(void *)> *, std::__compressed_pair<char *, void (*)(void *)> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPcPFvPvEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPcPFvPvEEES6_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPcPFvPvEEE",
    "_ZTINSt3__117__compressed_pairIPcPFvPvEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPhPFvPvEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<unsigned char *, void (*)(void *)> *, std::__compressed_pair<unsigned char *, void (*)(void *)> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPhPFvPvEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPhPFvPvEEES6_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPhPFvPvEEE",
    "_ZTINSt3__117__compressed_pairIPhPFvPvEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPjPFvPvEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<unsigned int *, void (*)(void *)> *, std::__compressed_pair<unsigned int *, void (*)(void *)> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPjPFvPvEEES6_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPjPFvPvEEES6_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPjPFvPvEEE",
    "_ZTINSt3__117__compressed_pairIPjPFvPvEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<void (*)(void *), 1, false> *, std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<char *, 0, false> *, std::__compressed_pair_elem<char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPcLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPcLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<unsigned char *, 0, false> *, std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPhLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPhLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<unsigned int *, 0, false> *, std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPjLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPjLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_9allocatorIcEES2_EE",
   "name" : "std::conditional<false, const std::allocator<char> *, std::allocator<char> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKNS_9allocatorIcEES2_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKNS_9allocatorIcEES2_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKNSt3__19allocatorIcEE", "_ZTINSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKjPjEE",
   "name" : "std::conditional<false, const unsigned int *, unsigned int *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPKjPjEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPKjPjEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKj", "_ZTIPj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> > *, std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> > >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EES9_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE",
    "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_17basic_string_viewIcNS_11char_traitsIcEEEES4_EE",
   "name" : "std::conditional<false, std::basic_string_view<char, std::char_traits<char> > *, std::basic_string_view<char, std::char_traits<char> > >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_17basic_string_viewIcNS_11char_traitsIcEEEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_17basic_string_viewIcNS_11char_traitsIcEEEES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__117basic_string_viewIcNS_11char_traitsIcEEEE",
    "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<void (*)(void *), 1, false> *, std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPFvPvELi1ELb0EEES5_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<char *, 0, false> *, std::__compressed_pair_elem<char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPcLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPcLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPcLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<unsigned char *, 0, false> *, std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPhLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPhLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPhLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<unsigned int *, 0, false> *, std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPjLi0ELb0EEES3_EE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPjLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPjLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPeeEE",
   "name" : "std::conditional<false, long double *, long double>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPeeEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPeeEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPe", "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPllEE",
   "name" : "std::conditional<false, long *, long>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPllEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPllEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPl", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "name" : "std::conditional<false, long long *, long long>",
   "referenced_type" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "self_type" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPx", "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impINS_17basic_string_viewIcNS_11char_traitsIcEEEES5_vEENS_11common_typeIJS5_S5_EEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<std::basic_string_view<char, std::char_traits<char> >, std::basic_string_view<char, std::char_traits<char> >, void>, std::common_type<basic_string_view<char, char_traits<char> >, basic_string_view<char, char_traits<char> > > >",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impINS_17basic_string_viewIcNS_11char_traitsIcEEEES5_vEENS_11common_typeIJS5_S5_EEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impINS_17basic_string_viewIcNS_11char_traitsIcEEEES5_vEENS_11common_typeIJS5_S5_EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impINS_17basic_string_viewIcNS_11char_traitsIcEEEES4_vEE",
    "_ZTINSt3__111common_typeIJNS_17basic_string_viewIcNS_11char_traitsIcEEEES4_EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIeevEENS_11common_typeIJeeEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long double, long double, void>, std::common_type<long double, long double> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIeevEENS_11common_typeIJeeEEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIeevEENS_11common_typeIJeeEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIeevEE",
    "_ZTINSt3__111common_typeIJeeEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIllvEENS_11common_typeIJllEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long, long, void>, std::common_type<long, long> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIllvEENS_11common_typeIJllEEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIllvEENS_11common_typeIJllEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIllvEE",
    "_ZTINSt3__111common_typeIJllEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIxxvEENS_11common_typeIJxxEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long long, long long, void>, std::common_type<long long, long long> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIxxvEENS_11common_typeIJxxEEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIxxvEENS_11common_typeIJxxEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIxxvEE",
    "_ZTINSt3__111common_typeIJxxEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "name" : "std::conditional<true, std::__bit_const_reference<std::__bitset<0, 0> >, std::__bit_reference<std::__bitset<0, 0>, true> >",
   "referenced_type" : "_ZTINSt3__111conditionalILb1ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "self_type" : "_ZTINSt3__111conditionalILb1ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__121__bit_const_referenceINS_8__bitsetILj0ELj0EEEEE",
    "_ZTINSt3__115__bit_referenceINS_8__bitsetILj0ELj0EEELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1EPKjPjEE",
   "name" : "std::conditional<true, const unsigned int *, unsigned int *>",
   "referenced_type" : "_ZTINSt3__111conditionalILb1EPKjPjEE",
   "self_type" : "_ZTINSt3__111conditionalILb1EPKjPjEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKj", "_ZTIPj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char32_t, std::char_traits<char32_t> > >",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDiNS_11char_traitsIDiEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char16_t, std::char_traits<char16_t> > >",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIDsNS_11char_traitsIDsEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char, std::char_traits<char> > >",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<wchar_t, std::char_traits<wchar_t> > >",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIwNS_11char_traitsIwEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_18input_iterator_tagEEE",
   "name" : "std::is_abstract<std::input_iterator_tag>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_18input_iterator_tagEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_18input_iterator_tagEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__118input_iterator_tagE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_20forward_iterator_tagEEE",
   "name" : "std::is_abstract<std::forward_iterator_tag>",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_20forward_iterator_tagEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_20forward_iterator_tagEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__120forward_iterator_tagE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEE",
   "name" : "std::is_abstract<std::chrono::duration<long double, std::ratio<1, 1000000000> > >",
   "referenced_type" : "_ZTINSt3__111is_abstractINS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEE",
   "self_type" : "_ZTINSt3__111is_abstractINS_6chrono8durationIeNS_5ratioILx1ELx1000000000EEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__16chrono8durationIeNS_5ratioILx1ELx1000000000EEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDiEE",
   "name" : "std::is_abstract<const char32_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDiEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDsEE",
   "name" : "std::is_abstract<const char16_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKDsEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKDs" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKcEE",
   "name" : "std::is_abstract<const char *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKcEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKwEE",
   "name" : "std::is_abstract<const wchar_t *>",
   "referenced_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "self_type" : "_ZTINSt3__111is_abstractIPKwEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPKw" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIeEE",
   "name" : "std::is_abstract<long double>",
   "referenced_type" : "_ZTINSt3__111is_abstractIeEE",
   "self_type" : "_ZTINSt3__111is_abstractIeEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIlEE",
   "name" : "std::is_abstract<long>",
   "referenced_type" : "_ZTINSt3__111is_abstractIlEE",
   "self_type" : "_ZTINSt3__111is_abstractIlEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIxEE",
   "name" : "std::is_abstract<long long>",
   "referenced_type" : "_ZTINSt3__111is_abstractIxEE",
   "self_type" : "_ZTINSt3__111is_abstractIxEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPcPFvPvEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<char *, void (*)(void *)> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPcPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPhPFvPvEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<unsigned char *, void (*)(void *)> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPhPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_17__compressed_pairIPjPFvPvEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "name" : "std::is_function<const std::__compressed_pair<unsigned int *, void (*)(void *)> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__117__compressed_pairIPjPFvPvEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_9allocatorIcEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_9allocatorIcEEEE",
   "name" : "std::is_function<const std::allocator<char> >",
   "referenced_type" : "_ZTINSt3__111is_functionIKNS_9allocatorIcEEEE",
   "self_type" : "_ZTINSt3__111is_functionIKNS_9allocatorIcEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIKNSt3__19allocatorIcEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "name" : "std::is_function<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> > >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_17basic_string_viewIcNS_11char_traitsIcEEEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_function<std::basic_string_view<char, std::char_traits<char> > >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPcLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPcLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPhLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPhLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "referenced_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "self_type" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemIPjLi0ELb0EEEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__122__compressed_pair_elemIPjLi0ELb0EEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIeLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIeEE",
   "name" : "std::is_function<long double>",
   "referenced_type" : "_ZTINSt3__111is_functionIeEE",
   "self_type" : "_ZTINSt3__111is_functionIeEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIlLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIlEE",
   "name" : "std::is_function<long>",
   "referenced_type" : "_ZTINSt3__111is_functionIlEE",
   "self_type" : "_ZTINSt3__111is_functionIlEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIxLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIxEE",
   "name" : "std::is_function<long long>",
   "referenced_type" : "_ZTINSt3__111is_functionIxEE",
   "self_type" : "_ZTINSt3__111is_functionIxEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIN7android8hardware11hidl_stringEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIN7android8hardware11hidl_stringEEE",
   "name" : "std::is_integral<android::hardware::hidl_string>",
   "referenced_type" : "_ZTINSt3__111is_integralIN7android8hardware11hidl_stringEEE",
   "self_type" : "_ZTINSt3__111is_integralIN7android8hardware11hidl_stringEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIN7android8hardware11hidl_stringE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIPK13native_handleEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIPK13native_handleEE",
   "name" : "std::is_integral<const native_handle *>",
   "referenced_type" : "_ZTINSt3__111is_integralIPK13native_handleEE",
   "self_type" : "_ZTINSt3__111is_integralIPK13native_handleEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPK13native_handle" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIPN7android8hardware20hidl_death_recipientEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIPN7android8hardware20hidl_death_recipientEEE",
   "name" : "std::is_integral<android::hardware::hidl_death_recipient *>",
   "referenced_type" : "_ZTINSt3__111is_integralIPN7android8hardware20hidl_death_recipientEEE",
   "self_type" : "_ZTINSt3__111is_integralIPN7android8hardware20hidl_death_recipientEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPN7android8hardware20hidl_death_recipientE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIaEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIaEE",
   "name" : "std::is_integral<signed char>",
   "referenced_type" : "_ZTINSt3__111is_integralIaEE",
   "self_type" : "_ZTINSt3__111is_integralIaEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIa" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIcEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIcEE",
   "name" : "std::is_integral<char>",
   "referenced_type" : "_ZTINSt3__111is_integralIcEE",
   "self_type" : "_ZTINSt3__111is_integralIcEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIhEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIhEE",
   "name" : "std::is_integral<unsigned char>",
   "referenced_type" : "_ZTINSt3__111is_integralIhEE",
   "self_type" : "_ZTINSt3__111is_integralIhEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIiEE",
   "name" : "std::is_integral<int>",
   "referenced_type" : "_ZTINSt3__111is_integralIiEE",
   "self_type" : "_ZTINSt3__111is_integralIiEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIjEE",
   "name" : "std::is_integral<unsigned int>",
   "referenced_type" : "_ZTINSt3__111is_integralIjEE",
   "self_type" : "_ZTINSt3__111is_integralIjEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIlEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIlEE",
   "name" : "std::is_integral<long>",
   "referenced_type" : "_ZTINSt3__111is_integralIlEE",
   "self_type" : "_ZTINSt3__111is_integralIlEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralImEE",
   "name" : "std::is_integral<unsigned long>",
   "referenced_type" : "_ZTINSt3__111is_integralImEE",
   "self_type" : "_ZTINSt3__111is_integralImEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIxEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIxEE",
   "name" : "std::is_integral<long long>",
   "referenced_type" : "_ZTINSt3__111is_integralIxEE",
   "self_type" : "_ZTINSt3__111is_integralIxEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIyEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIyEE",
   "name" : "std::is_integral<unsigned long long>",
   "referenced_type" : "_ZTINSt3__111is_integralIyEE",
   "self_type" : "_ZTINSt3__111is_integralIyEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_andIvEE",
   "name" : "std::logical_and<void>",
   "referenced_type" : "_ZTINSt3__111logical_andIvEE",
   "self_type" : "_ZTINSt3__111logical_andIvEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_notIvEE",
   "name" : "std::logical_not<void>",
   "referenced_type" : "_ZTINSt3__111logical_notIvEE",
   "self_type" : "_ZTINSt3__111logical_notIvEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111scoped_lockIJEEE",
   "name" : "std::scoped_lock<>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111scoped_lockIJEEE",
   "self_type" : "_ZTINSt3__111scoped_lockIJEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/mutex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__m_",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "__cv_",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__118condition_variableE"
    },
    {
     "access" : "private",
     "field_name" : "__locked_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111timed_mutexE",
   "name" : "std::timed_mutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111timed_mutexE",
   "self_type" : "_ZTINSt3__111timed_mutexE",
   "size" : 12,
   "source_file" : "/external/libcxx/include/mutex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__m_",
     "referenced_type" : "_ZTIPNSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "__owns_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111unique_lockINS_5mutexEEE",
   "name" : "std::unique_lock<std::mutex>",
   "record_kind" : "class",
   "referenced_type" : "_ZTINSt3__111unique_lockINS_5mutexEEE",
   "self_type" : "_ZTINSt3__111unique_lockINS_5mutexEEE",
   "size" : 8,
   "source_file" : "/external/libcxx/include/__mutex_base",
   "template_args" : [ "_ZTINSt3__15mutexE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__115__struct_doubleE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "self_type" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTINSt3__116__struct_double4E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIPiEE",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "_ZTINSt3__112__align_typeIPiEE",
   "self_type" : "_ZTINSt3__112__align_typeIPiEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIPi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIdEE",
   "name" : "std::__align_type<double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIdEE",
   "self_type" : "_ZTINSt3__112__align_typeIdEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIeEE",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "_ZTINSt3__112__align_typeIeEE",
   "self_type" : "_ZTINSt3__112__align_typeIeEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIe" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIhEE",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "_ZTINSt3__112__align_typeIhEE",
   "self_type" : "_ZTINSt3__112__align_typeIhEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIjEE",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "_ZTINSt3__112__align_typeIjEE",
   "self_type" : "_ZTINSt3__112__align_typeIjEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeImEE",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "_ZTINSt3__112__align_typeImEE",
   "self_type" : "_ZTINSt3__112__align_typeImEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeItEE",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "_ZTINSt3__112__align_typeItEE",
   "self_type" : "_ZTINSt3__112__align_typeItEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIyEE",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "_ZTINSt3__112__align_typeIyEE",
   "self_type" : "_ZTINSt3__112__align_typeIyEE",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__destruct_nE",
   "name" : "std::__destruct_n",
   "referenced_type" : "_ZTINSt3__112__destruct_nE",
   "self_type" : "_ZTINSt3__112__destruct_nE",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__do_messageE",
