{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA8_j",
   "name" : "unsigned int [8]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA8_j",
   "size" : 32,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" :
 [
  {
   "name" : "mixer_close"
  },
  {
   "name" : "mixer_consume_event"
  },
  {
   "name" : "mixer_ctl_get_array"
  },
  {
   "name" : "mixer_ctl_get_enum_string"
  },
  {
   "name" : "mixer_ctl_get_name"
  },
  {
   "name" : "mixer_ctl_get_num_enums"
  },
  {
   "name" : "mixer_ctl_get_num_values"
  },
  {
   "name" : "mixer_ctl_get_percent"
  },
  {
   "name" : "mixer_ctl_get_range_max"
  },
  {
   "name" : "mixer_ctl_get_range_min"
  },
  {

   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_prepare",
   "linker_set_key" : "pcm_prepare",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_read",
   "linker_set_key" : "pcm_read",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_set_avail_min",
   "linker_set_key" : "pcm_set_avail_min",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_start",
   "linker_set_key" : "pcm_start",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_stop",
   "linker_set_key" : "pcm_stop",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_wait",
   "linker_set_key" : "pcm_wait",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "function_name" : "pcm_write",
   "linker_set_key" : "pcm_write",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIP3pcm"
    },
    {
     "referenced_type" : "_ZTIPKv"
    },
    {
     "referenced_type" : "_ZTIj"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "global_vars" : [],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP10pcm_config",
   "name" : "pcm_config *",
   "referenced_type" : "_ZTI10pcm_config",
   "self_type" : "_ZTIP10pcm_config",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP10pcm_params",
   "name" : "pcm_params *",
   "referenced_type" : "_ZTI10pcm_params",
   "self_type" : "_ZTIP10pcm_params",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP3pcm",
   "name" : "pcm *",
   "referenced_type" : "_ZTI3pcm",
   "self_type" : "_ZTIP3pcm",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP5mixer",
   "name" : "mixer *",
   "referenced_type" : "_ZTI5mixer",
   "self_type" : "_ZTIP5mixer",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP8pcm_mask",
   "name" : "pcm_mask *",
   "referenced_type" : "_ZTI8pcm_mask",
   "self_type" : "_ZTIP8pcm_mask",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP8timespec",
   "name" : "timespec *",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTIP8timespec",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP9mixer_ctl",
   "name" : "mixer_ctl *",
   "referenced_type" : "_ZTI9mixer_ctl",
   "self_type" : "_ZTIP9mixer_ctl",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "channels",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "period_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "period_count",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10pcm_format"
    },
    {
     "field_name" : "start_threshold",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stop_threshold",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "silence_threshold",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "silence_size",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "avail_min",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10pcm_config",
   "name" : "pcm_config",
   "referenced_type" : "_ZTI10pcm_config",
   "self_type" : "_ZTI10pcm_config",
   "size" : 40,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bits",
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI8pcm_mask",
   "name" : "pcm_mask",
   "referenced_type" : "_ZTI8pcm_mask",
   "self_type" : "_ZTI8pcm_mask",
   "size" : 32,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h"
  }
 ],
 "rvalue_reference_types" : []
}
