{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1024_c",
   "name" : "char [1024]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1024_c",
   "size" : 1024,
   "source_file" : "/system/core/base/include/android-base/file.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 4,

   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8ZipEntry",
   "name" : "const ZipEntry",
   "referenced_type" : "_ZTI8ZipEntry",
   "self_type" : "_ZTIK8ZipEntry",
   "size" : 48,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9ZipWriter",
   "name" : "const ZipWriter",
   "referenced_type" : "_ZTI9ZipWriter",
   "self_type" : "_ZTIK9ZipWriter",
   "size" : 104,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_writer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN11zip_archive6ReaderE",
   "name" : "const zip_archive::Reader",
   "referenced_type" : "_ZTIN11zip_archive6ReaderE",
   "self_type" : "_ZTIKN11zip_archive6ReaderE",
   "size" : 4,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android4base10MappedFileE",
   "name" : "const android::base::MappedFile",
   "referenced_type" : "_ZTIN7android4base10MappedFileE",
   "self_type" : "_ZTIKN7android4base10MappedFileE",
   "size" : 12,
   "source_file" : "/system/core/base/include/android-base/mapped_file.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android4base11borrowed_fdE",
   "name" : "const android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIKN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android4base13ErrnoRestorerE",
   "name" : "const android::base::ErrnoRestorer",
   "referenced_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "self_type" : "_ZTIKN7android4base13ErrnoRestorerE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "name" : "const std::unique_ptr<android::base::LogMessageData, std::default_delete<android::base::LogMessageData> >",
   "referenced_type" : "_ZTINSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "self_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 12,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__117basic_string_viewIcNS_11char_traitsIcEEEE",
   "name" : "const std::basic_string_view<char, std::char_traits<char> >",
   "referenced_type" : "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE",
   "self_type" : "_ZTIKNSt3__117basic_string_viewIcNS_11char_traitsIcEEEE",
   "size" : 8,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP10ZipArchive",
   "name" : "ZipArchive *const",
   "referenced_type" : "_ZTIP10ZipArchive",
   "self_type" : "_ZTIKP10ZipArchive",
   "size" : 4,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "path",
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_dir_and_contents_",
     "field_offset" : 8192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI12TemporaryDir",
   "name" : "TemporaryDir",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12TemporaryDir",
   "self_type" : "_ZTI12TemporaryDir",
   "size" : 1025,
   "source_file" : "/system/core/base/include/android-base/file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "path",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_file_",
     "field_offset" : 8224,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI13TemporaryFile",
   "name" : "TemporaryFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13TemporaryFile",
   "self_type" : "_ZTI13TemporaryFile",
   "size" : 1032,
   "source_file" : "/system/core/base/include/android-base/file.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "archive_size",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "entry_count",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14ZipArchiveInfo",
   "name" : "ZipArchiveInfo",
   "referenced_type" : "_ZTI14ZipArchiveInfo",
   "self_type" : "_ZTI14ZipArchiveInfo",
   "size" : 16,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "handle_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP10ZipArchive"
    },
    {
     "access" : "protected",
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "protected",
     "field_name" : "crc32_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21ZipArchiveStreamEntry",
   "name" : "ZipArchiveStreamEntry",
   "record_kind" : "class",
   "referenced_type" : "_ZTI21ZipArchiveStreamEntry",
   "self_type" : "_ZTI21ZipArchiveStreamEntry",
   "size" : 24,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive_stream_entry.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI21ZipArchiveStreamEntry"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntry4ReadEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntry6VerifyEv"
    },
    {
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntry4InitERK8ZipEntry"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "method",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mod_time",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "unix_mode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "has_data_descriptor",
     "field_offset" : 80,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "crc32",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "compressed_length",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uncompressed_length",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "version_made_by",
     "field_offset" : 256,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "external_file_attributes",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gpbf",
     "field_offset" : 320,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "is_text",
     "field_offset" : 336,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI8ZipEntry",
   "name" : "ZipEntry",
   "referenced_type" : "_ZTI8ZipEntry",
   "self_type" : "_ZTI8ZipEntry",
   "size" : 48,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "file_",
     "referenced_type" : "_ZTIP7__sFILE"
    },
    {
     "access" : "private",
     "field_name" : "seekable_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "current_offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "state_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN9ZipWriter5StateE"
    },
    {
     "access" : "private",
     "field_name" : "files_",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__16vectorIN9ZipWriter9FileEntryENS_9allocatorIS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "current_file_entry_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN9ZipWriter9FileEntryE"
    },
    {
     "access" : "private",
     "field_name" : "z_stream_",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110unique_ptrI10z_stream_sPFvPS1_EEE"
    },
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 704,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTI9ZipWriter",
   "name" : "ZipWriter",
   "record_kind" : "class",
   "referenced_type" : "_ZTI9ZipWriter",
   "self_type" : "_ZTI9ZipWriter",
   "size" : 104,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_writer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN11zip_archive6ReaderE",
   "name" : "zip_archive::Reader",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11zip_archive6ReaderE",
   "self_type" : "_ZTIN11zip_archive6ReaderE",
   "size" : 4,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11zip_archive6ReaderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11zip_archive6Reader12ReadAtOffsetEPhjj"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11zip_archive6ReaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11zip_archive6ReaderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN11zip_archive6WriterE",
   "name" : "zip_archive::Writer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN11zip_archive6WriterE",
   "self_type" : "_ZTIN11zip_archive6WriterE",
   "size" : 4,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11zip_archive6WriterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11zip_archive6Writer6AppendEPhj"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11zip_archive6WriterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11zip_archive6WriterD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogMessageE",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogMessageE",
   "self_type" : "_ZTIN7android4base10LogMessageE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "_ZTIN7android4base5LogIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogdLoggerE",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10LogdLoggerE",
   "self_type" : "_ZTIN7android4base10LogdLoggerE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "base_",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10MappedFileE",
   "name" : "android::base::MappedFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base10MappedFileE",
   "self_type" : "_ZTIN7android4base10MappedFileE",
   "size" : 12,
   "source_file" : "/system/core/base/include/android-base/mapped_file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "_ZTIN7android4base13DefaultCloserE",
   "self_type" : "_ZTIN7android4base13DefaultCloserE",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "_ZTIKi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base13ErrnoRestorerE",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "self_type" : "_ZTIN7android4base13ErrnoRestorerE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKaPaEE",
   "name" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPKaPaEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPKaPaEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKa", "_ZTIPa" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKaS3_EE",
   "name" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPKaS3_EE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPKaS3_EE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKa", "_ZTIPKa" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKcPcEE",
   "name" : "android::base::EagerEvaluator<const char *, char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPKcPcEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPKcPcEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKc", "_ZTIPc" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKcS3_EE",
   "name" : "android::base::EagerEvaluator<const char *, const char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPKcS3_EE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPKcS3_EE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKc", "_ZTIPKc" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKhPhEE",
   "name" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPKhPhEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPKhPhEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKh", "_ZTIPh" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKhS3_EE",
   "name" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPKhS3_EE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPKhS3_EE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPKh", "_ZTIPKh" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPaPKaEE",
   "name" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPaPKaEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPaPKaEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPa", "_ZTIPKa" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPaS2_EE",
   "name" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPaS2_EE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPaS2_EE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPa", "_ZTIPa" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPcPKcEE",
   "name" : "android::base::EagerEvaluator<char *, const char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPcPKcEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPcPKcEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPc", "_ZTIPKc" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPcS2_EE",
   "name" : "android::base::EagerEvaluator<char *, char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPcS2_EE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPcS2_EE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPc", "_ZTIPc" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPhPKhEE",
   "name" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPhPKhEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPhPKhEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPh", "_ZTIPKh" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPhS2_EE",
   "name" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIPhS2_EE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIPhS2_EE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIPh", "_ZTIPh" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIiiEE",
   "name" : "android::base::EagerEvaluator<int, int>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIiiEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIiiEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIi", "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIjiEE",
   "name" : "android::base::EagerEvaluator<unsigned int, int>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIjiEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIjiEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIi" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIjjEE",
   "name" : "android::base::EagerEvaluator<unsigned int, unsigned int>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIjjEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIjjEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIjtEE",
   "name" : "android::base::EagerEvaluator<unsigned int, unsigned short>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIjtEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIjtEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIj", "_ZTIt" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIxjEE",
   "name" : "android::base::EagerEvaluator<long long, unsigned int>",
   "referenced_type" : "_ZTIN7android4base14EagerEvaluatorIxjEE",
   "self_type" : "_ZTIN7android4base14EagerEvaluatorIxjEE",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "_ZTIx", "_ZTIj" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "_ZTIN7android4base13DefaultCloserE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "_ZTIN7android4base11LogSeverityE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base17ScopedLogSeverityE",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "self_type" : "_ZTIN7android4base17ScopedLogSeverityE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "path",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "compression_method",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "crc32",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "compressed_size",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uncompressed_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "last_mod_time",
     "field_offset" : 224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "last_mod_date",
     "field_offset" : 240,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "padding_length",
     "field_offset" : 256,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "local_file_header_offset",
     "field_offset" : 320,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN9ZipWriter9FileEntryE",
   "name" : "ZipWriter::FileEntry",
   "referenced_type" : "_ZTIN9ZipWriter9FileEntryE",
   "self_type" : "_ZTIN9ZipWriter9FileEntryE",
   "size" : 48,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_writer.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIO9ZipWriter",
   "name" : "ZipWriter &&",
   "referenced_type" : "_ZTI9ZipWriter",
   "self_type" : "_ZTIO9ZipWriter",
   "size" : 4,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_writer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTION7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  }
 ]
}
