{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "VkMemoryHeap [16]",
   "name" : "VkMemoryHeap [16]",
   "referenced_type" : "type-473",
   "self_type" : "type-472",
   "size" : 256,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "VkMemoryType [32]",
   "name" : "VkMemoryType [32]",
   "referenced_type" : "type-471",
   "self_type" : "type-470",
   "size" : 256,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "VkOffset3D [2]",
   "name" : "VkOffset3D [2]",
   "referenced_type" : "type-58",
   "self_type" : "type-370",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "VkPhysicalDevice_T *[32]",
   "name" : "VkPhysicalDevice_T *[32]",
   "referenced_type" : "type-1015",
   "self_type" : "type-1017",
   "size" : 256,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "VkPhysicalDevice_T *[32]",
   "name" : "VkPhysicalDevice_T *[32]",
   "referenced_type" : "type-1122",
   "self_type" : "type-1182",
   "size" : 256,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "VkPhysicalDevice_T *[32]",
   "name" : "VkPhysicalDevice_T *[32]",

   "linker_set_key" : "const VkSubpassSampleLocationsEXT",
   "name" : "const VkSubpassSampleLocationsEXT",
   "referenced_type" : "type-1967",
   "self_type" : "type-1972",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const VkSubresourceLayout",
   "name" : "const VkSubresourceLayout",
   "referenced_type" : "type-31",
   "self_type" : "type-1994",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const VkSwapchainCreateInfoKHR",
   "name" : "const VkSwapchainCreateInfoKHR",
   "referenced_type" : "type-533",
   "self_type" : "type-532",
   "size" : 104,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const VkValidationCheckEXT",
   "name" : "const VkValidationCheckEXT",
   "referenced_type" : "type-1857",
   "self_type" : "type-1860",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const VkValidationFeatureDisableEXT",
   "name" : "const VkValidationFeatureDisableEXT",
   "referenced_type" : "type-2105",
   "self_type" : "type-2110",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const VkValidationFeatureEnableEXT",
   "name" : "const VkValidationFeatureEnableEXT",
   "referenced_type" : "type-2104",
   "self_type" : "type-2108",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const VkVertexInputAttributeDescription",
   "name" : "const VkVertexInputAttributeDescription",
   "referenced_type" : "type-166",
   "self_type" : "type-165",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const VkVertexInputBindingDescription",
   "name" : "const VkVertexInputBindingDescription",
   "referenced_type" : "type-162",
   "self_type" : "type-161",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const VkVertexInputBindingDivisorDescriptionEXT",
   "name" : "const VkVertexInputBindingDivisorDescriptionEXT",
   "referenced_type" : "type-2075",
   "self_type" : "type-2078",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const VkViewport",
   "name" : "const VkViewport",
   "referenced_type" : "type-179",
   "self_type" : "type-178",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const VkViewportSwizzleNV",
   "name" : "const VkViewportSwizzleNV",
   "referenced_type" : "type-1921",
   "self_type" : "type-1925",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const VkViewportWScalingNV",
   "name" : "const VkViewportWScalingNV",
   "referenced_type" : "type-1897",
   "self_type" : "type-1900",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const VkWriteDescriptorSet",
   "name" : "const VkWriteDescriptorSet",
   "referenced_type" : "type-286",
   "self_type" : "type-285",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-150",
   "self_type" : "type-149",
   "size" : 1,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const char *const",
   "name" : "const char *const",
   "referenced_type" : "type-148",
   "self_type" : "type-1249",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const float",
   "name" : "const float",
   "referenced_type" : "type-180",
   "self_type" : "type-978",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-59",
   "self_type" : "type-1308",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-95",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-11",
   "self_type" : "type-1991",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-10",
   "self_type" : "type-9",
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "compactedSize",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "info",
     "field_offset" : 192,
     "referenced_type" : "type-2046"
    }
   ],
   "linker_set_key" : "VkAccelerationStructureCreateInfoNV",
   "name" : "VkAccelerationStructureCreateInfoNV",
   "referenced_type" : "type-2049",
   "self_type" : "type-2049",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAccelerationStructureCreateInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "type",
     "field_offset" : 128,
     "referenced_type" : "type-2030"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "instanceCount",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "geometryCount",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pGeometries",
     "field_offset" : 256,
     "referenced_type" : "type-2047"
    }
   ],
   "linker_set_key" : "VkAccelerationStructureInfoNV",
   "name" : "VkAccelerationStructureInfoNV",
   "referenced_type" : "type-2046",
   "self_type" : "type-2046",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAccelerationStructureInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "type",
     "field_offset" : 128,
     "referenced_type" : "type-2032"
    },
    {
     "field_name" : "accelerationStructure",
     "field_offset" : 192,
     "referenced_type" : "type-2051"
    }
   ],
   "linker_set_key" : "VkAccelerationStructureMemoryRequirementsInfoNV",
   "name" : "VkAccelerationStructureMemoryRequirementsInfoNV",
   "referenced_type" : "type-2057",
   "self_type" : "type-2057",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAccelerationStructureMemoryRequirementsInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "swapchain",
     "field_offset" : 128,
     "referenced_type" : "type-537"
    },
    {
     "field_name" : "timeout",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "semaphore",
     "field_offset" : 256,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "fence",
     "field_offset" : 320,
     "referenced_type" : "type-554"
    },
    {
     "field_name" : "deviceMask",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkAcquireNextImageInfoKHR",
   "name" : "VkAcquireNextImageInfoKHR",
   "referenced_type" : "type-553",
   "self_type" : "type-553",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAcquireNextImageInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pUserData",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "pfnAllocation",
     "field_offset" : 64,
     "referenced_type" : "type-2132"
    },
    {
     "field_name" : "pfnReallocation",
     "field_offset" : 128,
     "referenced_type" : "type-2134"
    },
    {
     "field_name" : "pfnFree",
     "field_offset" : 192,
     "referenced_type" : "type-2136"
    },
    {
     "field_name" : "pfnInternalAllocation",
     "field_offset" : 256,
     "referenced_type" : "type-2138"
    },
    {
     "field_name" : "pfnInternalFree",
     "field_offset" : 320,
     "referenced_type" : "type-2138"
    }
   ],
   "linker_set_key" : "VkAllocationCallbacks",
   "name" : "VkAllocationCallbacks",
   "referenced_type" : "type-2131",
   "self_type" : "type-2131",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAllocationCallbacks"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "externalFormat",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "formatFeatures",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "samplerYcbcrConversionComponents",
     "field_offset" : 288,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "suggestedYcbcrModel",
     "field_offset" : 416,
     "referenced_type" : "type-484"
    },
    {
     "field_name" : "suggestedYcbcrRange",
     "field_offset" : 448,
     "referenced_type" : "type-485"
    },
    {
     "field_name" : "suggestedXChromaOffset",
     "field_offset" : 480,
     "referenced_type" : "type-486"
    },
    {
     "field_name" : "suggestedYChromaOffset",
     "field_offset" : 512,
     "referenced_type" : "type-486"
    }
   ],
   "linker_set_key" : "VkAndroidHardwareBufferFormatPropertiesANDROID",
   "name" : "VkAndroidHardwareBufferFormatPropertiesANDROID",
   "referenced_type" : "type-2122",
   "self_type" : "type-2122",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h",
   "unique_id" : "VkAndroidHardwareBufferFormatPropertiesANDROID"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "allocationSize",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "memoryTypeBits",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkAndroidHardwareBufferPropertiesANDROID",
   "name" : "VkAndroidHardwareBufferPropertiesANDROID",
   "referenced_type" : "type-2121",
   "self_type" : "type-2121",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h",
   "unique_id" : "VkAndroidHardwareBufferPropertiesANDROID"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "androidHardwareBufferUsage",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkAndroidHardwareBufferUsageANDROID",
   "name" : "VkAndroidHardwareBufferUsageANDROID",
   "referenced_type" : "type-2120",
   "self_type" : "type-2120",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h",
   "unique_id" : "VkAndroidHardwareBufferUsageANDROID"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "window",
     "field_offset" : 192,
     "referenced_type" : "type-2118"
    }
   ],
   "linker_set_key" : "VkAndroidSurfaceCreateInfoKHR",
   "name" : "VkAndroidSurfaceCreateInfoKHR",
   "referenced_type" : "type-2117",
   "self_type" : "type-2117",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h",
   "unique_id" : "VkAndroidSurfaceCreateInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pApplicationName",
     "field_offset" : 128,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "applicationVersion",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pEngineName",
     "field_offset" : 256,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "engineVersion",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "apiVersion",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkApplicationInfo",
   "name" : "VkApplicationInfo",
   "referenced_type" : "type-2066",
   "self_type" : "type-2066",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkApplicationInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "samples",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "loadOp",
     "field_offset" : 96,
     "referenced_type" : "type-318"
    },
    {
     "field_name" : "storeOp",
     "field_offset" : 128,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "stencilLoadOp",
     "field_offset" : 160,
     "referenced_type" : "type-318"
    },
    {
     "field_name" : "stencilStoreOp",
     "field_offset" : 192,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "initialLayout",
     "field_offset" : 224,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "finalLayout",
     "field_offset" : 256,
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "VkAttachmentDescription",
   "name" : "VkAttachmentDescription",
   "referenced_type" : "type-317",
   "self_type" : "type-317",
   "size" : 36,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAttachmentDescription"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 160,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "samples",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "loadOp",
     "field_offset" : 224,
     "referenced_type" : "type-318"
    },
    {
     "field_name" : "storeOp",
     "field_offset" : 256,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "stencilLoadOp",
     "field_offset" : 288,
     "referenced_type" : "type-318"
    },
    {
     "field_name" : "stencilStoreOp",
     "field_offset" : 320,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "initialLayout",
     "field_offset" : 352,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "finalLayout",
     "field_offset" : 384,
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "VkAttachmentDescription2KHR",
   "name" : "VkAttachmentDescription2KHR",
   "referenced_type" : "type-1690",
   "self_type" : "type-1690",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAttachmentDescription2KHR"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "attachment",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layout",
     "field_offset" : 32,
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "VkAttachmentReference",
   "name" : "VkAttachmentReference",
   "referenced_type" : "type-326",
   "self_type" : "type-326",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAttachmentReference"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "attachment",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layout",
     "field_offset" : 160,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "aspectMask",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkAttachmentReference2KHR",
   "name" : "VkAttachmentReference2KHR",
   "referenced_type" : "type-1693",
   "self_type" : "type-1693",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAttachmentReference2KHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "attachmentIndex",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleLocationsInfo",
     "field_offset" : 64,
     "referenced_type" : "type-1962"
    }
   ],
   "linker_set_key" : "VkAttachmentSampleLocationsEXT",
   "name" : "VkAttachmentSampleLocationsEXT",
   "referenced_type" : "type-1965",
   "self_type" : "type-1965",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkAttachmentSampleLocationsEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-1064"
    }
   ],
   "linker_set_key" : "VkBaseInStructure",
   "name" : "VkBaseInStructure",
   "referenced_type" : "type-1063",
   "self_type" : "type-1063",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBaseInStructure"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-1052"
    }
   ],
   "linker_set_key" : "VkBaseOutStructure",
   "name" : "VkBaseOutStructure",
   "referenced_type" : "type-1051",
   "self_type" : "type-1051",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBaseOutStructure"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "accelerationStructure",
     "field_offset" : 128,
     "referenced_type" : "type-2051"
    },
    {
     "field_name" : "memory",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "memoryOffset",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "deviceIndexCount",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDeviceIndices",
     "field_offset" : 384,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "VkBindAccelerationStructureMemoryInfoNV",
   "name" : "VkBindAccelerationStructureMemoryInfoNV",
   "referenced_type" : "type-2050",
   "self_type" : "type-2050",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBindAccelerationStructureMemoryInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "deviceIndexCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDeviceIndices",
     "field_offset" : 192,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "VkBindBufferMemoryDeviceGroupInfo",
   "name" : "VkBindBufferMemoryDeviceGroupInfo",
   "referenced_type" : "type-1190",
   "self_type" : "type-1190",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBindBufferMemoryDeviceGroupInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "memory",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "memoryOffset",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkBindBufferMemoryInfo",
   "name" : "VkBindBufferMemoryInfo",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBindBufferMemoryInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "deviceIndexCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDeviceIndices",
     "field_offset" : 192,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "splitInstanceBindRegionCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSplitInstanceBindRegions",
     "field_offset" : 320,
     "referenced_type" : "type-181"
    }
   ],
   "linker_set_key" : "VkBindImageMemoryDeviceGroupInfo",
   "name" : "VkBindImageMemoryDeviceGroupInfo",
   "referenced_type" : "type-1195",
   "self_type" : "type-1195",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBindImageMemoryDeviceGroupInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "image",
     "field_offset" : 128,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "memory",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "memoryOffset",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkBindImageMemoryInfo",
   "name" : "VkBindImageMemoryInfo",
   "referenced_type" : "type-422",
   "self_type" : "type-422",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBindImageMemoryInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "swapchain",
     "field_offset" : 128,
     "referenced_type" : "type-537"
    },
    {
     "field_name" : "imageIndex",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkBindImageMemorySwapchainInfoKHR",
   "name" : "VkBindImageMemorySwapchainInfoKHR",
   "referenced_type" : "type-1533",
   "self_type" : "type-1533",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBindImageMemorySwapchainInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "planeAspect",
     "field_offset" : 128,
     "referenced_type" : "type-1369"
    }
   ],
   "linker_set_key" : "VkBindImagePlaneMemoryInfo",
   "name" : "VkBindImagePlaneMemoryInfo",
   "referenced_type" : "type-1368",
   "self_type" : "type-1368",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBindImagePlaneMemoryInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "waitSemaphoreCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pWaitSemaphores",
     "field_offset" : 192,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "bufferBindCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pBufferBinds",
     "field_offset" : 320,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "imageOpaqueBindCount",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pImageOpaqueBinds",
     "field_offset" : 448,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "imageBindCount",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pImageBinds",
     "field_offset" : 576,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "signalSemaphoreCount",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSignalSemaphores",
     "field_offset" : 704,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "VkBindSparseInfo",
   "name" : "VkBindSparseInfo",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 96,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBindSparseInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "srcOffset",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "dstOffset",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkBufferCopy",
   "name" : "VkBufferCopy",
   "referenced_type" : "type-362",
   "self_type" : "type-362",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBufferCopy"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "size",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "usage",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sharingMode",
     "field_offset" : 288,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "queueFamilyIndexCount",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pQueueFamilyIndices",
     "field_offset" : 384,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "VkBufferCreateInfo",
   "name" : "VkBufferCreateInfo",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBufferCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "deviceAddress",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkBufferDeviceAddressCreateInfoEXT",
   "name" : "VkBufferDeviceAddressCreateInfoEXT",
   "referenced_type" : "type-2102",
   "self_type" : "type-2102",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBufferDeviceAddressCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "VkBufferDeviceAddressInfoEXT",
   "name" : "VkBufferDeviceAddressInfoEXT",
   "referenced_type" : "type-2101",
   "self_type" : "type-2101",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBufferDeviceAddressInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bufferOffset",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "bufferRowLength",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bufferImageHeight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "imageSubresource",
     "field_offset" : 128,
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "imageOffset",
     "field_offset" : 256,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "imageExtent",
     "field_offset" : 352,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "VkBufferImageCopy",
   "name" : "VkBufferImageCopy",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBufferImageCopy"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "srcAccessMask",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dstAccessMask",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "srcQueueFamilyIndex",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dstQueueFamilyIndex",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 256,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "offset",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "size",
     "field_offset" : 384,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkBufferMemoryBarrier",
   "name" : "VkBufferMemoryBarrier",
   "referenced_type" : "type-401",
   "self_type" : "type-401",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBufferMemoryBarrier"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "VkBufferMemoryRequirementsInfo2",
   "name" : "VkBufferMemoryRequirementsInfo2",
   "referenced_type" : "type-435",
   "self_type" : "type-435",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBufferMemoryRequirementsInfo2"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 192,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "format",
     "field_offset" : 256,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "offset",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "range",
     "field_offset" : 384,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkBufferViewCreateInfo",
   "name" : "VkBufferViewCreateInfo",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkBufferViewCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "timeDomain",
     "field_offset" : 128,
     "referenced_type" : "type-2069"
    }
   ],
   "linker_set_key" : "VkCalibratedTimestampInfoEXT",
   "name" : "VkCalibratedTimestampInfoEXT",
   "referenced_type" : "type-2070",
   "self_type" : "type-2070",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCalibratedTimestampInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "stage",
     "field_offset" : 128,
     "referenced_type" : "type-1621"
    },
    {
     "field_name" : "pCheckpointMarker",
     "field_offset" : 192,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "VkCheckpointDataNV",
   "name" : "VkCheckpointDataNV",
   "referenced_type" : "type-2089",
   "self_type" : "type-2089",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCheckpointDataNV"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aspectMask",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "colorAttachment",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "clearValue",
     "field_offset" : 64,
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "VkClearAttachment",
   "name" : "VkClearAttachment",
   "referenced_type" : "type-386",
   "self_type" : "type-386",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkClearAttachment"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "float32",
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "int32",
     "referenced_type" : "type-377"
    },
    {
     "field_name" : "uint32",
     "referenced_type" : "type-378"
    }
   ],
   "linker_set_key" : "VkClearColorValue",
   "name" : "VkClearColorValue",
   "record_kind" : "union",
   "referenced_type" : "type-376",
   "self_type" : "type-376",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkClearColorValue"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "depth",
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "stencil",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkClearDepthStencilValue",
   "name" : "VkClearDepthStencilValue",
   "referenced_type" : "type-383",
   "self_type" : "type-383",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkClearDepthStencilValue"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rect",
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "baseArrayLayer",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkClearRect",
   "name" : "VkClearRect",
   "referenced_type" : "type-390",
   "self_type" : "type-390",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkClearRect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "color",
     "referenced_type" : "type-376"
    },
    {
     "field_name" : "depthStencil",
     "referenced_type" : "type-383"
    }
   ],
   "linker_set_key" : "VkClearValue",
   "name" : "VkClearValue",
   "record_kind" : "union",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkClearValue"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "objectTable",
     "field_offset" : 128,
     "referenced_type" : "type-1881"
    },
    {
     "field_name" : "indirectCommandsLayout",
     "field_offset" : 192,
     "referenced_type" : "type-1883"
    },
    {
     "field_name" : "indirectCommandsTokenCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pIndirectCommandsTokens",
     "field_offset" : 320,
     "referenced_type" : "type-1885"
    },
    {
     "field_name" : "maxSequencesCount",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "targetCommandBuffer",
     "field_offset" : 448,
     "referenced_type" : "type-1708"
    },
    {
     "field_name" : "sequencesCountBuffer",
     "field_offset" : 512,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "sequencesCountOffset",
     "field_offset" : 576,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sequencesIndexBuffer",
     "field_offset" : 640,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "sequencesIndexOffset",
     "field_offset" : 704,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkCmdProcessCommandsInfoNVX",
   "name" : "VkCmdProcessCommandsInfoNVX",
   "referenced_type" : "type-1880",
   "self_type" : "type-1880",
   "size" : 96,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCmdProcessCommandsInfoNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "objectTable",
     "field_offset" : 128,
     "referenced_type" : "type-1881"
    },
    {
     "field_name" : "indirectCommandsLayout",
     "field_offset" : 192,
     "referenced_type" : "type-1883"
    },
    {
     "field_name" : "maxSequencesCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkCmdReserveSpaceForCommandsInfoNVX",
   "name" : "VkCmdReserveSpaceForCommandsInfoNVX",
   "referenced_type" : "type-1887",
   "self_type" : "type-1887",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCmdReserveSpaceForCommandsInfoNVX"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pixelX",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pixelY",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sample",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkCoarseSampleLocationNV",
   "name" : "VkCoarseSampleLocationNV",
   "referenced_type" : "type-2020",
   "self_type" : "type-2020",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCoarseSampleLocationNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "shadingRate",
     "referenced_type" : "type-2008"
    },
    {
     "field_name" : "sampleCount",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleLocationCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSampleLocations",
     "field_offset" : 128,
     "referenced_type" : "type-2022"
    }
   ],
   "linker_set_key" : "VkCoarseSampleOrderCustomNV",
   "name" : "VkCoarseSampleOrderCustomNV",
   "referenced_type" : "type-2021",
   "self_type" : "type-2021",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCoarseSampleOrderCustomNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "commandPool",
     "field_offset" : 128,
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "level",
     "field_offset" : 192,
     "referenced_type" : "type-345"
    },
    {
     "field_name" : "commandBufferCount",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkCommandBufferAllocateInfo",
   "name" : "VkCommandBufferAllocateInfo",
   "referenced_type" : "type-342",
   "self_type" : "type-342",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCommandBufferAllocateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pInheritanceInfo",
     "field_offset" : 192,
     "referenced_type" : "type-352"
    }
   ],
   "linker_set_key" : "VkCommandBufferBeginInfo",
   "name" : "VkCommandBufferBeginInfo",
   "referenced_type" : "type-351",
   "self_type" : "type-351",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCommandBufferBeginInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "conditionalRenderingEnable",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkCommandBufferInheritanceConditionalRenderingInfoEXT",
   "name" : "VkCommandBufferInheritanceConditionalRenderingInfoEXT",
   "referenced_type" : "type-1866",
   "self_type" : "type-1866",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCommandBufferInheritanceConditionalRenderingInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "renderPass",
     "field_offset" : 128,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "subpass",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "framebuffer",
     "field_offset" : 256,
     "referenced_type" : "type-355"
    },
    {
     "field_name" : "occlusionQueryEnable",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "queryFlags",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pipelineStatistics",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkCommandBufferInheritanceInfo",
   "name" : "VkCommandBufferInheritanceInfo",
   "referenced_type" : "type-354",
   "self_type" : "type-354",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCommandBufferInheritanceInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "queueFamilyIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkCommandPoolCreateInfo",
   "name" : "VkCommandPoolCreateInfo",
   "referenced_type" : "type-336",
   "self_type" : "type-336",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCommandPoolCreateInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "a",
     "field_offset" : 96,
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "VkComponentMapping",
   "name" : "VkComponentMapping",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkComponentMapping"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stage",
     "field_offset" : 192,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "layout",
     "field_offset" : 576,
     "referenced_type" : "type-216"
    },
    {
     "field_name" : "basePipelineHandle",
     "field_offset" : 640,
     "referenced_type" : "type-220"
    },
    {
     "field_name" : "basePipelineIndex",
     "field_offset" : 704,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "VkComputePipelineCreateInfo",
   "name" : "VkComputePipelineCreateInfo",
   "referenced_type" : "type-227",
   "self_type" : "type-227",
   "size" : 96,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkComputePipelineCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "offset",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkConditionalRenderingBeginInfoEXT",
   "name" : "VkConditionalRenderingBeginInfoEXT",
   "referenced_type" : "type-1864",
   "self_type" : "type-1864",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkConditionalRenderingBeginInfoEXT"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "major",
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "minor",
     "field_offset" : 8,
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "subminor",
     "field_offset" : 16,
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "patch",
     "field_offset" : 24,
     "referenced_type" : "type-451"
    }
   ],
   "linker_set_key" : "VkConformanceVersionKHR",
   "name" : "VkConformanceVersionKHR",
   "referenced_type" : "type-1819",
   "self_type" : "type-1819",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkConformanceVersionKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "MSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "NSize",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "KSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "AType",
     "field_offset" : 224,
     "referenced_type" : "type-2111"
    },
    {
     "field_name" : "BType",
     "field_offset" : 256,
     "referenced_type" : "type-2111"
    },
    {
     "field_name" : "CType",
     "field_offset" : 288,
     "referenced_type" : "type-2111"
    },
    {
     "field_name" : "DType",
     "field_offset" : 320,
     "referenced_type" : "type-2111"
    },
    {
     "field_name" : "scope",
     "field_offset" : 352,
     "referenced_type" : "type-2112"
    }
   ],
   "linker_set_key" : "VkCooperativeMatrixPropertiesNV",
   "name" : "VkCooperativeMatrixPropertiesNV",
   "referenced_type" : "type-2113",
   "self_type" : "type-2113",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCooperativeMatrixPropertiesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "srcSet",
     "field_offset" : 128,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "srcBinding",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "srcArrayElement",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dstSet",
     "field_offset" : 256,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "dstBinding",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dstArrayElement",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorCount",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkCopyDescriptorSet",
   "name" : "VkCopyDescriptorSet",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkCopyDescriptorSet"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pMarkerName",
     "field_offset" : 128,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "color",
     "field_offset" : 192,
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "VkDebugMarkerMarkerInfoEXT",
   "name" : "VkDebugMarkerMarkerInfoEXT",
   "referenced_type" : "type-1837",
   "self_type" : "type-1837",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDebugMarkerMarkerInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "objectType",
     "field_offset" : 128,
     "referenced_type" : "type-1827"
    },
    {
     "field_name" : "object",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "pObjectName",
     "field_offset" : 256,
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "VkDebugMarkerObjectNameInfoEXT",
   "name" : "VkDebugMarkerObjectNameInfoEXT",
   "referenced_type" : "type-1835",
   "self_type" : "type-1835",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDebugMarkerObjectNameInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "objectType",
     "field_offset" : 128,
     "referenced_type" : "type-1827"
    },
    {
     "field_name" : "object",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "tagName",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "tagSize",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "pTag",
     "field_offset" : 384,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "VkDebugMarkerObjectTagInfoEXT",
   "name" : "VkDebugMarkerObjectTagInfoEXT",
   "referenced_type" : "type-1836",
   "self_type" : "type-1836",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDebugMarkerObjectTagInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pfnCallback",
     "field_offset" : 192,
     "referenced_type" : "type-1830"
    },
    {
     "field_name" : "pUserData",
     "field_offset" : 256,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "VkDebugReportCallbackCreateInfoEXT",
   "name" : "VkDebugReportCallbackCreateInfoEXT",
   "referenced_type" : "type-1829",
   "self_type" : "type-1829",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDebugReportCallbackCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pLabelName",
     "field_offset" : 128,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "color",
     "field_offset" : 192,
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "VkDebugUtilsLabelEXT",
   "name" : "VkDebugUtilsLabelEXT",
   "referenced_type" : "type-1941",
   "self_type" : "type-1941",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDebugUtilsLabelEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pMessageIdName",
     "field_offset" : 192,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "messageIdNumber",
     "field_offset" : 256,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "pMessage",
     "field_offset" : 320,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "queueLabelCount",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pQueueLabels",
     "field_offset" : 448,
     "referenced_type" : "type-1943"
    },
    {
     "field_name" : "cmdBufLabelCount",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pCmdBufLabels",
     "field_offset" : 576,
     "referenced_type" : "type-1943"
    },
    {
     "field_name" : "objectCount",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pObjects",
     "field_offset" : 704,
     "referenced_type" : "type-1945"
    }
   ],
   "linker_set_key" : "VkDebugUtilsMessengerCallbackDataEXT",
   "name" : "VkDebugUtilsMessengerCallbackDataEXT",
   "referenced_type" : "type-1942",
   "self_type" : "type-1942",
   "size" : 96,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDebugUtilsMessengerCallbackDataEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "messageSeverity",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "messageType",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pfnUserCallback",
     "field_offset" : 256,
     "referenced_type" : "type-1949"
    },
    {
     "field_name" : "pUserData",
     "field_offset" : 320,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "VkDebugUtilsMessengerCreateInfoEXT",
   "name" : "VkDebugUtilsMessengerCreateInfoEXT",
   "referenced_type" : "type-1948",
   "self_type" : "type-1948",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDebugUtilsMessengerCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "objectType",
     "field_offset" : 128,
     "referenced_type" : "type-1214"
    },
    {
     "field_name" : "objectHandle",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "pObjectName",
     "field_offset" : 256,
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "VkDebugUtilsObjectNameInfoEXT",
   "name" : "VkDebugUtilsObjectNameInfoEXT",
   "referenced_type" : "type-1939",
   "self_type" : "type-1939",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDebugUtilsObjectNameInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "objectType",
     "field_offset" : 128,
     "referenced_type" : "type-1214"
    },
    {
     "field_name" : "objectHandle",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "tagName",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "tagSize",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "pTag",
     "field_offset" : 384,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "VkDebugUtilsObjectTagInfoEXT",
   "name" : "VkDebugUtilsObjectTagInfoEXT",
   "referenced_type" : "type-1940",
   "self_type" : "type-1940",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDebugUtilsObjectTagInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "dedicatedAllocation",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDedicatedAllocationBufferCreateInfoNV",
   "name" : "VkDedicatedAllocationBufferCreateInfoNV",
   "referenced_type" : "type-1839",
   "self_type" : "type-1839",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDedicatedAllocationBufferCreateInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "dedicatedAllocation",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDedicatedAllocationImageCreateInfoNV",
   "name" : "VkDedicatedAllocationImageCreateInfoNV",
   "referenced_type" : "type-1838",
   "self_type" : "type-1838",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDedicatedAllocationImageCreateInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "image",
     "field_offset" : 128,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 192,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "VkDedicatedAllocationMemoryAllocateInfoNV",
   "name" : "VkDedicatedAllocationMemoryAllocateInfoNV",
   "referenced_type" : "type-1840",
   "self_type" : "type-1840",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDedicatedAllocationMemoryAllocateInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "range",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkDescriptorBufferInfo",
   "name" : "VkDescriptorBufferInfo",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorBufferInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampler",
     "referenced_type" : "type-260"
    },
    {
     "field_name" : "imageView",
     "field_offset" : 64,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "imageLayout",
     "field_offset" : 128,
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "VkDescriptorImageInfo",
   "name" : "VkDescriptorImageInfo",
   "referenced_type" : "type-291",
   "self_type" : "type-291",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorImageInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSets",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "poolSizeCount",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pPoolSizes",
     "field_offset" : 256,
     "referenced_type" : "type-268"
    }
   ],
   "linker_set_key" : "VkDescriptorPoolCreateInfo",
   "name" : "VkDescriptorPoolCreateInfo",
   "referenced_type" : "type-267",
   "self_type" : "type-267",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorPoolCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "maxInlineUniformBlockBindings",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDescriptorPoolInlineUniformBlockCreateInfoEXT",
   "name" : "VkDescriptorPoolInlineUniformBlockCreateInfoEXT",
   "referenced_type" : "type-1960",
   "self_type" : "type-1960",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorPoolInlineUniformBlockCreateInfoEXT"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "descriptorCount",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDescriptorPoolSize",
   "name" : "VkDescriptorPoolSize",
   "referenced_type" : "type-270",
   "self_type" : "type-270",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorPoolSize"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "descriptorPool",
     "field_offset" : 128,
     "referenced_type" : "type-277"
    },
    {
     "field_name" : "descriptorSetCount",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSetLayouts",
     "field_offset" : 256,
     "referenced_type" : "type-231"
    }
   ],
   "linker_set_key" : "VkDescriptorSetAllocateInfo",
   "name" : "VkDescriptorSetAllocateInfo",
   "referenced_type" : "type-276",
   "self_type" : "type-276",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorSetAllocateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "binding",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorType",
     "field_offset" : 32,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "descriptorCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stageFlags",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pImmutableSamplers",
     "field_offset" : 128,
     "referenced_type" : "type-258"
    }
   ],
   "linker_set_key" : "VkDescriptorSetLayoutBinding",
   "name" : "VkDescriptorSetLayoutBinding",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorSetLayoutBinding"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "bindingCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pBindingFlags",
     "field_offset" : 192,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "VkDescriptorSetLayoutBindingFlagsCreateInfoEXT",
   "name" : "VkDescriptorSetLayoutBindingFlagsCreateInfoEXT",
   "referenced_type" : "type-2003",
   "self_type" : "type-2003",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorSetLayoutBindingFlagsCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bindingCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pBindings",
     "field_offset" : 192,
     "referenced_type" : "type-254"
    }
   ],
   "linker_set_key" : "VkDescriptorSetLayoutCreateInfo",
   "name" : "VkDescriptorSetLayoutCreateInfo",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorSetLayoutCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "supported",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDescriptorSetLayoutSupport",
   "name" : "VkDescriptorSetLayoutSupport",
   "referenced_type" : "type-519",
   "self_type" : "type-519",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorSetLayoutSupport"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "descriptorSetCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDescriptorCounts",
     "field_offset" : 192,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "VkDescriptorSetVariableDescriptorCountAllocateInfoEXT",
   "name" : "VkDescriptorSetVariableDescriptorCountAllocateInfoEXT",
   "referenced_type" : "type-2006",
   "self_type" : "type-2006",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorSetVariableDescriptorCountAllocateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxVariableDescriptorCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDescriptorSetVariableDescriptorCountLayoutSupportEXT",
   "name" : "VkDescriptorSetVariableDescriptorCountLayoutSupportEXT",
   "referenced_type" : "type-2007",
   "self_type" : "type-2007",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorSetVariableDescriptorCountLayoutSupportEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorUpdateEntryCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDescriptorUpdateEntries",
     "field_offset" : 192,
     "referenced_type" : "type-491"
    },
    {
     "field_name" : "templateType",
     "field_offset" : 256,
     "referenced_type" : "type-494"
    },
    {
     "field_name" : "descriptorSetLayout",
     "field_offset" : 320,
     "referenced_type" : "type-233"
    },
    {
     "field_name" : "pipelineBindPoint",
     "field_offset" : 384,
     "referenced_type" : "type-323"
    },
    {
     "field_name" : "pipelineLayout",
     "field_offset" : 448,
     "referenced_type" : "type-216"
    },
    {
     "field_name" : "set",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDescriptorUpdateTemplateCreateInfo",
   "name" : "VkDescriptorUpdateTemplateCreateInfo",
   "referenced_type" : "type-490",
   "self_type" : "type-490",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorUpdateTemplateCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dstBinding",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dstArrayElement",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorType",
     "field_offset" : 96,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkDescriptorUpdateTemplateEntry",
   "name" : "VkDescriptorUpdateTemplateEntry",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDescriptorUpdateTemplateEntry"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "queueCreateInfoCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pQueueCreateInfos",
     "field_offset" : 192,
     "referenced_type" : "type-1246"
    },
    {
     "field_name" : "enabledLayerCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ppEnabledLayerNames",
     "field_offset" : 320,
     "referenced_type" : "type-1248"
    },
    {
     "field_name" : "enabledExtensionCount",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ppEnabledExtensionNames",
     "field_offset" : 448,
     "referenced_type" : "type-1248"
    },
    {
     "field_name" : "pEnabledFeatures",
     "field_offset" : 512,
     "referenced_type" : "type-1250"
    }
   ],
   "linker_set_key" : "VkDeviceCreateInfo",
   "name" : "VkDeviceCreateInfo",
   "referenced_type" : "type-1245",
   "self_type" : "type-1245",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "deviceEvent",
     "field_offset" : 128,
     "referenced_type" : "type-1906"
    }
   ],
   "linker_set_key" : "VkDeviceEventInfoEXT",
   "name" : "VkDeviceEventInfoEXT",
   "referenced_type" : "type-1909",
   "self_type" : "type-1909",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceEventInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "computeBindingPointSupport",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDeviceGeneratedCommandsFeaturesNVX",
   "name" : "VkDeviceGeneratedCommandsFeaturesNVX",
   "referenced_type" : "type-1872",
   "self_type" : "type-1872",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGeneratedCommandsFeaturesNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "maxIndirectCommandsLayoutTokenCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxObjectEntryCounts",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSequenceCountBufferOffsetAlignment",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSequenceIndexBufferOffsetAlignment",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minCommandsTokenBufferOffsetAlignment",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDeviceGeneratedCommandsLimitsNVX",
   "name" : "VkDeviceGeneratedCommandsLimitsNVX",
   "referenced_type" : "type-1873",
   "self_type" : "type-1873",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGeneratedCommandsLimitsNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "resourceDeviceIndex",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "memoryDeviceIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDeviceGroupBindSparseInfo",
   "name" : "VkDeviceGroupBindSparseInfo",
   "referenced_type" : "type-1188",
   "self_type" : "type-1188",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGroupBindSparseInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "deviceMask",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDeviceGroupCommandBufferBeginInfo",
   "name" : "VkDeviceGroupCommandBufferBeginInfo",
   "referenced_type" : "type-1181",
   "self_type" : "type-1181",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGroupCommandBufferBeginInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "physicalDeviceCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pPhysicalDevices",
     "field_offset" : 192,
     "referenced_type" : "type-1206"
    }
   ],
   "linker_set_key" : "VkDeviceGroupDeviceCreateInfo",
   "name" : "VkDeviceGroupDeviceCreateInfo",
   "referenced_type" : "type-1205",
   "self_type" : "type-1205",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGroupDeviceCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "presentMask",
     "field_offset" : 128,
     "referenced_type" : "type-550"
    },
    {
     "field_name" : "modes",
     "field_offset" : 1152,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDeviceGroupPresentCapabilitiesKHR",
   "name" : "VkDeviceGroupPresentCapabilitiesKHR",
   "referenced_type" : "type-549",
   "self_type" : "type-549",
   "size" : 152,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGroupPresentCapabilitiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "swapchainCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDeviceMasks",
     "field_offset" : 192,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "mode",
     "field_offset" : 256,
     "referenced_type" : "type-1496"
    }
   ],
   "linker_set_key" : "VkDeviceGroupPresentInfoKHR",
   "name" : "VkDeviceGroupPresentInfoKHR",
   "referenced_type" : "type-1570",
   "self_type" : "type-1570",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGroupPresentInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "deviceMask",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "deviceRenderAreaCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDeviceRenderAreas",
     "field_offset" : 192,
     "referenced_type" : "type-181"
    }
   ],
   "linker_set_key" : "VkDeviceGroupRenderPassBeginInfo",
   "name" : "VkDeviceGroupRenderPassBeginInfo",
   "referenced_type" : "type-1178",
   "self_type" : "type-1178",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGroupRenderPassBeginInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "waitSemaphoreCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pWaitSemaphoreDeviceIndices",
     "field_offset" : 192,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "commandBufferCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pCommandBufferDeviceMasks",
     "field_offset" : 320,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "signalSemaphoreCount",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSignalSemaphoreDeviceIndices",
     "field_offset" : 448,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "VkDeviceGroupSubmitInfo",
   "name" : "VkDeviceGroupSubmitInfo",
   "referenced_type" : "type-1187",
   "self_type" : "type-1187",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGroupSubmitInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "modes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDeviceGroupSwapchainCreateInfoKHR",
   "name" : "VkDeviceGroupSwapchainCreateInfoKHR",
   "referenced_type" : "type-1575",
   "self_type" : "type-1575",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceGroupSwapchainCreateInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "overallocationBehavior",
     "field_offset" : 128,
     "referenced_type" : "type-2072"
    }
   ],
   "linker_set_key" : "VkDeviceMemoryOverallocationCreateInfoAMD",
   "name" : "VkDeviceMemoryOverallocationCreateInfoAMD",
   "referenced_type" : "type-2073",
   "self_type" : "type-2073",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceMemoryOverallocationCreateInfoAMD"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "queueFamilyIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "queueCount",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pQueuePriorities",
     "field_offset" : 256,
     "referenced_type" : "type-977"
    }
   ],
   "linker_set_key" : "VkDeviceQueueCreateInfo",
   "name" : "VkDeviceQueueCreateInfo",
   "referenced_type" : "type-976",
   "self_type" : "type-976",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceQueueCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "globalPriority",
     "field_offset" : 128,
     "referenced_type" : "type-2063"
    }
   ],
   "linker_set_key" : "VkDeviceQueueGlobalPriorityCreateInfoEXT",
   "name" : "VkDeviceQueueGlobalPriorityCreateInfoEXT",
   "referenced_type" : "type-2064",
   "self_type" : "type-2064",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceQueueGlobalPriorityCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "queueFamilyIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "queueIndex",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDeviceQueueInfo2",
   "name" : "VkDeviceQueueInfo2",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDeviceQueueInfo2"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDispatchIndirectCommand",
   "name" : "VkDispatchIndirectCommand",
   "referenced_type" : "type-1040",
   "self_type" : "type-1040",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDispatchIndirectCommand"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "displayEvent",
     "field_offset" : 128,
     "referenced_type" : "type-1907"
    }
   ],
   "linker_set_key" : "VkDisplayEventInfoEXT",
   "name" : "VkDisplayEventInfoEXT",
   "referenced_type" : "type-1910",
   "self_type" : "type-1910",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayEventInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "parameters",
     "field_offset" : 160,
     "referenced_type" : "type-1587"
    }
   ],
   "linker_set_key" : "VkDisplayModeCreateInfoKHR",
   "name" : "VkDisplayModeCreateInfoKHR",
   "referenced_type" : "type-1599",
   "self_type" : "type-1599",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayModeCreateInfoKHR"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "visibleRegion",
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "refreshRate",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDisplayModeParametersKHR",
   "name" : "VkDisplayModeParametersKHR",
   "referenced_type" : "type-1587",
   "self_type" : "type-1587",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayModeParametersKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "displayModeProperties",
     "field_offset" : 128,
     "referenced_type" : "type-1592"
    }
   ],
   "linker_set_key" : "VkDisplayModeProperties2KHR",
   "name" : "VkDisplayModeProperties2KHR",
   "referenced_type" : "type-1799",
   "self_type" : "type-1799",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayModeProperties2KHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "displayMode",
     "referenced_type" : "type-1593"
    },
    {
     "field_name" : "parameters",
     "field_offset" : 64,
     "referenced_type" : "type-1587"
    }
   ],
   "linker_set_key" : "VkDisplayModePropertiesKHR",
   "name" : "VkDisplayModePropertiesKHR",
   "referenced_type" : "type-1592",
   "self_type" : "type-1592",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayModePropertiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "capabilities",
     "field_offset" : 128,
     "referenced_type" : "type-1607"
    }
   ],
   "linker_set_key" : "VkDisplayPlaneCapabilities2KHR",
   "name" : "VkDisplayPlaneCapabilities2KHR",
   "referenced_type" : "type-1803",
   "self_type" : "type-1803",
   "size" : 88,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayPlaneCapabilities2KHR"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "supportedAlpha",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSrcPosition",
     "field_offset" : 32,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "maxSrcPosition",
     "field_offset" : 96,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "minSrcExtent",
     "field_offset" : 160,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "maxSrcExtent",
     "field_offset" : 224,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "minDstPosition",
     "field_offset" : 288,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "maxDstPosition",
     "field_offset" : 352,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "minDstExtent",
     "field_offset" : 416,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "maxDstExtent",
     "field_offset" : 480,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "VkDisplayPlaneCapabilitiesKHR",
   "name" : "VkDisplayPlaneCapabilitiesKHR",
   "referenced_type" : "type-1607",
   "self_type" : "type-1607",
   "size" : 68,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayPlaneCapabilitiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "mode",
     "field_offset" : 128,
     "referenced_type" : "type-1593"
    },
    {
     "field_name" : "planeIndex",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDisplayPlaneInfo2KHR",
   "name" : "VkDisplayPlaneInfo2KHR",
   "referenced_type" : "type-1800",
   "self_type" : "type-1800",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayPlaneInfo2KHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "displayPlaneProperties",
     "field_offset" : 128,
     "referenced_type" : "type-1615"
    }
   ],
   "linker_set_key" : "VkDisplayPlaneProperties2KHR",
   "name" : "VkDisplayPlaneProperties2KHR",
   "referenced_type" : "type-1798",
   "self_type" : "type-1798",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayPlaneProperties2KHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "currentDisplay",
     "referenced_type" : "type-1582"
    },
    {
     "field_name" : "currentStackIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDisplayPlanePropertiesKHR",
   "name" : "VkDisplayPlanePropertiesKHR",
   "referenced_type" : "type-1615",
   "self_type" : "type-1615",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayPlanePropertiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "powerState",
     "field_offset" : 128,
     "referenced_type" : "type-1905"
    }
   ],
   "linker_set_key" : "VkDisplayPowerInfoEXT",
   "name" : "VkDisplayPowerInfoEXT",
   "referenced_type" : "type-1908",
   "self_type" : "type-1908",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayPowerInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "srcRect",
     "field_offset" : 128,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "dstRect",
     "field_offset" : 256,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "persistent",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDisplayPresentInfoKHR",
   "name" : "VkDisplayPresentInfoKHR",
   "referenced_type" : "type-1619",
   "self_type" : "type-1619",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayPresentInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "displayProperties",
     "field_offset" : 128,
     "referenced_type" : "type-1581"
    }
   ],
   "linker_set_key" : "VkDisplayProperties2KHR",
   "name" : "VkDisplayProperties2KHR",
   "referenced_type" : "type-1795",
   "self_type" : "type-1795",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayProperties2KHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "type-1582"
    },
    {
     "field_name" : "displayName",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "physicalDimensions",
     "field_offset" : 128,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "physicalResolution",
     "field_offset" : 192,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "supportedTransforms",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "planeReorderPossible",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "persistentContent",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDisplayPropertiesKHR",
   "name" : "VkDisplayPropertiesKHR",
   "referenced_type" : "type-1581",
   "self_type" : "type-1581",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplayPropertiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "displayMode",
     "field_offset" : 192,
     "referenced_type" : "type-1593"
    },
    {
     "field_name" : "planeIndex",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "planeStackIndex",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transform",
     "field_offset" : 320,
     "referenced_type" : "type-522"
    },
    {
     "field_name" : "globalAlpha",
     "field_offset" : 352,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "alphaMode",
     "field_offset" : 384,
     "referenced_type" : "type-1576"
    },
    {
     "field_name" : "imageExtent",
     "field_offset" : 416,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "VkDisplaySurfaceCreateInfoKHR",
   "name" : "VkDisplaySurfaceCreateInfoKHR",
   "referenced_type" : "type-1618",
   "self_type" : "type-1618",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDisplaySurfaceCreateInfoKHR"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "indexCount",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "instanceCount",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "firstIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vertexOffset",
     "field_offset" : 96,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "firstInstance",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDrawIndexedIndirectCommand",
   "name" : "VkDrawIndexedIndirectCommand",
   "referenced_type" : "type-1045",
   "self_type" : "type-1045",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDrawIndexedIndirectCommand"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vertexCount",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "instanceCount",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "firstVertex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "firstInstance",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDrawIndirectCommand",
   "name" : "VkDrawIndirectCommand",
   "referenced_type" : "type-1048",
   "self_type" : "type-1048",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDrawIndirectCommand"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "taskCount",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "firstTask",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDrawMeshTasksIndirectCommandNV",
   "name" : "VkDrawMeshTasksIndirectCommandNV",
   "referenced_type" : "type-2083",
   "self_type" : "type-2083",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDrawMeshTasksIndirectCommandNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "drmFormatModifier",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "drmFormatModifierPlaneCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "drmFormatModifierTilingFeatures",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkDrmFormatModifierPropertiesEXT",
   "name" : "VkDrmFormatModifierPropertiesEXT",
   "referenced_type" : "type-1984",
   "self_type" : "type-1984",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDrmFormatModifierPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "drmFormatModifierCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDrmFormatModifierProperties",
     "field_offset" : 192,
     "referenced_type" : "type-1986"
    }
   ],
   "linker_set_key" : "VkDrmFormatModifierPropertiesListEXT",
   "name" : "VkDrmFormatModifierPropertiesListEXT",
   "referenced_type" : "type-1985",
   "self_type" : "type-1985",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkDrmFormatModifierPropertiesListEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkEventCreateInfo",
   "name" : "VkEventCreateInfo",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkEventCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExportFenceCreateInfo",
   "name" : "VkExportFenceCreateInfo",
   "referenced_type" : "type-1435",
   "self_type" : "type-1435",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExportFenceCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExportMemoryAllocateInfo",
   "name" : "VkExportMemoryAllocateInfo",
   "referenced_type" : "type-1434",
   "self_type" : "type-1434",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExportMemoryAllocateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExportMemoryAllocateInfoNV",
   "name" : "VkExportMemoryAllocateInfoNV",
   "referenced_type" : "type-1855",
   "self_type" : "type-1855",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExportMemoryAllocateInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExportSemaphoreCreateInfo",
   "name" : "VkExportSemaphoreCreateInfo",
   "referenced_type" : "type-1445",
   "self_type" : "type-1445",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExportSemaphoreCreateInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "extensionName",
     "referenced_type" : "type-449"
    },
    {
     "field_name" : "specVersion",
     "field_offset" : 2048,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExtensionProperties",
   "name" : "VkExtensionProperties",
   "referenced_type" : "type-1620",
   "self_type" : "type-1620",
   "size" : 260,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExtensionProperties"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExtent2D",
   "name" : "VkExtent2D",
   "referenced_type" : "type-185",
   "self_type" : "type-185",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExtent2D"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depth",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExtent3D",
   "name" : "VkExtent3D",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExtent3D"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "externalMemoryProperties",
     "field_offset" : 128,
     "referenced_type" : "type-505"
    }
   ],
   "linker_set_key" : "VkExternalBufferProperties",
   "name" : "VkExternalBufferProperties",
   "referenced_type" : "type-504",
   "self_type" : "type-504",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExternalBufferProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "exportFromImportedHandleTypes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "compatibleHandleTypes",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "externalFenceFeatures",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExternalFenceProperties",
   "name" : "VkExternalFenceProperties",
   "referenced_type" : "type-511",
   "self_type" : "type-511",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExternalFenceProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "externalFormat",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkExternalFormatANDROID",
   "name" : "VkExternalFormatANDROID",
   "referenced_type" : "type-2127",
   "self_type" : "type-2127",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h",
   "unique_id" : "VkExternalFormatANDROID"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "externalMemoryProperties",
     "field_offset" : 128,
     "referenced_type" : "type-505"
    }
   ],
   "linker_set_key" : "VkExternalImageFormatProperties",
   "name" : "VkExternalImageFormatProperties",
   "referenced_type" : "type-1409",
   "self_type" : "type-1409",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExternalImageFormatProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "imageFormatProperties",
     "referenced_type" : "type-463"
    },
    {
     "field_name" : "externalMemoryFeatures",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "exportFromImportedHandleTypes",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "compatibleHandleTypes",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExternalImageFormatPropertiesNV",
   "name" : "VkExternalImageFormatPropertiesNV",
   "referenced_type" : "type-1853",
   "self_type" : "type-1853",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExternalImageFormatPropertiesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExternalMemoryBufferCreateInfo",
   "name" : "VkExternalMemoryBufferCreateInfo",
   "referenced_type" : "type-1431",
   "self_type" : "type-1431",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExternalMemoryBufferCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExternalMemoryImageCreateInfo",
   "name" : "VkExternalMemoryImageCreateInfo",
   "referenced_type" : "type-1428",
   "self_type" : "type-1428",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExternalMemoryImageCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExternalMemoryImageCreateInfoNV",
   "name" : "VkExternalMemoryImageCreateInfoNV",
   "referenced_type" : "type-1854",
   "self_type" : "type-1854",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExternalMemoryImageCreateInfoNV"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "externalMemoryFeatures",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "exportFromImportedHandleTypes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "compatibleHandleTypes",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExternalMemoryProperties",
   "name" : "VkExternalMemoryProperties",
   "referenced_type" : "type-505",
   "self_type" : "type-505",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExternalMemoryProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "exportFromImportedHandleTypes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "compatibleHandleTypes",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "externalSemaphoreFeatures",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkExternalSemaphoreProperties",
   "name" : "VkExternalSemaphoreProperties",
   "referenced_type" : "type-517",
   "self_type" : "type-517",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkExternalSemaphoreProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkFenceCreateInfo",
   "name" : "VkFenceCreateInfo",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkFenceCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "fence",
     "field_offset" : 128,
     "referenced_type" : "type-554"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 192,
     "referenced_type" : "type-508"
    }
   ],
   "linker_set_key" : "VkFenceGetFdInfoKHR",
   "name" : "VkFenceGetFdInfoKHR",
   "referenced_type" : "type-1775",
   "self_type" : "type-1775",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkFenceGetFdInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "filterCubic",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "filterCubicMinmax",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkFilterCubicImageViewImageFormatPropertiesEXT",
   "name" : "VkFilterCubicImageViewImageFormatPropertiesEXT",
   "referenced_type" : "type-2062",
   "self_type" : "type-2062",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkFilterCubicImageViewImageFormatPropertiesEXT"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "linearTilingFeatures",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "optimalTilingFeatures",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bufferFeatures",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkFormatProperties",
   "name" : "VkFormatProperties",
   "referenced_type" : "type-457",
   "self_type" : "type-457",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkFormatProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "formatProperties",
     "field_offset" : 128,
     "referenced_type" : "type-457"
    }
   ],
   "linker_set_key" : "VkFormatProperties2",
   "name" : "VkFormatProperties2",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkFormatProperties2"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "renderPass",
     "field_offset" : 192,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "attachmentCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pAttachments",
     "field_offset" : 320,
     "referenced_type" : "type-307"
    },
    {
     "field_name" : "width",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layers",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkFramebufferCreateInfo",
   "name" : "VkFramebufferCreateInfo",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkFramebufferCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "aabbData",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "numAABBs",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stride",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkGeometryAABBNV",
   "name" : "VkGeometryAABBNV",
   "referenced_type" : "type-2042",
   "self_type" : "type-2042",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkGeometryAABBNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "triangles",
     "referenced_type" : "type-2041"
    },
    {
     "field_name" : "aabbs",
     "field_offset" : 768,
     "referenced_type" : "type-2042"
    }
   ],
   "linker_set_key" : "VkGeometryDataNV",
   "name" : "VkGeometryDataNV",
   "referenced_type" : "type-2043",
   "self_type" : "type-2043",
   "size" : 136,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkGeometryDataNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "geometryType",
     "field_offset" : 128,
     "referenced_type" : "type-2029"
    },
    {
     "field_name" : "geometry",
     "field_offset" : 192,
     "referenced_type" : "type-2043"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1280,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkGeometryNV",
   "name" : "VkGeometryNV",
   "referenced_type" : "type-2045",
   "self_type" : "type-2045",
   "size" : 168,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkGeometryNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "vertexData",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "vertexOffset",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vertexCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vertexStride",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vertexFormat",
     "field_offset" : 384,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "indexData",
     "field_offset" : 448,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "indexOffset",
     "field_offset" : 512,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "indexCount",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "indexType",
     "field_offset" : 608,
     "referenced_type" : "type-1154"
    },
    {
     "field_name" : "transformData",
     "field_offset" : 640,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "transformOffset",
     "field_offset" : 704,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkGeometryTrianglesNV",
   "name" : "VkGeometryTrianglesNV",
   "referenced_type" : "type-2041",
   "self_type" : "type-2041",
   "size" : 96,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkGeometryTrianglesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stageCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pStages",
     "field_offset" : 192,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "pVertexInputState",
     "field_offset" : 256,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "pInputAssemblyState",
     "field_offset" : 320,
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "pTessellationState",
     "field_offset" : 384,
     "referenced_type" : "type-171"
    },
    {
     "field_name" : "pViewportState",
     "field_offset" : 448,
     "referenced_type" : "type-174"
    },
    {
     "field_name" : "pRasterizationState",
     "field_offset" : 512,
     "referenced_type" : "type-186"
    },
    {
     "field_name" : "pMultisampleState",
     "field_offset" : 576,
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "pDepthStencilState",
     "field_offset" : 640,
     "referenced_type" : "type-194"
    },
    {
     "field_name" : "pColorBlendState",
     "field_offset" : 704,
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "pDynamicState",
     "field_offset" : 768,
     "referenced_type" : "type-210"
    },
    {
     "field_name" : "layout",
     "field_offset" : 832,
     "referenced_type" : "type-216"
    },
    {
     "field_name" : "renderPass",
     "field_offset" : 896,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "subpass",
     "field_offset" : 960,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "basePipelineHandle",
     "field_offset" : 1024,
     "referenced_type" : "type-220"
    },
    {
     "field_name" : "basePipelineIndex",
     "field_offset" : 1088,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "VkGraphicsPipelineCreateInfo",
   "name" : "VkGraphicsPipelineCreateInfo",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 144,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkGraphicsPipelineCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "displayPrimaryRed",
     "field_offset" : 128,
     "referenced_type" : "type-1935"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 192,
     "referenced_type" : "type-1935"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 256,
     "referenced_type" : "type-1935"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 320,
     "referenced_type" : "type-1935"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 384,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 416,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "maxContentLightLevel",
     "field_offset" : 448,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 480,
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "VkHdrMetadataEXT",
   "name" : "VkHdrMetadataEXT",
   "referenced_type" : "type-1936",
   "self_type" : "type-1936",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkHdrMetadataEXT"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "srcSubresource",
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "srcOffsets",
     "field_offset" : 128,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "dstSubresource",
     "field_offset" : 320,
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "dstOffsets",
     "field_offset" : 448,
     "referenced_type" : "type-370"
    }
   ],
   "linker_set_key" : "VkImageBlit",
   "name" : "VkImageBlit",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 80,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageBlit"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "srcSubresource",
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "srcOffset",
     "field_offset" : 128,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "dstSubresource",
     "field_offset" : 224,
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "dstOffset",
     "field_offset" : 352,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "extent",
     "field_offset" : 448,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "VkImageCopy",
   "name" : "VkImageCopy",
   "referenced_type" : "type-365",
   "self_type" : "type-365",
   "size" : 68,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageCopy"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "imageType",
     "field_offset" : 160,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "extent",
     "field_offset" : 224,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "mipLevels",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "arrayLayers",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "samples",
     "field_offset" : 384,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "tiling",
     "field_offset" : 416,
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "usage",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sharingMode",
     "field_offset" : 480,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "queueFamilyIndexCount",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pQueueFamilyIndices",
     "field_offset" : 576,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "initialLayout",
     "field_offset" : 640,
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "VkImageCreateInfo",
   "name" : "VkImageCreateInfo",
   "referenced_type" : "type-108",
   "self_type" : "type-108",
   "size" : 88,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "drmFormatModifier",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "drmFormatModifierPlaneCount",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pPlaneLayouts",
     "field_offset" : 256,
     "referenced_type" : "type-1993"
    }
   ],
   "linker_set_key" : "VkImageDrmFormatModifierExplicitCreateInfoEXT",
   "name" : "VkImageDrmFormatModifierExplicitCreateInfoEXT",
   "referenced_type" : "type-1992",
   "self_type" : "type-1992",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageDrmFormatModifierExplicitCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "drmFormatModifierCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDrmFormatModifiers",
     "field_offset" : 192,
     "referenced_type" : "type-1990"
    }
   ],
   "linker_set_key" : "VkImageDrmFormatModifierListCreateInfoEXT",
   "name" : "VkImageDrmFormatModifierListCreateInfoEXT",
   "referenced_type" : "type-1989",
   "self_type" : "type-1989",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageDrmFormatModifierListCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "drmFormatModifier",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkImageDrmFormatModifierPropertiesEXT",
   "name" : "VkImageDrmFormatModifierPropertiesEXT",
   "referenced_type" : "type-1995",
   "self_type" : "type-1995",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageDrmFormatModifierPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "viewFormatCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pViewFormats",
     "field_offset" : 192,
     "referenced_type" : "type-1812"
    }
   ],
   "linker_set_key" : "VkImageFormatListCreateInfoKHR",
   "name" : "VkImageFormatListCreateInfoKHR",
   "referenced_type" : "type-1811",
   "self_type" : "type-1811",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageFormatListCreateInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "maxExtent",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "maxMipLevels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxArrayLayers",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleCounts",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxResourceSize",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkImageFormatProperties",
   "name" : "VkImageFormatProperties",
   "referenced_type" : "type-463",
   "self_type" : "type-463",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageFormatProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imageFormatProperties",
     "field_offset" : 128,
     "referenced_type" : "type-463"
    }
   ],
   "linker_set_key" : "VkImageFormatProperties2",
   "name" : "VkImageFormatProperties2",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageFormatProperties2"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "srcAccessMask",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dstAccessMask",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "oldLayout",
     "field_offset" : 192,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "newLayout",
     "field_offset" : 224,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "srcQueueFamilyIndex",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dstQueueFamilyIndex",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "image",
     "field_offset" : 320,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "subresourceRange",
     "field_offset" : 384,
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "VkImageMemoryBarrier",
   "name" : "VkImageMemoryBarrier",
   "referenced_type" : "type-404",
   "self_type" : "type-404",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageMemoryBarrier"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "image",
     "field_offset" : 128,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "VkImageMemoryRequirementsInfo2",
   "name" : "VkImageMemoryRequirementsInfo2",
   "referenced_type" : "type-430",
   "self_type" : "type-430",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageMemoryRequirementsInfo2"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "planeAspect",
     "field_offset" : 128,
     "referenced_type" : "type-1369"
    }
   ],
   "linker_set_key" : "VkImagePlaneMemoryRequirementsInfo",
   "name" : "VkImagePlaneMemoryRequirementsInfo",
   "referenced_type" : "type-1375",
   "self_type" : "type-1375",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImagePlaneMemoryRequirementsInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "srcSubresource",
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "srcOffset",
     "field_offset" : 128,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "dstSubresource",
     "field_offset" : 224,
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "dstOffset",
     "field_offset" : 352,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "extent",
     "field_offset" : 448,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "VkImageResolve",
   "name" : "VkImageResolve",
   "referenced_type" : "type-393",
   "self_type" : "type-393",
   "size" : 68,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageResolve"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "image",
     "field_offset" : 128,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "VkImageSparseMemoryRequirementsInfo2",
   "name" : "VkImageSparseMemoryRequirementsInfo2",
   "referenced_type" : "type-438",
   "self_type" : "type-438",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageSparseMemoryRequirementsInfo2"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "stencilUsage",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkImageStencilUsageCreateInfoEXT",
   "name" : "VkImageStencilUsageCreateInfoEXT",
   "referenced_type" : "type-2103",
   "self_type" : "type-2103",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageStencilUsageCreateInfoEXT"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aspectMask",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mipLevel",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "arrayLayer",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkImageSubresource",
   "name" : "VkImageSubresource",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageSubresource"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aspectMask",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mipLevel",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "baseArrayLayer",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkImageSubresourceLayers",
   "name" : "VkImageSubresourceLayers",
   "referenced_type" : "type-366",
   "self_type" : "type-366",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageSubresourceLayers"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aspectMask",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "baseMipLevel",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "levelCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "baseArrayLayer",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkImageSubresourceRange",
   "name" : "VkImageSubresourceRange",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageSubresourceRange"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "swapchain",
     "field_offset" : 128,
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "VkImageSwapchainCreateInfoKHR",
   "name" : "VkImageSwapchainCreateInfoKHR",
   "referenced_type" : "type-1524",
   "self_type" : "type-1524",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageSwapchainCreateInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "decodeMode",
     "field_offset" : 128,
     "referenced_type" : "type-102"
    }
   ],
   "linker_set_key" : "VkImageViewASTCDecodeModeEXT",
   "name" : "VkImageViewASTCDecodeModeEXT",
   "referenced_type" : "type-1861",
   "self_type" : "type-1861",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageViewASTCDecodeModeEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "image",
     "field_offset" : 192,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "viewType",
     "field_offset" : 256,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "format",
     "field_offset" : 288,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "components",
     "field_offset" : 320,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "subresourceRange",
     "field_offset" : 448,
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "VkImageViewCreateInfo",
   "name" : "VkImageViewCreateInfo",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 80,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageViewCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "imageView",
     "field_offset" : 128,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "descriptorType",
     "field_offset" : 192,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "sampler",
     "field_offset" : 256,
     "referenced_type" : "type-260"
    }
   ],
   "linker_set_key" : "VkImageViewHandleInfoNVX",
   "name" : "VkImageViewHandleInfoNVX",
   "referenced_type" : "type-1844",
   "self_type" : "type-1844",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageViewHandleInfoNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkImageViewUsageCreateInfo",
   "name" : "VkImageViewUsageCreateInfo",
   "referenced_type" : "type-1301",
   "self_type" : "type-1301",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImageViewUsageCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "type-2124"
    }
   ],
   "linker_set_key" : "VkImportAndroidHardwareBufferInfoANDROID",
   "name" : "VkImportAndroidHardwareBufferInfoANDROID",
   "referenced_type" : "type-2123",
   "self_type" : "type-2123",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h",
   "unique_id" : "VkImportAndroidHardwareBufferInfoANDROID"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "fence",
     "field_offset" : 128,
     "referenced_type" : "type-554"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 224,
     "referenced_type" : "type-508"
    },
    {
     "field_name" : "fd",
     "field_offset" : 256,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "VkImportFenceFdInfoKHR",
   "name" : "VkImportFenceFdInfoKHR",
   "referenced_type" : "type-1769",
   "self_type" : "type-1769",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImportFenceFdInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 128,
     "referenced_type" : "type-501"
    },
    {
     "field_name" : "fd",
     "field_offset" : 160,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "VkImportMemoryFdInfoKHR",
   "name" : "VkImportMemoryFdInfoKHR",
   "referenced_type" : "type-1622",
   "self_type" : "type-1622",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImportMemoryFdInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 128,
     "referenced_type" : "type-501"
    },
    {
     "field_name" : "pHostPointer",
     "field_offset" : 192,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "VkImportMemoryHostPointerInfoEXT",
   "name" : "VkImportMemoryHostPointerInfoEXT",
   "referenced_type" : "type-2065",
   "self_type" : "type-2065",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImportMemoryHostPointerInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "semaphore",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 224,
     "referenced_type" : "type-514"
    },
    {
     "field_name" : "fd",
     "field_offset" : 256,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "VkImportSemaphoreFdInfoKHR",
   "name" : "VkImportSemaphoreFdInfoKHR",
   "referenced_type" : "type-1643",
   "self_type" : "type-1643",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkImportSemaphoreFdInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pipelineBindPoint",
     "field_offset" : 128,
     "referenced_type" : "type-323"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tokenCount",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pTokens",
     "field_offset" : 256,
     "referenced_type" : "type-1877"
    }
   ],
   "linker_set_key" : "VkIndirectCommandsLayoutCreateInfoNVX",
   "name" : "VkIndirectCommandsLayoutCreateInfoNVX",
   "referenced_type" : "type-1876",
   "self_type" : "type-1876",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkIndirectCommandsLayoutCreateInfoNVX"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tokenType",
     "referenced_type" : "type-1868"
    },
    {
     "field_name" : "bindingUnit",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dynamicCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "divisor",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkIndirectCommandsLayoutTokenNVX",
   "name" : "VkIndirectCommandsLayoutTokenNVX",
   "referenced_type" : "type-1875",
   "self_type" : "type-1875",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkIndirectCommandsLayoutTokenNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tokenType",
     "referenced_type" : "type-1868"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkIndirectCommandsTokenNVX",
   "name" : "VkIndirectCommandsTokenNVX",
   "referenced_type" : "type-1874",
   "self_type" : "type-1874",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkIndirectCommandsTokenNVX"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "subpass",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "inputAttachmentIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "aspectMask",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkInputAttachmentAspectReference",
   "name" : "VkInputAttachmentAspectReference",
   "referenced_type" : "type-1281",
   "self_type" : "type-1281",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkInputAttachmentAspectReference"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pApplicationInfo",
     "field_offset" : 192,
     "referenced_type" : "type-2129"
    },
    {
     "field_name" : "enabledLayerCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ppEnabledLayerNames",
     "field_offset" : 320,
     "referenced_type" : "type-1248"
    },
    {
     "field_name" : "enabledExtensionCount",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ppEnabledExtensionNames",
     "field_offset" : 448,
     "referenced_type" : "type-1248"
    }
   ],
   "linker_set_key" : "VkInstanceCreateInfo",
   "name" : "VkInstanceCreateInfo",
   "referenced_type" : "type-2128",
   "self_type" : "type-2128",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkInstanceCreateInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layerName",
     "referenced_type" : "type-449"
    },
    {
     "field_name" : "specVersion",
     "field_offset" : 2048,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "implementationVersion",
     "field_offset" : 2080,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "description",
     "field_offset" : 2112,
     "referenced_type" : "type-449"
    }
   ],
   "linker_set_key" : "VkLayerProperties",
   "name" : "VkLayerProperties",
   "referenced_type" : "type-1680",
   "self_type" : "type-1680",
   "size" : 520,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkLayerProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "memory",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "offset",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "size",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkMappedMemoryRange",
   "name" : "VkMappedMemoryRange",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMappedMemoryRange"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "deviceMask",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkMemoryAllocateFlagsInfo",
   "name" : "VkMemoryAllocateFlagsInfo",
   "referenced_type" : "type-1177",
   "self_type" : "type-1177",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryAllocateFlagsInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "allocationSize",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "memoryTypeIndex",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkMemoryAllocateInfo",
   "name" : "VkMemoryAllocateInfo",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryAllocateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "srcAccessMask",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dstAccessMask",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkMemoryBarrier",
   "name" : "VkMemoryBarrier",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryBarrier"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "image",
     "field_offset" : 128,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 192,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "VkMemoryDedicatedAllocateInfo",
   "name" : "VkMemoryDedicatedAllocateInfo",
   "referenced_type" : "type-1176",
   "self_type" : "type-1176",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryDedicatedAllocateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "prefersDedicatedAllocation",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "requiresDedicatedAllocation",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkMemoryDedicatedRequirements",
   "name" : "VkMemoryDedicatedRequirements",
   "referenced_type" : "type-1171",
   "self_type" : "type-1171",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryDedicatedRequirements"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "memoryTypeBits",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkMemoryFdPropertiesKHR",
   "name" : "VkMemoryFdPropertiesKHR",
   "referenced_type" : "type-1627",
   "self_type" : "type-1627",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryFdPropertiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "memory",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "VkMemoryGetAndroidHardwareBufferInfoANDROID",
   "name" : "VkMemoryGetAndroidHardwareBufferInfoANDROID",
   "referenced_type" : "type-2126",
   "self_type" : "type-2126",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h",
   "unique_id" : "VkMemoryGetAndroidHardwareBufferInfoANDROID"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "memory",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 192,
     "referenced_type" : "type-501"
    }
   ],
   "linker_set_key" : "VkMemoryGetFdInfoKHR",
   "name" : "VkMemoryGetFdInfoKHR",
   "referenced_type" : "type-1637",
   "self_type" : "type-1637",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryGetFdInfoKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkMemoryHeap",
   "name" : "VkMemoryHeap",
   "referenced_type" : "type-473",
   "self_type" : "type-473",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryHeap"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "memoryTypeBits",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkMemoryHostPointerPropertiesEXT",
   "name" : "VkMemoryHostPointerPropertiesEXT",
   "referenced_type" : "type-2067",
   "self_type" : "type-2067",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryHostPointerPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "priority",
     "field_offset" : 128,
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "VkMemoryPriorityAllocateInfoEXT",
   "name" : "VkMemoryPriorityAllocateInfoEXT",
   "referenced_type" : "type-2098",
   "self_type" : "type-2098",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryPriorityAllocateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "alignment",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "memoryTypeBits",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkMemoryRequirements",
   "name" : "VkMemoryRequirements",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryRequirements"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "memoryRequirements",
     "field_offset" : 128,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "VkMemoryRequirements2",
   "name" : "VkMemoryRequirements2",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryRequirements2"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "propertyFlags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "heapIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkMemoryType",
   "name" : "VkMemoryType",
   "referenced_type" : "type-471",
   "self_type" : "type-471",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMemoryType"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxSampleLocationGridSize",
     "field_offset" : 128,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "VkMultisamplePropertiesEXT",
   "name" : "VkMultisamplePropertiesEXT",
   "referenced_type" : "type-1975",
   "self_type" : "type-1975",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkMultisamplePropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "objectCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pObjectEntryTypes",
     "field_offset" : 192,
     "referenced_type" : "type-1889"
    },
    {
     "field_name" : "pObjectEntryCounts",
     "field_offset" : 256,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "pObjectEntryUsageFlags",
     "field_offset" : 320,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "maxUniformBuffersPerDescriptor",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxStorageBuffersPerDescriptor",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxStorageImagesPerDescriptor",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSampledImagesPerDescriptor",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPipelineLayouts",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkObjectTableCreateInfoNVX",
   "name" : "VkObjectTableCreateInfoNVX",
   "referenced_type" : "type-1888",
   "self_type" : "type-1888",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkObjectTableCreateInfoNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-1869"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pipelineLayout",
     "field_offset" : 64,
     "referenced_type" : "type-216"
    },
    {
     "field_name" : "descriptorSet",
     "field_offset" : 128,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "VkObjectTableDescriptorSetEntryNVX",
   "name" : "VkObjectTableDescriptorSetEntryNVX",
   "referenced_type" : "type-1893",
   "self_type" : "type-1893",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkObjectTableDescriptorSetEntryNVX"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-1869"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkObjectTableEntryNVX",
   "name" : "VkObjectTableEntryNVX",
   "referenced_type" : "type-1891",
   "self_type" : "type-1891",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkObjectTableEntryNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-1869"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "indexType",
     "field_offset" : 128,
     "referenced_type" : "type-1154"
    }
   ],
   "linker_set_key" : "VkObjectTableIndexBufferEntryNVX",
   "name" : "VkObjectTableIndexBufferEntryNVX",
   "referenced_type" : "type-1895",
   "self_type" : "type-1895",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkObjectTableIndexBufferEntryNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-1869"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pipeline",
     "field_offset" : 64,
     "referenced_type" : "type-220"
    }
   ],
   "linker_set_key" : "VkObjectTablePipelineEntryNVX",
   "name" : "VkObjectTablePipelineEntryNVX",
   "referenced_type" : "type-1892",
   "self_type" : "type-1892",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkObjectTablePipelineEntryNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-1869"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pipelineLayout",
     "field_offset" : 64,
     "referenced_type" : "type-216"
    },
    {
     "field_name" : "stageFlags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkObjectTablePushConstantEntryNVX",
   "name" : "VkObjectTablePushConstantEntryNVX",
   "referenced_type" : "type-1896",
   "self_type" : "type-1896",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkObjectTablePushConstantEntryNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-1869"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "VkObjectTableVertexBufferEntryNVX",
   "name" : "VkObjectTableVertexBufferEntryNVX",
   "referenced_type" : "type-1894",
   "self_type" : "type-1894",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkObjectTableVertexBufferEntryNVX"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "VkOffset2D",
   "name" : "VkOffset2D",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkOffset2D"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "VkOffset3D",
   "name" : "VkOffset3D",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkOffset3D"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "presentID",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "desiredPresentTime",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "actualPresentTime",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "earliestPresentTime",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "presentMargin",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkPastPresentationTimingGOOGLE",
   "name" : "VkPastPresentationTimingGOOGLE",
   "referenced_type" : "type-1914",
   "self_type" : "type-1914",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPastPresentationTimingGOOGLE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "storageBuffer16BitAccess",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uniformAndStorageBuffer16BitAccess",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "storagePushConstant16",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "storageInputOutput16",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDevice16BitStorageFeatures",
   "name" : "VkPhysicalDevice16BitStorageFeatures",
   "referenced_type" : "type-1168",
   "self_type" : "type-1168",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDevice16BitStorageFeatures"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "storageBuffer8BitAccess",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uniformAndStorageBuffer8BitAccess",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "storagePushConstant8",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDevice8BitStorageFeaturesKHR",
   "name" : "VkPhysicalDevice8BitStorageFeaturesKHR",
   "referenced_type" : "type-1816",
   "self_type" : "type-1816",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDevice8BitStorageFeaturesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "decodeModeSharedExponent",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceASTCDecodeFeaturesEXT",
   "name" : "VkPhysicalDeviceASTCDecodeFeaturesEXT",
   "referenced_type" : "type-1862",
   "self_type" : "type-1862",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceASTCDecodeFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "advancedBlendCoherentOperations",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceBlendOperationAdvancedFeaturesEXT",
   "name" : "VkPhysicalDeviceBlendOperationAdvancedFeaturesEXT",
   "referenced_type" : "type-1978",
   "self_type" : "type-1978",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceBlendOperationAdvancedFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "advancedBlendMaxColorAttachments",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "advancedBlendIndependentBlend",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "advancedBlendNonPremultipliedSrcColor",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "advancedBlendNonPremultipliedDstColor",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "advancedBlendCorrelatedOverlap",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "advancedBlendAllOperations",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceBlendOperationAdvancedPropertiesEXT",
   "name" : "VkPhysicalDeviceBlendOperationAdvancedPropertiesEXT",
   "referenced_type" : "type-1979",
   "self_type" : "type-1979",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceBlendOperationAdvancedPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "bufferDeviceAddress",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bufferDeviceAddressCaptureReplay",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bufferDeviceAddressMultiDevice",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceBufferAddressFeaturesEXT",
   "name" : "VkPhysicalDeviceBufferAddressFeaturesEXT",
   "referenced_type" : "type-2100",
   "self_type" : "type-2100",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceBufferAddressFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "computeDerivativeGroupQuads",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "computeDerivativeGroupLinear",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceComputeShaderDerivativesFeaturesNV",
   "name" : "VkPhysicalDeviceComputeShaderDerivativesFeaturesNV",
   "referenced_type" : "type-2080",
   "self_type" : "type-2080",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceComputeShaderDerivativesFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "conditionalRendering",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "inheritedConditionalRendering",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceConditionalRenderingFeaturesEXT",
   "name" : "VkPhysicalDeviceConditionalRenderingFeaturesEXT",
   "referenced_type" : "type-1865",
   "self_type" : "type-1865",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceConditionalRenderingFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "primitiveOverestimationSize",
     "field_offset" : 128,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "maxExtraPrimitiveOverestimationSize",
     "field_offset" : 160,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "extraPrimitiveOverestimationSizeGranularity",
     "field_offset" : 192,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "primitiveUnderestimation",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "conservativePointAndLineRasterization",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "degenerateTrianglesRasterized",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "degenerateLinesRasterized",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fullyCoveredFragmentShaderInputVariable",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "conservativeRasterizationPostDepthCoverage",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceConservativeRasterizationPropertiesEXT",
   "name" : "VkPhysicalDeviceConservativeRasterizationPropertiesEXT",
   "referenced_type" : "type-1930",
   "self_type" : "type-1930",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceConservativeRasterizationPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "cooperativeMatrix",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cooperativeMatrixRobustBufferAccess",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceCooperativeMatrixFeaturesNV",
   "name" : "VkPhysicalDeviceCooperativeMatrixFeaturesNV",
   "referenced_type" : "type-2114",
   "self_type" : "type-2114",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceCooperativeMatrixFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "cooperativeMatrixSupportedStages",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceCooperativeMatrixPropertiesNV",
   "name" : "VkPhysicalDeviceCooperativeMatrixPropertiesNV",
   "referenced_type" : "type-2115",
   "self_type" : "type-2115",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceCooperativeMatrixPropertiesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "cornerSampledImage",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceCornerSampledImageFeaturesNV",
   "name" : "VkPhysicalDeviceCornerSampledImageFeaturesNV",
   "referenced_type" : "type-1850",
   "self_type" : "type-1850",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceCornerSampledImageFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "dedicatedAllocationImageAliasing",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceDedicatedAllocationImageAliasingFeaturesNV",
   "name" : "VkPhysicalDeviceDedicatedAllocationImageAliasingFeaturesNV",
   "referenced_type" : "type-2099",
   "self_type" : "type-2099",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceDedicatedAllocationImageAliasingFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "depthClipEnable",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceDepthClipEnableFeaturesEXT",
   "name" : "VkPhysicalDeviceDepthClipEnableFeaturesEXT",
   "referenced_type" : "type-1932",
   "self_type" : "type-1932",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceDepthClipEnableFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "supportedDepthResolveModes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "supportedStencilResolveModes",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "independentResolveNone",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "independentResolve",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceDepthStencilResolvePropertiesKHR",
   "name" : "VkPhysicalDeviceDepthStencilResolvePropertiesKHR",
   "referenced_type" : "type-1825",
   "self_type" : "type-1825",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceDepthStencilResolvePropertiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "shaderInputAttachmentArrayDynamicIndexing",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderUniformTexelBufferArrayDynamicIndexing",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageTexelBufferArrayDynamicIndexing",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderUniformBufferArrayNonUniformIndexing",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderSampledImageArrayNonUniformIndexing",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageBufferArrayNonUniformIndexing",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageImageArrayNonUniformIndexing",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderInputAttachmentArrayNonUniformIndexing",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderUniformTexelBufferArrayNonUniformIndexing",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageTexelBufferArrayNonUniformIndexing",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingUniformBufferUpdateAfterBind",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingSampledImageUpdateAfterBind",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingStorageImageUpdateAfterBind",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingStorageBufferUpdateAfterBind",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingUniformTexelBufferUpdateAfterBind",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingStorageTexelBufferUpdateAfterBind",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingUpdateUnusedWhilePending",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingPartiallyBound",
     "field_offset" : 672,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingVariableDescriptorCount",
     "field_offset" : 704,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "runtimeDescriptorArray",
     "field_offset" : 736,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceDescriptorIndexingFeaturesEXT",
   "name" : "VkPhysicalDeviceDescriptorIndexingFeaturesEXT",
   "referenced_type" : "type-2004",
   "self_type" : "type-2004",
   "size" : 96,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceDescriptorIndexingFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxUpdateAfterBindDescriptorsInAllPools",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderUniformBufferArrayNonUniformIndexingNative",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderSampledImageArrayNonUniformIndexingNative",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageBufferArrayNonUniformIndexingNative",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageImageArrayNonUniformIndexingNative",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderInputAttachmentArrayNonUniformIndexingNative",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "robustBufferAccessUpdateAfterBind",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "quadDivergentImplicitLod",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorUpdateAfterBindSamplers",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorUpdateAfterBindUniformBuffers",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorUpdateAfterBindStorageBuffers",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorUpdateAfterBindSampledImages",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorUpdateAfterBindStorageImages",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorUpdateAfterBindInputAttachments",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageUpdateAfterBindResources",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUpdateAfterBindSamplers",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUpdateAfterBindUniformBuffers",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUpdateAfterBindUniformBuffersDynamic",
     "field_offset" : 672,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUpdateAfterBindStorageBuffers",
     "field_offset" : 704,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUpdateAfterBindStorageBuffersDynamic",
     "field_offset" : 736,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUpdateAfterBindSampledImages",
     "field_offset" : 768,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUpdateAfterBindStorageImages",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUpdateAfterBindInputAttachments",
     "field_offset" : 832,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceDescriptorIndexingPropertiesEXT",
   "name" : "VkPhysicalDeviceDescriptorIndexingPropertiesEXT",
   "referenced_type" : "type-2005",
   "self_type" : "type-2005",
   "size" : 112,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceDescriptorIndexingPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxDiscardRectangles",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceDiscardRectanglePropertiesEXT",
   "name" : "VkPhysicalDeviceDiscardRectanglePropertiesEXT",
   "referenced_type" : "type-1927",
   "self_type" : "type-1927",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceDiscardRectanglePropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "driverID",
     "field_offset" : 128,
     "referenced_type" : "type-1818"
    },
    {
     "field_name" : "driverName",
     "field_offset" : 160,
     "referenced_type" : "type-449"
    },
    {
     "field_name" : "driverInfo",
     "field_offset" : 2208,
     "referenced_type" : "type-449"
    },
    {
     "field_name" : "conformanceVersion",
     "field_offset" : 4256,
     "referenced_type" : "type-1819"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceDriverPropertiesKHR",
   "name" : "VkPhysicalDeviceDriverPropertiesKHR",
   "referenced_type" : "type-1820",
   "self_type" : "type-1820",
   "size" : 536,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceDriverPropertiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "exclusiveScissor",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceExclusiveScissorFeaturesNV",
   "name" : "VkPhysicalDeviceExclusiveScissorFeaturesNV",
   "referenced_type" : "type-2087",
   "self_type" : "type-2087",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceExclusiveScissorFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "usage",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 192,
     "referenced_type" : "type-501"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceExternalBufferInfo",
   "name" : "VkPhysicalDeviceExternalBufferInfo",
   "referenced_type" : "type-500",
   "self_type" : "type-500",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceExternalBufferInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 128,
     "referenced_type" : "type-508"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceExternalFenceInfo",
   "name" : "VkPhysicalDeviceExternalFenceInfo",
   "referenced_type" : "type-507",
   "self_type" : "type-507",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceExternalFenceInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 128,
     "referenced_type" : "type-501"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceExternalImageFormatInfo",
   "name" : "VkPhysicalDeviceExternalImageFormatInfo",
   "referenced_type" : "type-1404",
   "self_type" : "type-1404",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceExternalImageFormatInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "minImportedHostPointerAlignment",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceExternalMemoryHostPropertiesEXT",
   "name" : "VkPhysicalDeviceExternalMemoryHostPropertiesEXT",
   "referenced_type" : "type-2068",
   "self_type" : "type-2068",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceExternalMemoryHostPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 128,
     "referenced_type" : "type-514"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceExternalSemaphoreInfo",
   "name" : "VkPhysicalDeviceExternalSemaphoreInfo",
   "referenced_type" : "type-513",
   "self_type" : "type-513",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceExternalSemaphoreInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "robustBufferAccess",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fullDrawIndexUint32",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "imageCubeArray",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "independentBlend",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "geometryShader",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tessellationShader",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleRateShading",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dualSrcBlend",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "logicOp",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "multiDrawIndirect",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "drawIndirectFirstInstance",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depthClamp",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depthBiasClamp",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fillModeNonSolid",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depthBounds",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "wideLines",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "largePoints",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "alphaToOne",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "multiViewport",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "samplerAnisotropy",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "textureCompressionETC2",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "textureCompressionASTC_LDR",
     "field_offset" : 672,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "textureCompressionBC",
     "field_offset" : 704,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "occlusionQueryPrecise",
     "field_offset" : 736,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pipelineStatisticsQuery",
     "field_offset" : 768,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vertexPipelineStoresAndAtomics",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fragmentStoresAndAtomics",
     "field_offset" : 832,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderTessellationAndGeometryPointSize",
     "field_offset" : 864,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderImageGatherExtended",
     "field_offset" : 896,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageImageExtendedFormats",
     "field_offset" : 928,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageImageMultisample",
     "field_offset" : 960,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageImageReadWithoutFormat",
     "field_offset" : 992,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageImageWriteWithoutFormat",
     "field_offset" : 1024,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderUniformBufferArrayDynamicIndexing",
     "field_offset" : 1056,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderSampledImageArrayDynamicIndexing",
     "field_offset" : 1088,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageBufferArrayDynamicIndexing",
     "field_offset" : 1120,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderStorageImageArrayDynamicIndexing",
     "field_offset" : 1152,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderClipDistance",
     "field_offset" : 1184,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderCullDistance",
     "field_offset" : 1216,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderFloat64",
     "field_offset" : 1248,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderInt64",
     "field_offset" : 1280,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderInt16",
     "field_offset" : 1312,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderResourceResidency",
     "field_offset" : 1344,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderResourceMinLod",
     "field_offset" : 1376,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sparseBinding",
     "field_offset" : 1408,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sparseResidencyBuffer",
     "field_offset" : 1440,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sparseResidencyImage2D",
     "field_offset" : 1472,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sparseResidencyImage3D",
     "field_offset" : 1504,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sparseResidency2Samples",
     "field_offset" : 1536,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sparseResidency4Samples",
     "field_offset" : 1568,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sparseResidency8Samples",
     "field_offset" : 1600,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sparseResidency16Samples",
     "field_offset" : 1632,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sparseResidencyAliased",
     "field_offset" : 1664,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "variableMultisampleRate",
     "field_offset" : 1696,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "inheritedQueries",
     "field_offset" : 1728,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceFeatures",
   "name" : "VkPhysicalDeviceFeatures",
   "referenced_type" : "type-444",
   "self_type" : "type-444",
   "size" : 220,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceFeatures"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "features",
     "field_offset" : 128,
     "referenced_type" : "type-444"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceFeatures2",
   "name" : "VkPhysicalDeviceFeatures2",
   "referenced_type" : "type-443",
   "self_type" : "type-443",
   "size" : 240,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceFeatures2"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "shaderFloat16",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderInt8",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceFloat16Int8FeaturesKHR",
   "name" : "VkPhysicalDeviceFloat16Int8FeaturesKHR",
   "referenced_type" : "type-1658",
   "self_type" : "type-1658",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceFloat16Int8FeaturesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "separateDenormSettings",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "separateRoundingModeSettings",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderSignedZeroInfNanPreserveFloat16",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderSignedZeroInfNanPreserveFloat32",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderSignedZeroInfNanPreserveFloat64",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderDenormPreserveFloat16",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderDenormPreserveFloat32",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderDenormPreserveFloat64",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderDenormFlushToZeroFloat16",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderDenormFlushToZeroFloat32",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderDenormFlushToZeroFloat64",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderRoundingModeRTEFloat16",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderRoundingModeRTEFloat32",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderRoundingModeRTEFloat64",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderRoundingModeRTZFloat16",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderRoundingModeRTZFloat32",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderRoundingModeRTZFloat64",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceFloatControlsPropertiesKHR",
   "name" : "VkPhysicalDeviceFloatControlsPropertiesKHR",
   "referenced_type" : "type-1821",
   "self_type" : "type-1821",
   "size" : 88,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceFloatControlsPropertiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "fragmentDensityMap",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fragmentDensityMapDynamic",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fragmentDensityMapNonSubsampledImages",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceFragmentDensityMapFeaturesEXT",
   "name" : "VkPhysicalDeviceFragmentDensityMapFeaturesEXT",
   "referenced_type" : "type-2091",
   "self_type" : "type-2091",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceFragmentDensityMapFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "minFragmentDensityTexelSize",
     "field_offset" : 128,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "maxFragmentDensityTexelSize",
     "field_offset" : 192,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "fragmentDensityInvocations",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceFragmentDensityMapPropertiesEXT",
   "name" : "VkPhysicalDeviceFragmentDensityMapPropertiesEXT",
   "referenced_type" : "type-2092",
   "self_type" : "type-2092",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceFragmentDensityMapPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "fragmentShaderBarycentric",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceFragmentShaderBarycentricFeaturesNV",
   "name" : "VkPhysicalDeviceFragmentShaderBarycentricFeaturesNV",
   "referenced_type" : "type-2084",
   "self_type" : "type-2084",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceFragmentShaderBarycentricFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "physicalDeviceCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "physicalDevices",
     "field_offset" : 192,
     "referenced_type" : "type-426"
    },
    {
     "field_name" : "subsetAllocation",
     "field_offset" : 2240,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceGroupProperties",
   "name" : "VkPhysicalDeviceGroupProperties",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 288,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceGroupProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "deviceUUID",
     "field_offset" : 128,
     "referenced_type" : "type-450"
    },
    {
     "field_name" : "driverUUID",
     "field_offset" : 256,
     "referenced_type" : "type-450"
    },
    {
     "field_name" : "deviceLUID",
     "field_offset" : 384,
     "referenced_type" : "type-1415"
    },
    {
     "field_name" : "deviceNodeMask",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "deviceLUIDValid",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceIDProperties",
   "name" : "VkPhysicalDeviceIDProperties",
   "referenced_type" : "type-1414",
   "self_type" : "type-1414",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceIDProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "drmFormatModifier",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sharingMode",
     "field_offset" : 192,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "queueFamilyIndexCount",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pQueueFamilyIndices",
     "field_offset" : 256,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceImageDrmFormatModifierInfoEXT",
   "name" : "VkPhysicalDeviceImageDrmFormatModifierInfoEXT",
   "referenced_type" : "type-1987",
   "self_type" : "type-1987",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceImageDrmFormatModifierInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "type",
     "field_offset" : 160,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "tiling",
     "field_offset" : 192,
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "usage",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceImageFormatInfo2",
   "name" : "VkPhysicalDeviceImageFormatInfo2",
   "referenced_type" : "type-459",
   "self_type" : "type-459",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceImageFormatInfo2"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imageViewType",
     "field_offset" : 128,
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceImageViewImageFormatInfoEXT",
   "name" : "VkPhysicalDeviceImageViewImageFormatInfoEXT",
   "referenced_type" : "type-2061",
   "self_type" : "type-2061",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceImageViewImageFormatInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "inlineUniformBlock",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "descriptorBindingInlineUniformBlockUpdateAfterBind",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceInlineUniformBlockFeaturesEXT",
   "name" : "VkPhysicalDeviceInlineUniformBlockFeaturesEXT",
   "referenced_type" : "type-1957",
   "self_type" : "type-1957",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceInlineUniformBlockFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxInlineUniformBlockSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorInlineUniformBlocks",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetInlineUniformBlocks",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUpdateAfterBindInlineUniformBlocks",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceInlineUniformBlockPropertiesEXT",
   "name" : "VkPhysicalDeviceInlineUniformBlockPropertiesEXT",
   "referenced_type" : "type-1958",
   "self_type" : "type-1958",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceInlineUniformBlockPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "maxImageDimension1D",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxImageDimension2D",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxImageDimension3D",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxImageDimensionCube",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxImageArrayLayers",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTexelBufferElements",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxUniformBufferRange",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxStorageBufferRange",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPushConstantsSize",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxMemoryAllocationCount",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSamplerAllocationCount",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bufferImageGranularity",
     "field_offset" : 384,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sparseAddressSpaceSize",
     "field_offset" : 448,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "maxBoundDescriptorSets",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorSamplers",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorUniformBuffers",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorStorageBuffers",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorSampledImages",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorStorageImages",
     "field_offset" : 672,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageDescriptorInputAttachments",
     "field_offset" : 704,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxPerStageResources",
     "field_offset" : 736,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetSamplers",
     "field_offset" : 768,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUniformBuffers",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetUniformBuffersDynamic",
     "field_offset" : 832,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetStorageBuffers",
     "field_offset" : 864,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetStorageBuffersDynamic",
     "field_offset" : 896,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetSampledImages",
     "field_offset" : 928,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetStorageImages",
     "field_offset" : 960,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDescriptorSetInputAttachments",
     "field_offset" : 992,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxVertexInputAttributes",
     "field_offset" : 1024,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxVertexInputBindings",
     "field_offset" : 1056,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxVertexInputAttributeOffset",
     "field_offset" : 1088,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxVertexInputBindingStride",
     "field_offset" : 1120,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxVertexOutputComponents",
     "field_offset" : 1152,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTessellationGenerationLevel",
     "field_offset" : 1184,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTessellationPatchSize",
     "field_offset" : 1216,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTessellationControlPerVertexInputComponents",
     "field_offset" : 1248,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTessellationControlPerVertexOutputComponents",
     "field_offset" : 1280,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTessellationControlPerPatchOutputComponents",
     "field_offset" : 1312,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTessellationControlTotalOutputComponents",
     "field_offset" : 1344,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTessellationEvaluationInputComponents",
     "field_offset" : 1376,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTessellationEvaluationOutputComponents",
     "field_offset" : 1408,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxGeometryShaderInvocations",
     "field_offset" : 1440,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxGeometryInputComponents",
     "field_offset" : 1472,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxGeometryOutputComponents",
     "field_offset" : 1504,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxGeometryOutputVertices",
     "field_offset" : 1536,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxGeometryTotalOutputComponents",
     "field_offset" : 1568,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFragmentInputComponents",
     "field_offset" : 1600,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFragmentOutputAttachments",
     "field_offset" : 1632,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFragmentDualSrcAttachments",
     "field_offset" : 1664,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFragmentCombinedOutputResources",
     "field_offset" : 1696,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxComputeSharedMemorySize",
     "field_offset" : 1728,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxComputeWorkGroupCount",
     "field_offset" : 1760,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "maxComputeWorkGroupInvocations",
     "field_offset" : 1856,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxComputeWorkGroupSize",
     "field_offset" : 1888,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "subPixelPrecisionBits",
     "field_offset" : 1984,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "subTexelPrecisionBits",
     "field_offset" : 2016,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mipmapPrecisionBits",
     "field_offset" : 2048,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDrawIndexedIndexValue",
     "field_offset" : 2080,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxDrawIndirectCount",
     "field_offset" : 2112,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSamplerLodBias",
     "field_offset" : 2144,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "maxSamplerAnisotropy",
     "field_offset" : 2176,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "maxViewports",
     "field_offset" : 2208,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxViewportDimensions",
     "field_offset" : 2240,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "viewportBoundsRange",
     "field_offset" : 2304,
     "referenced_type" : "type-360"
    },
    {
     "field_name" : "viewportSubPixelBits",
     "field_offset" : 2368,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minMemoryMapAlignment",
     "field_offset" : 2432,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "minTexelBufferOffsetAlignment",
     "field_offset" : 2496,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "minUniformBufferOffsetAlignment",
     "field_offset" : 2560,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "minStorageBufferOffsetAlignment",
     "field_offset" : 2624,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "minTexelOffset",
     "field_offset" : 2688,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "maxTexelOffset",
     "field_offset" : 2720,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minTexelGatherOffset",
     "field_offset" : 2752,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "maxTexelGatherOffset",
     "field_offset" : 2784,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minInterpolationOffset",
     "field_offset" : 2816,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "maxInterpolationOffset",
     "field_offset" : 2848,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "subPixelInterpolationOffsetBits",
     "field_offset" : 2880,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFramebufferWidth",
     "field_offset" : 2912,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFramebufferHeight",
     "field_offset" : 2944,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFramebufferLayers",
     "field_offset" : 2976,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "framebufferColorSampleCounts",
     "field_offset" : 3008,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "framebufferDepthSampleCounts",
     "field_offset" : 3040,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "framebufferStencilSampleCounts",
     "field_offset" : 3072,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "framebufferNoAttachmentsSampleCounts",
     "field_offset" : 3104,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxColorAttachments",
     "field_offset" : 3136,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampledImageColorSampleCounts",
     "field_offset" : 3168,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampledImageIntegerSampleCounts",
     "field_offset" : 3200,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampledImageDepthSampleCounts",
     "field_offset" : 3232,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampledImageStencilSampleCounts",
     "field_offset" : 3264,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "storageImageSampleCounts",
     "field_offset" : 3296,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSampleMaskWords",
     "field_offset" : 3328,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "timestampComputeAndGraphics",
     "field_offset" : 3360,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "timestampPeriod",
     "field_offset" : 3392,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "maxClipDistances",
     "field_offset" : 3424,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxCullDistances",
     "field_offset" : 3456,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxCombinedClipAndCullDistances",
     "field_offset" : 3488,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "discreteQueuePriorities",
     "field_offset" : 3520,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pointSizeRange",
     "field_offset" : 3552,
     "referenced_type" : "type-360"
    },
    {
     "field_name" : "lineWidthRange",
     "field_offset" : 3616,
     "referenced_type" : "type-360"
    },
    {
     "field_name" : "pointSizeGranularity",
     "field_offset" : 3680,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "lineWidthGranularity",
     "field_offset" : 3712,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "strictLines",
     "field_offset" : 3744,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "standardSampleLocations",
     "field_offset" : 3776,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "optimalBufferCopyOffsetAlignment",
     "field_offset" : 3840,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "optimalBufferCopyRowPitchAlignment",
     "field_offset" : 3904,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nonCoherentAtomSize",
     "field_offset" : 3968,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceLimits",
   "name" : "VkPhysicalDeviceLimits",
   "referenced_type" : "type-452",
   "self_type" : "type-452",
   "size" : 504,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceLimits"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxPerSetDescriptors",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxMemoryAllocationSize",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMaintenance3Properties",
   "name" : "VkPhysicalDeviceMaintenance3Properties",
   "referenced_type" : "type-1463",
   "self_type" : "type-1463",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMaintenance3Properties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "heapBudget",
     "field_offset" : 128,
     "referenced_type" : "type-2096"
    },
    {
     "field_name" : "heapUsage",
     "field_offset" : 1152,
     "referenced_type" : "type-2096"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMemoryBudgetPropertiesEXT",
   "name" : "VkPhysicalDeviceMemoryBudgetPropertiesEXT",
   "referenced_type" : "type-2095",
   "self_type" : "type-2095",
   "size" : 272,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMemoryBudgetPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "memoryPriority",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMemoryPriorityFeaturesEXT",
   "name" : "VkPhysicalDeviceMemoryPriorityFeaturesEXT",
   "referenced_type" : "type-2097",
   "self_type" : "type-2097",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMemoryPriorityFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "memoryTypeCount",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "memoryTypes",
     "field_offset" : 32,
     "referenced_type" : "type-470"
    },
    {
     "field_name" : "memoryHeapCount",
     "field_offset" : 2080,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "memoryHeaps",
     "field_offset" : 2112,
     "referenced_type" : "type-472"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMemoryProperties",
   "name" : "VkPhysicalDeviceMemoryProperties",
   "referenced_type" : "type-469",
   "self_type" : "type-469",
   "size" : 520,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMemoryProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "memoryProperties",
     "field_offset" : 128,
     "referenced_type" : "type-469"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMemoryProperties2",
   "name" : "VkPhysicalDeviceMemoryProperties2",
   "referenced_type" : "type-468",
   "self_type" : "type-468",
   "size" : 536,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMemoryProperties2"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "taskShader",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "meshShader",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMeshShaderFeaturesNV",
   "name" : "VkPhysicalDeviceMeshShaderFeaturesNV",
   "referenced_type" : "type-2081",
   "self_type" : "type-2081",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMeshShaderFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxDrawMeshTasksCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTaskWorkGroupInvocations",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTaskWorkGroupSize",
     "field_offset" : 192,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "maxTaskTotalMemorySize",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTaskOutputCount",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxMeshWorkGroupInvocations",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxMeshWorkGroupSize",
     "field_offset" : 384,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "maxMeshTotalMemorySize",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxMeshOutputVertices",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxMeshOutputPrimitives",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxMeshMultiviewViewCount",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "meshOutputPerVertexGranularity",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "meshOutputPerPrimitiveGranularity",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMeshShaderPropertiesNV",
   "name" : "VkPhysicalDeviceMeshShaderPropertiesNV",
   "referenced_type" : "type-2082",
   "self_type" : "type-2082",
   "size" : 88,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMeshShaderPropertiesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "multiview",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "multiviewGeometryShader",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "multiviewTessellationShader",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMultiviewFeatures",
   "name" : "VkPhysicalDeviceMultiviewFeatures",
   "referenced_type" : "type-1317",
   "self_type" : "type-1317",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMultiviewFeatures"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "perViewPositionAllComponents",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMultiviewPerViewAttributesPropertiesNVX",
   "name" : "VkPhysicalDeviceMultiviewPerViewAttributesPropertiesNVX",
   "referenced_type" : "type-1919",
   "self_type" : "type-1919",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMultiviewPerViewAttributesPropertiesNVX"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxMultiviewViewCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxMultiviewInstanceIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceMultiviewProperties",
   "name" : "VkPhysicalDeviceMultiviewProperties",
   "referenced_type" : "type-1318",
   "self_type" : "type-1318",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceMultiviewProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "pciDomain",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pciBus",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pciDevice",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pciFunction",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDevicePCIBusInfoPropertiesEXT",
   "name" : "VkPhysicalDevicePCIBusInfoPropertiesEXT",
   "referenced_type" : "type-2090",
   "self_type" : "type-2090",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDevicePCIBusInfoPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "pointClippingBehavior",
     "field_offset" : 128,
     "referenced_type" : "type-1079"
    }
   ],
   "linker_set_key" : "VkPhysicalDevicePointClippingProperties",
   "name" : "VkPhysicalDevicePointClippingProperties",
   "referenced_type" : "type-1277",
   "self_type" : "type-1277",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDevicePointClippingProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "apiVersion",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "driverVersion",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vendorID",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "deviceID",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "deviceType",
     "field_offset" : 128,
     "referenced_type" : "type-448"
    },
    {
     "field_name" : "deviceName",
     "field_offset" : 160,
     "referenced_type" : "type-449"
    },
    {
     "field_name" : "pipelineCacheUUID",
     "field_offset" : 2208,
     "referenced_type" : "type-450"
    },
    {
     "field_name" : "limits",
     "field_offset" : 2368,
     "referenced_type" : "type-452"
    },
    {
     "field_name" : "sparseProperties",
     "field_offset" : 6400,
     "referenced_type" : "type-454"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceProperties",
   "name" : "VkPhysicalDeviceProperties",
   "referenced_type" : "type-447",
   "self_type" : "type-447",
   "size" : 824,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "properties",
     "field_offset" : 128,
     "referenced_type" : "type-447"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceProperties2",
   "name" : "VkPhysicalDeviceProperties2",
   "referenced_type" : "type-446",
   "self_type" : "type-446",
   "size" : 840,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceProperties2"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "protectedMemory",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceProtectedMemoryFeatures",
   "name" : "VkPhysicalDeviceProtectedMemoryFeatures",
   "referenced_type" : "type-1328",
   "self_type" : "type-1328",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceProtectedMemoryFeatures"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "protectedNoFault",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceProtectedMemoryProperties",
   "name" : "VkPhysicalDeviceProtectedMemoryProperties",
   "referenced_type" : "type-1335",
   "self_type" : "type-1335",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceProtectedMemoryProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxPushDescriptors",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDevicePushDescriptorPropertiesKHR",
   "name" : "VkPhysicalDevicePushDescriptorPropertiesKHR",
   "referenced_type" : "type-1653",
   "self_type" : "type-1653",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDevicePushDescriptorPropertiesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "shaderGroupHandleSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxRecursionDepth",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxShaderGroupStride",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderGroupBaseAlignment",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxGeometryCount",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "maxInstanceCount",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "maxTriangleCount",
     "field_offset" : 384,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "maxDescriptorSetAccelerationStructures",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceRayTracingPropertiesNV",
   "name" : "VkPhysicalDeviceRayTracingPropertiesNV",
   "referenced_type" : "type-2058",
   "self_type" : "type-2058",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceRayTracingPropertiesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "representativeFragmentTest",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceRepresentativeFragmentTestFeaturesNV",
   "name" : "VkPhysicalDeviceRepresentativeFragmentTestFeaturesNV",
   "referenced_type" : "type-2059",
   "self_type" : "type-2059",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceRepresentativeFragmentTestFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "sampleLocationSampleCounts",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSampleLocationGridSize",
     "field_offset" : 160,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "sampleLocationCoordinateRange",
     "field_offset" : 224,
     "referenced_type" : "type-360"
    },
    {
     "field_name" : "sampleLocationSubPixelBits",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "variableSampleLocations",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceSampleLocationsPropertiesEXT",
   "name" : "VkPhysicalDeviceSampleLocationsPropertiesEXT",
   "referenced_type" : "type-1974",
   "self_type" : "type-1974",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceSampleLocationsPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "filterMinmaxSingleComponentFormats",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "filterMinmaxImageComponentMapping",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceSamplerFilterMinmaxPropertiesEXT",
   "name" : "VkPhysicalDeviceSamplerFilterMinmaxPropertiesEXT",
   "referenced_type" : "type-1956",
   "self_type" : "type-1956",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceSamplerFilterMinmaxPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "samplerYcbcrConversion",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceSamplerYcbcrConversionFeatures",
   "name" : "VkPhysicalDeviceSamplerYcbcrConversionFeatures",
   "referenced_type" : "type-1381",
   "self_type" : "type-1381",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceSamplerYcbcrConversionFeatures"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "scalarBlockLayout",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceScalarBlockLayoutFeaturesEXT",
   "name" : "VkPhysicalDeviceScalarBlockLayoutFeaturesEXT",
   "referenced_type" : "type-2094",
   "self_type" : "type-2094",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceScalarBlockLayoutFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "shaderBufferInt64Atomics",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderSharedInt64Atomics",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceShaderAtomicInt64FeaturesKHR",
   "name" : "VkPhysicalDeviceShaderAtomicInt64FeaturesKHR",
   "referenced_type" : "type-1817",
   "self_type" : "type-1817",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceShaderAtomicInt64FeaturesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "shaderEngineCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shaderArraysPerEngineCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "computeUnitsPerShaderArray",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "simdPerComputeUnit",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "wavefrontsPerSimd",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "wavefrontSize",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sgprsPerSimd",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSgprAllocation",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSgprAllocation",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sgprAllocationGranularity",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vgprsPerSimd",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minVgprAllocation",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxVgprAllocation",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vgprAllocationGranularity",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceShaderCorePropertiesAMD",
   "name" : "VkPhysicalDeviceShaderCorePropertiesAMD",
   "referenced_type" : "type-2071",
   "self_type" : "type-2071",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceShaderCorePropertiesAMD"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "shaderDrawParameters",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceShaderDrawParameterFeatures",
   "name" : "VkPhysicalDeviceShaderDrawParameterFeatures",
   "referenced_type" : "type-1476",
   "self_type" : "type-1476",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceShaderDrawParameterFeatures"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imageFootprint",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceShaderImageFootprintFeaturesNV",
   "name" : "VkPhysicalDeviceShaderImageFootprintFeaturesNV",
   "referenced_type" : "type-2085",
   "self_type" : "type-2085",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceShaderImageFootprintFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "shadingRateImage",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shadingRateCoarseSampleOrder",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceShadingRateImageFeaturesNV",
   "name" : "VkPhysicalDeviceShadingRateImageFeaturesNV",
   "referenced_type" : "type-2018",
   "self_type" : "type-2018",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceShadingRateImageFeaturesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "shadingRateTexelSize",
     "field_offset" : 128,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "shadingRatePaletteSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "shadingRateMaxCoarseSamples",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceShadingRateImagePropertiesNV",
   "name" : "VkPhysicalDeviceShadingRateImagePropertiesNV",
   "referenced_type" : "type-2019",
   "self_type" : "type-2019",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceShadingRateImagePropertiesNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "type",
     "field_offset" : 160,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "samples",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "usage",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tiling",
     "field_offset" : 256,
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceSparseImageFormatInfo2",
   "name" : "VkPhysicalDeviceSparseImageFormatInfo2",
   "referenced_type" : "type-475",
   "self_type" : "type-475",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceSparseImageFormatInfo2"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "residencyStandard2DBlockShape",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "residencyStandard2DMultisampleBlockShape",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "residencyStandard3DBlockShape",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "residencyAlignedMipSize",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "residencyNonResidentStrict",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceSparseProperties",
   "name" : "VkPhysicalDeviceSparseProperties",
   "referenced_type" : "type-454",
   "self_type" : "type-454",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceSparseProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "subgroupSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "supportedStages",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "supportedOperations",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "quadOperationsInAllStages",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceSubgroupProperties",
   "name" : "VkPhysicalDeviceSubgroupProperties",
   "referenced_type" : "type-1148",
   "self_type" : "type-1148",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceSubgroupProperties"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "surface",
     "field_offset" : 128,
     "referenced_type" : "type-534"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceSurfaceInfo2KHR",
   "name" : "VkPhysicalDeviceSurfaceInfo2KHR",
   "referenced_type" : "type-1783",
   "self_type" : "type-1783",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceSurfaceInfo2KHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "transformFeedback",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "geometryStreams",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceTransformFeedbackFeaturesEXT",
   "name" : "VkPhysicalDeviceTransformFeedbackFeaturesEXT",
   "referenced_type" : "type-1841",
   "self_type" : "type-1841",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceTransformFeedbackFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxTransformFeedbackStreams",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTransformFeedbackBuffers",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTransformFeedbackBufferSize",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "maxTransformFeedbackStreamDataSize",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTransformFeedbackBufferDataSize",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxTransformFeedbackBufferDataStride",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformFeedbackQueries",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformFeedbackStreamsLinesTriangles",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformFeedbackRasterizationStreamSelect",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformFeedbackDraw",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceTransformFeedbackPropertiesEXT",
   "name" : "VkPhysicalDeviceTransformFeedbackPropertiesEXT",
   "referenced_type" : "type-1842",
   "self_type" : "type-1842",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceTransformFeedbackPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "variablePointersStorageBuffer",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "variablePointers",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceVariablePointerFeatures",
   "name" : "VkPhysicalDeviceVariablePointerFeatures",
   "referenced_type" : "type-1319",
   "self_type" : "type-1319",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceVariablePointerFeatures"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "vertexAttributeInstanceRateDivisor",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vertexAttributeInstanceRateZeroDivisor",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceVertexAttributeDivisorFeaturesEXT",
   "name" : "VkPhysicalDeviceVertexAttributeDivisorFeaturesEXT",
   "referenced_type" : "type-2079",
   "self_type" : "type-2079",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceVertexAttributeDivisorFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maxVertexAttribDivisor",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceVertexAttributeDivisorPropertiesEXT",
   "name" : "VkPhysicalDeviceVertexAttributeDivisorPropertiesEXT",
   "referenced_type" : "type-2074",
   "self_type" : "type-2074",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceVertexAttributeDivisorPropertiesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "vulkanMemoryModel",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vulkanMemoryModelDeviceScope",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vulkanMemoryModelAvailabilityVisibilityChains",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceVulkanMemoryModelFeaturesKHR",
   "name" : "VkPhysicalDeviceVulkanMemoryModelFeaturesKHR",
   "referenced_type" : "type-1826",
   "self_type" : "type-1826",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceVulkanMemoryModelFeaturesKHR"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "ycbcrImageArrays",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPhysicalDeviceYcbcrImageArraysFeaturesEXT",
   "name" : "VkPhysicalDeviceYcbcrImageArraysFeaturesEXT",
   "referenced_type" : "type-2116",
   "self_type" : "type-2116",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPhysicalDeviceYcbcrImageArraysFeaturesEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "initialDataSize",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "pInitialData",
     "field_offset" : 256,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "VkPipelineCacheCreateInfo",
   "name" : "VkPipelineCacheCreateInfo",
   "referenced_type" : "type-133",
   "self_type" : "type-133",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineCacheCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "srcPremultiplied",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dstPremultiplied",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "blendOverlap",
     "field_offset" : 192,
     "referenced_type" : "type-1976"
    }
   ],
   "linker_set_key" : "VkPipelineColorBlendAdvancedStateCreateInfoEXT",
   "name" : "VkPipelineColorBlendAdvancedStateCreateInfoEXT",
   "referenced_type" : "type-1980",
   "self_type" : "type-1980",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineColorBlendAdvancedStateCreateInfoEXT"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "blendEnable",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "srcColorBlendFactor",
     "field_offset" : 32,
     "referenced_type" : "type-207"
    },
    {
     "field_name" : "dstColorBlendFactor",
     "field_offset" : 64,
     "referenced_type" : "type-207"
    },
    {
     "field_name" : "colorBlendOp",
     "field_offset" : 96,
     "referenced_type" : "type-208"
    },
    {
     "field_name" : "srcAlphaBlendFactor",
     "field_offset" : 128,
     "referenced_type" : "type-207"
    },
    {
     "field_name" : "dstAlphaBlendFactor",
     "field_offset" : 160,
     "referenced_type" : "type-207"
    },
    {
     "field_name" : "alphaBlendOp",
     "field_offset" : 192,
     "referenced_type" : "type-208"
    },
    {
     "field_name" : "colorWriteMask",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPipelineColorBlendAttachmentState",
   "name" : "VkPipelineColorBlendAttachmentState",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineColorBlendAttachmentState"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "logicOpEnable",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "logicOp",
     "field_offset" : 192,
     "referenced_type" : "type-203"
    },
    {
     "field_name" : "attachmentCount",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pAttachments",
     "field_offset" : 256,
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "blendConstants",
     "field_offset" : 320,
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "VkPipelineColorBlendStateCreateInfo",
   "name" : "VkPipelineColorBlendStateCreateInfo",
   "referenced_type" : "type-202",
   "self_type" : "type-202",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineColorBlendStateCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "coverageModulationMode",
     "field_offset" : 160,
     "referenced_type" : "type-1982"
    },
    {
     "field_name" : "coverageModulationTableEnable",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "coverageModulationTableCount",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pCoverageModulationTable",
     "field_offset" : 256,
     "referenced_type" : "type-977"
    }
   ],
   "linker_set_key" : "VkPipelineCoverageModulationStateCreateInfoNV",
   "name" : "VkPipelineCoverageModulationStateCreateInfoNV",
   "referenced_type" : "type-1983",
   "self_type" : "type-1983",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineCoverageModulationStateCreateInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "coverageToColorEnable",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "coverageToColorLocation",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPipelineCoverageToColorStateCreateInfoNV",
   "name" : "VkPipelineCoverageToColorStateCreateInfoNV",
   "referenced_type" : "type-1981",
   "self_type" : "type-1981",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineCoverageToColorStateCreateInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depthTestEnable",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depthWriteEnable",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depthCompareOp",
     "field_offset" : 224,
     "referenced_type" : "type-197"
    },
    {
     "field_name" : "depthBoundsTestEnable",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stencilTestEnable",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "front",
     "field_offset" : 320,
     "referenced_type" : "type-198"
    },
    {
     "field_name" : "back",
     "field_offset" : 544,
     "referenced_type" : "type-198"
    },
    {
     "field_name" : "minDepthBounds",
     "field_offset" : 768,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "maxDepthBounds",
     "field_offset" : 800,
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "VkPipelineDepthStencilStateCreateInfo",
   "name" : "VkPipelineDepthStencilStateCreateInfo",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 104,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineDepthStencilStateCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "discardRectangleMode",
     "field_offset" : 160,
     "referenced_type" : "type-1926"
    },
    {
     "field_name" : "discardRectangleCount",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDiscardRectangles",
     "field_offset" : 256,
     "referenced_type" : "type-181"
    }
   ],
   "linker_set_key" : "VkPipelineDiscardRectangleStateCreateInfoEXT",
   "name" : "VkPipelineDiscardRectangleStateCreateInfoEXT",
   "referenced_type" : "type-1928",
   "self_type" : "type-1928",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineDiscardRectangleStateCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dynamicStateCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDynamicStates",
     "field_offset" : 192,
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "VkPipelineDynamicStateCreateInfo",
   "name" : "VkPipelineDynamicStateCreateInfo",
   "referenced_type" : "type-212",
   "self_type" : "type-212",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineDynamicStateCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "topology",
     "field_offset" : 160,
     "referenced_type" : "type-170"
    },
    {
     "field_name" : "primitiveRestartEnable",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPipelineInputAssemblyStateCreateInfo",
   "name" : "VkPipelineInputAssemblyStateCreateInfo",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineInputAssemblyStateCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "setLayoutCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSetLayouts",
     "field_offset" : 192,
     "referenced_type" : "type-231"
    },
    {
     "field_name" : "pushConstantRangeCount",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pPushConstantRanges",
     "field_offset" : 320,
     "referenced_type" : "type-235"
    }
   ],
   "linker_set_key" : "VkPipelineLayoutCreateInfo",
   "name" : "VkPipelineLayoutCreateInfo",
   "referenced_type" : "type-230",
   "self_type" : "type-230",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineLayoutCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rasterizationSamples",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "sampleShadingEnable",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSampleShading",
     "field_offset" : 224,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "pSampleMask",
     "field_offset" : 256,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "alphaToCoverageEnable",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "alphaToOneEnable",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPipelineMultisampleStateCreateInfo",
   "name" : "VkPipelineMultisampleStateCreateInfo",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineMultisampleStateCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "conservativeRasterizationMode",
     "field_offset" : 160,
     "referenced_type" : "type-1929"
    },
    {
     "field_name" : "extraPrimitiveOverestimationSize",
     "field_offset" : 192,
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "VkPipelineRasterizationConservativeStateCreateInfoEXT",
   "name" : "VkPipelineRasterizationConservativeStateCreateInfoEXT",
   "referenced_type" : "type-1931",
   "self_type" : "type-1931",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineRasterizationConservativeStateCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depthClipEnable",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPipelineRasterizationDepthClipStateCreateInfoEXT",
   "name" : "VkPipelineRasterizationDepthClipStateCreateInfoEXT",
   "referenced_type" : "type-1934",
   "self_type" : "type-1934",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineRasterizationDepthClipStateCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depthClampEnable",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rasterizerDiscardEnable",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "polygonMode",
     "field_offset" : 224,
     "referenced_type" : "type-189"
    },
    {
     "field_name" : "cullMode",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "frontFace",
     "field_offset" : 288,
     "referenced_type" : "type-190"
    },
    {
     "field_name" : "depthBiasEnable",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "depthBiasConstantFactor",
     "field_offset" : 352,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "depthBiasClamp",
     "field_offset" : 384,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "depthBiasSlopeFactor",
     "field_offset" : 416,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "lineWidth",
     "field_offset" : 448,
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "VkPipelineRasterizationStateCreateInfo",
   "name" : "VkPipelineRasterizationStateCreateInfo",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineRasterizationStateCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "rasterizationOrder",
     "field_offset" : 128,
     "referenced_type" : "type-1832"
    }
   ],
   "linker_set_key" : "VkPipelineRasterizationStateRasterizationOrderAMD",
   "name" : "VkPipelineRasterizationStateRasterizationOrderAMD",
   "referenced_type" : "type-1833",
   "self_type" : "type-1833",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineRasterizationStateRasterizationOrderAMD"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rasterizationStream",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPipelineRasterizationStateStreamCreateInfoEXT",
   "name" : "VkPipelineRasterizationStateStreamCreateInfoEXT",
   "referenced_type" : "type-1843",
   "self_type" : "type-1843",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineRasterizationStateStreamCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "representativeFragmentTestEnable",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "VkPipelineRepresentativeFragmentTestStateCreateInfoNV",
   "name" : "VkPipelineRepresentativeFragmentTestStateCreateInfoNV",
   "referenced_type" : "type-2060",
   "self_type" : "type-2060",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineRepresentativeFragmentTestStateCreateInfoNV"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "sampleLocationsEnable",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleLocationsInfo",
     "field_offset" : 192,
     "referenced_type" : "type-1962"
    }
   ],
   "linker_set_key" : "VkPipelineSampleLocationsStateCreateInfoEXT",
   "name" : "VkPipelineSampleLocationsStateCreateInfoEXT",
   "referenced_type" : "type-1973",
   "self_type" : "type-1973",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineSampleLocationsStateCreateInfoEXT"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stage",
     "field_offset" : 160,
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "module",
     "field_offset" : 192,
     "referenced_type" : "type-146"
    },
    {
     "field_name" : "pName",
     "field_offset" : 256,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "pSpecializationInfo",
     "field_offset" : 320,
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "VkPipelineShaderStageCreateInfo",
   "name" : "VkPipelineShaderStageCreateInfo",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h",
   "unique_id" : "VkPipelineShaderStageCreateInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "domainOrigin",
     "field_offset" : 128,
     "referenced_type" : "type-1082"
    }
   ],
   "linker_set_key" : "VkPipelineTessellationDomainOriginStateCreateInfo",
   "name" : "VkPipelineTessellationDomainOriginStateCreateInfo",
   "referenced_type" : "type-1302",
   "self_type" : "type-1302",
   "size" : 24,
