{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_Pv",
   "name" : "void *[1]",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIA1_Pv",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_21AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane [4]",
   "referenced_type" : "_ZTI21AHardwareBuffer_Plane",
   "self_type" : "_ZTIA4_21AHardwareBuffer_Plane",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_Pv",
   "name" : "void *[4]",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIA4_Pv",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA4_i",
   "name" : "int [4]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA4_i",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA6_Pv",
   "name" : "void *[6]",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIA6_Pv",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA6_j",
   "name" : "unsigned int [6]",
   "referenced_type" : "_ZTIj",

   "linker_set_key" : "_ZTIPN7android13GraphicBufferE",
   "name" : "android::GraphicBuffer *",
   "referenced_type" : "_ZTIN7android13GraphicBufferE",
   "self_type" : "_ZTIPN7android13GraphicBufferE",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include-private/private/android/AHardwareBufferHelpers.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP15AHardwareBuffer",
   "name" : "AHardwareBuffer **",
   "referenced_type" : "_ZTIP15AHardwareBuffer",
   "self_type" : "_ZTIPP15AHardwareBuffer",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP19ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer **",
   "referenced_type" : "_ZTIP19ANativeWindowBuffer",
   "self_type" : "_ZTIPP19ANativeWindowBuffer",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/apex/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPf",
   "name" : "float *",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIPf",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/vndk/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ANativeWindow",
   "name" : "const ANativeWindow",
   "referenced_type" : "_ZTI13ANativeWindow",
   "self_type" : "_ZTIK13ANativeWindow",
   "size" : 108,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13native_handle",
   "name" : "const native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTIK13native_handle",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK15AHardwareBuffer",
   "name" : "const AHardwareBuffer",
   "referenced_type" : "_ZTI15AHardwareBuffer",
   "self_type" : "_ZTIK15AHardwareBuffer",
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK19ANativeWindowBuffer",
   "name" : "const ANativeWindowBuffer",
   "referenced_type" : "_ZTI19ANativeWindowBuffer",
   "self_type" : "_ZTIK19ANativeWindowBuffer",
   "size" : 96,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK20AHardwareBuffer_Desc",
   "name" : "const AHardwareBuffer_Desc",
   "referenced_type" : "_ZTI20AHardwareBuffer_Desc",
   "self_type" : "_ZTIK20AHardwareBuffer_Desc",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK5ARect",
   "name" : "const ARect",
   "referenced_type" : "_ZTI5ARect",
   "self_type" : "_ZTIK5ARect",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android13GraphicBufferE",
   "name" : "const android::GraphicBuffer",
   "referenced_type" : "_ZTIN7android13GraphicBufferE",
   "self_type" : "_ZTIKN7android13GraphicBufferE",
   "size" : 148,
   "source_file" : "/frameworks/native/libs/nativewindow/include-private/private/android/AHardwareBufferHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI21android_native_base_t"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "minSwapInterval",
     "field_offset" : 288,
     "referenced_type" : "_ZTIKi"
    },
    {
     "field_name" : "maxSwapInterval",
     "field_offset" : 320,
     "referenced_type" : "_ZTIKi"
    },
    {
     "field_name" : "xdpi",
     "field_offset" : 352,
     "referenced_type" : "_ZTIKf"
    },
    {
     "field_name" : "ydpi",
     "field_offset" : 384,
     "referenced_type" : "_ZTIKf"
    },
    {
     "field_name" : "oem",
     "field_offset" : 416,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "setSwapInterval",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFiP13ANativeWindowiE"
    },
    {
     "field_name" : "dequeueBuffer_DEPRECATED",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFiP13ANativeWindowPP19ANativeWindowBufferE"
    },
    {
     "field_name" : "lockBuffer_DEPRECATED",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferE"
    },
    {
     "field_name" : "queueBuffer_DEPRECATED",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferE"
    },
    {
     "field_name" : "query",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFiPK13ANativeWindowiPiE"
    },
    {
     "field_name" : "perform",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFiP13ANativeWindowizE"
    },
    {
     "field_name" : "cancelBuffer_DEPRECATED",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferE"
    },
    {
     "field_name" : "dequeueBuffer",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFiP13ANativeWindowPP19ANativeWindowBufferPiE"
    },
    {
     "field_name" : "queueBuffer",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferiE"
    },
    {
     "field_name" : "cancelBuffer",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferiE"
    }
   ],
   "linker_set_key" : "_ZTI13ANativeWindow",
   "name" : "ANativeWindow",
   "referenced_type" : "_ZTI13ANativeWindow",
   "self_type" : "_ZTI13ANativeWindow",
   "size" : 108,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI21android_native_base_t"
    },
    {
     "field_name" : "width",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 448,
     "referenced_type" : "_ZTIA1_Pv"
    },
    {
     "field_name" : "handle",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPK13native_handle"
    },
    {
     "field_name" : "usage",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA6_Pv"
    }
   ],
   "linker_set_key" : "_ZTI19ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "_ZTI19ANativeWindowBuffer",
   "self_type" : "_ZTI19ANativeWindowBuffer",
   "size" : 96,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI20AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "referenced_type" : "_ZTI20AHardwareBuffer_Desc",
   "self_type" : "_ZTI20AHardwareBuffer_Desc",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA6_j"
    }
   ],
   "linker_set_key" : "_ZTI20ANativeWindow_Buffer",
   "name" : "ANativeWindow_Buffer",
   "referenced_type" : "_ZTI20ANativeWindow_Buffer",
   "self_type" : "_ZTI20ANativeWindow_Buffer",
   "size" : 44,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/native_window.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "referenced_type" : "_ZTI21AHardwareBuffer_Plane",
   "self_type" : "_ZTI21AHardwareBuffer_Plane",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI21AHdrMetadata_cta861_3",
   "name" : "AHdrMetadata_cta861_3",
   "referenced_type" : "_ZTI21AHdrMetadata_cta861_3",
   "self_type" : "_ZTI21AHdrMetadata_cta861_3",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hdr_metadata.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_Pv"
    },
    {
     "field_name" : "incRef",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvP21android_native_base_tE"
    },
    {
     "field_name" : "decRef",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFvP21android_native_base_tE"
    }
   ],
   "linker_set_key" : "_ZTI21android_native_base_t",
   "name" : "android_native_base_t",
   "referenced_type" : "_ZTI21android_native_base_t",
   "self_type" : "_ZTI21android_native_base_t",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI21android_native_rect_t",
   "name" : "android_native_rect_t",
   "referenced_type" : "_ZTI21android_native_rect_t",
   "self_type" : "_ZTI21android_native_rect_t",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_21AHardwareBuffer_Plane"
    }
   ],
   "linker_set_key" : "_ZTI22AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "referenced_type" : "_ZTI22AHardwareBuffer_Planes",
   "self_type" : "_ZTI22AHardwareBuffer_Planes",
   "size" : 52,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI9AColor_xy"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI9AColor_xy"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI9AColor_xy"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI9AColor_xy"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI22AHdrMetadata_smpte2086",
   "name" : "AHdrMetadata_smpte2086",
   "referenced_type" : "_ZTI22AHdrMetadata_smpte2086",
   "self_type" : "_ZTI22AHdrMetadata_smpte2086",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hdr_metadata.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5ARect",
   "name" : "ARect",
   "referenced_type" : "_ZTI5ARect",
   "self_type" : "_ZTI5ARect",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI9AColor_xy",
   "name" : "AColor_xy",
   "referenced_type" : "_ZTI9AColor_xy",
   "self_type" : "_ZTI9AColor_xy",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hdr_metadata.h"
  }
 ],
 "rvalue_reference_types" : []
}
