{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1024_c",
   "name" : "char [1024]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1024_c",
   "size" : 1024,
   "source_file" : "/system/core/base/include/android-base/file.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA92_c",
   "name" : "char [92]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA92_c",
   "size" : 92,
   "source_file" : "/system/core/base/include/android-base/properties.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,

   "referenced_type" : "_ZTIN7android2os9dumpstate14CommandOptions21CommandOptionsBuilderE",
   "self_type" : "_ZTIPN7android2os9dumpstate14CommandOptions21CommandOptionsBuilderE",
   "size" : 8,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateUtil.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN7android2os9dumpstate14CommandOptionsE",
   "name" : "android::os::dumpstate::CommandOptions *",
   "referenced_type" : "_ZTIN7android2os9dumpstate14CommandOptionsE",
   "self_type" : "_ZTIPN7android2os9dumpstate14CommandOptionsE",
   "size" : 8,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateUtil.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd *",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIPN7android4base11borrowed_fdE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser> *",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIPN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPNSt3__117basic_string_viewIcNS_11char_traitsIcEEEE",
   "name" : "std::basic_string_view<char, std::char_traits<char> > *",
   "referenced_type" : "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE",
   "self_type" : "_ZTIPNSt3__117basic_string_viewIcNS_11char_traitsIcEEEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/strings.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK9prop_info",
   "name" : "const prop_info",
   "referenced_type" : "_ZTI9prop_info",
   "self_type" : "_ZTIK9prop_info",
   "source_file" : "/system/core/base/include/android-base/properties.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2os9dumpstate14CommandOptions20CommandOptionsValuesE",
   "name" : "const android::os::dumpstate::CommandOptions::CommandOptionsValues",
   "referenced_type" : "_ZTIN7android2os9dumpstate14CommandOptions20CommandOptionsValuesE",
   "self_type" : "_ZTIKN7android2os9dumpstate14CommandOptions20CommandOptionsValuesE",
   "size" : 48,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateUtil.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android2os9dumpstate14CommandOptionsE",
   "name" : "const android::os::dumpstate::CommandOptions",
   "referenced_type" : "_ZTIN7android2os9dumpstate14CommandOptionsE",
   "self_type" : "_ZTIKN7android2os9dumpstate14CommandOptionsE",
   "size" : 48,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateUtil.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android4base11borrowed_fdE",
   "name" : "const android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIKN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "const android::base::unique_fd_impl<android::base::DefaultCloser>",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIKN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE",
   "name" : "const std::vector<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE",
   "self_type" : "_ZTIKNSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE",
   "size" : 24,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateUtil.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateInternal.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "path",
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_dir_and_contents_",
     "field_offset" : 8192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI12TemporaryDir",
   "name" : "TemporaryDir",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12TemporaryDir",
   "self_type" : "_ZTI12TemporaryDir",
   "size" : 1025,
   "source_file" : "/system/core/base/include/android-base/file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "path",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_file_",
     "field_offset" : 8224,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI13TemporaryFile",
   "name" : "TemporaryFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13TemporaryFile",
   "self_type" : "_ZTI13TemporaryFile",
   "size" : 1032,
   "source_file" : "/system/core/base/include/android-base/file.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "timeout_ms_",
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "private",
     "field_name" : "always_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "account_mode_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android2os9dumpstate13PrivilegeModeE"
    },
    {
     "access" : "private",
     "field_name" : "output_mode_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android2os9dumpstate10OutputModeE"
    },
    {
     "access" : "private",
     "field_name" : "logging_message_",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2os9dumpstate14CommandOptions20CommandOptionsValuesE",
   "name" : "android::os::dumpstate::CommandOptions::CommandOptionsValues",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2os9dumpstate14CommandOptions20CommandOptionsValuesE",
   "self_type" : "_ZTIN7android2os9dumpstate14CommandOptions20CommandOptionsValuesE",
   "size" : 48,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateUtil.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "values",
     "referenced_type" : "_ZTIN7android2os9dumpstate14CommandOptions20CommandOptionsValuesE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2os9dumpstate14CommandOptions21CommandOptionsBuilderE",
   "name" : "android::os::dumpstate::CommandOptions::CommandOptionsBuilder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2os9dumpstate14CommandOptions21CommandOptionsBuilderE",
   "self_type" : "_ZTIN7android2os9dumpstate14CommandOptions21CommandOptionsBuilderE",
   "size" : 48,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateUtil.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "values",
     "referenced_type" : "_ZTIKN7android2os9dumpstate14CommandOptions20CommandOptionsValuesE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2os9dumpstate14CommandOptionsE",
   "name" : "android::os::dumpstate::CommandOptions",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2os9dumpstate14CommandOptionsE",
   "self_type" : "_ZTIN7android2os9dumpstate14CommandOptionsE",
   "size" : 48,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateUtil.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android2os9dumpstate16PropertiesHelperE",
   "name" : "android::os::dumpstate::PropertiesHelper",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2os9dumpstate16PropertiesHelperE",
   "self_type" : "_ZTIN7android2os9dumpstate16PropertiesHelperE",
   "size" : 1,
   "source_file" : "/frameworks/native/cmds/dumpstate/DumpstateUtil.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "_ZTIN7android4base11borrowed_fdE",
   "self_type" : "_ZTIN7android4base11borrowed_fdE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "_ZTIN7android4base13DefaultCloserE",
   "self_type" : "_ZTIN7android4base13DefaultCloserE",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "property_name_",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "prop_info_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK9prop_info"
    },
    {
     "access" : "private",
     "field_name" : "cached_area_serial_",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__18optionalIjEE"
    },
    {
     "access" : "private",
     "field_name" : "cached_property_serial_",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__18optionalIjEE"
    },
    {
     "access" : "private",
     "field_name" : "cached_value_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA92_c"
    },
    {
     "access" : "private",
     "field_name" : "is_read_only_",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "read_only_property_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14CachedPropertyE",
   "name" : "android::base::CachedProperty",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14CachedPropertyE",
   "self_type" : "_ZTIN7android4base14CachedPropertyE",
   "size" : 152,
   "source_file" : "/system/core/base/include/android-base/properties.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "_ZTIN7android4base13DefaultCloserE" ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "referenced_type" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "self_type" : "_ZTION7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  }
 ]
}
