{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1024_h",
   "name" : "unsigned char [1024]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA1024_h",
   "size" : 1024,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA128_A64_t",
   "name" : "unsigned short [128][64]",
   "referenced_type" : "_ZTIA64_t",
   "self_type" : "_ZTIA128_A64_t",
   "size" : 16384,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_h",
   "name" : "unsigned char [128]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA128_h",
   "size" : 128,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_9CPpmd_See",
   "name" : "CPpmd_See [16]",
   "referenced_type" : "_ZTI9CPpmd_See",
   "self_type" : "_ZTIA16_9CPpmd_See",
   "size" : 64,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA16_h",
   "size" : 16,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA20_h",
   "name" : "unsigned char [20]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA20_h",
   "size" : 20,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA256_h",

   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12ISeqInStream",
   "name" : "const ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTIK12ISeqInStream",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13CXzDecMtProps",
   "name" : "const CXzDecMtProps",
   "referenced_type" : "_ZTI13CXzDecMtProps",
   "self_type" : "_ZTIK13CXzDecMtProps",
   "size" : 24,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ILookInStream",
   "name" : "const ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTIK13ILookInStream",
   "size" : 32,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeekInStream",
   "name" : "const ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTIK13ISeekInStream",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ISeqOutStream",
   "name" : "const ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTIK13ISeqOutStream",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK14CLzma2EncProps",
   "name" : "const CLzma2EncProps",
   "referenced_type" : "_ZTI14CLzma2EncProps",
   "self_type" : "_ZTIK14CLzma2EncProps",
   "size" : 80,
   "source_file" : "/external/lzma/C/Lzma2Enc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK14_CLzmaEncProps",
   "name" : "const _CLzmaEncProps",
   "referenced_type" : "_ZTI14_CLzmaEncProps",
   "self_type" : "_ZTIK14_CLzmaEncProps",
   "size" : 56,
   "source_file" : "/external/lzma/C/LzmaEnc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK15IPpmd7_RangeDec",
   "name" : "const IPpmd7_RangeDec",
   "referenced_type" : "_ZTI15IPpmd7_RangeDec",
   "self_type" : "_ZTIK15IPpmd7_RangeDec",
   "size" : 24,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17ICompressProgress",
   "name" : "const ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTIK17ICompressProgress",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK4CXzs",
   "name" : "const CXzs",
   "referenced_type" : "_ZTI4CXzs",
   "self_type" : "_ZTIK4CXzs",
   "size" : 24,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK5CSzAr",
   "name" : "const CSzAr",
   "referenced_type" : "_ZTI5CSzAr",
   "self_type" : "_ZTIK5CSzAr",
   "size" : 80,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7CSzArEx",
   "name" : "const CSzArEx",
   "referenced_type" : "_ZTI7CSzArEx",
   "self_type" : "_ZTIK7CSzArEx",
   "size" : 216,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7IByteIn",
   "name" : "const IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTIK7IByteIn",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8CXzProps",
   "name" : "const CXzProps",
   "referenced_type" : "_ZTI8CXzProps",
   "self_type" : "_ZTIK8CXzProps",
   "size" : 136,
   "source_file" : "/external/lzma/C/XzEnc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8IByteOut",
   "name" : "const IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTIK8IByteOut",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8ISzAlloc",
   "name" : "const ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTIK8ISzAlloc",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9CXzStream",
   "name" : "const CXzStream",
   "referenced_type" : "_ZTI9CXzStream",
   "self_type" : "_ZTIK9CXzStream",
   "size" : 32,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9Cx86cpuid",
   "name" : "const Cx86cpuid",
   "referenced_type" : "_ZTI9Cx86cpuid",
   "self_type" : "_ZTIK9Cx86cpuid",
   "size" : 32,
   "source_file" : "/external/lzma/C/CpuArch.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/external/lzma/C/7zFile.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "/external/lzma/C/Aes.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "/external/lzma/C/Xz.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToLook",
   "name" : "CSecToLook",
   "referenced_type" : "_ZTI10CSecToLook",
   "self_type" : "_ZTI10CSecToLook",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK13ILookInStream"
    }
   ],
   "linker_set_key" : "_ZTI10CSecToRead",
   "name" : "CSecToRead",
   "referenced_type" : "_ZTI10CSecToRead",
   "self_type" : "_ZTI10CSecToRead",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "Symbol",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "Freq",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "SuccessorLow",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "SuccessorHigh",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI11CPpmd_State",
   "name" : "CPpmd_State",
   "referenced_type" : "_ZTI11CPpmd_State",
   "self_type" : "_ZTI11CPpmd_State",
   "size" : 6,
   "source_file" : "/external/lzma/C/Ppmd.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Defs",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "Vals",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPj"
    }
   ],
   "linker_set_key" : "_ZTI11CSzBitUi32s",
   "name" : "CSzBitUi32s",
   "referenced_type" : "_ZTI11CSzBitUi32s",
   "self_type" : "_ZTI11CSzBitUi32s",
   "size" : 16,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Defs",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "Vals",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP13CNtfsFileTime"
    }
   ],
   "linker_set_key" : "_ZTI11CSzBitUi64s",
   "name" : "CSzBitUi64s",
   "referenced_type" : "_ZTI11CSzBitUi64s",
   "self_type" : "_ZTI11CSzBitUi64s",
   "size" : 16,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "UnpackSize_Defined",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "NumStreams_Defined",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "NumBlocks_Defined",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "DataAfterEnd",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "DecodingTruncated",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "InSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "OutSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "NumStreams",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "NumBlocks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "DecodeRes",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ReadRes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ProgressRes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "CombinedRes",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "CombinedRes_Type",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11CXzStatInfo",
   "name" : "CXzStatInfo",
   "referenced_type" : "_ZTI11CXzStatInfo",
   "self_type" : "_ZTI11CXzStatInfo",
   "size" : 64,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "_ZTI8EXzState"
    },
    {
     "field_name" : "pos",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alignPos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "indexPreSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "streamFlags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "blockHeaderSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "packSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numBlocks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indexSize",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indexPos",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "padSize",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numStartedStreams",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numFinishedStreams",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numTotalBlocks",
     "field_offset" : 704,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "crc",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "decoder",
     "field_offset" : 832,
     "referenced_type" : "_ZTI9CMixCoder"
    },
    {
     "field_name" : "block",
     "field_offset" : 3712,
     "referenced_type" : "_ZTI8CXzBlock"
    },
    {
     "field_name" : "check",
     "field_offset" : 4928,
     "referenced_type" : "_ZTI8CXzCheck"
    },
    {
     "field_name" : "sha",
     "field_offset" : 5888,
     "referenced_type" : "_ZTI7CSha256"
    },
    {
     "field_name" : "parseMode",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "headerParsedOk",
     "field_offset" : 6752,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "decodeToStreamSignature",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "decodeOnlyOneBlock",
     "field_offset" : 6816,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "outBuf",
     "field_offset" : 6848,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "outBufSize",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "outDataWritten",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "shaDigest",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIA32_h"
    },
    {
     "field_name" : "buf",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIA1024_h"
    }
   ],
   "linker_set_key" : "_ZTI11CXzUnpacker",
   "name" : "CXzUnpacker",
   "referenced_type" : "_ZTI11CXzUnpacker",
   "self_type" : "_ZTI11CXzUnpacker",
   "size" : 1936,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lc",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "lp",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pb",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "_pad_",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "dicSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11_CLzmaProps",
   "name" : "_CLzmaProps",
   "referenced_type" : "_ZTI11_CLzmaProps",
   "self_type" : "_ZTI11_CLzmaProps",
   "size" : 8,
   "source_file" : "/external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI13ILookInStream"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK13ISeekInStream"
    },
    {
     "field_name" : "pos",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buf",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "bufSize",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12CLookToRead2",
   "name" : "CLookToRead2",
   "referenced_type" : "_ZTI12CLookToRead2",
   "self_type" : "_ZTI12CLookToRead2",
   "size" : 72,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "PropsOffset",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "MethodID",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "NumStreams",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "PropsSize",
     "field_offset" : 104,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI12CSzCoderInfo",
   "name" : "CSzCoderInfo",
   "referenced_type" : "_ZTI12CSzCoderInfo",
   "self_type" : "_ZTI12CSzCoderInfo",
   "size" : 16,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK12ISeqInStreamPvPmE"
    }
   ],
   "linker_set_key" : "_ZTI12ISeqInStream",
   "name" : "ISeqInStream",
   "referenced_type" : "_ZTI12ISeqInStream",
   "self_type" : "_ZTI12ISeqInStream",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "Free",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvPK8ISzAllocE"
    },
    {
     "field_name" : "SetProps",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPvPKhmPK8ISzAllocE"
    },
    {
     "field_name" : "Init",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "Code2",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiPvPhPmPKhS1_i16ECoderFinishModeP12ECoderStatusE"
    },
    {
     "field_name" : "Filter",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFmPvPhmE"
    }
   ],
   "linker_set_key" : "_ZTI12_IStateCoder",
   "name" : "_IStateCoder",
   "referenced_type" : "_ZTI12_IStateCoder",
   "self_type" : "_ZTI12_IStateCoder",
   "size" : 48,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI13ISeekInStream"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7CSzFile"
    }
   ],
   "linker_set_key" : "_ZTI13CFileInStream",
   "name" : "CFileInStream",
   "referenced_type" : "_ZTI13CFileInStream",
   "self_type" : "_ZTI13CFileInStream",
   "size" : 24,
   "source_file" : "/external/lzma/C/7zFile.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Low",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "High",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13CNtfsFileTime",
   "name" : "CNtfsFileTime",
   "referenced_type" : "_ZTI13CNtfsFileTime",
   "self_type" : "_ZTI13CNtfsFileTime",
   "size" : 8,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "unpackSize",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "totalSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI13CXzBlockSizes",
   "name" : "CXzBlockSizes",
   "referenced_type" : "_ZTI13CXzBlockSizes",
   "self_type" : "_ZTI13CXzBlockSizes",
   "size" : 16,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "inBufSize_ST",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "outStep_ST",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ignoreErrors",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI13CXzDecMtProps",
   "name" : "CXzDecMtProps",
   "referenced_type" : "_ZTI13CXzDecMtProps",
   "self_type" : "_ZTI13CXzDecMtProps",
   "size" : 24,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Look",
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPPKvPmE"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ILookInStreammE"
    },
    {
     "field_name" : "Read",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPvPmE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPK13ILookInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ILookInStream",
   "name" : "ILookInStream",
   "referenced_type" : "_ZTI13ILookInStream",
   "self_type" : "_ZTI13ILookInStream",
   "size" : 32,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPvPmE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPK13ISeekInStreamPx7ESzSeekE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeekInStream",
   "name" : "ISeekInStream",
   "referenced_type" : "_ZTI13ISeekInStream",
   "self_type" : "_ZTI13ISeekInStream",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFmPK13ISeqOutStreamPKvmE"
    }
   ],
   "linker_set_key" : "_ZTI13ISeqOutStream",
   "name" : "ISeqOutStream",
   "referenced_type" : "_ZTI13ISeqOutStream",
   "self_type" : "_ZTI13ISeqOutStream",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "pos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "posLimit",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "streamPos",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lenLimit",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cyclicBufferPos",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cyclicBufferSize",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "streamEndWasReached",
     "field_offset" : 256,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "btMode",
     "field_offset" : 264,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "bigHash",
     "field_offset" : 272,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "directInput",
     "field_offset" : 280,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "matchMaxLen",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hash",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "son",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "hashMask",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cutValue",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bufferBase",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "stream",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP12ISeqInStream"
    },
    {
     "field_name" : "blockSize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepSizeBefore",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepSizeAfter",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numHashBytes",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "directInputRem",
     "field_offset" : 768,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "historySize",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fixedHashSize",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hashSizeSum",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "result",
     "field_offset" : 928,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "crc",
     "field_offset" : 960,
     "referenced_type" : "_ZTIA256_j"
    },
    {
     "field_name" : "numRefs",
     "field_offset" : 9152,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "expectedDataSize",
     "field_offset" : 9216,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI13_CMatchFinder",
   "name" : "_CMatchFinder",
   "referenced_type" : "_ZTI13_CMatchFinder",
   "self_type" : "_ZTI13_CMatchFinder",
   "size" : 1160,
   "source_file" : "/external/lzma/C/LzFind.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Init",
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "GetNumAvailableBytes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPvE"
    },
    {
     "field_name" : "GetPointerToCurrentPos",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFPKhPvE"
    },
    {
     "field_name" : "GetMatches",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPvPjE"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFvPvjE"
    }
   ],
   "linker_set_key" : "_ZTI13_IMatchFinder",
   "name" : "_IMatchFinder",
   "referenced_type" : "_ZTI13_IMatchFinder",
   "self_type" : "_ZTI13_IMatchFinder",
   "size" : 40,
   "source_file" : "/external/lzma/C/LzFind.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI13ISeqOutStream"
    },
    {
     "field_name" : "file",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7CSzFile"
    }
   ],
   "linker_set_key" : "_ZTI14CFileOutStream",
   "name" : "CFileOutStream",
   "referenced_type" : "_ZTI14CFileOutStream",
   "self_type" : "_ZTI14CFileOutStream",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zFile.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lzmaProps",
     "referenced_type" : "_ZTI14_CLzmaEncProps"
    },
    {
     "field_name" : "blockSize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numBlockThreads_Reduced",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numBlockThreads_Max",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numTotalThreads",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14CLzma2EncProps",
   "name" : "CLzma2EncProps",
   "referenced_type" : "_ZTI14CLzma2EncProps",
   "self_type" : "_ZTI14CLzma2EncProps",
   "size" : 80,
   "source_file" : "/external/lzma/C/Lzma2Enc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "delta",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ip",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ipDefined",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14CXzFilterProps",
   "name" : "CXzFilterProps",
   "referenced_type" : "_ZTI14CXzFilterProps",
   "self_type" : "_ZTI14CXzFilterProps",
   "size" : 16,
   "source_file" : "/external/lzma/C/XzEnc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "level",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dictSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lp",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pb",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "algo",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fb",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "btMode",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numHashBytes",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mc",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "writeEndMark",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numThreads",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reduceSize",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI14_CLzmaEncProps",
   "name" : "_CLzmaEncProps",
   "referenced_type" : "_ZTI14_CLzmaEncProps",
   "self_type" : "_ZTI14_CLzmaEncProps",
   "size" : 56,
   "source_file" : "/external/lzma/C/LzmaEnc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "NumStats",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "SummFreq",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "Stats",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Suffix",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15CPpmd7_Context_",
   "name" : "CPpmd7_Context_",
   "referenced_type" : "_ZTI15CPpmd7_Context_",
   "self_type" : "_ZTI15CPpmd7_Context_",
   "size" : 12,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetThreshold",
     "referenced_type" : "_ZTIPFjPK15IPpmd7_RangeDecjE"
    },
    {
     "field_name" : "Decode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPK15IPpmd7_RangeDecjjE"
    },
    {
     "field_name" : "DecodeBit",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPK15IPpmd7_RangeDecjE"
    }
   ],
   "linker_set_key" : "_ZTI15IPpmd7_RangeDec",
   "name" : "IPpmd7_RangeDec",
   "referenced_type" : "_ZTI15IPpmd7_RangeDec",
   "self_type" : "_ZTI15IPpmd7_RangeDec",
   "size" : 24,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI12ISeqInStream"
    },
    {
     "field_name" : "file",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7CSzFile"
    }
   ],
   "linker_set_key" : "_ZTI16CFileSeqInStream",
   "name" : "CFileSeqInStream",
   "referenced_type" : "_ZTI16CFileSeqInStream",
   "self_type" : "_ZTI16CFileSeqInStream",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zFile.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI15IPpmd7_RangeDec"
    },
    {
     "field_name" : "Range",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Code",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Stream",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP7IByteIn"
    }
   ],
   "linker_set_key" : "_ZTI16CPpmd7z_RangeDec",
   "name" : "CPpmd7z_RangeDec",
   "referenced_type" : "_ZTI16CPpmd7z_RangeDec",
   "self_type" : "_ZTI16CPpmd7z_RangeDec",
   "size" : 40,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Low",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "Range",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Cache",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "CacheSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "Stream",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8IByteOut"
    }
   ],
   "linker_set_key" : "_ZTI16CPpmd7z_RangeEnc",
   "name" : "CPpmd7z_RangeEnc",
   "referenced_type" : "_ZTI16CPpmd7z_RangeEnc",
   "self_type" : "_ZTI16CPpmd7z_RangeEnc",
   "size" : 32,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "_ZTI8ISzAlloc"
    },
    {
     "field_name" : "baseAlloc",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK8ISzAlloc"
    },
    {
     "field_name" : "numAlignBits",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI17CAlignOffsetAlloc",
   "name" : "CAlignOffsetAlloc",
   "referenced_type" : "_ZTI17CAlignOffsetAlloc",
   "self_type" : "_ZTI17CAlignOffsetAlloc",
   "size" : 40,
   "source_file" : "/external/lzma/C/Alloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Progress",
     "referenced_type" : "_ZTIPFiPK17ICompressProgressyyE"
    }
   ],
   "linker_set_key" : "_ZTI17ICompressProgress",
   "name" : "ICompressProgress",
   "referenced_type" : "_ZTI17ICompressProgress",
   "self_type" : "_ZTI17ICompressProgress",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI4CBuf",
   "name" : "CBuf",
   "referenced_type" : "_ZTI4CBuf",
   "self_type" : "_ZTI4CBuf",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zBuf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "numAllocated",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "streams",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP9CXzStream"
    }
   ],
   "linker_set_key" : "_ZTI4CXzs",
   "name" : "CXzs",
   "referenced_type" : "_ZTI4CXzs",
   "self_type" : "_ZTI4CXzs",
   "size" : 24,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "NumPackStreams",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "NumFolders",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "PackPositions",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPy"
    },
    {
     "field_name" : "FolderCRCs",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11CSzBitUi32s"
    },
    {
     "field_name" : "FoCodersOffsets",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPm"
    },
    {
     "field_name" : "FoStartPackStreamIndex",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FoToCoderUnpackSizes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FoToMainUnpackSizeIndex",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "CoderUnpackSizes",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPy"
    },
    {
     "field_name" : "CodersData",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTI5CSzAr",
   "name" : "CSzAr",
   "referenced_type" : "_ZTI5CSzAr",
   "self_type" : "_ZTI5CSzAr",
   "size" : 80,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "MinContext",
     "referenced_type" : "_ZTIP15CPpmd7_Context_"
    },
    {
     "field_name" : "MaxContext",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15CPpmd7_Context_"
    },
    {
     "field_name" : "FoundState",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP11CPpmd_State"
    },
    {
     "field_name" : "OrderFall",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "InitEsc",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "PrevSuccess",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "MaxOrder",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "HiBitsFlag",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "RunLength",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "InitRL",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "Size",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "GlueCount",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Base",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "LoUnit",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "HiUnit",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "Text",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "UnitsStart",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "AlignOffset",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "Indx2Units",
     "field_offset" : 864,
     "referenced_type" : "_ZTIA38_h"
    },
    {
     "field_name" : "Units2Indx",
     "field_offset" : 1168,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "FreeList",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIA38_j"
    },
    {
     "field_name" : "NS2Indx",
     "field_offset" : 3424,
     "referenced_type" : "_ZTIA256_h"
    },
    {
     "field_name" : "NS2BSIndx",
     "field_offset" : 5472,
     "referenced_type" : "_ZTIA256_h"
    },
    {
     "field_name" : "HB2Flag",
     "field_offset" : 7520,
     "referenced_type" : "_ZTIA256_h"
    },
    {
     "field_name" : "DummySee",
     "field_offset" : 9568,
     "referenced_type" : "_ZTI9CPpmd_See"
    },
    {
     "field_name" : "See",
     "field_offset" : 9600,
     "referenced_type" : "_ZTIA25_A16_9CPpmd_See"
    },
    {
     "field_name" : "BinSumm",
     "field_offset" : 22400,
     "referenced_type" : "_ZTIA128_A64_t"
    }
   ],
   "linker_set_key" : "_ZTI6CPpmd7",
   "name" : "CPpmd7",
   "referenced_type" : "_ZTI6CPpmd7",
   "self_type" : "_ZTI6CPpmd7",
   "size" : 19184,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pos",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI7CDynBuf",
   "name" : "CDynBuf",
   "referenced_type" : "_ZTI7CDynBuf",
   "self_type" : "_ZTI7CDynBuf",
   "size" : 24,
   "source_file" : "/external/lzma/C/7zBuf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "count",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA64_h"
    }
   ],
   "linker_set_key" : "_ZTI7CSha256",
   "name" : "CSha256",
   "referenced_type" : "_ZTI7CSha256",
   "self_type" : "_ZTI7CSha256",
   "size" : 104,
   "source_file" : "/external/lzma/C/Sha256.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "db",
     "referenced_type" : "_ZTI5CSzAr"
    },
    {
     "field_name" : "startPosAfterHeader",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dataPos",
     "field_offset" : 704,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "NumFiles",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "UnpackPositions",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPy"
    },
    {
     "field_name" : "IsDirs",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "CRCs",
     "field_offset" : 960,
     "referenced_type" : "_ZTI11CSzBitUi32s"
    },
    {
     "field_name" : "Attribs",
     "field_offset" : 1088,
     "referenced_type" : "_ZTI11CSzBitUi32s"
    },
    {
     "field_name" : "MTime",
     "field_offset" : 1216,
     "referenced_type" : "_ZTI11CSzBitUi64s"
    },
    {
     "field_name" : "CTime",
     "field_offset" : 1344,
     "referenced_type" : "_ZTI11CSzBitUi64s"
    },
    {
     "field_name" : "FolderToFile",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FileToFolder",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "FileNameOffsets",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPm"
    },
    {
     "field_name" : "FileNames",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTI7CSzArEx",
   "name" : "CSzArEx",
   "referenced_type" : "_ZTI7CSzArEx",
   "self_type" : "_ZTI7CSzArEx",
   "size" : 216,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "InIndex",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "OutIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7CSzBond",
   "name" : "CSzBond",
   "referenced_type" : "_ZTI7CSzBond",
   "self_type" : "_ZTI7CSzBond",
   "size" : 8,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Data",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "Size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI7CSzData",
   "name" : "CSzData",
   "referenced_type" : "_ZTI7CSzData",
   "self_type" : "_ZTI7CSzData",
   "size" : 16,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "file",
     "referenced_type" : "_ZTIP7__sFILE"
    }
   ],
   "linker_set_key" : "_ZTI7CSzFile",
   "name" : "CSzFile",
   "referenced_type" : "_ZTI7CSzFile",
   "self_type" : "_ZTI7CSzFile",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zFile.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "_ZTIPFhPK7IByteInE"
    }
   ],
   "linker_set_key" : "_ZTI7IByteIn",
   "name" : "IByteIn",
   "referenced_type" : "_ZTI7IByteIn",
   "self_type" : "_ZTI7IByteIn",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bufs",
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "lims",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "dest",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "destLim",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "state",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ip",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "temp",
     "field_offset" : 704,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "range",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "code",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "probs",
     "field_offset" : 800,
     "referenced_type" : "_ZTIA258_t"
    }
   ],
   "linker_set_key" : "_ZTI8CBcj2Dec",
   "name" : "CBcj2Dec",
   "referenced_type" : "_ZTI8CBcj2Dec",
   "self_type" : "_ZTI8CBcj2Dec",
   "size" : 616,
   "source_file" : "/external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bufs",
     "referenced_type" : "_ZTIA4_Ph"
    },
    {
     "field_name" : "lims",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "src",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "srcLim",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "state",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "finishMode",
     "field_offset" : 672,
     "referenced_type" : "_ZTI19EBcj2Enc_FinishMode"
    },
    {
     "field_name" : "prevByte",
     "field_offset" : 704,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "cache",
     "field_offset" : 712,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "range",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "low",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cacheSize",
     "field_offset" : 832,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ip",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fileIp",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fileSize",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "relatLimit",
     "field_offset" : 992,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempTarget",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempPos",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "temp",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "flushPos",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "probs",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIA258_t"
    }
   ],
   "linker_set_key" : "_ZTI8CBcj2Enc",
   "name" : "CBcj2Enc",
   "referenced_type" : "_ZTI8CBcj2Enc",
   "self_type" : "_ZTI8CBcj2Enc",
   "size" : 664,
   "source_file" : "/external/lzma/C/Bcj2.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "prop",
     "referenced_type" : "_ZTI11_CLzmaProps"
    },
    {
     "field_name" : "probs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "probs_1664",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "dic",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "dicBufSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "dicPos",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buf",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "range",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "code",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "processedPos",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "checkDicSize",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reps",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "state",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "remainLen",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numProbs",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempBufSize",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tempBuf",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA20_h"
    }
   ],
   "linker_set_key" : "_ZTI8CLzmaDec",
   "name" : "CLzmaDec",
   "referenced_type" : "_ZTI8CLzmaDec",
   "self_type" : "_ZTI8CLzmaDec",
   "size" : 128,
   "source_file" : "/external/lzma/C/LzmaDec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "packSize",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "filters",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA4_9CXzFilter"
    }
   ],
   "linker_set_key" : "_ZTI8CXzBlock",
   "name" : "CXzBlock",
   "referenced_type" : "_ZTI8CXzBlock",
   "self_type" : "_ZTI8CXzBlock",
   "size" : 152,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "crc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "crc64",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sha",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7CSha256"
    }
   ],
   "linker_set_key" : "_ZTI8CXzCheck",
   "name" : "CXzCheck",
   "referenced_type" : "_ZTI8CXzCheck",
   "self_type" : "_ZTI8CXzCheck",
   "size" : 120,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lzma2Props",
     "referenced_type" : "_ZTI14CLzma2EncProps"
    },
    {
     "field_name" : "filterProps",
     "field_offset" : 640,
     "referenced_type" : "_ZTI14CXzFilterProps"
    },
    {
     "field_name" : "checkId",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blockSize",
     "field_offset" : 832,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numBlockThreads_Reduced",
     "field_offset" : 896,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numBlockThreads_Max",
     "field_offset" : 928,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numTotalThreads",
     "field_offset" : 960,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "forceWriteSizesInHeader",
     "field_offset" : 992,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reduceSize",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI8CXzProps",
   "name" : "CXzProps",
   "referenced_type" : "_ZTI8CXzProps",
   "self_type" : "_ZTI8CXzProps",
   "size" : 136,
   "source_file" : "/external/lzma/C/XzEnc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "_ZTIPFvPK8IByteOuthE"
    }
   ],
   "linker_set_key" : "_ZTI8IByteOut",
   "name" : "IByteOut",
   "referenced_type" : "_ZTI8IByteOut",
   "self_type" : "_ZTI8IByteOut",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Alloc",
     "referenced_type" : "_ZTIPFPvPK8ISzAllocmE"
    },
    {
     "field_name" : "Free",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPK8ISzAllocPvE"
    }
   ],
   "linker_set_key" : "_ZTI8ISzAlloc",
   "name" : "ISzAlloc",
   "referenced_type" : "_ZTI8ISzAlloc",
   "self_type" : "_ZTI8ISzAlloc",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "control",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "needInitLevel",
     "field_offset" : 40,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "isExtraMode",
     "field_offset" : 48,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "_pad_",
     "field_offset" : 56,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "packSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "decoder",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8CLzmaDec"
    }
   ],
   "linker_set_key" : "_ZTI9CLzma2Dec",
   "name" : "CLzma2Dec",
   "referenced_type" : "_ZTI9CLzma2Dec",
   "self_type" : "_ZTI9CLzma2Dec",
   "size" : 144,
   "source_file" : "/external/lzma/C/Lzma2Dec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alloc",
     "referenced_type" : "_ZTIPK8ISzAlloc"
    },
    {
     "field_name" : "buf",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "numCoders",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "outBuf",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "outBufSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "outWritten",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "wasFinished",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "res",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "status",
     "field_offset" : 448,
     "referenced_type" : "_ZTI12ECoderStatus"
    },
    {
     "field_name" : "finished",
     "field_offset" : 480,
     "referenced_type" : "_ZTIA3_i"
    },
    {
     "field_name" : "pos",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA3_m"
    },
    {
     "field_name" : "size",
     "field_offset" : 768,
     "referenced_type" : "_ZTIA3_m"
    },
    {
     "field_name" : "ids",
     "field_offset" : 960,
     "referenced_type" : "_ZTIA4_y"
    },
    {
     "field_name" : "results",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "coders",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIA4_12_IStateCoder"
    }
   ],
   "linker_set_key" : "_ZTI9CMixCoder",
   "name" : "CMixCoder",
   "referenced_type" : "_ZTI9CMixCoder",
   "self_type" : "_ZTI9CMixCoder",
   "size" : 360,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "Summ",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "Shift",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "Count",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI9CPpmd_See",
   "name" : "CPpmd_See",
   "referenced_type" : "_ZTI9CPpmd_See",
   "self_type" : "_ZTI9CPpmd_See",
   "size" : 4,
   "source_file" : "/external/lzma/C/Ppmd.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "NumCoders",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "NumBonds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "NumPackStreams",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "UnpackStream",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "PackStreams",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_j"
    },
    {
     "field_name" : "Bonds",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA3_7CSzBond"
    },
    {
     "field_name" : "Coders",
     "field_offset" : 448,
     "referenced_type" : "_ZTIA4_12CSzCoderInfo"
    }
   ],
   "linker_set_key" : "_ZTI9CSzFolder",
   "name" : "CSzFolder",
   "referenced_type" : "_ZTI9CSzFolder",
   "self_type" : "_ZTI9CSzFolder",
   "size" : 120,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "propsSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "props",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA20_h"
    }
   ],
   "linker_set_key" : "_ZTI9CXzFilter",
   "name" : "CXzFilter",
   "referenced_type" : "_ZTI9CXzFilter",
   "self_type" : "_ZTI9CXzFilter",
   "size" : 32,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "numBlocks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "blocks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP13CXzBlockSizes"
    },
    {
     "field_name" : "startOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI9CXzStream",
   "name" : "CXzStream",
   "referenced_type" : "_ZTI9CXzStream",
   "self_type" : "_ZTI9CXzStream",
   "size" : 32,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxFunc",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vendor",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA3_j"
    },
    {
     "field_name" : "ver",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "b",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "c",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "d",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI9Cx86cpuid",
   "name" : "Cx86cpuid",
   "referenced_type" : "_ZTI9Cx86cpuid",
   "self_type" : "_ZTI9Cx86cpuid",
   "size" : 32,
   "source_file" : "/external/lzma/C/CpuArch.h"
  }
 ],
 "rvalue_reference_types" : []
}
