{
 "array_types" :
 [
  {
   "linker_set_key" : "keymaster_algorithm_t []",
   "name" : "keymaster_algorithm_t []",
   "referenced_type" : "type-156",
   "self_type" : "type-155",
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h"
  },
  {
   "linker_set_key" : "keymaster_block_mode_t []",
   "name" : "keymaster_block_mode_t []",
   "referenced_type" : "type-19",
   "self_type" : "type-18",
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h"
  },
  {
   "linker_set_key" : "keymaster_digest_t []",
   "name" : "keymaster_digest_t []",
   "referenced_type" : "type-86",
   "self_type" : "type-85",
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h"
  },
  {
   "linker_set_key" : "keymaster_key_format_t []",
   "name" : "keymaster_key_format_t []",
   "referenced_type" : "type-175",
   "self_type" : "type-174",
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h"
  },
  {
   "linker_set_key" : "keymaster_padding_t []",
   "name" : "keymaster_padding_t []",
   "referenced_type" : "type-50",
   "self_type" : "type-49",
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [32]",
   "name" : "unsigned char [32]",
   "referenced_type" : "type-3",
   "self_type" : "type-342",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h"
  },
  {
   "linker_set_key" : "unsigned char []",

   "linker_set_key" : "const keymaster_key_blob_t",
   "name" : "const keymaster_key_blob_t",
   "referenced_type" : "type-525",
   "self_type" : "type-524",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_key_blob_t",
   "name" : "const keymaster_key_blob_t",
   "referenced_type" : "type-661",
   "self_type" : "type-660",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_key_format_t",
   "name" : "const keymaster_key_format_t",
   "referenced_type" : "type-462",
   "self_type" : "type-461",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_key_param_set_t",
   "name" : "const keymaster_key_param_set_t",
   "referenced_type" : "type-505",
   "self_type" : "type-504",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_key_param_set_t",
   "name" : "const keymaster_key_param_set_t",
   "referenced_type" : "type-65",
   "self_type" : "type-64",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_key_param_t",
   "name" : "const keymaster_key_param_t",
   "referenced_type" : "type-502",
   "self_type" : "type-501",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_key_param_t",
   "name" : "const keymaster_key_param_t",
   "referenced_type" : "type-62",
   "self_type" : "type-61",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_padding_t",
   "name" : "const keymaster_padding_t",
   "referenced_type" : "type-454",
   "self_type" : "type-453",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_tag_t",
   "name" : "const keymaster_tag_t",
   "referenced_type" : "type-540",
   "self_type" : "type-539",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_tag_t",
   "name" : "const keymaster_tag_t",
   "referenced_type" : "type-577",
   "self_type" : "type-576",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_tag_t",
   "name" : "const keymaster_tag_t",
   "referenced_type" : "type-681",
   "self_type" : "type-680",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const nullptr_t",
   "name" : "const nullptr_t",
   "referenced_type" : "type-281",
   "self_type" : "type-280",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-440",
   "self_type" : "type-439",
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-477",
   "self_type" : "type-476",
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-508",
   "self_type" : "type-507",
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-659",
   "self_type" : "type-658",
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-677",
   "self_type" : "type-676",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-3",
   "self_type" : "type-266",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned char *const",
   "name" : "const unsigned char *const",
   "referenced_type" : "type-265",
   "self_type" : "type-264",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-33",
   "self_type" : "type-394",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-220",
   "self_type" : "type-444",
   "source_file" : "/system/keymaster/include/keymaster/serializable.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "keymaster::AbortOperationRequest",
   "name" : "keymaster::AbortOperationRequest",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21AbortOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21AbortOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21AbortOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21AbortOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "keymaster::AbortOperationResponse",
   "name" : "keymaster::AbortOperationResponse",
   "referenced_type" : "type-239",
   "self_type" : "type-239",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22AbortOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22AbortOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22AbortOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22AbortOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "random_data",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "keymaster::AddEntropyRequest",
   "name" : "keymaster::AddEntropyRequest",
   "referenced_type" : "type-244",
   "self_type" : "type-244",
   "size" : 28,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17AddEntropyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17AddEntropyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AddEntropyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AddEntropyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "keymaster::AddEntropyResponse",
   "name" : "keymaster::AddEntropyResponse",
   "referenced_type" : "type-248",
   "self_type" : "type-248",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18AddEntropyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18AddEntropyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18AddEntropyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18AddEntropyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-307"
    },
    {
     "field_name" : "attest_params",
     "field_offset" : 128,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::AttestKeyRequest",
   "name" : "keymaster::AttestKeyRequest",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16AttestKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AttestKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AttestKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AttestKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "certificate_chain",
     "field_offset" : 96,
     "referenced_type" : "type-312"
    }
   ],
   "linker_set_key" : "keymaster::AttestKeyResponse",
   "name" : "keymaster::AttestKeyResponse",
   "referenced_type" : "type-311",
   "self_type" : "type-311",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17AttestKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17AttestKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AttestKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AttestKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "hw_enforced_",
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "sw_enforced_",
     "field_offset" : 32,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "keymaster::AuthProxy",
   "name" : "keymaster::AuthProxy",
   "record_kind" : "class",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster9AuthProxyE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pos_",
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "auth_set1_",
     "field_offset" : 32,
     "referenced_type" : "type-69"
    },
    {
     "access" : "private",
     "field_name" : "auth_set2_",
     "field_offset" : 64,
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "keymaster::AuthProxyIterator",
   "name" : "keymaster::AuthProxyIterator",
   "record_kind" : "class",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster17AuthProxyIteratorE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    },
    {
     "referenced_type" : "type-60"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "elems_",
     "field_offset" : 96,
     "referenced_type" : "type-55"
    },
    {
     "access" : "private",
     "field_name" : "elems_size_",
     "field_offset" : 128,
     "referenced_type" : "type-58"
    },
    {
     "access" : "private",
     "field_name" : "elems_capacity_",
     "field_offset" : 160,
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_",
     "field_offset" : 192,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_size_",
     "field_offset" : 224,
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_capacity_",
     "field_offset" : 256,
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "error_",
     "field_offset" : 288,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "keymaster::AuthorizationSet",
   "name" : "keymaster::AuthorizationSet",
   "record_kind" : "class",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster16AuthorizationSetE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AuthorizationSetE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSetD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSetD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AuthorizationSet14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AuthorizationSet9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSet11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "set",
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::AuthorizationSetBuilder",
   "name" : "keymaster::AuthorizationSetBuilder",
   "record_kind" : "class",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster23AuthorizationSetBuilderE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "purpose",
     "field_offset" : 64,
     "referenced_type" : "type-205"
    },
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-206"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 160,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::BeginOperationRequest",
   "name" : "keymaster::BeginOperationRequest",
   "referenced_type" : "type-204",
   "self_type" : "type-204",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21BeginOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21BeginOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21BeginOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21BeginOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 96,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 160,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::BeginOperationResponse",
   "name" : "keymaster::BeginOperationResponse",
   "referenced_type" : "type-211",
   "self_type" : "type-211",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22BeginOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22BeginOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22BeginOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22BeginOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "read_position_",
     "field_offset" : 96,
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "write_position_",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::Buffer",
   "name" : "keymaster::Buffer",
   "record_kind" : "class",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h",
   "unique_id" : "_ZTSN9keymaster6BufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6BufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6BufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6BufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6Buffer14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6Buffer9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster6Buffer11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::CertificateChainDelete",
   "name" : "keymaster::CertificateChainDelete",
   "referenced_type" : "type-515",
   "self_type" : "type-515",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster22CertificateChainDeleteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Characteristics_Delete",
   "name" : "keymaster::Characteristics_Delete",
   "referenced_type" : "type-475",
   "self_type" : "type-475",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster22Characteristics_DeleteE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params_array",
     "field_offset" : 64,
     "referenced_type" : "type-347"
    }
   ],
   "linker_set_key" : "keymaster::ComputeSharedHmacRequest",
   "name" : "keymaster::ComputeSharedHmacRequest",
   "referenced_type" : "type-361",
   "self_type" : "type-361",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24ComputeSharedHmacRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24ComputeSharedHmacRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ComputeSharedHmacRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ComputeSharedHmacRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "sharing_check",
     "field_offset" : 96,
     "referenced_type" : "type-339"
    }
   ],
   "linker_set_key" : "keymaster::ComputeSharedHmacResponse",
   "name" : "keymaster::ComputeSharedHmacResponse",
   "referenced_type" : "type-366",
   "self_type" : "type-366",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster25ComputeSharedHmacResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25ComputeSharedHmacResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25ComputeSharedHmacResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25ComputeSharedHmacResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "os_version",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "os_patchlevel",
     "field_offset" : 96,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::ConfigureRequest",
   "name" : "keymaster::ConfigureRequest",
   "referenced_type" : "type-328",
   "self_type" : "type-328",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ConfigureRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ConfigureRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ConfigureRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ConfigureRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "keymaster::ConfigureResponse",
   "name" : "keymaster::ConfigureResponse",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ConfigureResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ConfigureResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ConfigureResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ConfigureResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_algorithm_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_algorithm_t []>",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-155" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_21keymaster_algorithm_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_block_mode_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_block_mode_t []>",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_22keymaster_block_mode_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_digest_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_digest_t []>",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-85" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_key_format_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_key_format_t []>",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-174" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_22keymaster_key_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_padding_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_padding_t []>",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-49" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<unsigned char []>",
   "name" : "keymaster::DefaultDelete<unsigned char []>",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_hEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "linker_set_key" : "keymaster::DeleteAllKeysRequest",
   "name" : "keymaster::DeleteAllKeysRequest",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster20DeleteAllKeysRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20DeleteAllKeysRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20DeleteAllKeysRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20DeleteAllKeysRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "keymaster::DeleteAllKeysResponse",
   "name" : "keymaster::DeleteAllKeysResponse",
   "referenced_type" : "type-294",
   "self_type" : "type-294",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21DeleteAllKeysResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21DeleteAllKeysResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21DeleteAllKeysResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21DeleteAllKeysResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-279"
    }
   ],
   "linker_set_key" : "keymaster::DeleteKeyRequest",
   "name" : "keymaster::DeleteKeyRequest",
   "referenced_type" : "type-278",
   "self_type" : "type-278",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16DeleteKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16DeleteKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16DeleteKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16DeleteKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "keymaster::DeleteKeyResponse",
   "name" : "keymaster::DeleteKeyResponse",
   "referenced_type" : "type-285",
   "self_type" : "type-285",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17DeleteKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17DeleteKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17DeleteKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17DeleteKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buf_",
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::Eraser",
   "name" : "keymaster::Eraser",
   "record_kind" : "class",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster6EraserE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "additional_params",
     "field_offset" : 64,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "key_format",
     "field_offset" : 384,
     "referenced_type" : "type-269"
    },
    {
     "field_name" : "key_blob",
     "field_offset" : 416,
     "referenced_type" : "type-270"
    }
   ],
   "linker_set_key" : "keymaster::ExportKeyRequest",
   "name" : "keymaster::ExportKeyRequest",
   "referenced_type" : "type-268",
   "self_type" : "type-268",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ExportKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ExportKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ExportKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ExportKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_data",
     "field_offset" : 96,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "key_data_length",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::ExportKeyResponse",
   "name" : "keymaster::ExportKeyResponse",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ExportKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ExportKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ExportKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ExportKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "input",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "signature",
     "field_offset" : 288,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 448,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::FinishOperationRequest",
   "name" : "keymaster::FinishOperationRequest",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22FinishOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22FinishOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22FinishOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22FinishOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "output",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 256,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::FinishOperationResponse",
   "name" : "keymaster::FinishOperationResponse",
   "referenced_type" : "type-231",
   "self_type" : "type-231",
   "size" : 72,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23FinishOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23FinishOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23FinishOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23FinishOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_description",
     "field_offset" : 64,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::GenerateKeyRequest",
   "name" : "keymaster::GenerateKeyRequest",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 48,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18GenerateKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18GenerateKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GenerateKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GenerateKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-187"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 160,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 480,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::GenerateKeyResponse",
   "name" : "keymaster::GenerateKeyResponse",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster19GenerateKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19GenerateKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19GenerateKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19GenerateKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params",
     "field_offset" : 96,
     "referenced_type" : "type-338"
    }
   ],
   "linker_set_key" : "keymaster::GetHmacSharingParametersResponse",
   "name" : "keymaster::GetHmacSharingParametersResponse",
   "referenced_type" : "type-352",
   "self_type" : "type-352",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster32GetHmacSharingParametersResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster32GetHmacSharingParametersResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster32GetHmacSharingParametersResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster32GetHmacSharingParametersResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 128,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::GetKeyCharacteristicsRequest",
   "name" : "keymaster::GetKeyCharacteristicsRequest",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster28GetKeyCharacteristicsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28GetKeyCharacteristicsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28GetKeyCharacteristicsRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28GetKeyCharacteristicsRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "enforced",
     "field_offset" : 96,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 416,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::GetKeyCharacteristicsResponse",
   "name" : "keymaster::GetKeyCharacteristicsResponse",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 92,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29GetKeyCharacteristicsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29GetKeyCharacteristicsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29GetKeyCharacteristicsResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29GetKeyCharacteristicsResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "linker_set_key" : "keymaster::GetVersionRequest",
   "name" : "keymaster::GetVersionRequest",
   "referenced_type" : "type-298",
   "self_type" : "type-298",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17GetVersionRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17GetVersionRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17GetVersionRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17GetVersionRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "major_ver",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "minor_ver",
     "field_offset" : 104,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "subminor_ver",
     "field_offset" : 112,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "keymaster::GetVersionResponse",
   "name" : "keymaster::GetVersionResponse",
   "referenced_type" : "type-302",
   "self_type" : "type-302",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18GetVersionResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18GetVersionResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GetVersionResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GetVersionResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 32,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "user_id",
     "field_offset" : 96,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "authenticator_id",
     "field_offset" : 160,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "authenticator_type",
     "field_offset" : 224,
     "referenced_type" : "type-385"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 256,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "mac",
     "field_offset" : 320,
     "referenced_type" : "type-339"
    }
   ],
   "linker_set_key" : "keymaster::HardwareAuthToken",
   "name" : "keymaster::HardwareAuthToken",
   "referenced_type" : "type-384",
   "self_type" : "type-384",
   "size" : 48,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17HardwareAuthTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17HardwareAuthTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17HardwareAuthToken14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17HardwareAuthToken9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthToken11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "seed",
     "field_offset" : 32,
     "referenced_type" : "type-339"
    },
    {
     "field_name" : "nonce",
     "field_offset" : 96,
     "referenced_type" : "type-342"
    }
   ],
   "linker_set_key" : "keymaster::HmacSharingParameters",
   "name" : "keymaster::HmacSharingParameters",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 44,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21HmacSharingParametersE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21HmacSharingParametersE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParametersD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParametersD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21HmacSharingParameters14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21HmacSharingParameters9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParameters11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params_array",
     "field_offset" : 32,
     "referenced_type" : "type-337"
    },
    {
     "field_name" : "num_params",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::HmacSharingParametersArray",
   "name" : "keymaster::HmacSharingParametersArray",
   "referenced_type" : "type-347",
   "self_type" : "type-347",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26HmacSharingParametersArrayE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26HmacSharingParametersArrayE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArrayD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArrayD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26HmacSharingParametersArray14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26HmacSharingParametersArray9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArray11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_description",
     "field_offset" : 64,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "key_format",
     "field_offset" : 384,
     "referenced_type" : "type-254"
    },
    {
     "field_name" : "key_data",
     "field_offset" : 416,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "key_data_length",
     "field_offset" : 448,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::ImportKeyRequest",
   "name" : "keymaster::ImportKeyRequest",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ImportKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ImportKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ImportKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ImportKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-259"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 160,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 480,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::ImportKeyResponse",
   "name" : "keymaster::ImportKeyResponse",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ImportKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ImportKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ImportKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ImportKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "wrapped_key",
     "field_offset" : 64,
     "referenced_type" : "type-372"
    },
    {
     "field_name" : "wrapping_key",
     "field_offset" : 128,
     "referenced_type" : "type-372"
    },
    {
     "field_name" : "masking_key",
     "field_offset" : 192,
     "referenced_type" : "type-372"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 256,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "password_sid",
     "field_offset" : 576,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "biometric_sid",
     "field_offset" : 640,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "keymaster::ImportWrappedKeyRequest",
   "name" : "keymaster::ImportWrappedKeyRequest",
   "referenced_type" : "type-371",
   "self_type" : "type-371",
   "size" : 88,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23ImportWrappedKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23ImportWrappedKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23ImportWrappedKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23ImportWrappedKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-372"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 160,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 480,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::ImportWrappedKeyResponse",
   "name" : "keymaster::ImportWrappedKeyResponse",
   "referenced_type" : "type-380",
   "self_type" : "type-380",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24ImportWrappedKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24ImportWrappedKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ImportWrappedKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ImportWrappedKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "message_version",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterMessage",
   "name" : "keymaster::KeymasterMessage",
   "referenced_type" : "type-96",
   "self_type" : "type-96",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16KeymasterMessageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16KeymasterMessageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterMessageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterMessageD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable14SerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable9SerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12Serializable11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "error",
     "field_offset" : 64,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterResponse",
   "name" : "keymaster::KeymasterResponse",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17KeymasterResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17KeymasterResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse22NonErrorSerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse17NonErrorSerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::Logger",
   "name" : "keymaster::Logger",
   "record_kind" : "class",
   "referenced_type" : "type-516",
   "self_type" : "type-516",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/logger.h",
   "unique_id" : "_ZTSN9keymaster6LoggerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6LoggerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6LoggerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6LoggerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster6Logger7log_msgENS0_8LogLevelEPKcPc"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Malloc_Delete",
   "name" : "keymaster::Malloc_Delete",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster13Malloc_DeleteE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::Serializable",
   "name" : "keymaster::Serializable",
   "record_kind" : "class",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h",
   "unique_id" : "_ZTSN9keymaster12SerializableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12SerializableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SerializableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SerializableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable14SerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable9SerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12Serializable11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::StaticAssert<true>",
   "name" : "keymaster::StaticAssert<true>",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12StaticAssertILb1EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "linker_set_key" : "keymaster::SupportedAlgorithmsRequest",
   "name" : "keymaster::SupportedAlgorithmsRequest",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26SupportedAlgorithmsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26SupportedAlgorithmsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26SupportedAlgorithmsRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26SupportedAlgorithmsRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "keymaster::SupportedAlgorithmsResponse",
   "name" : "keymaster::SupportedAlgorithmsResponse",
   "referenced_type" : "type-167",
   "self_type" : "type-167",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedAlgorithmsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedAlgorithmsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedAlgorithmsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedAlgorithmsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "keymaster::SupportedBlockModesRequest",
   "name" : "keymaster::SupportedBlockModesRequest",
   "referenced_type" : "type-123",
   "self_type" : "type-123",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26SupportedBlockModesRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26SupportedBlockModesRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedBlockModesRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedBlockModesRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-138"
    }
   ],
   "linker_set_key" : "keymaster::SupportedBlockModesResponse",
   "name" : "keymaster::SupportedBlockModesResponse",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedBlockModesResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedBlockModesResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedBlockModesResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedBlockModesResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "purpose",
     "field_offset" : 96,
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "keymaster::SupportedByAlgorithmAndPurposeRequest",
   "name" : "keymaster::SupportedByAlgorithmAndPurposeRequest",
   "referenced_type" : "type-116",
   "self_type" : "type-116",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster37SupportedByAlgorithmAndPurposeRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster37SupportedByAlgorithmAndPurposeRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "field_offset" : 64,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "keymaster::SupportedByAlgorithmRequest",
   "name" : "keymaster::SupportedByAlgorithmRequest",
   "referenced_type" : "type-107",
   "self_type" : "type-107",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedByAlgorithmRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedByAlgorithmRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "keymaster::SupportedDigestsRequest",
   "name" : "keymaster::SupportedDigestsRequest",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23SupportedDigestsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23SupportedDigestsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23SupportedDigestsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23SupportedDigestsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-149"
    }
   ],
   "linker_set_key" : "keymaster::SupportedDigestsResponse",
   "name" : "keymaster::SupportedDigestsResponse",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24SupportedDigestsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24SupportedDigestsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SupportedDigestsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SupportedDigestsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-107"
    }
   ],
   "linker_set_key" : "keymaster::SupportedExportFormatsRequest",
   "name" : "keymaster::SupportedExportFormatsRequest",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedExportFormatsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedExportFormatsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedExportFormatsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedExportFormatsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-160"
    }
   ],
   "linker_set_key" : "keymaster::SupportedExportFormatsResponse",
   "name" : "keymaster::SupportedExportFormatsResponse",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster30SupportedExportFormatsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster30SupportedExportFormatsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedExportFormatsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedExportFormatsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-107"
    }
   ],
   "linker_set_key" : "keymaster::SupportedImportFormatsRequest",
   "name" : "keymaster::SupportedImportFormatsRequest",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedImportFormatsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedImportFormatsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedImportFormatsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedImportFormatsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-160"
    }
   ],
   "linker_set_key" : "keymaster::SupportedImportFormatsResponse",
   "name" : "keymaster::SupportedImportFormatsResponse",
   "referenced_type" : "type-178",
   "self_type" : "type-178",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster30SupportedImportFormatsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster30SupportedImportFormatsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedImportFormatsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedImportFormatsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "keymaster::SupportedPaddingModesRequest",
   "name" : "keymaster::SupportedPaddingModesRequest",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster28SupportedPaddingModesRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28SupportedPaddingModesRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28SupportedPaddingModesRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28SupportedPaddingModesRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "keymaster::SupportedPaddingModesResponse",
   "name" : "keymaster::SupportedPaddingModesResponse",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedPaddingModesResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedPaddingModesResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedPaddingModesResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedPaddingModesResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_algorithm_t>",
   "name" : "keymaster::SupportedResponse<keymaster_algorithm_t>",
   "referenced_type" : "type-131",
   "self_type" : "type-131",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-134" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI21keymaster_algorithm_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI21keymaster_algorithm_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_block_mode_t>",
   "name" : "keymaster::SupportedResponse<keymaster_block_mode_t>",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-139" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI22keymaster_block_mode_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI22keymaster_block_mode_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_digest_t>",
   "name" : "keymaster::SupportedResponse<keymaster_digest_t>",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-152" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI18keymaster_digest_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI18keymaster_digest_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-161"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_key_format_t>",
   "name" : "keymaster::SupportedResponse<keymaster_key_format_t>",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI22keymaster_key_format_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI22keymaster_key_format_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_padding_t>",
   "name" : "keymaster::SupportedResponse<keymaster_padding_t>",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-145" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI19keymaster_padding_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI19keymaster_padding_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-340"
    }
   ],
   "linker_set_key" : "keymaster::TKeymasterBlob<keymaster_blob_t>",
   "name" : "keymaster::TKeymasterBlob<keymaster_blob_t>",
   "referenced_type" : "type-339",
   "self_type" : "type-339",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-341" ],
   "unique_id" : "_ZTSN9keymaster14TKeymasterBlobI16keymaster_blob_tEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-373"
    }
   ],
   "linker_set_key" : "keymaster::TKeymasterBlob<keymaster_key_blob_t>",
   "name" : "keymaster::TKeymasterBlob<keymaster_key_blob_t>",
   "referenced_type" : "type-372",
   "self_type" : "type-372",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-374" ],
   "unique_id" : "_ZTSN9keymaster14TKeymasterBlobI20keymaster_key_blob_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BIGNUM>",
   "name" : "keymaster::TagValueType<KM_BIGNUM>",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn2147483648EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BOOL>",
   "name" : "keymaster::TagValueType<KM_BOOL>",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1879048192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BYTES>",
   "name" : "keymaster::TagValueType<KM_BYTES>",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn1879048192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_DATE>",
   "name" : "keymaster::TagValueType<KM_DATE>",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1610612736EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_INVALID>",
   "name" : "keymaster::TagValueType<KM_INVALID>",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_UINT>",
   "name" : "keymaster::TagValueType<KM_UINT>",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t805306368EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_UINT_REP>",
   "name" : "keymaster::TagValueType<KM_UINT_REP>",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1073741824EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_ULONG>",
   "name" : "keymaster::TagValueType<KM_ULONG>",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1342177280EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_ULONG_REP>",
   "name" : "keymaster::TagValueType<KM_ULONG_REP>",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn1610612736EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, 268435461, keymaster_digest_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, 268435461, keymaster_digest_t>",
   "record_kind" : "class",
   "referenced_type" : "type-545",
   "self_type" : "type-545",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-546" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435461E18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, 268435463, keymaster_padding_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, 268435463, keymaster_padding_t>",
   "record_kind" : "class",
   "referenced_type" : "type-550",
   "self_type" : "type-550",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-551" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435463E19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t>",
   "record_kind" : "class",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435458E21keymaster_algorithm_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_BLOB_USAGE_REQUIREMENTS, keymaster_key_blob_usage_requirements_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_BLOB_USAGE_REQUIREMENTS, keymaster_key_blob_usage_requirements_t>",
   "record_kind" : "class",
   "referenced_type" : "type-553",
   "self_type" : "type-553",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-554" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435757E39keymaster_key_blob_usage_requirements_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_EC_CURVE, keymaster_ec_curve_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_EC_CURVE, keymaster_ec_curve_t>",
   "record_kind" : "class",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435466E20keymaster_ec_curve_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ORIGIN, keymaster_key_origin_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ORIGIN, keymaster_key_origin_t>",
   "record_kind" : "class",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-557" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268436158E22keymaster_key_origin_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_USER_AUTH_TYPE, hw_authenticator_type_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_USER_AUTH_TYPE, hw_authenticator_type_t>",
   "record_kind" : "class",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-562" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435960E23hw_authenticator_type_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_BLOCK_MODE, keymaster_block_mode_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_BLOCK_MODE, keymaster_block_mode_t>",
   "record_kind" : "class",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870916E22keymaster_block_mode_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_DIGEST, keymaster_digest_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_DIGEST, keymaster_digest_t>",
   "record_kind" : "class",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870917E18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_KDF, keymaster_kdf_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_KDF, keymaster_kdf_t>",
   "record_kind" : "class",
   "referenced_type" : "type-564",
   "self_type" : "type-564",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-565" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870921E15keymaster_kdf_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PADDING, keymaster_padding_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PADDING, keymaster_padding_t>",
   "record_kind" : "class",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870918E19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PURPOSE, keymaster_purpose_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PURPOSE, keymaster_purpose_t>",
   "record_kind" : "class",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-26" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870913E19keymaster_purpose_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALLOW_WHILE_ON_BODY>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALLOW_WHILE_ON_BODY>",
   "record_kind" : "class",
   "referenced_type" : "type-607",
   "self_type" : "type-607",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048698EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_APPLICATIONS>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_APPLICATIONS>",
   "record_kind" : "class",
   "referenced_type" : "type-613",
   "self_type" : "type-613",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048792EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_USERS>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_USERS>",
   "record_kind" : "class",
   "referenced_type" : "type-597",
   "self_type" : "type-597",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048692EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_BOOTLOADER_ONLY>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_BOOTLOADER_ONLY>",
   "record_kind" : "class",
   "referenced_type" : "type-633",
   "self_type" : "type-633",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048494EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_CALLER_NONCE>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_CALLER_NONCE>",
   "record_kind" : "class",
   "referenced_type" : "type-579",
   "self_type" : "type-579",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048199EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ECIES_SINGLE_HASH_MODE>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ECIES_SINGLE_HASH_MODE>",
   "record_kind" : "class",
   "referenced_type" : "type-583",
   "self_type" : "type-583",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048393EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_INCLUDE_UNIQUE_ID>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_INCLUDE_UNIQUE_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048394EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_NO_AUTH_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_NO_AUTH_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-603",
   "self_type" : "type-603",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048695EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ROLLBACK_RESISTANT>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ROLLBACK_RESISTANT>",
   "record_kind" : "class",
   "referenced_type" : "type-623",
   "self_type" : "type-623",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048895EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_TRUSTED_CONFIRMATION_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_TRUSTED_CONFIRMATION_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-611",
   "self_type" : "type-611",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048700EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_UNLOCKED_DEVICE_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_UNLOCKED_DEVICE_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-609",
   "self_type" : "type-609",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048701EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_DATA>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_DATA>",
   "record_kind" : "class",
   "referenced_type" : "type-619",
   "self_type" : "type-619",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047492EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-615",
   "self_type" : "type-615",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047591EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ASSOCIATED_DATA>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ASSOCIATED_DATA>",
   "record_kind" : "class",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_APPLICATION_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_APPLICATION_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-641",
   "self_type" : "type-641",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047483EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_BRAND>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_BRAND>",
   "record_kind" : "class",
   "referenced_type" : "type-643",
   "self_type" : "type-643",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047482EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_DEVICE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_DEVICE>",
   "record_kind" : "class",
   "referenced_type" : "type-645",
   "self_type" : "type-645",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047481EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_IMEI>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_IMEI>",
   "record_kind" : "class",
   "referenced_type" : "type-651",
   "self_type" : "type-651",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047478EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MANUFACTURER>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MANUFACTURER>",
   "record_kind" : "class",
   "referenced_type" : "type-655",
   "self_type" : "type-655",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047476EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MEID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MEID>",
   "record_kind" : "class",
   "referenced_type" : "type-653",
   "self_type" : "type-653",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047477EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MODEL>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MODEL>",
   "record_kind" : "class",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047475EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_PRODUCT>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_PRODUCT>",
   "record_kind" : "class",
   "referenced_type" : "type-647",
   "self_type" : "type-647",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047480EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_SERIAL>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_SERIAL>",
   "record_kind" : "class",
   "referenced_type" : "type-649",
   "self_type" : "type-649",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047479EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_AUTH_TOKEN>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_AUTH_TOKEN>",
   "record_kind" : "class",
   "referenced_type" : "type-631",
   "self_type" : "type-631",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047190EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_NONCE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_NONCE>",
   "record_kind" : "class",
   "referenced_type" : "type-629",
   "self_type" : "type-629",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047191EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ROOT_OF_TRUST>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ROOT_OF_TRUST>",
   "record_kind" : "class",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047488EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_UNIQUE_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_UNIQUE_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-639",
   "self_type" : "type-639",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047485EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_ACTIVE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_ACTIVE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613136EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_CREATION_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_CREATION_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613437EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_ORIGINATION_EXPIRE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_ORIGINATION_EXPIRE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-589",
   "self_type" : "type-589",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613137EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_USAGE_EXPIRE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_USAGE_EXPIRE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-591",
   "self_type" : "type-591",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613138EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_INVALID, KM_TAG_INVALID>",
   "name" : "keymaster::TypedTag<KM_INVALID, KM_TAG_INVALID>",
   "record_kind" : "class",
   "referenced_type" : "type-573",
   "self_type" : "type-573",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t0EL15keymaster_tag_t0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_AUTH_TIMEOUT>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_AUTH_TIMEOUT>",
   "record_kind" : "class",
   "referenced_type" : "type-605",
   "self_type" : "type-605",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306873EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_KEY_SIZE>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_KEY_SIZE>",
   "record_kind" : "class",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306371EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAC_LENGTH>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAC_LENGTH>",
   "record_kind" : "class",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307371EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAX_USES_PER_BOOT>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAX_USES_PER_BOOT>",
   "record_kind" : "class",
   "referenced_type" : "type-595",
   "self_type" : "type-595",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306772EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_MAC_LENGTH>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_MAC_LENGTH>",
   "record_kind" : "class",
   "referenced_type" : "type-581",
   "self_type" : "type-581",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306376EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_SECONDS_BETWEEN_OPS>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_SECONDS_BETWEEN_OPS>",
   "record_kind" : "class",
   "referenced_type" : "type-593",
   "self_type" : "type-593",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306771EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_PATCHLEVEL>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_PATCHLEVEL>",
   "record_kind" : "class",
   "referenced_type" : "type-637",
   "self_type" : "type-637",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307074EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_VERSION>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_VERSION>",
   "record_kind" : "class",
   "referenced_type" : "type-635",
   "self_type" : "type-635",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307073EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_USER_ID>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_USER_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-599",
   "self_type" : "type-599",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306869EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_ULONG, KM_TAG_RSA_PUBLIC_EXPONENT>",
   "name" : "keymaster::TypedTag<KM_ULONG, KM_TAG_RSA_PUBLIC_EXPONENT>",
   "record_kind" : "class",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1342177280EL15keymaster_tag_t1342177480EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_ULONG_REP, KM_TAG_USER_SECURE_ID>",
   "name" : "keymaster::TypedTag<KM_ULONG_REP, KM_TAG_USER_SECURE_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1610612736EL15keymaster_tag_tn1610612234EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_algorithm_t [], keymaster::DefaultDelete<keymaster_algorithm_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_algorithm_t [], keymaster::DefaultDelete<keymaster_algorithm_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-345",
   "self_type" : "type-345",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-155", "type-154" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_21keymaster_algorithm_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_block_mode_t [], keymaster::DefaultDelete<keymaster_block_mode_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_block_mode_t [], keymaster::DefaultDelete<keymaster_block_mode_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-412",
   "self_type" : "type-412",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-18", "type-17" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_22keymaster_block_mode_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-150"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_digest_t [], keymaster::DefaultDelete<keymaster_digest_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_digest_t [], keymaster::DefaultDelete<keymaster_digest_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-85", "type-84" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_18keymaster_digest_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_key_format_t [], keymaster::DefaultDelete<keymaster_key_format_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_key_format_t [], keymaster::DefaultDelete<keymaster_key_format_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-174", "type-173" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_22keymaster_key_format_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_padding_t [], keymaster::DefaultDelete<keymaster_padding_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_padding_t [], keymaster::DefaultDelete<keymaster_padding_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-418",
   "self_type" : "type-418",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-49", "type-48" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_19keymaster_padding_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<unsigned char [], keymaster::DefaultDelete<unsigned char []> >",
   "name" : "keymaster::UniquePtr<unsigned char [], keymaster::DefaultDelete<unsigned char []> >",
   "record_kind" : "class",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2", "type-1" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_hNS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "input",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 288,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::UpdateOperationRequest",
   "name" : "keymaster::UpdateOperationRequest",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 76,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22UpdateOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22UpdateOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22UpdateOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22UpdateOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "output",
     "field_offset" : 96,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "input_consumed",
     "field_offset" : 256,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 288,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::UpdateOperationResponse",
   "name" : "keymaster::UpdateOperationResponse",
   "referenced_type" : "type-222",
   "self_type" : "type-222",
   "size" : 76,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23UpdateOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23UpdateOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23UpdateOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23UpdateOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-318"
    },
    {
     "field_name" : "upgrade_params",
     "field_offset" : 128,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "keymaster::UpgradeKeyRequest",
   "name" : "keymaster::UpgradeKeyRequest",
   "referenced_type" : "type-317",
   "self_type" : "type-317",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17UpgradeKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17UpgradeKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17UpgradeKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17UpgradeKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "upgraded_key",
     "field_offset" : 96,
     "referenced_type" : "type-323"
    }
   ],
   "linker_set_key" : "keymaster::UpgradeKeyResponse",
   "name" : "keymaster::UpgradeKeyResponse",
   "referenced_type" : "type-322",
   "self_type" : "type-322",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18UpgradeKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18UpgradeKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18UpgradeKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18UpgradeKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 32,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 96,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "parameters_verified",
     "field_offset" : 160,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "security_level",
     "field_offset" : 480,
     "referenced_type" : "type-392"
    },
    {
     "field_name" : "mac",
     "field_offset" : 512,
     "referenced_type" : "type-339"
    }
   ],
   "linker_set_key" : "keymaster::VerificationToken",
   "name" : "keymaster::VerificationToken",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 72,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17VerificationTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17VerificationTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17VerificationTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17VerificationTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17VerificationToken14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17VerificationToken9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17VerificationToken11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "parameters_to_verify",
     "field_offset" : 128,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "auth_token",
     "field_offset" : 448,
     "referenced_type" : "type-384"
    }
   ],
   "linker_set_key" : "keymaster::VerifyAuthorizationRequest",
   "name" : "keymaster::VerifyAuthorizationRequest",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 104,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26VerifyAuthorizationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26VerifyAuthorizationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26VerifyAuthorizationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26VerifyAuthorizationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "error",
     "field_offset" : 96,
     "referenced_type" : "type-406"
    },
    {
     "field_name" : "token",
     "field_offset" : 128,
     "referenced_type" : "type-391"
    }
   ],
   "linker_set_key" : "keymaster::VerifyAuthorizationResponse",
   "name" : "keymaster::VerifyAuthorizationResponse",
   "referenced_type" : "type-405",
   "self_type" : "type-405",
   "size" : 88,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27VerifyAuthorizationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27VerifyAuthorizationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27VerifyAuthorizationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27VerifyAuthorizationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Void",
   "name" : "keymaster::Void",
   "record_kind" : "class",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster4VoidE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::AuthorizationSet &>",
   "name" : "keymaster::remove_reference<keymaster::AuthorizationSet &>",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-618" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_16AuthorizationSetEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::ComputeSharedHmacResponse &>",
   "name" : "keymaster::remove_reference<keymaster::ComputeSharedHmacResponse &>",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-559" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_25ComputeSharedHmacResponseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::HmacSharingParameters &>",
   "name" : "keymaster::remove_reference<keymaster::HmacSharingParameters &>",
   "referenced_type" : "type-541",
   "self_type" : "type-541",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-542" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_21HmacSharingParametersEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::TKeymasterBlob<keymaster_blob_t> &>",
   "name" : "keymaster::remove_reference<keymaster::TKeymasterBlob<keymaster_blob_t> &>",
   "referenced_type" : "type-536",
   "self_type" : "type-536",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-470" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_14TKeymasterBlobI16keymaster_blob_tEEEE"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::AuthorizationSet &&",
   "name" : "keymaster::AuthorizationSet &&",
