{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIy",
   "name" : "unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIy",
   "size" : 8
  }
 ],
 "elf_functions" :
 [
  {
   "name" : "InitializeNativeBridge"
  },
  {
   "name" : "LoadNativeBridge"
  },
  {
   "name" : "NativeBridgeAvailable"
  },
  {
   "name" : "NativeBridgeCreateNamespace"
  },
  {
   "name" : "NativeBridgeError"
  },
  {
   "name" : "NativeBridgeGetError"
  },
  {
   "name" : "NativeBridgeGetExportedNamespace"
  },
  {

   "referenced_type" : "_ZTIFPvPKciPN7android25native_bridge_namespace_tEE",
   "self_type" : "_ZTIPFPvPKciPN7android25native_bridge_namespace_tEE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFPvS_PKcS1_jE",
   "name" : "void *(*)(void *, const char *, const char *, unsigned int)",
   "referenced_type" : "_ZTIFPvS_PKcS1_jE",
   "self_type" : "_ZTIPFPvS_PKcS1_jE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFbPKN7android28NativeBridgeRuntimeCallbacksEPKcS4_E",
   "name" : "bool (*)(const android::NativeBridgeRuntimeCallbacks *, const char *, const char *)",
   "referenced_type" : "_ZTIFbPKN7android28NativeBridgeRuntimeCallbacksEPKcS4_E",
   "self_type" : "_ZTIPFbPKN7android28NativeBridgeRuntimeCallbacksEPKcS4_E",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFbPKcE",
   "name" : "bool (*)(const char *)",
   "referenced_type" : "_ZTIFbPKcE",
   "self_type" : "_ZTIPFbPKcE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFbPKcS0_E",
   "name" : "bool (*)(const char *, const char *)",
   "referenced_type" : "_ZTIFbPKcS0_E",
   "self_type" : "_ZTIPFbPKcS0_E",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFbPN7android25native_bridge_namespace_tES1_PKcE",
   "name" : "bool (*)(android::native_bridge_namespace_t *, android::native_bridge_namespace_t *, const char *)",
   "referenced_type" : "_ZTIFbPN7android25native_bridge_namespace_tES1_PKcE",
   "self_type" : "_ZTIPFbPN7android25native_bridge_namespace_tES1_PKcE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFbiP7siginfoPvE",
   "name" : "bool (*)(int, siginfo *, void *)",
   "referenced_type" : "_ZTIFbiP7siginfoPvE",
   "self_type" : "_ZTIPFbiP7siginfoPvE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFbjE",
   "name" : "bool (*)(unsigned int)",
   "referenced_type" : "_ZTIFbjE",
   "self_type" : "_ZTIPFbjE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiPvE",
   "name" : "int (*)(void *)",
   "referenced_type" : "_ZTIFiPvE",
   "self_type" : "_ZTIPFiPvE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFjP7_JNIEnvP7_jclassE",
   "name" : "unsigned int (*)(_JNIEnv *, _jclass *)",
   "referenced_type" : "_ZTIFjP7_JNIEnvP7_jclassE",
   "self_type" : "_ZTIPFjP7_JNIEnvP7_jclassE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFjP7_JNIEnvP7_jclassP15JNINativeMethodjE",
   "name" : "unsigned int (*)(_JNIEnv *, _jclass *, JNINativeMethod *, unsigned int)",
   "referenced_type" : "_ZTIFjP7_JNIEnvP7_jclassP15JNINativeMethodjE",
   "self_type" : "_ZTIPFjP7_JNIEnvP7_jclassP15JNINativeMethodjE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvvE",
   "name" : "void (*)()",
   "referenced_type" : "_ZTIFvvE",
   "self_type" : "_ZTIPFvvE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKN7android28NativeBridgeRuntimeCallbacksE",
   "name" : "const android::NativeBridgeRuntimeCallbacks *",
   "referenced_type" : "_ZTIKN7android28NativeBridgeRuntimeCallbacksE",
   "self_type" : "_ZTIPKN7android28NativeBridgeRuntimeCallbacksE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN7android25native_bridge_namespace_tE",
   "name" : "android::native_bridge_namespace_t *",
   "referenced_type" : "_ZTIN7android25native_bridge_namespace_tE",
   "self_type" : "_ZTIPN7android25native_bridge_namespace_tE",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android28NativeBridgeRuntimeCallbacksE",
   "name" : "const android::NativeBridgeRuntimeCallbacks",
   "referenced_type" : "_ZTIN7android28NativeBridgeRuntimeCallbacksE",
   "self_type" : "_ZTIKN7android28NativeBridgeRuntimeCallbacksE",
   "size" : 12,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "initialize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFbPKN7android28NativeBridgeRuntimeCallbacksEPKcS4_E"
    },
    {
     "field_name" : "loadLibrary",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFPvPKciE"
    },
    {
     "field_name" : "getTrampoline",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFPvS_PKcS1_jE"
    },
    {
     "field_name" : "isSupported",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFbPKcE"
    },
    {
     "field_name" : "getAppEnv",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFPKN7android25NativeBridgeRuntimeValuesEPKcE"
    },
    {
     "field_name" : "isCompatibleWith",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFbjE"
    },
    {
     "field_name" : "getSignalHandler",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFPFbiP7siginfoPvEiE"
    },
    {
     "field_name" : "unloadLibrary",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "getError",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFPKcvE"
    },
    {
     "field_name" : "isPathSupported",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFbPKcE"
    },
    {
     "field_name" : "initAnonymousNamespace",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFbPKcS0_E"
    },
    {
     "field_name" : "createNamespace",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFPN7android25native_bridge_namespace_tEPKcS3_S3_yS3_S1_E"
    },
    {
     "field_name" : "linkNamespaces",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFbPN7android25native_bridge_namespace_tES1_PKcE"
    },
    {
     "field_name" : "loadLibraryExt",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFPvPKciPN7android25native_bridge_namespace_tEE"
    },
    {
     "field_name" : "getVendorNamespace",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFPN7android25native_bridge_namespace_tEvE"
    },
    {
     "field_name" : "getExportedNamespace",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFPN7android25native_bridge_namespace_tEPKcE"
    },
    {
     "field_name" : "preZygoteFork",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTIN7android21NativeBridgeCallbacksE",
   "name" : "android::NativeBridgeCallbacks",
   "referenced_type" : "_ZTIN7android21NativeBridgeCallbacksE",
   "self_type" : "_ZTIN7android21NativeBridgeCallbacksE",
   "size" : 72,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "getMethodShorty",
     "referenced_type" : "_ZTIPFPKcP7_JNIEnvP10_jmethodIDE"
    },
    {
     "field_name" : "getNativeMethodCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "getNativeMethods",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjP7_JNIEnvP7_jclassP15JNINativeMethodjE"
    }
   ],
   "linker_set_key" : "_ZTIN7android28NativeBridgeRuntimeCallbacksE",
   "name" : "android::NativeBridgeRuntimeCallbacks",
   "referenced_type" : "_ZTIN7android28NativeBridgeRuntimeCallbacksE",
   "self_type" : "_ZTIN7android28NativeBridgeRuntimeCallbacksE",
   "size" : 12,
   "source_file" : "/art/libnativebridge/include/nativebridge/native_bridge.h"
  }
 ],
 "rvalue_reference_types" : []
}
