{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "__attribute__((neon_polyvector_type(1))) unsigned long [2]",
   "name" : "__attribute__((neon_polyvector_type(1))) unsigned long [2]",
   "referenced_type" : "type-1556",
   "self_type" : "type-1555",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "__attribute__((neon_polyvector_type(1))) unsigned long [3]",
   "name" : "__attribute__((neon_polyvector_type(1))) unsigned long [3]",
   "referenced_type" : "type-1640",
   "self_type" : "type-1639",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "__attribute__((neon_polyvector_type(1))) unsigned long [4]",
   "name" : "__attribute__((neon_polyvector_type(1))) unsigned long [4]",
   "referenced_type" : "type-1724",
   "self_type" : "type-1723",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h"
  },
  {
   "alignment" : 16,
   "linker_set_key" : "__attribute__((neon_polyvector_type(16))) unsigned char [2]",
   "name" : "__attribute__((neon_polyvector_type(16))) unsigned char [2]",
   "referenced_type" : "type-1547",
   "self_type" : "type-1546",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h"
  },
  {
   "alignment" : 16,

   "linker_set_key" : "const tm",
   "name" : "const tm",
   "referenced_type" : "type-2117",
   "self_type" : "type-2118",
   "size" : 56,
   "source_file" : "/bionic/libc/include/time.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const uniform_int_distribution<_IntType>",
   "name" : "const uniform_int_distribution<_IntType>",
   "referenced_type" : "type-2411",
   "self_type" : "type-2410",
   "source_file" : "/external/libcxx/include/algorithm"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-38",
   "self_type" : "type-486",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-556",
   "self_type" : "type-1432",
   "size" : 4,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-570",
   "self_type" : "type-575",
   "size" : 8,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-772",
   "self_type" : "type-1430",
   "size" : 8,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-77",
   "self_type" : "type-370",
   "size" : 2,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-9",
   "self_type" : "type-1472",
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const void *const",
   "name" : "const void *const",
   "referenced_type" : "type-1471",
   "self_type" : "type-1473",
   "size" : 8,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const wchar_t",
   "name" : "const wchar_t",
   "referenced_type" : "type-615",
   "self_type" : "type-1120",
   "size" : 4,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const wchar_t *const",
   "name" : "const wchar_t *const",
   "referenced_type" : "type-1119",
   "self_type" : "type-1162",
   "size" : 8,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "void (*const)(void *)",
   "name" : "void (*const)(void *)",
   "referenced_type" : "type-564",
   "self_type" : "type-2375",
   "size" : 8,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "is_const" : true,
   "linker_set_key" : "void (*const[])(const SkMatrix &, SkPoint *, const SkPoint *, int)",
   "name" : "void (*const[])(const SkMatrix &, SkPoint *, const SkPoint *, int)",
   "referenced_type" : "type-2056",
   "self_type" : "type-2057",
   "source_file" : "/external/skia/include/core/SkMatrix.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "void (*const[])(const SkMatrix &, float, float, SkPoint *)",
   "name" : "void (*const[])(const SkMatrix &, float, float, SkPoint *)",
   "referenced_type" : "type-2054",
   "self_type" : "type-2055",
   "source_file" : "/external/skia/include/core/SkMatrix.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-2082",
   "self_type" : "type-2084",
   "size" : 8,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "void *(*const)(const void *)",
   "name" : "void *(*const)(const void *)",
   "referenced_type" : "type-2373",
   "self_type" : "type-2372",
   "size" : 8,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned long, const void *)",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "type-2076",
   "self_type" : "type-2078",
   "size" : 8,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "type-2085",
   "self_type" : "type-2087",
   "size" : 8,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned long, const void *)",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "type-2079",
   "self_type" : "type-2081",
   "size" : 8,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-8",
   "self_type" : "type-1474",
   "size" : 8,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile std::atomic_flag",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "type-1814",
   "self_type" : "type-1816",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "AndroidBitmapInfo",
   "name" : "AndroidBitmapInfo",
   "referenced_type" : "type-2958",
   "self_type" : "type-2958",
   "size" : 20,
   "source_file" : "/frameworks/native/include/android/bitmap.h",
   "unique_id" : "AndroidBitmapInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 192,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 256,
     "referenced_type" : "type-530"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 320,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 384,
     "referenced_type" : "type-533"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 448,
     "referenced_type" : "type-530"
    }
   ],
   "linker_set_key" : "JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 64,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNIInvokeInterface"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 320,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 384,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 448,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 512,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 576,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 640,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 704,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 768,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 832,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 896,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 960,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 1024,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 1088,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 1152,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 1216,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 1280,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 1344,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 1408,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 1472,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 1536,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 1600,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 1664,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 1728,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 1792,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 1856,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 1920,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 1984,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 2048,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 2112,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 2176,
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 2240,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 2304,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 2368,
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 2432,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 2496,
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 2560,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 2624,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 2688,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 2752,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 2816,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 2880,
     "referenced_type" : "type-114"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 2944,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 3008,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 3072,
     "referenced_type" : "type-121"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 3136,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 3200,
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 3264,
     "referenced_type" : "type-128"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 3328,
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 3392,
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 3456,
     "referenced_type" : "type-135"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 3520,
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 3584,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 3648,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 3712,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 3776,
     "referenced_type" : "type-146"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 3840,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 3904,
     "referenced_type" : "type-151"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 3968,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 4032,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 4096,
     "referenced_type" : "type-158"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 4160,
     "referenced_type" : "type-160"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 4224,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 4288,
     "referenced_type" : "type-165"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 4352,
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 4416,
     "referenced_type" : "type-170"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 4480,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 4544,
     "referenced_type" : "type-174"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 4608,
     "referenced_type" : "type-177"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 4672,
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 4736,
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 4800,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 4864,
     "referenced_type" : "type-186"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 4928,
     "referenced_type" : "type-188"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 4992,
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 5056,
     "referenced_type" : "type-193"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 5120,
     "referenced_type" : "type-195"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 5184,
     "referenced_type" : "type-198"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 5248,
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 5312,
     "referenced_type" : "type-202"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 5376,
     "referenced_type" : "type-205"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 5440,
     "referenced_type" : "type-207"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 5504,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 5568,
     "referenced_type" : "type-212"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 5632,
     "referenced_type" : "type-214"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 5696,
     "referenced_type" : "type-216"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 5760,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 5824,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 5888,
     "referenced_type" : "type-223"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 5952,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 6016,
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 6080,
     "referenced_type" : "type-230"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 6144,
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 6208,
     "referenced_type" : "type-234"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 6272,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 6336,
     "referenced_type" : "type-238"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 6400,
     "referenced_type" : "type-240"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 6464,
     "referenced_type" : "type-242"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 6528,
     "referenced_type" : "type-244"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 6592,
     "referenced_type" : "type-246"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 6656,
     "referenced_type" : "type-248"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 6720,
     "referenced_type" : "type-250"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 6784,
     "referenced_type" : "type-252"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 6848,
     "referenced_type" : "type-254"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 6912,
     "referenced_type" : "type-256"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 6976,
     "referenced_type" : "type-258"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 7040,
     "referenced_type" : "type-260"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 7104,
     "referenced_type" : "type-262"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 7168,
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 7232,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 7296,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 7360,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 7424,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 7488,
     "referenced_type" : "type-266"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 7552,
     "referenced_type" : "type-268"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 7616,
     "referenced_type" : "type-271"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 7680,
     "referenced_type" : "type-273"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 7744,
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 7808,
     "referenced_type" : "type-278"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 7872,
     "referenced_type" : "type-280"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 7936,
     "referenced_type" : "type-282"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 8000,
     "referenced_type" : "type-285"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 8064,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 8128,
     "referenced_type" : "type-289"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 8192,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 8256,
     "referenced_type" : "type-294"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 8320,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 8384,
     "referenced_type" : "type-299"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 8448,
     "referenced_type" : "type-301"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 8512,
     "referenced_type" : "type-303"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 8576,
     "referenced_type" : "type-306"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 8640,
     "referenced_type" : "type-308"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 8704,
     "referenced_type" : "type-310"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 8768,
     "referenced_type" : "type-313"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 8832,
     "referenced_type" : "type-315"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 8896,
     "referenced_type" : "type-317"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 8960,
     "referenced_type" : "type-320"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 9024,
     "referenced_type" : "type-322"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 9088,
     "referenced_type" : "type-324"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 9152,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 9216,
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 9280,
     "referenced_type" : "type-329"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 9344,
     "referenced_type" : "type-331"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 9408,
     "referenced_type" : "type-333"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 9472,
     "referenced_type" : "type-335"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 9536,
     "referenced_type" : "type-337"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 9600,
     "referenced_type" : "type-339"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 9664,
     "referenced_type" : "type-341"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 9728,
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 9792,
     "referenced_type" : "type-345"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 9856,
     "referenced_type" : "type-347"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 9920,
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 9984,
     "referenced_type" : "type-351"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 10048,
     "referenced_type" : "type-353"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 10112,
     "referenced_type" : "type-355"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 10176,
     "referenced_type" : "type-357"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 10240,
     "referenced_type" : "type-359"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 10304,
     "referenced_type" : "type-361"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 10368,
     "referenced_type" : "type-363"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 10432,
     "referenced_type" : "type-365"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 10496,
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 10560,
     "referenced_type" : "type-373"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 10624,
     "referenced_type" : "type-376"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 10688,
     "referenced_type" : "type-378"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 10752,
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 10816,
     "referenced_type" : "type-380"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 10880,
     "referenced_type" : "type-382"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 10944,
     "referenced_type" : "type-384"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 11008,
     "referenced_type" : "type-388"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 11072,
     "referenced_type" : "type-392"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 11136,
     "referenced_type" : "type-394"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 11200,
     "referenced_type" : "type-396"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 11264,
     "referenced_type" : "type-400"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 11328,
     "referenced_type" : "type-404"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 11392,
     "referenced_type" : "type-408"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 11456,
     "referenced_type" : "type-412"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 11520,
     "referenced_type" : "type-416"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 11584,
     "referenced_type" : "type-420"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 11648,
     "referenced_type" : "type-424"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 11712,
     "referenced_type" : "type-428"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 11776,
     "referenced_type" : "type-430"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 11840,
     "referenced_type" : "type-433"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 11904,
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 11968,
     "referenced_type" : "type-439"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 12032,
     "referenced_type" : "type-442"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 12096,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 12160,
     "referenced_type" : "type-448"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 12224,
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 12288,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 12352,
     "referenced_type" : "type-455"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 12416,
     "referenced_type" : "type-457"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 12480,
     "referenced_type" : "type-459"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 12544,
     "referenced_type" : "type-461"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 12608,
     "referenced_type" : "type-463"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 12672,
     "referenced_type" : "type-465"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 12736,
     "referenced_type" : "type-467"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 12800,
     "referenced_type" : "type-469"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 12864,
     "referenced_type" : "type-471"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 12928,
     "referenced_type" : "type-473"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 12992,
     "referenced_type" : "type-475"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 13056,
     "referenced_type" : "type-477"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 13120,
     "referenced_type" : "type-479"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 13184,
     "referenced_type" : "type-481"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 13248,
     "referenced_type" : "type-483"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 13312,
     "referenced_type" : "type-487"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 13376,
     "referenced_type" : "type-489"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 13440,
     "referenced_type" : "type-491"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 13504,
     "referenced_type" : "type-495"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 13568,
     "referenced_type" : "type-499"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 13632,
     "referenced_type" : "type-503"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 13696,
     "referenced_type" : "type-507"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 13760,
     "referenced_type" : "type-511"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 13824,
     "referenced_type" : "type-516"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 13888,
     "referenced_type" : "type-518"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 13952,
     "referenced_type" : "type-518"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 14016,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 14080,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 14144,
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 14208,
     "referenced_type" : "type-541"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 14272,
     "referenced_type" : "type-543"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 14336,
     "referenced_type" : "type-373"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 14400,
     "referenced_type" : "type-376"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 14464,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 14528,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 14592,
     "referenced_type" : "type-545"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 14656,
     "referenced_type" : "type-547"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 14720,
     "referenced_type" : "type-549"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 14784,
     "referenced_type" : "type-551"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 14848,
     "referenced_type" : "type-553"
    }
   ],
   "linker_set_key" : "JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 1864,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNINativeInterface"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "type-515",
   "self_type" : "type-515",
   "size" : 24,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS15JNINativeMethod"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "group",
     "field_offset" : 128,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "type-2953",
   "self_type" : "type-2953",
   "size" : 24,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS16JavaVMAttachArgs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "type-2956"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 128,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "type-2955",
   "self_type" : "type-2955",
   "size" : 24,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14JavaVMInitArgs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "type-2954",
   "self_type" : "type-2954",
   "size" : 16,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12JavaVMOption"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPixelRef",
     "referenced_type" : "type-2911"
    },
    {
     "access" : "private",
     "field_name" : "fPixmap",
     "field_offset" : 64,
     "referenced_type" : "type-2934"
    },
    {
     "access" : "private",
     "field_name" : "fFlags",
     "field_offset" : 384,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "SkBitmap",
   "name" : "SkBitmap",
   "record_kind" : "class",
   "referenced_type" : "type-2940",
   "self_type" : "type-2940",
   "size" : 56,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTS8SkBitmap"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2903"
    }
   ],
   "linker_set_key" : "SkBitmap::Allocator",
   "name" : "SkBitmap::Allocator",
   "record_kind" : "class",
   "referenced_type" : "type-2949",
   "self_type" : "type-2949",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTSN8SkBitmap9AllocatorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8SkBitmap9AllocatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap9AllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap9AllocatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkBitmap9Allocator13allocPixelRefEPS_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2949"
    }
   ],
   "linker_set_key" : "SkBitmap::HeapAllocator",
   "name" : "SkBitmap::HeapAllocator",
   "record_kind" : "class",
   "referenced_type" : "type-2950",
   "self_type" : "type-2950",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTSN8SkBitmap13HeapAllocatorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8SkBitmap13HeapAllocatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocator13allocPixelRefEPS_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-875"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fTransferFnHash",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    },
    {
     "access" : "private",
     "field_name" : "fToXYZD50Hash",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    },
    {
     "access" : "private",
     "field_name" : "fTransferFn",
     "field_offset" : 96,
     "referenced_type" : "type-868"
    },
    {
     "access" : "private",
     "field_name" : "fToXYZD50_3x3",
     "field_offset" : 320,
     "referenced_type" : "type-869"
    },
    {
     "access" : "private",
     "field_name" : "fInvTransferFn",
     "field_offset" : 608,
     "referenced_type" : "type-868"
    },
    {
     "access" : "private",
     "field_name" : "fFromXYZD50_3x3",
     "field_offset" : 832,
     "referenced_type" : "type-869"
    },
    {
     "access" : "private",
     "field_name" : "fLazyDstFieldsOnce",
     "field_offset" : 1120,
     "referenced_type" : "type-870"
    }
   ],
   "linker_set_key" : "SkColorSpace",
   "name" : "SkColorSpace",
   "record_kind" : "class",
   "referenced_type" : "type-867",
   "self_type" : "type-867",
   "size" : 144,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS12SkColorSpace"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fRX",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fRY",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fGX",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fGY",
     "field_offset" : 96,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fBX",
     "field_offset" : 128,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fBY",
     "field_offset" : 160,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fWX",
     "field_offset" : 192,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fWY",
     "field_offset" : 224,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkColorSpacePrimaries",
   "name" : "SkColorSpacePrimaries",
   "referenced_type" : "type-2918",
   "self_type" : "type-2918",
   "size" : 32,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS21SkColorSpacePrimaries"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fFloat",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fSignBitInt",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "SkFloatIntUnion",
   "name" : "SkFloatIntUnion",
   "record_kind" : "union",
   "referenced_type" : "type-1455",
   "self_type" : "type-1455",
   "size" : 4,
   "source_file" : "/external/skia/include/private/SkFloatBits.h",
   "unique_id" : "_ZTS15SkFloatIntUnion"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "SkIPoint",
   "name" : "SkIPoint",
   "referenced_type" : "type-2011",
   "self_type" : "type-2011",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS8SkIPoint"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "SkIRect",
   "name" : "SkIRect",
   "referenced_type" : "type-2032",
   "self_type" : "type-2032",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRect.h",
   "unique_id" : "_ZTS7SkIRect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "SkISize",
   "name" : "SkISize",
   "referenced_type" : "type-2022",
   "self_type" : "type-2022",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkSize.h",
   "unique_id" : "_ZTS7SkISize"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fColorSpace",
     "referenced_type" : "type-865"
    },
    {
     "access" : "private",
     "field_name" : "fDimensions",
     "field_offset" : 64,
     "referenced_type" : "type-2022"
    },
    {
     "access" : "private",
     "field_name" : "fColorType",
     "field_offset" : 128,
     "referenced_type" : "type-2924"
    },
    {
     "access" : "private",
     "field_name" : "fAlphaType",
     "field_offset" : 160,
     "referenced_type" : "type-2923"
    }
   ],
   "linker_set_key" : "SkImageInfo",
   "name" : "SkImageInfo",
   "referenced_type" : "type-2926",
   "self_type" : "type-2926",
   "size" : 24,
   "source_file" : "/external/skia/include/core/SkImageInfo.h",
   "unique_id" : "_ZTS11SkImageInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fMat",
     "referenced_type" : "type-869"
    },
    {
     "access" : "private",
     "field_name" : "fTypeMask",
     "field_offset" : 288,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "SkMatrix",
   "name" : "SkMatrix",
   "record_kind" : "class",
   "referenced_type" : "type-2043",
   "self_type" : "type-2043",
   "size" : 40,
   "source_file" : "/external/skia/include/core/SkMatrix.h",
   "unique_id" : "_ZTS8SkMatrix"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fMat",
     "referenced_type" : "type-2064"
    },
    {
     "access" : "private",
     "field_name" : "fTypeMask",
     "field_offset" : 512,
     "referenced_type" : "type-1812"
    }
   ],
   "linker_set_key" : "SkMatrix44",
   "name" : "SkMatrix44",
   "record_kind" : "class",
   "referenced_type" : "type-2063",
   "self_type" : "type-2063",
   "size" : 68,
   "source_file" : "/external/skia/include/core/SkMatrix44.h",
   "unique_id" : "_ZTS10SkMatrix44"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "referenced_type" : "type-876"
    }
   ],
   "linker_set_key" : "SkNVRefCnt<SkColorSpace>",
   "name" : "SkNVRefCnt<SkColorSpace>",
   "record_kind" : "class",
   "referenced_type" : "type-875",
   "self_type" : "type-875",
   "size" : 4,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "type-867" ],
   "unique_id" : "_ZTS10SkNVRefCntI12SkColorSpaceE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fState",
     "referenced_type" : "type-871"
    }
   ],
   "linker_set_key" : "SkOnce",
   "name" : "SkOnce",
   "record_kind" : "class",
   "referenced_type" : "type-870",
   "self_type" : "type-870",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkOnce.h",
   "unique_id" : "_ZTS6SkOnce"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPixels",
     "referenced_type" : "type-1471"
    },
    {
     "access" : "private",
     "field_name" : "fRowBytes",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    },
    {
     "access" : "private",
     "field_name" : "fInfo",
     "field_offset" : 128,
     "referenced_type" : "type-2926"
    }
   ],
   "linker_set_key" : "SkPixmap",
   "name" : "SkPixmap",
   "record_kind" : "class",
   "referenced_type" : "type-2934",
   "self_type" : "type-2934",
   "size" : 40,
   "source_file" : "/external/skia/include/core/SkPixmap.h",
   "unique_id" : "_ZTS8SkPixmap"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkPoint",
   "name" : "SkPoint",
   "referenced_type" : "type-2016",
   "self_type" : "type-2016",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS7SkPoint"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fR",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fG",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fA",
     "field_offset" : 96,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkRGBA4f<kPremul_SkAlphaType>",
   "name" : "SkRGBA4f<kPremul_SkAlphaType>",
   "referenced_type" : "type-2931",
   "self_type" : "type-2931",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkColor.h",
   "unique_id" : "_ZTS8SkRGBA4fIL11SkAlphaType2EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fR",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fG",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fA",
     "field_offset" : 96,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkRGBA4f<kUnpremul_SkAlphaType>",
   "name" : "SkRGBA4f<kUnpremul_SkAlphaType>",
   "referenced_type" : "type-2932",
   "self_type" : "type-2932",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkColor.h",
   "unique_id" : "_ZTS8SkRGBA4fIL11SkAlphaType3EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkRect",
   "name" : "SkRect",
   "referenced_type" : "type-2038",
   "self_type" : "type-2038",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRect.h",
   "unique_id" : "_ZTS6SkRect"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2899"
    }
   ],
   "linker_set_key" : "SkRefCnt",
   "name" : "SkRefCnt",
   "record_kind" : "class",
   "referenced_type" : "type-2903",
   "self_type" : "type-2903",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "unique_id" : "_ZTS8SkRefCnt",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8SkRefCnt"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "field_offset" : 64,
     "referenced_type" : "type-876"
    }
   ],
   "linker_set_key" : "SkRefCntBase",
   "name" : "SkRefCntBase",
   "record_kind" : "class",
   "referenced_type" : "type-2899",
   "self_type" : "type-2899",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "unique_id" : "_ZTS12SkRefCntBase",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkRefCntBase"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkSize",
   "name" : "SkSize",
   "referenced_type" : "type-2026",
   "self_type" : "type-2026",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkSize.h",
   "unique_id" : "_ZTS6SkSize"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fData",
     "referenced_type" : "type-1998"
    }
   ],
   "linker_set_key" : "SkVector4",
   "name" : "SkVector4",
   "referenced_type" : "type-2058",
   "self_type" : "type-2058",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkMatrix44.h",
   "unique_id" : "_ZTS9SkVector4"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JNIEnv"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JavaVM"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-1457"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-1456",
   "self_type" : "type-1456",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1459"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-1458",
   "self_type" : "type-1458",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1733"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1733"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-1734",
   "self_type" : "type-1734",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-1735",
   "self_type" : "type-1735",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1750"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "type-1752"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "type-1747"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-1749",
   "self_type" : "type-1749",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-1733",
   "self_type" : "type-1733",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "type-2672"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 64,
     "referenced_type" : "type-564"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "type-2671",
   "self_type" : "type-2671",
   "size" : 24,
   "source_file" : "/bionic/libc/include/pthread.h",
   "unique_id" : "__pthread_cleanup_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "type-1757"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-1758"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-1759"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-1760"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-1761"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-1766"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-1767"
    }
   ],
   "linker_set_key" : "__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "type-1756",
   "self_type" : "type-1756",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS10__sifields"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "referenced_type" : "type-1757",
   "self_type" : "type-1757",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1755"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "referenced_type" : "type-1758",
   "self_type" : "type-1758",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1755"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "referenced_type" : "type-1759",
   "self_type" : "type-1759",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt1_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "type-79"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "referenced_type" : "type-1760",
   "self_type" : "type-1760",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt2_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-8"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-1762"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "referenced_type" : "type-1761",
   "self_type" : "type-1761",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-1763"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-1765"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "record_kind" : "union",
   "referenced_type" : "type-1762",
   "self_type" : "type-1762",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-1764"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "referenced_type" : "type-1763",
   "self_type" : "type-1763",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-1764"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "referenced_type" : "type-1765",
   "self_type" : "type-1765",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "referenced_type" : "type-1766",
   "self_type" : "type-1766",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt4_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "type-556"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "referenced_type" : "type-1767",
   "self_type" : "type-1767",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt5_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "referenced_type" : "type-1739",
   "self_type" : "type-1739",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS12_aarch64_ctx"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jarray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14_jbooleanArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jbyteArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jcharArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jclass"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jdoubleArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "type-423",
   "self_type" : "type-423",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jfloatArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "type-415",
   "self_type" : "type-415",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS10_jintArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jlongArray"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jobject"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jobjectArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jshortArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "type-368",
   "self_type" : "type-368",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jstring"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jthrowable"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-1457"
    }
   ],
   "linker_set_key" : "cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "type-2670",
   "self_type" : "type-2670",
   "size" : 128,
   "source_file" : "/bionic/libc/include/sched.h",
   "unique_id" : "cpu_set_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-2088",
   "self_type" : "type-2088",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "type-1739"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "type-772"
    }
   ],
   "linker_set_key" : "esr_context",
   "name" : "esr_context",
   "referenced_type" : "type-1742",
   "self_type" : "type-1742",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS11esr_context"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "type-1739"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "type-772"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "type-1744"
    }
   ],
   "linker_set_key" : "extra_context",
   "name" : "extra_context",
   "referenced_type" : "type-1743",
   "self_type" : "type-1743",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS13extra_context"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-1457"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-1793",
   "self_type" : "type-1793",
   "size" : 128,
   "source_file" : "/bionic/libc/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1525"
    }
   ],
   "linker_set_key" : "float16x4x2_t",
   "name" : "float16x4x2_t",
   "referenced_type" : "type-1524",
   "self_type" : "type-1524",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x4x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1609"
    }
   ],
   "linker_set_key" : "float16x4x3_t",
   "name" : "float16x4x3_t",
   "referenced_type" : "type-1608",
   "self_type" : "type-1608",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x4x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1693"
    }
   ],
   "linker_set_key" : "float16x4x4_t",
   "name" : "float16x4x4_t",
   "referenced_type" : "type-1692",
   "self_type" : "type-1692",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1528"
    }
   ],
   "linker_set_key" : "float16x8x2_t",
   "name" : "float16x8x2_t",
   "referenced_type" : "type-1527",
   "self_type" : "type-1527",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x8x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1612"
    }
   ],
   "linker_set_key" : "float16x8x3_t",
   "name" : "float16x8x3_t",
   "referenced_type" : "type-1611",
   "self_type" : "type-1611",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x8x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1696"
    }
   ],
   "linker_set_key" : "float16x8x4_t",
   "name" : "float16x8x4_t",
   "referenced_type" : "type-1695",
   "self_type" : "type-1695",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1531"
    }
   ],
   "linker_set_key" : "float32x2x2_t",
   "name" : "float32x2x2_t",
   "referenced_type" : "type-1530",
   "self_type" : "type-1530",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x2x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1615"
    }
   ],
   "linker_set_key" : "float32x2x3_t",
   "name" : "float32x2x3_t",
   "referenced_type" : "type-1614",
   "self_type" : "type-1614",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x2x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1699"
    }
   ],
   "linker_set_key" : "float32x2x4_t",
   "name" : "float32x2x4_t",
   "referenced_type" : "type-1698",
   "self_type" : "type-1698",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1534"
    }
   ],
   "linker_set_key" : "float32x4x2_t",
   "name" : "float32x4x2_t",
   "referenced_type" : "type-1533",
   "self_type" : "type-1533",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1618"
    }
   ],
   "linker_set_key" : "float32x4x3_t",
   "name" : "float32x4x3_t",
   "referenced_type" : "type-1617",
   "self_type" : "type-1617",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x4x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1702"
    }
   ],
   "linker_set_key" : "float32x4x4_t",
   "name" : "float32x4x4_t",
   "referenced_type" : "type-1701",
   "self_type" : "type-1701",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x4x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1537"
    }
   ],
   "linker_set_key" : "float64x1x2_t",
   "name" : "float64x1x2_t",
   "referenced_type" : "type-1536",
   "self_type" : "type-1536",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x1x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1621"
    }
   ],
   "linker_set_key" : "float64x1x3_t",
   "name" : "float64x1x3_t",
   "referenced_type" : "type-1620",
   "self_type" : "type-1620",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x1x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1705"
    }
   ],
   "linker_set_key" : "float64x1x4_t",
   "name" : "float64x1x4_t",
   "referenced_type" : "type-1704",
   "self_type" : "type-1704",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x1x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1540"
    }
   ],
   "linker_set_key" : "float64x2x2_t",
   "name" : "float64x2x2_t",
   "referenced_type" : "type-1539",
   "self_type" : "type-1539",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x2x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1624"
    }
   ],
   "linker_set_key" : "float64x2x3_t",
   "name" : "float64x2x3_t",
   "referenced_type" : "type-1623",
   "self_type" : "type-1623",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x2x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1708"
    }
   ],
   "linker_set_key" : "float64x2x4_t",
   "name" : "float64x2x4_t",
   "referenced_type" : "type-1707",
   "self_type" : "type-1707",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "type-1739"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "type-1741"
    }
   ],
   "linker_set_key" : "fpsimd_context",
   "name" : "fpsimd_context",
   "referenced_type" : "type-1740",
   "self_type" : "type-1740",
   "size" : 528,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS14fpsimd_context"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1483"
    }
   ],
   "linker_set_key" : "int16x4x2_t",
   "name" : "int16x4x2_t",
   "referenced_type" : "type-1482",
   "self_type" : "type-1482",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x4x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1567"
    }
   ],
   "linker_set_key" : "int16x4x3_t",
   "name" : "int16x4x3_t",
   "referenced_type" : "type-1566",
   "self_type" : "type-1566",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x4x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1651"
    }
   ],
   "linker_set_key" : "int16x4x4_t",
   "name" : "int16x4x4_t",
   "referenced_type" : "type-1650",
   "self_type" : "type-1650",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1486"
    }
   ],
   "linker_set_key" : "int16x8x2_t",
   "name" : "int16x8x2_t",
   "referenced_type" : "type-1485",
   "self_type" : "type-1485",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x8x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1570"
    }
   ],
   "linker_set_key" : "int16x8x3_t",
   "name" : "int16x8x3_t",
   "referenced_type" : "type-1569",
   "self_type" : "type-1569",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x8x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1654"
    }
   ],
   "linker_set_key" : "int16x8x4_t",
   "name" : "int16x8x4_t",
   "referenced_type" : "type-1653",
   "self_type" : "type-1653",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1489"
    }
   ],
   "linker_set_key" : "int32x2x2_t",
   "name" : "int32x2x2_t",
   "referenced_type" : "type-1488",
   "self_type" : "type-1488",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x2x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1573"
    }
   ],
   "linker_set_key" : "int32x2x3_t",
   "name" : "int32x2x3_t",
   "referenced_type" : "type-1572",
   "self_type" : "type-1572",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x2x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1657"
    }
   ],
   "linker_set_key" : "int32x2x4_t",
   "name" : "int32x2x4_t",
   "referenced_type" : "type-1656",
   "self_type" : "type-1656",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1492"
    }
   ],
   "linker_set_key" : "int32x4x2_t",
   "name" : "int32x4x2_t",
   "referenced_type" : "type-1491",
   "self_type" : "type-1491",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1576"
    }
   ],
   "linker_set_key" : "int32x4x3_t",
   "name" : "int32x4x3_t",
   "referenced_type" : "type-1575",
   "self_type" : "type-1575",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x4x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1660"
    }
   ],
   "linker_set_key" : "int32x4x4_t",
   "name" : "int32x4x4_t",
   "referenced_type" : "type-1659",
   "self_type" : "type-1659",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x4x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1495"
    }
   ],
   "linker_set_key" : "int64x1x2_t",
   "name" : "int64x1x2_t",
   "referenced_type" : "type-1494",
   "self_type" : "type-1494",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x1x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1579"
    }
   ],
   "linker_set_key" : "int64x1x3_t",
   "name" : "int64x1x3_t",
   "referenced_type" : "type-1578",
   "self_type" : "type-1578",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x1x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1663"
    }
   ],
   "linker_set_key" : "int64x1x4_t",
   "name" : "int64x1x4_t",
   "referenced_type" : "type-1662",
   "self_type" : "type-1662",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x1x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1498"
    }
   ],
   "linker_set_key" : "int64x2x2_t",
   "name" : "int64x2x2_t",
   "referenced_type" : "type-1497",
   "self_type" : "type-1497",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x2x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1582"
    }
   ],
   "linker_set_key" : "int64x2x3_t",
   "name" : "int64x2x3_t",
   "referenced_type" : "type-1581",
   "self_type" : "type-1581",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x2x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1666"
    }
   ],
   "linker_set_key" : "int64x2x4_t",
   "name" : "int64x2x4_t",
   "referenced_type" : "type-1665",
   "self_type" : "type-1665",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1480"
    }
   ],
   "linker_set_key" : "int8x16x2_t",
   "name" : "int8x16x2_t",
   "referenced_type" : "type-1479",
   "self_type" : "type-1479",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int8x16x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1564"
    }
   ],
   "linker_set_key" : "int8x16x3_t",
   "name" : "int8x16x3_t",
   "referenced_type" : "type-1563",
   "self_type" : "type-1563",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int8x16x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1648"
    }
   ],
   "linker_set_key" : "int8x16x4_t",
   "name" : "int8x16x4_t",
   "referenced_type" : "type-1647",
   "self_type" : "type-1647",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11int8x16x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1477"
    }
   ],
   "linker_set_key" : "int8x8x2_t",
   "name" : "int8x8x2_t",
   "referenced_type" : "type-1476",
   "self_type" : "type-1476",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS10int8x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1561"
    }
   ],
   "linker_set_key" : "int8x8x3_t",
   "name" : "int8x8x3_t",
   "referenced_type" : "type-1560",
   "self_type" : "type-1560",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS10int8x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1645"
    }
   ],
   "linker_set_key" : "int8x8x4_t",
   "name" : "int8x8x4_t",
   "referenced_type" : "type-1644",
   "self_type" : "type-1644",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS10int8x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1728"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1728"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-1731",
   "self_type" : "type-1731",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1729"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1729"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-1732",
   "self_type" : "type-1732",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "b",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "c",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "s",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "i",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "j",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "f",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "d",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "l",
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS6jvalue"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "decimal_point",
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 64,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 128,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "int_curr_symbol",
     "field_offset" : 192,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "currency_symbol",
     "field_offset" : 256,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "mon_decimal_point",
     "field_offset" : 320,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "mon_thousands_sep",
     "field_offset" : 384,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "mon_grouping",
     "field_offset" : 448,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "positive_sign",
     "field_offset" : 512,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "negative_sign",
     "field_offset" : 576,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "int_frac_digits",
     "field_offset" : 640,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "frac_digits",
     "field_offset" : 648,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "p_cs_precedes",
     "field_offset" : 656,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "p_sep_by_space",
     "field_offset" : 664,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "n_cs_precedes",
     "field_offset" : 672,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "n_sep_by_space",
     "field_offset" : 680,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "p_sign_posn",
     "field_offset" : 688,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "n_sign_posn",
     "field_offset" : 696,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "int_p_cs_precedes",
     "field_offset" : 704,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "int_p_sep_by_space",
     "field_offset" : 712,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "int_n_cs_precedes",
     "field_offset" : 720,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "int_n_sep_by_space",
     "field_offset" : 728,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "int_p_sign_posn",
     "field_offset" : 736,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "int_n_sign_posn",
     "field_offset" : 744,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "lconv",
   "name" : "lconv",
   "referenced_type" : "type-2697",
   "self_type" : "type-2697",
   "size" : 96,
   "source_file" : "/bionic/libc/include/locale.h",
   "unique_id" : "lconv"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-2089",
   "self_type" : "type-2089",
   "size" : 16,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-2090",
   "self_type" : "type-2090",
   "size" : 16,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-2075",
   "self_type" : "type-2075",
   "size" : 80,
   "source_file" : "/bionic/libc/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-2005"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "type-2005"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-2120",
   "self_type" : "type-2120",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1549"
    }
   ],
   "linker_set_key" : "poly16x4x2_t",
   "name" : "poly16x4x2_t",
   "referenced_type" : "type-1548",
   "self_type" : "type-1548",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x4x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1633"
    }
   ],
   "linker_set_key" : "poly16x4x3_t",
   "name" : "poly16x4x3_t",
   "referenced_type" : "type-1632",
   "self_type" : "type-1632",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x4x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1717"
    }
   ],
   "linker_set_key" : "poly16x4x4_t",
   "name" : "poly16x4x4_t",
   "referenced_type" : "type-1716",
   "self_type" : "type-1716",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1552"
    }
   ],
   "linker_set_key" : "poly16x8x2_t",
   "name" : "poly16x8x2_t",
   "referenced_type" : "type-1551",
   "self_type" : "type-1551",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x8x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1636"
    }
   ],
   "linker_set_key" : "poly16x8x3_t",
   "name" : "poly16x8x3_t",
   "referenced_type" : "type-1635",
   "self_type" : "type-1635",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x8x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1720"
    }
   ],
   "linker_set_key" : "poly16x8x4_t",
   "name" : "poly16x8x4_t",
   "referenced_type" : "type-1719",
   "self_type" : "type-1719",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1555"
    }
   ],
   "linker_set_key" : "poly64x1x2_t",
   "name" : "poly64x1x2_t",
   "referenced_type" : "type-1554",
   "self_type" : "type-1554",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x1x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1639"
    }
   ],
   "linker_set_key" : "poly64x1x3_t",
   "name" : "poly64x1x3_t",
   "referenced_type" : "type-1638",
   "self_type" : "type-1638",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x1x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1723"
    }
   ],
   "linker_set_key" : "poly64x1x4_t",
   "name" : "poly64x1x4_t",
   "referenced_type" : "type-1722",
   "self_type" : "type-1722",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x1x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1558"
    }
   ],
   "linker_set_key" : "poly64x2x2_t",
   "name" : "poly64x2x2_t",
   "referenced_type" : "type-1557",
   "self_type" : "type-1557",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x2x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1642"
    }
   ],
   "linker_set_key" : "poly64x2x3_t",
   "name" : "poly64x2x3_t",
   "referenced_type" : "type-1641",
   "self_type" : "type-1641",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x2x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1726"
    }
   ],
   "linker_set_key" : "poly64x2x4_t",
   "name" : "poly64x2x4_t",
   "referenced_type" : "type-1725",
   "self_type" : "type-1725",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1546"
    }
   ],
   "linker_set_key" : "poly8x16x2_t",
   "name" : "poly8x16x2_t",
   "referenced_type" : "type-1545",
   "self_type" : "type-1545",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly8x16x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1630"
    }
   ],
   "linker_set_key" : "poly8x16x3_t",
   "name" : "poly8x16x3_t",
   "referenced_type" : "type-1629",
   "self_type" : "type-1629",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly8x16x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1714"
    }
   ],
   "linker_set_key" : "poly8x16x4_t",
   "name" : "poly8x16x4_t",
   "referenced_type" : "type-1713",
   "self_type" : "type-1713",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS12poly8x16x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1543"
    }
   ],
   "linker_set_key" : "poly8x8x2_t",
   "name" : "poly8x8x2_t",
   "referenced_type" : "type-1542",
   "self_type" : "type-1542",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11poly8x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1627"
    }
   ],
   "linker_set_key" : "poly8x8x3_t",
   "name" : "poly8x8x3_t",
   "referenced_type" : "type-1626",
   "self_type" : "type-1626",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11poly8x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1711"
    }
   ],
   "linker_set_key" : "poly8x8x4_t",
   "name" : "poly8x8x4_t",
   "referenced_type" : "type-1710",
   "self_type" : "type-1710",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/arm_neon.h",
   "unique_id" : "_ZTS11poly8x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "type-1461"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-1460",
   "self_type" : "type-1460",
   "size" : 56,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1463"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-1462",
   "self_type" : "type-1462",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS17pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1465"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-1464",
   "self_type" : "type-1464",
   "size" : 48,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1366"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-1365",
   "self_type" : "type-1365",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1467"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-1466",
   "self_type" : "type-1466",
   "size" : 56,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-1468",
   "self_type" : "type-1468",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS18pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "sched_param",
   "name" : "sched_param",
   "referenced_type" : "type-2669",
   "self_type" : "type-2669",
   "size" : 4,
   "source_file" : "/bionic/libc/include/sched.h",
   "unique_id" : "sched_param"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "type-12"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-1778"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "type-1747"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "type-1752"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-1777",
   "self_type" : "type-1777",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "type-12"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-1783"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "type-1747"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "type-1752"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-1782",
   "self_type" : "type-1782",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1750"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1779"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:80:22) at bionic/libc/include/bits/signal_types.h:80:22 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:80:22) at bionic/libc/include/bits/signal_types.h:80:22 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "record_kind" : "union",
   "referenced_type" : "type-1783",
   "self_type" : "type-1783",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1750"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1779"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:79:20) at bionic/libc/include/bits/signal_types.h:79:20 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:79:20) at bionic/libc/include/bits/signal_types.h:79:20 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "record_kind" : "union",
   "referenced_type" : "type-1778",
   "self_type" : "type-1778",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-1754",
   "self_type" : "type-1754",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "type-772"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "type-1737"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "type-772"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "type-772"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "type-772"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "type-1738"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-1736",
   "self_type" : "type-1736",
   "size" : 4384,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-1755"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "type-1773"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-1772",
   "self_type" : "type-1772",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-1465"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-1774"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3",
   "record_kind" : "union",
   "referenced_type" : "type-1773",
   "self_type" : "type-1773",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-1775"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5",
   "referenced_type" : "type-1774",
   "self_type" : "type-1774",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-1769"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-1768",
   "self_type" : "type-1768",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-1770"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "type-1771"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3",
   "record_kind" : "union",
   "referenced_type" : "type-1769",
   "self_type" : "type-1769",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "type-1756"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5 <Spelling=bionic/libc/kernel/uapi/asm-generic/siginfo.h:95:19>",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5 <Spelling=bionic/libc/kernel/uapi/asm-generic/siginfo.h:95:19>",
   "referenced_type" : "type-1770",
   "self_type" : "type-1770",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "type-1748"
    }
   ],
   "linker_set_key" : "sigset_t",
   "name" : "sigset_t",
   "referenced_type" : "type-1747",
   "self_type" : "type-1747",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/signal.h",
   "unique_id" : "_ZTS8sigset_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-1755",
   "self_type" : "type-1755",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "type-866"
    }
   ],
   "linker_set_key" : "sk_sp<SkColorSpace>",
   "name" : "sk_sp<SkColorSpace>",
   "record_kind" : "class",
   "referenced_type" : "type-865",
   "self_type" : "type-865",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "type-867" ],
   "unique_id" : "_ZTS5sk_spI12SkColorSpaceE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "type-2912"
    }
   ],
   "linker_set_key" : "sk_sp<SkPixelRef>",
   "name" : "sk_sp<SkPixelRef>",
   "record_kind" : "class",
   "referenced_type" : "type-2911",
   "self_type" : "type-2911",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "type-2914" ],
   "unique_id" : "_ZTS5sk_spI10SkPixelRefE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sk_strip_enum<int, void>",
   "name" : "sk_strip_enum<int, void>",
   "referenced_type" : "type-1795",
   "self_type" : "type-1795",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-12", "type-9" ],
   "unique_id" : "_ZTS13sk_strip_enumIivE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "input_channels",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "input_curves",
     "field_offset" : 64,
     "referenced_type" : "type-2004"
    },
    {
     "field_name" : "grid_points",
     "field_offset" : 1088,
     "referenced_type" : "type-2005"
    },
    {
     "field_name" : "grid_8",
     "field_offset" : 1152,
     "referenced_type" : "type-485"
    },
    {
     "field_name" : "grid_16",
     "field_offset" : 1216,
     "referenced_type" : "type-485"
    },
    {
     "field_name" : "matrix_channels",
     "field_offset" : 1280,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "matrix_curves",
     "field_offset" : 1344,
     "referenced_type" : "type-2006"
    },
    {
     "field_name" : "matrix",
     "field_offset" : 2112,
     "referenced_type" : "type-1996"
    },
    {
     "field_name" : "output_channels",
     "field_offset" : 2496,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "output_curves",
     "field_offset" : 2560,
     "referenced_type" : "type-2006"
    }
   ],
   "linker_set_key" : "skcms_A2B",
   "name" : "skcms_A2B",
   "referenced_type" : "type-2003",
   "self_type" : "type-2003",
   "size" : 416,
   "source_file" : "/external/skia/third_party/skcms/skcms.h",
   "unique_id" : "skcms_A2B"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-2001"
    },
    {
     "referenced_type" : "type-2002"
    }
   ],
   "linker_set_key" : "skcms_Curve",
   "name" : "skcms_Curve",
   "record_kind" : "union",
   "referenced_type" : "type-2000",
   "self_type" : "type-2000",
   "size" : 32,
   "source_file" : "/external/skia/third_party/skcms/skcms.h",
   "unique_id" : "skcms_Curve"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alias_of_table_entries",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "parametric",
     "field_offset" : 32,
     "referenced_type" : "type-1999"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "skcms_Curve::(anonymous struct at external/skia/include/core/../../third_party/skcms/skcms.h:56:5) at external/skia/include/core/../../third_party/skcms/skcms.h:56:5",
   "name" : "skcms_Curve::(anonymous struct at external/skia/include/core/../../third_party/skcms/skcms.h:56:5) at external/skia/include/core/../../third_party/skcms/skcms.h:56:5",
   "referenced_type" : "type-2001",
   "self_type" : "type-2001",
   "size" : 32,
   "source_file" : "/external/skia/third_party/skcms/skcms.h",
   "unique_id" : "skcms_Curve::(anonymous struct at external/skia/include/core/../../third_party/skcms/skcms.h:56:5)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "table_entries",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "table_8",
     "field_offset" : 64,
     "referenced_type" : "type-485"
    },
    {
     "field_name" : "table_16",
     "field_offset" : 128,
     "referenced_type" : "type-485"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "skcms_Curve::(anonymous struct at external/skia/include/core/../../third_party/skcms/skcms.h:60:5) at external/skia/include/core/../../third_party/skcms/skcms.h:60:5",
   "name" : "skcms_Curve::(anonymous struct at external/skia/include/core/../../third_party/skcms/skcms.h:60:5) at external/skia/include/core/../../third_party/skcms/skcms.h:60:5",
   "referenced_type" : "type-2002",
   "self_type" : "type-2002",
   "size" : 24,
   "source_file" : "/external/skia/third_party/skcms/skcms.h",
   "unique_id" : "skcms_Curve::(anonymous struct at external/skia/include/core/../../third_party/skcms/skcms.h:60:5)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "type-485"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "data_color_space",
     "field_offset" : 96,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "pcs",
     "field_offset" : 128,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "tag_count",
     "field_offset" : 160,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "has_trc",
     "field_offset" : 192,
     "referenced_type" : "type-559"
    },
    {
     "field_name" : "trc",
     "field_offset" : 256,
     "referenced_type" : "type-2006"
    },
    {
     "field_name" : "has_toXYZD50",
     "field_offset" : 1024,
     "referenced_type" : "type-559"
    },
    {
     "field_name" : "toXYZD50",
     "field_offset" : 1056,
     "referenced_type" : "type-1993"
    },
    {
     "field_name" : "has_A2B",
     "field_offset" : 1344,
     "referenced_type" : "type-559"
    },
    {
     "field_name" : "A2B",
     "field_offset" : 1408,
     "referenced_type" : "type-2003"
    }
   ],
   "linker_set_key" : "skcms_ICCProfile",
   "name" : "skcms_ICCProfile",
   "referenced_type" : "type-2007",
   "self_type" : "type-2007",
   "size" : 592,
   "source_file" : "/external/skia/third_party/skcms/skcms.h",
   "unique_id" : "skcms_ICCProfile"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "signature",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "buf",
     "field_offset" : 128,
     "referenced_type" : "type-485"
    }
   ],
   "linker_set_key" : "skcms_ICCTag",
   "name" : "skcms_ICCTag",
   "referenced_type" : "type-2008",
   "self_type" : "type-2008",
   "size" : 24,
   "source_file" : "/external/skia/third_party/skcms/skcms.h",
   "unique_id" : "skcms_ICCTag"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vals",
     "referenced_type" : "type-1994"
    }
   ],
   "linker_set_key" : "skcms_Matrix3x3",
   "name" : "skcms_Matrix3x3",
   "referenced_type" : "type-1993",
   "self_type" : "type-1993",
   "size" : 36,
   "source_file" : "/external/skia/third_party/skcms/skcms.h",
   "unique_id" : "skcms_Matrix3x3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vals",
     "referenced_type" : "type-1997"
    }
   ],
   "linker_set_key" : "skcms_Matrix3x4",
   "name" : "skcms_Matrix3x4",
   "referenced_type" : "type-1996",
   "self_type" : "type-1996",
   "size" : 48,
   "source_file" : "/external/skia/third_party/skcms/skcms.h",
   "unique_id" : "skcms_Matrix3x4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "g",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "a",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "c",
     "field_offset" : 96,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "d",
     "field_offset" : 128,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "e",
     "field_offset" : 160,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "f",
     "field_offset" : 192,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "skcms_TransferFunction",
   "name" : "skcms_TransferFunction",
   "referenced_type" : "type-1999",
   "self_type" : "type-1999",
   "size" : 28,
   "source_file" : "/external/skia/third_party/skcms/skcms.h",
   "unique_id" : "skcms_TransferFunction"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::_DeallocateCaller",
   "name" : "std::_DeallocateCaller",
   "referenced_type" : "type-2115",
   "self_type" : "type-2115",
   "size" : 1,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSNSt3__117_DeallocateCallerE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::_PairT",
   "name" : "std::_PairT",
   "referenced_type" : "type-1889",
   "self_type" : "type-1889",
   "size" : 16,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__16_PairTE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_const<unsigned long, false>",
   "name" : "std::__add_const<unsigned long, false>",
   "referenced_type" : "type-817",
   "self_type" : "type-817",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__111__add_constImLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<char, true>",
   "name" : "std::__add_lvalue_reference_impl<char, true>",
   "referenced_type" : "type-912",
   "self_type" : "type-912",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIcLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<const unsigned long, true>",
   "name" : "std::__add_lvalue_reference_impl<const unsigned long, true>",
   "referenced_type" : "type-915",
   "self_type" : "type-915",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-575" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIKmLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<float, true>",
   "name" : "std::__add_lvalue_reference_impl<float, true>",
   "referenced_type" : "type-910",
   "self_type" : "type-910",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIfLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<int, true>",
   "name" : "std::__add_lvalue_reference_impl<int, true>",
   "referenced_type" : "type-909",
   "self_type" : "type-909",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<unsigned char, true>",
   "name" : "std::__add_lvalue_reference_impl<unsigned char, true>",
   "referenced_type" : "type-911",
   "self_type" : "type-911",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIhLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<unsigned int, true>",
   "name" : "std::__add_lvalue_reference_impl<unsigned int, true>",
   "referenced_type" : "type-913",
   "self_type" : "type-913",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<unsigned long, true>",
   "name" : "std::__add_lvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "type-914",
   "self_type" : "type-914",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<__int128, true>",
   "name" : "std::__add_pointer_impl<__int128, true>",
   "referenced_type" : "type-934",
   "self_type" : "type-934",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-690" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implInLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair<char *, void (*)(void *)>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair<char *, void (*)(void *)>, true>",
   "referenced_type" : "type-942",
   "self_type" : "type-942",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-706" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_17__compressed_pairIPcPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair<unsigned char *, void (*)(void *)>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair<unsigned char *, void (*)(void *)>, true>",
   "referenced_type" : "type-939",
   "self_type" : "type-939",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-699" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_17__compressed_pairIPhPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair<unsigned int *, void (*)(void *)>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair<unsigned int *, void (*)(void *)>, true>",
   "referenced_type" : "type-945",
   "self_type" : "type-945",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-712" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_17__compressed_pairIPjPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<char *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<char *, 0, false>, true>",
   "referenced_type" : "type-940",
   "self_type" : "type-940",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-702" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "referenced_type" : "type-956",
   "self_type" : "type-956",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-650" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "referenced_type" : "type-960",
   "self_type" : "type-960",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-676" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "referenced_type" : "type-948",
   "self_type" : "type-948",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-597" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "referenced_type" : "type-952",
   "self_type" : "type-952",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-624" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-955",
   "self_type" : "type-955",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-635" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-959",
   "self_type" : "type-959",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-661" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "referenced_type" : "type-947",
   "self_type" : "type-947",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-583" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "referenced_type" : "type-951",
   "self_type" : "type-951",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-609" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "referenced_type" : "type-935",
   "self_type" : "type-935",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-692" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "referenced_type" : "type-943",
   "self_type" : "type-943",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-709" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "referenced_type" : "type-936",
   "self_type" : "type-936",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-695" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<long double, true>",
   "name" : "std::__add_pointer_impl<long double, true>",
   "referenced_type" : "type-933",
   "self_type" : "type-933",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIeLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<long long, true>",
   "name" : "std::__add_pointer_impl<long long, true>",
   "referenced_type" : "type-931",
   "self_type" : "type-931",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<long, true>",
   "name" : "std::__add_pointer_impl<long, true>",
   "referenced_type" : "type-932",
   "self_type" : "type-932",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<char *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<char *, 0, false>, true>",
   "referenced_type" : "type-941",
   "self_type" : "type-941",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-703" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "referenced_type" : "type-958",
   "self_type" : "type-958",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-651" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "referenced_type" : "type-962",
   "self_type" : "type-962",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-677" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "referenced_type" : "type-950",
   "self_type" : "type-950",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-598" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "referenced_type" : "type-954",
   "self_type" : "type-954",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-625" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-957",
   "self_type" : "type-957",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-636" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-961",
   "self_type" : "type-961",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-662" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "referenced_type" : "type-949",
   "self_type" : "type-949",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-584" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "referenced_type" : "type-953",
   "self_type" : "type-953",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "referenced_type" : "type-937",
   "self_type" : "type-937",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-693" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "referenced_type" : "type-944",
   "self_type" : "type-944",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-561" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "referenced_type" : "type-938",
   "self_type" : "type-938",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-563" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__add_pointer_impl<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-946",
   "self_type" : "type-946",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-578" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_rvalue_reference_impl<float, true>",
   "name" : "std::__add_rvalue_reference_impl<float, true>",
   "referenced_type" : "type-924",
   "self_type" : "type-924",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__127__add_rvalue_reference_implIfLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_rvalue_reference_impl<int, true>",
   "name" : "std::__add_rvalue_reference_impl<int, true>",
   "referenced_type" : "type-923",
   "self_type" : "type-923",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__127__add_rvalue_reference_implIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_rvalue_reference_impl<unsigned long, true>",
   "name" : "std::__add_rvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "type-925",
   "self_type" : "type-925",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__127__add_rvalue_reference_implImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<double>",
   "name" : "std::__align_type<double>",
   "referenced_type" : "type-1242",
   "self_type" : "type-1242",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<int *>",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "type-1246",
   "self_type" : "type-1246",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-441" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIPiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<long double>",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "type-1243",
   "self_type" : "type-1243",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIeEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double4>",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "type-1245",
   "self_type" : "type-1245",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1230" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_16__struct_double4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double>",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "type-1244",
   "self_type" : "type-1244",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1228" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned char>",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "type-1237",
   "self_type" : "type-1237",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned int>",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "type-1239",
   "self_type" : "type-1239",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long long>",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "type-1241",
   "self_type" : "type-1241",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-772" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long>",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "type-1240",
   "self_type" : "type-1240",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__112__align_typeImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned short>",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "type-1238",
   "self_type" : "type-1238",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__112__align_typeItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<char16_t>, char16_t *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<char16_t>, char16_t *, true>",
   "referenced_type" : "type-2285",
   "self_type" : "type-2285",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-640" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorIDsEEPDsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<char32_t>, char32_t *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<char32_t>, char32_t *, true>",
   "referenced_type" : "type-2286",
   "self_type" : "type-2286",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-666" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorIDiEEPDiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<char>, char *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<char>, char *, true>",
   "referenced_type" : "type-2283",
   "self_type" : "type-2283",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-540" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorIcEEPcLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<wchar_t>, wchar_t *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<wchar_t>, wchar_t *, true>",
   "referenced_type" : "type-2284",
   "self_type" : "type-2284",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-614" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorIwEEPwLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__and_<>",
   "name" : "std::__and_<>",
   "referenced_type" : "type-3129",
   "self_type" : "type-3129",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__16__and_IJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__any",
   "name" : "std::__any",
   "referenced_type" : "type-930",
   "self_type" : "type-930",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__anyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, false>",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "type-1825",
   "self_type" : "type-1825",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, true>",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "type-1827",
   "self_type" : "type-1827",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, false>",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "type-1826",
   "self_type" : "type-1826",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, true>",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "type-1828",
   "self_type" : "type-1828",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, false>",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "type-1829",
   "self_type" : "type-1829",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, true>",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "type-1831",
   "self_type" : "type-1831",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, false>",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "type-1830",
   "self_type" : "type-1830",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, true>",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "type-1832",
   "self_type" : "type-1832",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-879"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, false>",
   "name" : "std::__atomic_base<int, false>",
   "referenced_type" : "type-878",
   "self_type" : "type-878",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb0EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-878"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, true>",
   "name" : "std::__atomic_base<int, true>",
   "referenced_type" : "type-877",
   "self_type" : "type-877",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb1EEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-874"
    }
   ],
   "linker_set_key" : "std::__atomic_base<unsigned char, false>",
   "name" : "std::__atomic_base<unsigned char, false>",
   "referenced_type" : "type-873",
   "self_type" : "type-873",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIhLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-873"
    }
   ],
   "linker_set_key" : "std::__atomic_base<unsigned char, true>",
   "name" : "std::__atomic_base<unsigned char, true>",
   "referenced_type" : "type-872",
   "self_type" : "type-872",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIhLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-1801"
    }
   ],
   "linker_set_key" : "std::__atomic_base<unsigned int, false>",
   "name" : "std::__atomic_base<unsigned int, false>",
   "referenced_type" : "type-1800",
   "self_type" : "type-1800",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIjLb0EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1800"
    }
   ],
   "linker_set_key" : "std::__atomic_base<unsigned int, true>",
   "name" : "std::__atomic_base<unsigned int, true>",
   "referenced_type" : "type-1799",
   "self_type" : "type-1799",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__basic_string_common<true>",
   "name" : "std::__basic_string_common<true>",
   "record_kind" : "class",
   "referenced_type" : "type-1192",
   "self_type" : "type-1192",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "unique_id" : "_ZTSNSt3__121__basic_string_commonILb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__seg_",
     "referenced_type" : "type-2719"
    },
    {
     "access" : "private",
     "field_name" : "__mask_",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__bit_const_reference<std::__bitset<0, 0> >",
   "name" : "std::__bit_const_reference<std::__bitset<0, 0> >",
   "record_kind" : "class",
   "referenced_type" : "type-2884",
   "self_type" : "type-2884",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__bit_reference",
   "template_args" : [ "type-2879" ],
   "unique_id" : "_ZTSNSt3__121__bit_const_referenceINS_8__bitsetILm0ELm0EEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__seg_",
     "referenced_type" : "type-2878"
    },
    {
     "access" : "private",
     "field_name" : "__ctz_",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "std::__bit_iterator<std::__bitset<0, 0>, false, 0>",
   "name" : "std::__bit_iterator<std::__bitset<0, 0>, false, 0>",
   "record_kind" : "class",
   "referenced_type" : "type-2877",
   "self_type" : "type-2877",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__bit_reference",
   "template_args" : [ "type-2879" ],
   "unique_id" : "_ZTSNSt3__114__bit_iteratorINS_8__bitsetILm0ELm0EEELb0ELm0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__seg_",
     "referenced_type" : "type-2719"
    },
    {
     "access" : "private",
     "field_name" : "__ctz_",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "std::__bit_iterator<std::__bitset<0, 0>, true, 0>",
   "name" : "std::__bit_iterator<std::__bitset<0, 0>, true, 0>",
   "record_kind" : "class",
   "referenced_type" : "type-2881",
   "self_type" : "type-2881",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__bit_reference",
   "template_args" : [ "type-2879" ],
   "unique_id" : "_ZTSNSt3__114__bit_iteratorINS_8__bitsetILm0ELm0EEELb1ELm0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__seg_",
     "referenced_type" : "type-2878"
    },
    {
     "access" : "private",
     "field_name" : "__mask_",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__bit_reference<std::__bitset<0, 0>, true>",
   "name" : "std::__bit_reference<std::__bitset<0, 0>, true>",
   "record_kind" : "class",
   "referenced_type" : "type-2887",
   "self_type" : "type-2887",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__bit_reference",
   "template_args" : [ "type-2879" ],
   "unique_id" : "_ZTSNSt3__115__bit_referenceINS_8__bitsetILm0ELm0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__bitset<0, 0>",
   "name" : "std::__bitset<0, 0>",
   "record_kind" : "class",
   "referenced_type" : "type-2879",
   "self_type" : "type-2879",
   "size" : 1,
   "source_file" : "/external/libcxx/include/bitset",
   "unique_id" : "_ZTSNSt3__18__bitsetILm0ELm0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, const char *>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, const char *>",
   "referenced_type" : "type-2436",
   "self_type" : "type-2436",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-21", "type-1115", "type-19" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEPKcEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-2440",
   "self_type" : "type-2440",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-21", "type-1115", "type-1190" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEENS_12basic_stringIcS2_NS_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char16_t, std::char_traits<char16_t>, const char16_t *>",
   "name" : "std::__can_be_converted_to_string_view<char16_t, std::char_traits<char16_t>, const char16_t *>",
   "referenced_type" : "type-2438",
   "self_type" : "type-2438",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-641", "type-1127", "type-1125" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIDsNS_11char_traitsIDsEEPKDsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char32_t, std::char_traits<char32_t>, const char32_t *>",
   "name" : "std::__can_be_converted_to_string_view<char32_t, std::char_traits<char32_t>, const char32_t *>",
   "referenced_type" : "type-2439",
   "self_type" : "type-2439",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-667", "type-1133", "type-1131" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIDiNS_11char_traitsIDiEEPKDiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<wchar_t, std::char_traits<wchar_t>, const wchar_t *>",
   "name" : "std::__can_be_converted_to_string_view<wchar_t, std::char_traits<wchar_t>, const wchar_t *>",
   "referenced_type" : "type-2437",
   "self_type" : "type-2437",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-615", "type-1121", "type-1119" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIwNS_11char_traitsIwEEPKwEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<wchar_t, std::char_traits<wchar_t>, std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> > >",
   "name" : "std::__can_be_converted_to_string_view<wchar_t, std::char_traits<wchar_t>, std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> > >",
   "referenced_type" : "type-2441",
   "self_type" : "type-2441",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-615", "type-1121", "type-1197" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIwNS_11char_traitsIwEENS_12basic_stringIwS2_NS_9allocatorIwEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__check_tuple_constructor_fail",
   "name" : "std::__check_tuple_constructor_fail",
   "referenced_type" : "type-3070",
   "self_type" : "type-3070",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__130__check_tuple_constructor_failE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<__int128, __int128, void>",
   "name" : "std::__common_type2_imp<__int128, __int128, void>",
   "referenced_type" : "type-3031",
   "self_type" : "type-3031",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-690", "type-690", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impInnvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<__int128, long, void>",
   "name" : "std::__common_type2_imp<__int128, long, void>",
   "referenced_type" : "type-3034",
   "self_type" : "type-3034",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-690", "type-79", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impInlvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<long double, long double, void>",
   "name" : "std::__common_type2_imp<long double, long double, void>",
   "referenced_type" : "type-3026",
   "self_type" : "type-3026",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3", "type-3", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impIeevEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<long long, long long, void>",
   "name" : "std::__common_type2_imp<long long, long long, void>",
   "referenced_type" : "type-3017",
   "self_type" : "type-3017",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2", "type-2", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impIxxvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<long long, long, void>",
   "name" : "std::__common_type2_imp<long long, long, void>",
   "referenced_type" : "type-3037",
   "self_type" : "type-3037",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2", "type-79", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impIxlvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<long, long, void>",
   "name" : "std::__common_type2_imp<long, long, void>",
   "referenced_type" : "type-3021",
   "self_type" : "type-3021",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79", "type-79", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impIllvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1331"
    }
   ],
   "linker_set_key" : "std::__common_type_impl<std::__common_types<__int128, __int128, long>, void>",
   "name" : "std::__common_type_impl<std::__common_types<__int128, __int128, long>, void>",
   "referenced_type" : "type-1330",
   "self_type" : "type-1330",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1333", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type_implINS_14__common_typesIJnnlEEEvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type_impl<std::__common_types<__int128, long>, void>",
   "name" : "std::__common_type_impl<std::__common_types<__int128, long>, void>",
   "referenced_type" : "type-1331",
   "self_type" : "type-1331",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1332", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type_implINS_14__common_typesIJnlEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1336"
    }
   ],
   "linker_set_key" : "std::__common_type_impl<std::__common_types<long long, long long, long>, void>",
   "name" : "std::__common_type_impl<std::__common_types<long long, long long, long>, void>",
   "referenced_type" : "type-1335",
   "self_type" : "type-1335",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1338", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type_implINS_14__common_typesIJxxlEEEvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type_impl<std::__common_types<long long, long>, void>",
   "name" : "std::__common_type_impl<std::__common_types<long long, long>, void>",
   "referenced_type" : "type-1336",
   "self_type" : "type-1336",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1337", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__common_type_implINS_14__common_typesIJxlEEEvEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-703"
    },
    {
     "access" : "private",
     "referenced_type" : "type-563"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<char *, void (*)(void *)>",
   "name" : "std::__compressed_pair<char *, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "type-707",
   "self_type" : "type-707",
   "size" : 16,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-540", "type-564" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairIPcPFvPvEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-636"
    },
    {
     "access" : "private",
     "referenced_type" : "type-651"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, std::allocator<char16_t> >",
   "name" : "std::__compressed_pair<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, std::allocator<char16_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-2134",
   "self_type" : "type-2134",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-637", "type-652" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repES5_EE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-662"
    },
    {
     "access" : "private",
     "referenced_type" : "type-677"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, std::allocator<char32_t> >",
   "name" : "std::__compressed_pair<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, std::allocator<char32_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-2142",
   "self_type" : "type-2142",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-663", "type-678" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repES5_EE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-584"
    },
    {
     "access" : "private",
     "referenced_type" : "type-598"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> >",
   "name" : "std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> >",
   "record_kind" : "class",
   "referenced_type" : "type-1191",
   "self_type" : "type-1191",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-585", "type-599" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-610"
    },
    {
     "access" : "private",
     "referenced_type" : "type-625"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<std::basic_string<wchar_t>::__rep, std::allocator<wchar_t> >",
   "name" : "std::__compressed_pair<std::basic_string<wchar_t>::__rep, std::allocator<wchar_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-1198",
   "self_type" : "type-1198",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-611", "type-626" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-693"
    },
    {
     "access" : "private",
     "referenced_type" : "type-563"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<unsigned char *, void (*)(void *)>",
   "name" : "std::__compressed_pair<unsigned char *, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "type-700",
   "self_type" : "type-700",
   "size" : 16,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-375", "type-564" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairIPhPFvPvEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-561"
    },
    {
     "access" : "private",
     "referenced_type" : "type-563"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<unsigned int *, void (*)(void *)>",
   "name" : "std::__compressed_pair<unsigned int *, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 16,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-562", "type-564" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairIPjPFvPvEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-540"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<char *, 0, false>",
   "name" : "std::__compressed_pair_elem<char *, 0, false>",
   "referenced_type" : "type-703",
   "self_type" : "type-703",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-540" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPcLi0ELb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>",
   "referenced_type" : "type-651",
   "self_type" : "type-651",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-678"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>",
   "referenced_type" : "type-677",
   "self_type" : "type-677",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-599"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<char>, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<char>, 1, true>",
   "referenced_type" : "type-598",
   "self_type" : "type-598",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-626"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-637"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>",
   "name" : "std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>",
   "referenced_type" : "type-636",
   "self_type" : "type-636",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-663"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>",
   "name" : "std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-663" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-585"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>",
   "name" : "std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>",
   "referenced_type" : "type-584",
   "self_type" : "type-584",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-585" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-611"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>",
   "name" : "std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>",
   "referenced_type" : "type-610",
   "self_type" : "type-610",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-611" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-375"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<unsigned char *, 0, false>",
   "name" : "std::__compressed_pair_elem<unsigned char *, 0, false>",
   "referenced_type" : "type-693",
   "self_type" : "type-693",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-375" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPhLi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-562"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<unsigned int *, 0, false>",
   "name" : "std::__compressed_pair_elem<unsigned int *, 0, false>",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-562" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPjLi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-564"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<void (*)(void *), 1, false>",
   "name" : "std::__compressed_pair_elem<void (*)(void *), 1, false>",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-564" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<char, char *, std::allocator<char>, true>",
   "name" : "std::__const_pointer<char, char *, std::allocator<char>, true>",
   "referenced_type" : "type-2219",
   "self_type" : "type-2219",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-21", "type-540", "type-599" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerIcPcNS_9allocatorIcEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<char16_t, char16_t *, std::allocator<char16_t>, true>",
   "name" : "std::__const_pointer<char16_t, char16_t *, std::allocator<char16_t>, true>",
   "referenced_type" : "type-2221",
   "self_type" : "type-2221",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-641", "type-640", "type-652" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerIDsPDsNS_9allocatorIDsEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<char32_t, char32_t *, std::allocator<char32_t>, true>",
   "name" : "std::__const_pointer<char32_t, char32_t *, std::allocator<char32_t>, true>",
   "referenced_type" : "type-2222",
   "self_type" : "type-2222",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-667", "type-666", "type-678" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerIDiPDiNS_9allocatorIDiEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<wchar_t, wchar_t *, std::allocator<wchar_t>, true>",
   "name" : "std::__const_pointer<wchar_t, wchar_t *, std::allocator<wchar_t>, true>",
   "referenced_type" : "type-2220",
   "self_type" : "type-2220",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-615", "type-614", "type-626" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerIwPwNS_9allocatorIwEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<char *, std::allocator<char>, false>",
   "name" : "std::__const_void_pointer<char *, std::allocator<char>, false>",
   "referenced_type" : "type-2235",
   "self_type" : "type-2235",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-540", "type-599" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPcNS_9allocatorIcEELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<char16_t *, std::allocator<char16_t>, false>",
   "name" : "std::__const_void_pointer<char16_t *, std::allocator<char16_t>, false>",
   "referenced_type" : "type-2237",
   "self_type" : "type-2237",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-640", "type-652" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPDsNS_9allocatorIDsEELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<char32_t *, std::allocator<char32_t>, false>",
   "name" : "std::__const_void_pointer<char32_t *, std::allocator<char32_t>, false>",
   "referenced_type" : "type-2238",
   "self_type" : "type-2238",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-666", "type-678" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPDiNS_9allocatorIDiEELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<wchar_t *, std::allocator<wchar_t>, false>",
   "name" : "std::__const_void_pointer<wchar_t *, std::allocator<wchar_t>, false>",
   "referenced_type" : "type-2236",
   "self_type" : "type-2236",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-614", "type-626" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPwNS_9allocatorIwEELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<__int128, true>",
   "name" : "std::__decay<__int128, true>",
   "referenced_type" : "type-1048",
   "self_type" : "type-1048",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-690" ],
   "unique_id" : "_ZTSNSt3__17__decayInLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair<char *, void (*)(void *)>, true>",
   "name" : "std::__decay<const std::__compressed_pair<char *, void (*)(void *)>, true>",
   "referenced_type" : "type-1056",
   "self_type" : "type-1056",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-706" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_17__compressed_pairIPcPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair<unsigned char *, void (*)(void *)>, true>",
   "name" : "std::__decay<const std::__compressed_pair<unsigned char *, void (*)(void *)>, true>",
   "referenced_type" : "type-1053",
   "self_type" : "type-1053",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-699" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_17__compressed_pairIPhPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair<unsigned int *, void (*)(void *)>, true>",
   "name" : "std::__decay<const std::__compressed_pair<unsigned int *, void (*)(void *)>, true>",
   "referenced_type" : "type-1059",
   "self_type" : "type-1059",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-712" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_17__compressed_pairIPjPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<char *, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<char *, 0, false>, true>",
   "referenced_type" : "type-1054",
   "self_type" : "type-1054",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-702" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "referenced_type" : "type-1070",
   "self_type" : "type-1070",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-650" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "referenced_type" : "type-1074",
   "self_type" : "type-1074",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-676" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "referenced_type" : "type-1062",
   "self_type" : "type-1062",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-597" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "referenced_type" : "type-1066",
   "self_type" : "type-1066",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-624" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-1069",
   "self_type" : "type-1069",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-635" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-1073",
   "self_type" : "type-1073",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-661" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "referenced_type" : "type-1061",
   "self_type" : "type-1061",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-583" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "referenced_type" : "type-1065",
   "self_type" : "type-1065",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-609" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "referenced_type" : "type-1049",
   "self_type" : "type-1049",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-692" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "referenced_type" : "type-1057",
   "self_type" : "type-1057",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-709" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "referenced_type" : "type-1050",
   "self_type" : "type-1050",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-695" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<long double, true>",
   "name" : "std::__decay<long double, true>",
   "referenced_type" : "type-1047",
   "self_type" : "type-1047",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__17__decayIeLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<long long, true>",
   "name" : "std::__decay<long long, true>",
   "referenced_type" : "type-1045",
   "self_type" : "type-1045",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__17__decayIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<long, true>",
   "name" : "std::__decay<long, true>",
   "referenced_type" : "type-1046",
   "self_type" : "type-1046",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__17__decayIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<char *, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<char *, 0, false>, true>",
   "referenced_type" : "type-1055",
   "self_type" : "type-1055",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-703" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "referenced_type" : "type-1072",
   "self_type" : "type-1072",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-651" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "referenced_type" : "type-1076",
   "self_type" : "type-1076",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-677" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "referenced_type" : "type-1064",
   "self_type" : "type-1064",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-598" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "referenced_type" : "type-1068",
   "self_type" : "type-1068",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-625" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-1071",
   "self_type" : "type-1071",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-636" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-1075",
   "self_type" : "type-1075",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-662" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "referenced_type" : "type-1063",
   "self_type" : "type-1063",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-584" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "referenced_type" : "type-1067",
   "self_type" : "type-1067",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "referenced_type" : "type-1051",
   "self_type" : "type-1051",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-693" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "referenced_type" : "type-1058",
   "self_type" : "type-1058",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-561" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "referenced_type" : "type-1052",
   "self_type" : "type-1052",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-563" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__decay<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-1060",
   "self_type" : "type-1060",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-578" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2989"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::__unique_ptr_deleter_sfinae<void (*)(void *)>, true>",
   "name" : "std::__dependent_type<std::__unique_ptr_deleter_sfinae<void (*)(void *)>, true>",
   "referenced_type" : "type-2988",
   "self_type" : "type-2988",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2989" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_27__unique_ptr_deleter_sfinaeIPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3001"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::allocator<char16_t> >, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::allocator<char16_t> >, true>",
   "referenced_type" : "type-3000",
   "self_type" : "type-3000",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3001" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_9allocatorIDsEEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3005"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::allocator<char32_t> >, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::allocator<char32_t> >, true>",
   "referenced_type" : "type-3004",
   "self_type" : "type-3004",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3005" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_9allocatorIDiEEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2993"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::allocator<char> >, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::allocator<char> >, true>",
   "referenced_type" : "type-2992",
   "self_type" : "type-2992",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2993" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_9allocatorIcEEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2997"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::allocator<wchar_t> >, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::allocator<wchar_t> >, true>",
   "referenced_type" : "type-2996",
   "self_type" : "type-2996",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2997" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_9allocatorIwEEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2999"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep>, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep>, true>",
   "referenced_type" : "type-2998",
   "self_type" : "type-2998",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2999" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3003"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep>, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep>, true>",
   "referenced_type" : "type-3002",
   "self_type" : "type-3002",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3003" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2991"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char>::__rep>, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char>::__rep>, true>",
   "referenced_type" : "type-2990",
   "self_type" : "type-2990",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2991" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2995"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::basic_string<wchar_t>::__rep>, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::basic_string<wchar_t>::__rep>, true>",
   "referenced_type" : "type-2994",
   "self_type" : "type-2994",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2995" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repEEELb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__destruct_n",
   "name" : "std::__destruct_n",
   "referenced_type" : "type-2327",
   "self_type" : "type-2327",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__destruct_nE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1915"
    }
   ],
   "linker_set_key" : "std::__do_message",
   "name" : "std::__do_message",
   "record_kind" : "class",
   "referenced_type" : "type-2651",
   "self_type" : "type-2651",
   "size" : 8,
   "source_file" : "/external/libcxx/include/system_error",
   "unique_id" : "_ZTSNSt3__112__do_messageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112__do_messageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112__do_messageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112__do_messageD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__114error_category4nameEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category23default_error_conditionEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112__do_message7messageEi"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_fail_tag",
   "name" : "std::__extract_key_fail_tag",
   "referenced_type" : "type-1417",
   "self_type" : "type-1417",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_fail_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_first_tag",
   "name" : "std::__extract_key_first_tag",
   "referenced_type" : "type-1419",
   "self_type" : "type-1419",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__123__extract_key_first_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_self_tag",
   "name" : "std::__extract_key_self_tag",
   "referenced_type" : "type-1418",
   "self_type" : "type-1418",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_self_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 24>",
   "referenced_type" : "type-1257",
   "self_type" : "type-1257",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1258" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1222"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "referenced_type" : "type-1265",
   "self_type" : "type-1265",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1266" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 24>",
   "referenced_type" : "type-1259",
   "self_type" : "type-1259",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1260" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1222"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 24>",
   "referenced_type" : "type-1263",
   "self_type" : "type-1263",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1264" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 24>",
   "referenced_type" : "type-1261",
   "self_type" : "type-1261",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1262" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 24>",
   "referenced_type" : "type-1247",
   "self_type" : "type-1247",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1248" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 24>",
   "referenced_type" : "type-1251",
   "self_type" : "type-1251",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1252" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 24>",
   "referenced_type" : "type-1255",
   "self_type" : "type-1255",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1256" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 24>",
   "referenced_type" : "type-1253",
   "self_type" : "type-1253",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1254" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1226"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 24>",
   "referenced_type" : "type-1249",
   "self_type" : "type-1249",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1250" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "type-2372"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 64,
     "referenced_type" : "type-2375"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 128,
     "referenced_type" : "type-2376"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 192,
     "referenced_type" : "type-2377"
    }
   ],
   "linker_set_key" : "std::__function::__policy",
   "name" : "std::__function::__policy",
   "referenced_type" : "type-2371",
   "self_type" : "type-2371",
   "size" : 32,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__110__function8__policyE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "type-1461"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "std::__function::__policy_storage",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "type-2370",
   "self_type" : "type-2370",
   "size" : 16,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__110__function16__policy_storageE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<0>",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "type-1883",
   "self_type" : "type-1883",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<1>",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "type-1884",
   "self_type" : "type-1884",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILm1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<char16_t>, void>",
   "name" : "std::__has_const_pointer<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2217",
   "self_type" : "type-2217",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<char32_t>, void>",
   "name" : "std::__has_const_pointer<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2218",
   "self_type" : "type-2218",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<char>, void>",
   "name" : "std::__has_const_pointer<std::allocator<char>, void>",
   "referenced_type" : "type-2215",
   "self_type" : "type-2215",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<wchar_t>, void>",
   "name" : "std::__has_const_pointer<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2216",
   "self_type" : "type-2216",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<char16_t>, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2233",
   "self_type" : "type-2233",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<char32_t>, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2234",
   "self_type" : "type-2234",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<char>, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<char>, void>",
   "referenced_type" : "type-2231",
   "self_type" : "type-2231",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<wchar_t>, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2232",
   "self_type" : "type-2232",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<char16_t>, void>",
   "name" : "std::__has_difference_type<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2190",
   "self_type" : "type-2190",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<char32_t>, void>",
   "name" : "std::__has_difference_type<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2191",
   "self_type" : "type-2191",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<char>, void>",
   "name" : "std::__has_difference_type<std::allocator<char>, void>",
   "referenced_type" : "type-2188",
   "self_type" : "type-2188",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<wchar_t>, void>",
   "name" : "std::__has_difference_type<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2189",
   "self_type" : "type-2189",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<char16_t>, void>",
   "name" : "std::__has_is_always_equal<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2273",
   "self_type" : "type-2273",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<char32_t>, void>",
   "name" : "std::__has_is_always_equal<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2274",
   "self_type" : "type-2274",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<char>, void>",
   "name" : "std::__has_is_always_equal<std::allocator<char>, void>",
   "referenced_type" : "type-2271",
   "self_type" : "type-2271",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<wchar_t>, void>",
   "name" : "std::__has_is_always_equal<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2272",
   "self_type" : "type-2272",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_max_size<const std::allocator<char16_t> >",
   "name" : "std::__has_max_size<const std::allocator<char16_t> >",
   "referenced_type" : "type-2281",
   "self_type" : "type-2281",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-2128" ],
   "unique_id" : "_ZTSNSt3__114__has_max_sizeIKNS_9allocatorIDsEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_max_size<const std::allocator<char32_t> >",
   "name" : "std::__has_max_size<const std::allocator<char32_t> >",
   "referenced_type" : "type-2282",
   "self_type" : "type-2282",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-2131" ],
   "unique_id" : "_ZTSNSt3__114__has_max_sizeIKNS_9allocatorIDiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_max_size<const std::allocator<char> >",
   "name" : "std::__has_max_size<const std::allocator<char> >",
   "referenced_type" : "type-2279",
   "self_type" : "type-2279",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-2122" ],
   "unique_id" : "_ZTSNSt3__114__has_max_sizeIKNS_9allocatorIcEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_max_size<const std::allocator<wchar_t> >",
   "name" : "std::__has_max_size<const std::allocator<wchar_t> >",
   "referenced_type" : "type-2280",
   "self_type" : "type-2280",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-2125" ],
   "unique_id" : "_ZTSNSt3__114__has_max_sizeIKNS_9allocatorIwEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<char16_t>, void>",
   "name" : "std::__has_pointer_type<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2198",
   "self_type" : "type-2198",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<char32_t>, void>",
   "name" : "std::__has_pointer_type<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2199",
   "self_type" : "type-2199",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<char>, void>",
   "name" : "std::__has_pointer_type<std::allocator<char>, void>",
   "referenced_type" : "type-2196",
   "self_type" : "type-2196",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<wchar_t>, void>",
   "name" : "std::__has_pointer_type<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2197",
   "self_type" : "type-2197",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<void (*)(void *), void>",
   "name" : "std::__has_pointer_type<void (*)(void *), void>",
   "referenced_type" : "type-2200",
   "self_type" : "type-2200",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-564", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeIPFvPvEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char16_t>, void>",
   "name" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2249",
   "self_type" : "type-2249",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_copy_assignmentINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char32_t>, void>",
   "name" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2250",
   "self_type" : "type-2250",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_copy_assignmentINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char>, void>",
   "name" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char>, void>",
   "referenced_type" : "type-2247",
   "self_type" : "type-2247",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_copy_assignmentINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_copy_assignment<std::allocator<wchar_t>, void>",
   "name" : "std::__has_propagate_on_container_copy_assignment<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2248",
   "self_type" : "type-2248",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_copy_assignmentINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_move_assignment<std::allocator<char16_t>, void>",
   "name" : "std::__has_propagate_on_container_move_assignment<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2257",
   "self_type" : "type-2257",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_move_assignmentINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_move_assignment<std::allocator<char32_t>, void>",
   "name" : "std::__has_propagate_on_container_move_assignment<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2258",
   "self_type" : "type-2258",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_move_assignmentINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_move_assignment<std::allocator<char>, void>",
   "name" : "std::__has_propagate_on_container_move_assignment<std::allocator<char>, void>",
   "referenced_type" : "type-2255",
   "self_type" : "type-2255",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_move_assignmentINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_move_assignment<std::allocator<wchar_t>, void>",
   "name" : "std::__has_propagate_on_container_move_assignment<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2256",
   "self_type" : "type-2256",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_move_assignmentINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_swap<std::allocator<char16_t>, void>",
   "name" : "std::__has_propagate_on_container_swap<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2265",
   "self_type" : "type-2265",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__133__has_propagate_on_container_swapINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_swap<std::allocator<char32_t>, void>",
   "name" : "std::__has_propagate_on_container_swap<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2266",
   "self_type" : "type-2266",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__133__has_propagate_on_container_swapINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_swap<std::allocator<char>, void>",
   "name" : "std::__has_propagate_on_container_swap<std::allocator<char>, void>",
   "referenced_type" : "type-2263",
   "self_type" : "type-2263",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__133__has_propagate_on_container_swapINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_swap<std::allocator<wchar_t>, void>",
   "name" : "std::__has_propagate_on_container_swap<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2264",
   "self_type" : "type-2264",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__133__has_propagate_on_container_swapINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_size_type<std::allocator<char16_t>, void>",
   "name" : "std::__has_size_type<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2241",
   "self_type" : "type-2241",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__115__has_size_typeINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_size_type<std::allocator<char32_t>, void>",
   "name" : "std::__has_size_type<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2242",
   "self_type" : "type-2242",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__115__has_size_typeINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_size_type<std::allocator<char>, void>",
   "name" : "std::__has_size_type<std::allocator<char>, void>",
   "referenced_type" : "type-2239",
   "self_type" : "type-2239",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__115__has_size_typeINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__has_size_type<std::allocator<wchar_t>, void>",
   "name" : "std::__has_size_type<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2240",
   "self_type" : "type-2240",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__115__has_size_typeINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__has_storage_type<std::__bitset<0, 0> >",
   "name" : "std::__has_storage_type<std::__bitset<0, 0> >",
   "referenced_type" : "type-2885",
   "self_type" : "type-2885",
   "size" : 1,
   "source_file" : "/external/libcxx/include/bitset",
   "template_args" : [ "type-2879" ],
   "unique_id" : "_ZTSNSt3__118__has_storage_typeINS_8__bitsetILm0ELm0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_void_pointer<std::allocator<char16_t>, void>",
   "name" : "std::__has_void_pointer<std::allocator<char16_t>, void>",
   "referenced_type" : "type-2225",
   "self_type" : "type-2225",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__has_void_pointerINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_void_pointer<std::allocator<char32_t>, void>",
   "name" : "std::__has_void_pointer<std::allocator<char32_t>, void>",
   "referenced_type" : "type-2226",
   "self_type" : "type-2226",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__has_void_pointerINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_void_pointer<std::allocator<char>, void>",
   "name" : "std::__has_void_pointer<std::allocator<char>, void>",
   "referenced_type" : "type-2223",
   "self_type" : "type-2223",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__has_void_pointerINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__has_void_pointer<std::allocator<wchar_t>, void>",
   "name" : "std::__has_void_pointer<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-2224",
   "self_type" : "type-2224",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9" ],
   "unique_id" : "_ZTSNSt3__118__has_void_pointerINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__ignore_t<unsigned char>",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "type-2162",
   "self_type" : "type-2162",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__110__ignore_tIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__integer_sequence<unsigned long>",
   "name" : "std::__integer_sequence<unsigned long>",
   "referenced_type" : "type-1822",
   "self_type" : "type-1822",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__118__integer_sequenceImJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__invoke_void_return_wrapper<void>",
   "name" : "std::__invoke_void_return_wrapper<void>",
   "referenced_type" : "type-2150",
   "self_type" : "type-2150",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__128__invoke_void_return_wrapperIvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_allocator<std::allocator<char16_t>, void, void>",
   "name" : "std::__is_allocator<std::allocator<char16_t>, void, void>",
   "referenced_type" : "type-2349",
   "self_type" : "type-2349",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652", "type-9", "type-9" ],
   "unique_id" : "_ZTSNSt3__114__is_allocatorINS_9allocatorIDsEEvvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_allocator<std::allocator<char32_t>, void, void>",
   "name" : "std::__is_allocator<std::allocator<char32_t>, void, void>",
   "referenced_type" : "type-2350",
   "self_type" : "type-2350",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678", "type-9", "type-9" ],
   "unique_id" : "_ZTSNSt3__114__is_allocatorINS_9allocatorIDiEEvvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_allocator<std::allocator<char>, void, void>",
   "name" : "std::__is_allocator<std::allocator<char>, void, void>",
   "referenced_type" : "type-2347",
   "self_type" : "type-2347",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599", "type-9", "type-9" ],
   "unique_id" : "_ZTSNSt3__114__is_allocatorINS_9allocatorIcEEvvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_allocator<std::allocator<wchar_t>, void, void>",
   "name" : "std::__is_allocator<std::allocator<wchar_t>, void, void>",
   "referenced_type" : "type-2348",
   "self_type" : "type-2348",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626", "type-9", "type-9" ],
   "unique_id" : "_ZTSNSt3__114__is_allocatorINS_9allocatorIwEEvvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_always_equal<std::allocator<char16_t>, true>",
   "name" : "std::__is_always_equal<std::allocator<char16_t>, true>",
   "referenced_type" : "type-2277",
   "self_type" : "type-2277",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652" ],
   "unique_id" : "_ZTSNSt3__117__is_always_equalINS_9allocatorIDsEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_always_equal<std::allocator<char32_t>, true>",
   "name" : "std::__is_always_equal<std::allocator<char32_t>, true>",
   "referenced_type" : "type-2278",
   "self_type" : "type-2278",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678" ],
   "unique_id" : "_ZTSNSt3__117__is_always_equalINS_9allocatorIDiEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_always_equal<std::allocator<char>, true>",
   "name" : "std::__is_always_equal<std::allocator<char>, true>",
   "referenced_type" : "type-2275",
   "self_type" : "type-2275",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599" ],
   "unique_id" : "_ZTSNSt3__117__is_always_equalINS_9allocatorIcEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_always_equal<std::allocator<wchar_t>, true>",
   "name" : "std::__is_always_equal<std::allocator<wchar_t>, true>",
   "referenced_type" : "type-2276",
   "self_type" : "type-2276",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626" ],
   "unique_id" : "_ZTSNSt3__117__is_always_equalINS_9allocatorIwEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_assignable_imp<float &, float &&, false>",
   "name" : "std::__is_assignable_imp<float &, float &&, false>",
   "referenced_type" : "type-1345",
   "self_type" : "type-1345",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-884", "type-1346" ],
   "unique_id" : "_ZTSNSt3__119__is_assignable_impIRfOfLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_assignable_imp<int &, int &&, false>",
   "name" : "std::__is_assignable_imp<int &, int &&, false>",
   "referenced_type" : "type-1343",
   "self_type" : "type-1343",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-848", "type-1344" ],
   "unique_id" : "_ZTSNSt3__119__is_assignable_impIRiOiLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_assignable_imp<unsigned long &, const unsigned long &, false>",
   "name" : "std::__is_assignable_imp<unsigned long &, const unsigned long &, false>",
   "referenced_type" : "type-1347",
   "self_type" : "type-1347",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-569", "type-574" ],
   "unique_id" : "_ZTSNSt3__119__is_assignable_impIRmRKmLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_assignable_imp<unsigned long &, unsigned long &&, false>",
   "name" : "std::__is_assignable_imp<unsigned long &, unsigned long &&, false>",
   "referenced_type" : "type-1348",
   "self_type" : "type-1348",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-569", "type-1349" ],
   "unique_id" : "_ZTSNSt3__119__is_assignable_impIRmOmLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_construct::__nat",
   "name" : "std::__is_construct::__nat",
   "referenced_type" : "type-1360",
   "self_type" : "type-1360",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__is_construct5__natE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_default_allocator<std::allocator<char16_t> >",
   "name" : "std::__is_default_allocator<std::allocator<char16_t> >",
   "referenced_type" : "type-2289",
   "self_type" : "type-2289",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-652" ],
   "unique_id" : "_ZTSNSt3__122__is_default_allocatorINS_9allocatorIDsEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_default_allocator<std::allocator<char32_t> >",
   "name" : "std::__is_default_allocator<std::allocator<char32_t> >",
   "referenced_type" : "type-2290",
   "self_type" : "type-2290",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-678" ],
   "unique_id" : "_ZTSNSt3__122__is_default_allocatorINS_9allocatorIDiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_default_allocator<std::allocator<char> >",
   "name" : "std::__is_default_allocator<std::allocator<char> >",
   "referenced_type" : "type-2287",
   "self_type" : "type-2287",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-599" ],
   "unique_id" : "_ZTSNSt3__122__is_default_allocatorINS_9allocatorIcEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_default_allocator<std::allocator<wchar_t> >",
   "name" : "std::__is_default_allocator<std::allocator<wchar_t> >",
   "referenced_type" : "type-2288",
   "self_type" : "type-2288",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-626" ],
   "unique_id" : "_ZTSNSt3__122__is_default_allocatorINS_9allocatorIwEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3362"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<__int128>",
   "name" : "std::__is_nullptr_t<__int128>",
   "referenced_type" : "type-3384",
   "self_type" : "type-3384",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-690" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tInEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3367"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair<char *, void (*)(void *)> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair<char *, void (*)(void *)> >",
   "referenced_type" : "type-3392",
   "self_type" : "type-3392",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-706" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_17__compressed_pairIPcPFvPvEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3365"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair<unsigned char *, void (*)(void *)> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair<unsigned char *, void (*)(void *)> >",
   "referenced_type" : "type-3389",
   "self_type" : "type-3389",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-699" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_17__compressed_pairIPhPFvPvEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3369"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair<unsigned int *, void (*)(void *)> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair<unsigned int *, void (*)(void *)> >",
   "referenced_type" : "type-3395",
   "self_type" : "type-3395",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-712" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_17__compressed_pairIPjPFvPvEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3366"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<char *, 0, false> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<char *, 0, false> >",
   "referenced_type" : "type-3390",
   "self_type" : "type-3390",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-702" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemIPcLi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3377"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "referenced_type" : "type-3407",
   "self_type" : "type-3407",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-650" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3379"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "referenced_type" : "type-3411",
   "self_type" : "type-3411",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-676" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3373"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "referenced_type" : "type-3399",
   "self_type" : "type-3399",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-597" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3375"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "referenced_type" : "type-3403",
   "self_type" : "type-3403",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-624" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3376"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "referenced_type" : "type-3406",
   "self_type" : "type-3406",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-635" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3378"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "referenced_type" : "type-3410",
   "self_type" : "type-3410",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-661" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3372"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "referenced_type" : "type-3398",
   "self_type" : "type-3398",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-583" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3374"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "referenced_type" : "type-3402",
   "self_type" : "type-3402",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-609" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3363"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "referenced_type" : "type-3385",
   "self_type" : "type-3385",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-692" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemIPhLi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3368"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "referenced_type" : "type-3393",
   "self_type" : "type-3393",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-709" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemIPjLi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3364"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<const std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "referenced_type" : "type-3386",
   "self_type" : "type-3386",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-695" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3361"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<long double>",
   "name" : "std::__is_nullptr_t<long double>",
   "referenced_type" : "type-3383",
   "self_type" : "type-3383",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3359"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<long long>",
   "name" : "std::__is_nullptr_t<long long>",
   "referenced_type" : "type-3381",
   "self_type" : "type-3381",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3360"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<long>",
   "name" : "std::__is_nullptr_t<long>",
   "referenced_type" : "type-3382",
   "self_type" : "type-3382",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3366"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<char *, 0, false> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<char *, 0, false> >",
   "referenced_type" : "type-3391",
   "self_type" : "type-3391",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-703" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemIPcLi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3377"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "referenced_type" : "type-3409",
   "self_type" : "type-3409",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-651" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3379"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "referenced_type" : "type-3413",
   "self_type" : "type-3413",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-677" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3373"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "referenced_type" : "type-3401",
   "self_type" : "type-3401",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-598" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3375"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "referenced_type" : "type-3405",
   "self_type" : "type-3405",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-625" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3376"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "referenced_type" : "type-3408",
   "self_type" : "type-3408",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-636" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3378"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "referenced_type" : "type-3412",
   "self_type" : "type-3412",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-662" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3372"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "referenced_type" : "type-3400",
   "self_type" : "type-3400",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-584" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3374"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "referenced_type" : "type-3404",
   "self_type" : "type-3404",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3363"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<unsigned char *, 0, false> >",
   "referenced_type" : "type-3387",
   "self_type" : "type-3387",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-693" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemIPhLi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3368"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<unsigned int *, 0, false> >",
   "referenced_type" : "type-3394",
   "self_type" : "type-3394",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-561" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemIPjLi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3364"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<void (*)(void *), 1, false> >",
   "referenced_type" : "type-3388",
   "self_type" : "type-3388",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-563" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_22__compressed_pair_elemIPFvPvELi1ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3371"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::pair<unsigned long, unsigned long> >",
   "name" : "std::__is_nullptr_t<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-3397",
   "self_type" : "type-3397",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-578" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3370"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<unsigned long>",
   "name" : "std::__is_nullptr_t<unsigned long>",
   "referenced_type" : "type-3396",
   "self_type" : "type-3396",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<__int128>",
   "name" : "std::__is_nullptr_t_impl<__int128>",
   "referenced_type" : "type-3362",
   "self_type" : "type-3362",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-690" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implInEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<long double>",
   "name" : "std::__is_nullptr_t_impl<long double>",
   "referenced_type" : "type-3361",
   "self_type" : "type-3361",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<long long>",
   "name" : "std::__is_nullptr_t_impl<long long>",
   "referenced_type" : "type-3359",
   "self_type" : "type-3359",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<long>",
   "name" : "std::__is_nullptr_t_impl<long>",
   "referenced_type" : "type-3360",
   "self_type" : "type-3360",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<nullptr_t>",
   "name" : "std::__is_nullptr_t_impl<nullptr_t>",
   "referenced_type" : "type-3380",
   "self_type" : "type-3380",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-776" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implIDnEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair<char *, void (*)(void *)> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair<char *, void (*)(void *)> >",
   "referenced_type" : "type-3367",
   "self_type" : "type-3367",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-707" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_17__compressed_pairIPcPFvPvEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair<unsigned char *, void (*)(void *)> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair<unsigned char *, void (*)(void *)> >",
   "referenced_type" : "type-3365",
   "self_type" : "type-3365",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-700" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_17__compressed_pairIPhPFvPvEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair<unsigned int *, void (*)(void *)> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair<unsigned int *, void (*)(void *)> >",
   "referenced_type" : "type-3369",
   "self_type" : "type-3369",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-560" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_17__compressed_pairIPjPFvPvEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<char *, 0, false> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<char *, 0, false> >",
   "referenced_type" : "type-3366",
   "self_type" : "type-3366",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-703" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemIPcLi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> >",
   "referenced_type" : "type-3377",
   "self_type" : "type-3377",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-651" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> >",
   "referenced_type" : "type-3379",
   "self_type" : "type-3379",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-677" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::allocator<char>, 1, true> >",
   "referenced_type" : "type-3373",
   "self_type" : "type-3373",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-598" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> >",
   "referenced_type" : "type-3375",
   "self_type" : "type-3375",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-625" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false> >",
   "referenced_type" : "type-3376",
   "self_type" : "type-3376",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-636" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false> >",
   "referenced_type" : "type-3378",
   "self_type" : "type-3378",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-662" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false> >",
   "referenced_type" : "type-3372",
   "self_type" : "type-3372",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-584" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "name" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false> >",
   "referenced_type" : "type-3374",
   "self_type" : "type-3374",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::__compressed_pair_elem<unsigned char *, 0, false> >",
