{
 "array_types" :
 [
  {
   "alignment" : 16,
   "linker_set_key" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:129:14) [129] at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:129:14",
   "name" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:129:14) [129] at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:129:14",
   "referenced_type" : "type-1222",
   "self_type" : "type-1221",
   "size" : 4128,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:289:14) [129] at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:289:14",
   "name" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:289:14) [129] at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:289:14",
   "referenced_type" : "type-1225",
   "self_type" : "type-1224",
   "size" : 1032,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c"
  },
  {
   "alignment" : 16,
   "linker_set_key" : "(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h:83:14) [128] at bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h:83:14",
   "name" : "(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h:83:14) [128] at bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h:83:14",
   "referenced_type" : "type-699",

   "is_const" : true,
   "linker_set_key" : "double const[6]",
   "name" : "double const[6]",
   "referenced_type" : "type-33",
   "self_type" : "type-34",
   "size" : 48,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_j0.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "double const[8]",
   "name" : "double const[8]",
   "referenced_type" : "type-54",
   "self_type" : "type-55",
   "size" : 64,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_rem_pio2.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "float const[128]",
   "name" : "float const[128]",
   "referenced_type" : "type-1219",
   "self_type" : "type-1220",
   "size" : 512,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/s_exp2l.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "float const[2]",
   "name" : "float const[2]",
   "referenced_type" : "type-29",
   "self_type" : "type-28",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_fmodf.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "float const[4]",
   "name" : "float const[4]",
   "referenced_type" : "type-70",
   "self_type" : "type-71",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_atanf.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "float const[5]",
   "name" : "float const[5]",
   "referenced_type" : "type-42",
   "self_type" : "type-43",
   "size" : 20,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_j0f.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "float const[6]",
   "name" : "float const[6]",
   "referenced_type" : "type-40",
   "self_type" : "type-41",
   "size" : 24,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_j0f.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[4]",
   "name" : "int const[4]",
   "referenced_type" : "type-50",
   "self_type" : "type-51",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_rem_pio2.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[690]",
   "name" : "int const[690]",
   "referenced_type" : "type-52",
   "self_type" : "type-53",
   "size" : 2760,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_rem_pio2.c"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "long double const[128]",
   "name" : "long double const[128]",
   "referenced_type" : "type-1217",
   "self_type" : "type-1218",
   "size" : 2048,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/s_exp2l.c"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "long double const[24]",
   "name" : "long double const[24]",
   "referenced_type" : "type-1132",
   "self_type" : "type-1133",
   "size" : 384,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/invtrig.c"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "long double const[2]",
   "name" : "long double const[2]",
   "referenced_type" : "type-76",
   "self_type" : "type-696",
   "size" : 32,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_fmodl.c"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "long double const[4]",
   "name" : "long double const[4]",
   "referenced_type" : "type-1130",
   "self_type" : "type-1131",
   "size" : 64,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/invtrig.c"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "long double const[5]",
   "name" : "long double const[5]",
   "referenced_type" : "type-1134",
   "self_type" : "type-1135",
   "size" : 80,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/e_powl.c"
  },
  {
   "is_const" : true,
   "linker_set_key" : "long double const[]",
   "name" : "long double const[]",
   "referenced_type" : "type-693",
   "self_type" : "type-694",
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/invtrig.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "sincos_t const[2]",
   "name" : "sincos_t const[2]",
   "referenced_type" : "type-1268",
   "self_type" : "type-1269",
   "size" : 224,
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "unsigned int const[24]",
   "name" : "unsigned int const[24]",
   "referenced_type" : "type-1554",
   "self_type" : "type-1555",
   "size" : 96,
   "source_file" : "/external/arm-optimized-routines/math/sincosf_data.c"
  },
  {
   "is_const" : true,
   "linker_set_key" : "unsigned int const[]",
   "name" : "unsigned int const[]",
   "referenced_type" : "type-1270",
   "self_type" : "type-1271",
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "volatile double",
   "name" : "volatile double",
   "referenced_type" : "type-6",
   "self_type" : "type-5",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_acos.c"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile float",
   "name" : "volatile float",
   "referenced_type" : "type-11",
   "self_type" : "type-10",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_acosf.c"
  },
  {
   "alignment" : 16,
   "is_volatile" : true,
   "linker_set_key" : "volatile long double",
   "name" : "volatile long double",
   "referenced_type" : "type-17",
   "self_type" : "type-695",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_atan2l.c"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "G",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "F_hi",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "F_lo",
     "field_offset" : 128,
     "referenced_type" : "type-17"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:129:14) at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:129:14",
   "name" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:129:14) at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:129:14",
   "referenced_type" : "type-1222",
   "self_type" : "type-1222",
   "size" : 32,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c",
   "unique_id" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:129:14)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "H",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "E",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:289:14) at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:289:14",
   "name" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:289:14) at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:289:14",
   "referenced_type" : "type-1225",
   "self_type" : "type-1225",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c",
   "unique_id" : "(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c:289:14)"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "hi",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "lo",
     "field_offset" : 128,
     "referenced_type" : "type-17"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h:83:14) at bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h:83:14",
   "name" : "(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h:83:14) at bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h:83:14",
   "referenced_type" : "type-699",
   "self_type" : "type-699",
   "size" : 32,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h",
   "unique_id" : "(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/k_expl.h:83:14)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "Double",
   "name" : "Double",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/bsdsrc/mathimpl.h",
   "unique_id" : "Double"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-683"
    }
   ],
   "linker_set_key" : "IEEEd2bits",
   "name" : "IEEEd2bits",
   "record_kind" : "union",
   "referenced_type" : "type-682",
   "self_type" : "type-682",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTS10IEEEd2bits"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "IEEEd2bits",
   "name" : "IEEEd2bits",
   "record_kind" : "union",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEd2bits"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "manh",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "exp",
     "field_offset" : 52,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sign",
     "field_offset" : 63,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3) at bionic/libm/fpmath.h:54:3",
   "name" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3) at bionic/libm/fpmath.h:54:3",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTSN10IEEEd2bitsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "manh",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "exp",
     "field_offset" : 52,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sign",
     "field_offset" : 63,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3) at bionic/libm/fpmath.h:54:3",
   "name" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3) at bionic/libm/fpmath.h:54:3",
   "referenced_type" : "type-85",
   "self_type" : "type-85",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-689"
    }
   ],
   "linker_set_key" : "IEEEf2bits",
   "name" : "IEEEf2bits",
   "record_kind" : "union",
   "referenced_type" : "type-688",
   "self_type" : "type-688",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTS10IEEEf2bits"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "IEEEf2bits",
   "name" : "IEEEf2bits",
   "record_kind" : "union",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEf2bits"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "man",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "exp",
     "field_offset" : 23,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sign",
     "field_offset" : 31,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3) at bionic/libm/fpmath.h:42:3",
   "name" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3) at bionic/libm/fpmath.h:42:3",
   "referenced_type" : "type-689",
   "self_type" : "type-689",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTSN10IEEEf2bitsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "man",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "exp",
     "field_offset" : 23,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sign",
     "field_offset" : 31,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3) at bionic/libm/fpmath.h:42:3",
   "name" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3) at bionic/libm/fpmath.h:42:3",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3)"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "e",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "xbits",
     "referenced_type" : "type-686"
    }
   ],
   "linker_set_key" : "IEEEl2bits",
   "name" : "IEEEl2bits",
   "record_kind" : "union",
   "referenced_type" : "type-684",
   "self_type" : "type-684",
   "size" : 16,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTS10IEEEl2bits"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "e",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "xbits",
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "IEEEl2bits",
   "name" : "IEEEl2bits",
   "record_kind" : "union",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 16,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEl2bits"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "manh",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "exp",
     "field_offset" : 112,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sign",
     "field_offset" : 127,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:66:3) at bionic/libm/fpmath.h:66:3",
   "name" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:66:3) at bionic/libm/fpmath.h:66:3",
   "referenced_type" : "type-685",
   "self_type" : "type-685",
   "size" : 16,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTSN10IEEEl2bitsUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "manh",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "exp",
     "field_offset" : 112,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sign",
     "field_offset" : 127,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:66:3) at bionic/libm/fpmath.h:66:3",
   "name" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:66:3) at bionic/libm/fpmath.h:66:3",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 16,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:66:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "manh",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "expsign",
     "field_offset" : 112,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:72:3) at bionic/libm/fpmath.h:72:3",
   "name" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:72:3) at bionic/libm/fpmath.h:72:3",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 16,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "_ZTSN10IEEEl2bitsUt0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "manh",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "expsign",
     "field_offset" : 112,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:72:3) at bionic/libm/fpmath.h:72:3",
   "name" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:72:3) at bionic/libm/fpmath.h:72:3",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 16,
   "source_file" : "/bionic/libm/fpmath.h",
   "unique_id" : "IEEEl2bits::(anonymous struct at bionic/libm/fpmath.h:72:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "__kernel_fsid_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "hi",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "lo",
     "field_offset" : 128,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "dd",
   "name" : "dd",
   "referenced_type" : "type-702",
   "self_type" : "type-702",
   "size" : 32,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_fmal.c",
   "unique_id" : "dd"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "double_complex",
   "name" : "double_complex",
   "record_kind" : "union",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "double_complex"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-1254"
    },
    {
     "field_name" : "shift_scaled",
     "field_offset" : 2048,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "type-1236"
    },
    {
     "field_name" : "shift",
     "field_offset" : 2304,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "invln2_scaled",
     "field_offset" : 2368,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "poly_scaled",
     "field_offset" : 2432,
     "referenced_type" : "type-1236"
    }
   ],
   "linker_set_key" : "exp2f_data",
   "name" : "exp2f_data",
   "referenced_type" : "type-1253",
   "self_type" : "type-1253",
   "size" : 328,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "exp2f_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invln2N",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "shift",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "negln2hiN",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "negln2loN",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "poly",
     "field_offset" : 256,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "exp2_shift",
     "field_offset" : 512,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "exp2_poly",
     "field_offset" : 576,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "tab",
     "field_offset" : 896,
     "referenced_type" : "type-1247"
    }
   ],
   "linker_set_key" : "exp_data",
   "name" : "exp_data",
   "referenced_type" : "type-1246",
   "self_type" : "type-1246",
   "size" : 2160,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "exp_data"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__control",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "__status",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "fenv_t",
   "name" : "fenv_t",
   "referenced_type" : "type-262",
   "self_type" : "type-262",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/fenv_arm.h",
   "unique_id" : "fenv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "float_complex",
   "name" : "float_complex",
   "record_kind" : "union",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "float_complex"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "parts",
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "xparts",
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "ieee_double_shape_type",
   "name" : "ieee_double_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "msw",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3",
   "name" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "w",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3",
   "name" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "msw",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:115:3) at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:115:3",
   "name" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:115:3) at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:115:3",
   "referenced_type" : "type-1230",
   "self_type" : "type-1230",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:115:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "w",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:120:3) at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:120:3",
   "name" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:120:3) at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:120:3",
   "referenced_type" : "type-1231",
   "self_type" : "type-1231",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:120:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "msw",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3",
   "name" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:115:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "w",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3",
   "name" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_double_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:120:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "word",
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "ieee_float_shape_type",
   "name" : "ieee_float_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_float_shape_type"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "parts32",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "parts64",
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "ieee_quad_shape_type",
   "name" : "ieee_quad_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lswlo",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "lswhi",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mswlo",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mswhi",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "msw",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3) at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lswlo",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "lswhi",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mswlo",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mswhi",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:78:3) at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:78:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:78:3) at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:78:3",
   "referenced_type" : "type-1228",
   "self_type" : "type-1228",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:78:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "msw",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:84:3) at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:84:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:84:3) at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:84:3",
   "referenced_type" : "type-1229",
   "self_type" : "type-1229",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/ld128/../src/math_private.h:84:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lswlo",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "lswhi",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mswlo",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mswhi",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:78:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "msw",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3",
   "name" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3) at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "ieee_quad_shape_type::(anonymous struct at bionic/libm/upstream-freebsd/lib/msun/src/math_private.h:84:3)"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "hi",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "lo",
     "field_offset" : 128,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "lo_set",
     "field_offset" : 256,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "ld",
   "name" : "ld",
   "referenced_type" : "type-1227",
   "self_type" : "type-1227",
   "size" : 48,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/ld128/s_logl.c",
   "unique_id" : "ld"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invln2hi",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "invln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 512,
     "referenced_type" : "type-1258"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "type-1259"
    }
   ],
   "linker_set_key" : "log2_data",
   "name" : "log2_data",
   "referenced_type" : "type-1256",
   "self_type" : "type-1256",
   "size" : 1168,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log2_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:388:3) at /external/arm-optimized-routines/math/math_config.h:388:3",
   "name" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:388:3) at /external/arm-optimized-routines/math/math_config.h:388:3",
   "referenced_type" : "type-1260",
   "self_type" : "type-1260",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:388:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-1238"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "type-66"
    }
   ],
   "linker_set_key" : "log2f_data",
   "name" : "log2f_data",
   "referenced_type" : "type-1237",
   "self_type" : "type-1237",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log2f_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log2f_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:317:3) at /external/arm-optimized-routines/math/math_config.h:317:3",
   "name" : "log2f_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:317:3) at /external/arm-optimized-routines/math/math_config.h:317:3",
   "referenced_type" : "type-1239",
   "self_type" : "type-1239",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log2f_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:317:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 448,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "type-1250"
    }
   ],
   "linker_set_key" : "log_data",
   "name" : "log_data",
   "referenced_type" : "type-1249",
   "self_type" : "type-1249",
   "size" : 2192,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:373:3) at /external/arm-optimized-routines/math/math_config.h:373:3",
   "name" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:373:3) at /external/arm-optimized-routines/math/math_config.h:373:3",
   "referenced_type" : "type-1251",
   "self_type" : "type-1251",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:373:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-1233"
    },
    {
     "field_name" : "ln2",
     "field_offset" : 2048,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "type-1236"
    }
   ],
   "linker_set_key" : "logf_data",
   "name" : "logf_data",
   "referenced_type" : "type-1235",
   "self_type" : "type-1235",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "logf_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "logf_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:305:3) at /external/arm-optimized-routines/math/math_config.h:305:3",
   "name" : "logf_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:305:3) at /external/arm-optimized-routines/math/math_config.h:305:3",
   "referenced_type" : "type-1232",
   "self_type" : "type-1232",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "logf_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:305:3)"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "long_double_complex",
   "name" : "long_double_complex",
   "record_kind" : "union",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 32,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h",
   "unique_id" : "long_double_complex"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-261"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-687",
   "self_type" : "type-687",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-1263"
    },
    {
     "field_name" : "tab",
     "field_offset" : 576,
     "referenced_type" : "type-1264"
    }
   ],
   "linker_set_key" : "pow_log_data",
   "name" : "pow_log_data",
   "referenced_type" : "type-1262",
   "self_type" : "type-1262",
   "size" : 4168,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "pow_log_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pad",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "logc",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "logctail",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3) at /external/arm-optimized-routines/math/math_config.h:402:3",
   "name" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3) at /external/arm-optimized-routines/math/math_config.h:402:3",
   "referenced_type" : "type-1265",
   "self_type" : "type-1265",
   "size" : 32,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-1242"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "powf_log2_data",
   "name" : "powf_log2_data",
   "referenced_type" : "type-1241",
   "self_type" : "type-1241",
   "size" : 296,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "powf_log2_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "powf_log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:334:3) at /external/arm-optimized-routines/math/math_config.h:334:3",
   "name" : "powf_log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:334:3) at /external/arm-optimized-routines/math/math_config.h:334:3",
   "referenced_type" : "type-1243",
   "self_type" : "type-1243",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h",
   "unique_id" : "powf_log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:334:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 56,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_attr_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-86",
   "self_type" : "type-86",
   "size" : 48,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 56,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_rwlock_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_spinlock_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sign",
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "hpi_inv",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "hpi",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "c0",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "c1",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "c2",
     "field_offset" : 512,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "c3",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "c4",
     "field_offset" : 640,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "s1",
     "field_offset" : 704,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "s2",
     "field_offset" : 768,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "s3",
     "field_offset" : 832,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "sincos_t",
   "name" : "sincos_t",
   "referenced_type" : "type-1267",
   "self_type" : "type-1267",
   "size" : 112,
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h",
   "unique_id" : "sincos_t"
  }
 ],
 "rvalue_reference_types" : []
}
