{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",

   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIjNS_9allocatorIjEEEEEE",
   "name" : "const std::optional<std::vector<unsigned int, std::allocator<unsigned int> > >",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIjNS_9allocatorIjEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIjNS_9allocatorIjEEEEEE",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "name" : "const std::optional<std::vector<long, std::allocator<long> > >",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long, std::allocator<unsigned long> > >",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_interface_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelvXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusvXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakvXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiiXadL_Z5closeEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientvXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakvXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, void, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakvXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakvXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP13AIBinder_Weak", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientvXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, void, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientvXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientvXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP23AIBinder_DeathRecipient", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelvXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, void, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelvXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelvXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AParcel", "_ZTIv" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusvXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, void, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusvXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusvXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIP7AStatus", "_ZTIv" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIiiXadL_Z5closeEELin1EEE",
   "name" : "ndk::impl::ScopedAResource<int, int, &close, -1>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiiXadL_Z5closeEELin1EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIiiXadL_Z5closeEELin1EEE",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h",
   "template_args" : [ "_ZTIi", "_ZTIi" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds",
     "referenced_type" : "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE"
    },
    {
     "field_name" : "ints",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "name" : "aidl::android::hardware::common::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "self_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "size" : 48,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/common/aidl/android.hardware.common-ndk_platform-source/gen/include/aidl/android/hardware/common/NativeHandle.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "components",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware8graphics6common20PlaneLayoutComponentENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "offsetInBytes",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "sampleIncrementInBits",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "strideInBytes",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "widthInSamples",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "heightInSamples",
     "field_offset" : 448,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "totalSizeInBytes",
     "field_offset" : 512,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "horizontalSubsampling",
     "field_offset" : 576,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "verticalSubsampling",
     "field_offset" : 640,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common11PlaneLayoutE",
   "name" : "aidl::android::hardware::graphics::common::PlaneLayout",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PlaneLayoutE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common11PlaneLayoutE",
   "size" : 88,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/PlaneLayout.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "value",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common14ExtendableTypeE",
   "name" : "aidl::android::hardware::graphics::common::ExtendableType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common14ExtendableTypeE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common14ExtendableTypeE",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/ExtendableType.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "description",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common25HardwareBufferDescriptionE"
    },
    {
     "field_name" : "handle",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common14HardwareBufferE",
   "name" : "aidl::android::hardware::graphics::common::HardwareBuffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common14HardwareBufferE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common14HardwareBufferE",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/HardwareBuffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common14ExtendableTypeE"
    },
    {
     "field_name" : "offsetInBits",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "sizeInBits",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common20PlaneLayoutComponentE",
   "name" : "aidl::android::hardware::graphics::common::PlaneLayoutComponent",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common20PlaneLayoutComponentE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common20PlaneLayoutComponentE",
   "size" : 48,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/PlaneLayoutComponent.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PixelFormatE"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11BufferUsageE"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common25HardwareBufferDescriptionE",
   "name" : "aidl::android::hardware::graphics::common::HardwareBufferDescription",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common25HardwareBufferDescriptionE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common25HardwareBufferDescriptionE",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/HardwareBufferDescription.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common4RectE",
   "name" : "aidl::android::hardware::graphics::common::Rect",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common4RectE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common4RectE",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/Rect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common7XyColorE",
   "name" : "aidl::android::hardware::graphics::common::XyColor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common7XyColorE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common7XyColorE",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/XyColor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common8Cta861_3E",
   "name" : "aidl::android::hardware::graphics::common::Cta861_3",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common8Cta861_3E",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common8Cta861_3E",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/Cta861_3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "primaryRed",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common7XyColorE"
    },
    {
     "field_name" : "primaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common7XyColorE"
    },
    {
     "field_name" : "primaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common7XyColorE"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common7XyColorE"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common9Smpte2086E",
   "name" : "aidl::android::hardware::graphics::common::Smpte2086",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9Smpte2086E",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common9Smpte2086E",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-ndk_platform-source/gen/include/aidl/android/hardware/graphics/common/Smpte2086.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel &&",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTION3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus &&",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTION3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak &&",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTION3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor &&",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTION3ndk20ScopedFileDescriptorE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient &&",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTION3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/ndk/include_ndk/android/binder_auto_utils.h"
  }
 ]
}
