{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "linker_set_key" : "_ZTIs",
   "name" : "short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIs",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" :
 [
  {
   "name" : "Curl_HMAC_final"
  },
  {
   "name" : "Curl_HMAC_init"
  },
  {
   "name" : "Curl_HMAC_update"
  },
  {
   "name" : "Curl_MD5_final"
  },
  {

   "referenced_type" : "_ZTIFiPvliE",
   "self_type" : "_ZTIPFiPvliE",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFmPcmmPvE",
   "name" : "unsigned long (*)(char *, unsigned long, unsigned long, void *)",
   "referenced_type" : "_ZTIFmPcmmPvE",
   "self_type" : "_ZTIPFmPcmmPvE",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFmPvPKcmE",
   "name" : "unsigned long (*)(void *, const char *, unsigned long)",
   "referenced_type" : "_ZTIFmPvPKcmE",
   "self_type" : "_ZTIPFmPvPKcmE",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPFvPvE",
   "name" : "void (*)(void *)",
   "referenced_type" : "_ZTIFvPvE",
   "self_type" : "_ZTIPFvPvE",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK16curl_ssl_backend",
   "name" : "const curl_ssl_backend *",
   "referenced_type" : "_ZTIK16curl_ssl_backend",
   "self_type" : "_ZTIPK16curl_ssl_backend",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKPKc",
   "name" : "const char *const *",
   "referenced_type" : "_ZTIKPKc",
   "self_type" : "_ZTIPKPKc",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKl",
   "name" : "const long *",
   "referenced_type" : "_ZTIKl",
   "self_type" : "_ZTIPKl",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/easy.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP10curl_slist",
   "name" : "curl_slist **",
   "referenced_type" : "_ZTIP10curl_slist",
   "self_type" : "_ZTIPP10curl_slist",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP13curl_httppost",
   "name" : "curl_httppost **",
   "referenced_type" : "_ZTIP13curl_httppost",
   "self_type" : "_ZTIPP13curl_httppost",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPK16curl_ssl_backend",
   "name" : "const curl_ssl_backend **",
   "referenced_type" : "_ZTIPK16curl_ssl_backend",
   "self_type" : "_ZTIPPK16curl_ssl_backend",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPPK16curl_ssl_backend",
   "name" : "const curl_ssl_backend ***",
   "referenced_type" : "_ZTIPPK16curl_ssl_backend",
   "self_type" : "_ZTIPPPK16curl_ssl_backend",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIPPc",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/urlapi.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPl",
   "name" : "long *",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIPl",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/easy.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK16curl_ssl_backend",
   "name" : "const curl_ssl_backend",
   "referenced_type" : "_ZTI16curl_ssl_backend",
   "self_type" : "_ZTIK16curl_ssl_backend",
   "size" : 16,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/external/curl/include/curl/easy.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "option",
     "referenced_type" : "_ZTI14CURLformoption"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI10curl_forms",
   "name" : "curl_forms",
   "referenced_type" : "_ZTI10curl_forms",
   "self_type" : "_ZTI10curl_forms",
   "size" : 16,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keytype",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11curl_khtype"
    }
   ],
   "linker_set_key" : "_ZTI10curl_khkey",
   "name" : "curl_khkey",
   "referenced_type" : "_ZTI10curl_khkey",
   "self_type" : "_ZTI10curl_khkey",
   "size" : 24,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP10curl_slist"
    }
   ],
   "linker_set_key" : "_ZTI10curl_slist",
   "name" : "curl_slist",
   "referenced_type" : "_ZTI10curl_slist",
   "self_type" : "_ZTI10curl_slist",
   "size" : 16,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "events",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "revents",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI11curl_waitfd",
   "name" : "curl_waitfd",
   "referenced_type" : "_ZTI11curl_waitfd",
   "self_type" : "_ZTI11curl_waitfd",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num_of_certs",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "certinfo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP10curl_slist"
    }
   ],
   "linker_set_key" : "_ZTI13curl_certinfo",
   "name" : "curl_certinfo",
   "referenced_type" : "_ZTI13curl_certinfo",
   "self_type" : "_ZTI13curl_certinfo",
   "size" : 16,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "filename",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "filetype",
     "field_offset" : 64,
     "referenced_type" : "_ZTI12curlfiletype"
    },
    {
     "field_name" : "time",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "perm",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "gid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "hardlinks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "strings",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN13curl_fileinfoUt_E"
    },
    {
     "field_name" : "flags",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "b_data",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "b_size",
     "field_offset" : 896,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "b_used",
     "field_offset" : 960,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI13curl_fileinfo",
   "name" : "curl_fileinfo",
   "referenced_type" : "_ZTI13curl_fileinfo",
   "self_type" : "_ZTI13curl_fileinfo",
   "size" : 128,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP13curl_httppost"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "namelength",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "contents",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "contentslength",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "bufferlength",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "contenttype",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "contentheader",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP10curl_slist"
    },
    {
     "field_name" : "more",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP13curl_httppost"
    },
    {
     "field_name" : "flags",
     "field_offset" : 640,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "showfilename",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "userp",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "contentlen",
     "field_offset" : 832,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI13curl_httppost",
   "name" : "curl_httppost",
   "referenced_type" : "_ZTI13curl_httppost",
   "self_type" : "_ZTI13curl_httppost",
   "size" : 112,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "family",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "socktype",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "protocol",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "addrlen",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "addr",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sockaddr"
    }
   ],
   "linker_set_key" : "_ZTI13curl_sockaddr",
   "name" : "curl_sockaddr",
   "referenced_type" : "_ZTI13curl_sockaddr",
   "self_type" : "_ZTI13curl_sockaddr",
   "size" : 32,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTI15curl_sslbackend"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI16curl_ssl_backend",
   "name" : "curl_ssl_backend",
   "referenced_type" : "_ZTI16curl_ssl_backend",
   "self_type" : "_ZTI16curl_ssl_backend",
   "size" : 16,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "backend",
     "referenced_type" : "_ZTI15curl_sslbackend"
    },
    {
     "field_name" : "internals",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19curl_tlssessioninfo",
   "name" : "curl_tlssessioninfo",
   "referenced_type" : "_ZTI19curl_tlssessioninfo",
   "self_type" : "_ZTI19curl_tlssessioninfo",
   "size" : 16,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "age",
     "referenced_type" : "_ZTI11CURLversion"
    },
    {
     "field_name" : "version",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "version_num",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "host",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "features",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssl_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "ssl_version_num",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "libz_version",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "protocols",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPKPKc"
    },
    {
     "field_name" : "ares",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "ares_num",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "libidn",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "iconv_ver_num",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "libssh_version",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "brotli_ver_num",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "brotli_version",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "nghttp2_ver_num",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nghttp2_version",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "quic_version",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI22curl_version_info_data",
   "name" : "curl_version_info_data",
   "referenced_type" : "_ZTI22curl_version_info_data",
   "self_type" : "_ZTI22curl_version_info_data",
   "size" : 152,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "msg",
     "referenced_type" : "_ZTI7CURLMSG"
    },
    {
     "field_name" : "easy_handle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9Curl_easy"
    },
    {
     "field_name" : "data",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7CURLMsgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7CURLMsg",
   "name" : "CURLMsg",
   "referenced_type" : "_ZTI7CURLMsg",
   "self_type" : "_ZTI7CURLMsg",
   "size" : 24,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "time",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "perm",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "user",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "group",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "target",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN13curl_fileinfoUt_E",
   "name" : "curl_fileinfo::(anonymous struct at external/curl/include/curl/curl.h:298:3)",
   "referenced_type" : "_ZTIN13curl_fileinfoUt_E",
   "self_type" : "_ZTIN13curl_fileinfoUt_E",
   "size" : 40,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "whatever",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "result",
     "referenced_type" : "_ZTI8CURLcode"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7CURLMsgUt_E",
   "name" : "CURLMsg::(anonymous union at external/curl/include/curl/multi.h:98:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7CURLMsgUt_E",
   "self_type" : "_ZTIN7CURLMsgUt_E",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/multi.h"
  }
 ],
 "rvalue_reference_types" : []
}
