{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_h",
   "name" : "unsigned char [128]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA128_h",
   "size" : 128,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA16_21OMX_AUDIO_CHANNELTYPE",
   "name" : "OMX_AUDIO_CHANNELTYPE [16]",
   "referenced_type" : "_ZTI21OMX_AUDIO_CHANNELTYPE",
   "self_type" : "_ZTIA16_21OMX_AUDIO_CHANNELTYPE",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char [16]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA16_c",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/OMXMaster.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA16_h",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",

   "self_type" : "_ZTIKNSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/1.0/OmxStore.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP17OMX_COMPONENTTYPE",
   "name" : "OMX_COMPONENTTYPE *const",
   "referenced_type" : "_ZTIP17OMX_COMPONENTTYPE",
   "self_type" : "_ZTIKP17OMX_COMPONENTTYPE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP20OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE *const",
   "referenced_type" : "_ZTIP20OMX_BUFFERHEADERTYPE",
   "self_type" : "_ZTIKP20OMX_BUFFERHEADERTYPE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android13OMXPluginBaseE",
   "name" : "android::OMXPluginBase *const",
   "referenced_type" : "_ZTIPN7android13OMXPluginBaseE",
   "self_type" : "_ZTIKPN7android13OMXPluginBaseE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android15OMXNodeInstanceE",
   "name" : "android::OMXNodeInstance *const",
   "referenced_type" : "_ZTIPN7android15OMXNodeInstanceE",
   "self_type" : "_ZTIKPN7android15OMXNodeInstanceE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVb",
   "name" : "volatile bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIVb",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hMarkTargetComponent",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12OMX_MARKTYPE",
   "name" : "OMX_MARKTYPE",
   "referenced_type" : "_ZTI12OMX_MARKTYPE",
   "self_type" : "_ZTI12OMX_MARKTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hMarkTargetComponent",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12OMX_MARKTYPE",
   "name" : "OMX_MARKTYPE",
   "referenced_type" : "_ZTI12OMX_MARKTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump",
   "self_type" : "_ZTI12OMX_MARKTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 80,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIN15OMX_VERSIONTYPEUt_E"
    },
    {
     "field_name" : "nVersion",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15OMX_VERSIONTYPE",
   "name" : "OMX_VERSIONTYPE",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15OMX_VERSIONTYPE",
   "self_type" : "_ZTI15OMX_VERSIONTYPE",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EventHandler",
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_13OMX_EVENTTYPEjjS0_E"
    },
    {
     "field_name" : "EmptyBufferDone",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_P20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "FillBufferDone",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvS0_P20OMX_BUFFERHEADERTYPEE"
    }
   ],
   "linker_set_key" : "_ZTI16OMX_CALLBACKTYPE",
   "name" : "OMX_CALLBACKTYPE",
   "referenced_type" : "_ZTI16OMX_CALLBACKTYPE",
   "self_type" : "_ZTI16OMX_CALLBACKTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EventHandler",
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjj13OMX_EVENTTYPEjjjE"
    },
    {
     "field_name" : "EmptyBufferDone",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjjP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "FillBufferDone",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjjP20OMX_BUFFERHEADERTYPEE"
    }
   ],
   "linker_set_key" : "_ZTI16OMX_CALLBACKTYPE",
   "name" : "OMX_CALLBACKTYPE",
   "referenced_type" : "_ZTI16OMX_CALLBACKTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump",
   "self_type" : "_ZTI16OMX_CALLBACKTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "pComponentPrivate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pApplicationPrivate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "GetComponentVersion",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPcP15OMX_VERSIONTYPES3_PA128_hE"
    },
    {
     "field_name" : "SendCommand",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv15OMX_COMMANDTYPEjS0_E"
    },
    {
     "field_name" : "GetParameter",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv13OMX_INDEXTYPES0_E"
    },
    {
     "field_name" : "SetParameter",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv13OMX_INDEXTYPES0_E"
    },
    {
     "field_name" : "GetConfig",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv13OMX_INDEXTYPES0_E"
    },
    {
     "field_name" : "SetConfig",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPv13OMX_INDEXTYPES0_E"
    },
    {
     "field_name" : "GetExtensionIndex",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPcP13OMX_INDEXTYPEE"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvP13OMX_STATETYPEE"
    },
    {
     "field_name" : "ComponentTunnelRequest",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvjS0_jP19OMX_TUNNELSETUPTYPEE"
    },
    {
     "field_name" : "UseBuffer",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPP20OMX_BUFFERHEADERTYPEjS0_jPhE"
    },
    {
     "field_name" : "AllocateBuffer",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPP20OMX_BUFFERHEADERTYPEjS0_jE"
    },
    {
     "field_name" : "FreeBuffer",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvjP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "EmptyThisBuffer",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "FillThisBuffer",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "SetCallbacks",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvP16OMX_CALLBACKTYPES0_E"
    },
    {
     "field_name" : "ComponentDeInit",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvE"
    },
    {
     "field_name" : "UseEGLImage",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPP20OMX_BUFFERHEADERTYPEjS0_S0_E"
    },
    {
     "field_name" : "ComponentRoleEnum",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvPhjE"
    }
   ],
   "linker_set_key" : "_ZTI17OMX_COMPONENTTYPE",
   "name" : "OMX_COMPONENTTYPE",
   "referenced_type" : "_ZTI17OMX_COMPONENTTYPE",
   "self_type" : "_ZTI17OMX_COMPONENTTYPE",
   "size" : 168,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "pComponentPrivate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pApplicationPrivate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "GetComponentVersion",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjjP15OMX_VERSIONTYPES1_PA128_hE"
    },
    {
     "field_name" : "SendCommand",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEj15OMX_COMMANDTYPEjjE"
    },
    {
     "field_name" : "GetParameter",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEj13OMX_INDEXTYPEjE"
    },
    {
     "field_name" : "SetParameter",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEj13OMX_INDEXTYPEjE"
    },
    {
     "field_name" : "GetConfig",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEj13OMX_INDEXTYPEjE"
    },
    {
     "field_name" : "SetConfig",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEj13OMX_INDEXTYPEjE"
    },
    {
     "field_name" : "GetExtensionIndex",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjjP13OMX_INDEXTYPEE"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjP13OMX_STATETYPEE"
    },
    {
     "field_name" : "ComponentTunnelRequest",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjjjjP19OMX_TUNNELSETUPTYPEE"
    },
    {
     "field_name" : "UseBuffer",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjPP20OMX_BUFFERHEADERTYPEjjjPhE"
    },
    {
     "field_name" : "AllocateBuffer",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjPP20OMX_BUFFERHEADERTYPEjjjE"
    },
    {
     "field_name" : "FreeBuffer",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjjP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "EmptyThisBuffer",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "FillThisBuffer",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjP20OMX_BUFFERHEADERTYPEE"
    },
    {
     "field_name" : "SetCallbacks",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjP16OMX_CALLBACKTYPEjE"
    },
    {
     "field_name" : "ComponentDeInit",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjE"
    },
    {
     "field_name" : "UseEGLImage",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjPP20OMX_BUFFERHEADERTYPEjjPvE"
    },
    {
     "field_name" : "ComponentRoleEnum",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjPhjE"
    }
   ],
   "linker_set_key" : "_ZTI17OMX_COMPONENTTYPE",
   "name" : "OMX_COMPONENTTYPE",
   "referenced_type" : "_ZTI17OMX_COMPONENTTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI17OMX_COMPONENTTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 160,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17OMX_FRAMESIZETYPE",
   "name" : "OMX_FRAMESIZETYPE",
   "referenced_type" : "_ZTI17OMX_FRAMESIZETYPE",
   "self_type" : "_ZTI17OMX_FRAMESIZETYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nU32",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17OMX_PARAM_U32TYPE",
   "name" : "OMX_PARAM_U32TYPE",
   "referenced_type" : "_ZTI17OMX_PARAM_U32TYPE",
   "self_type" : "_ZTI17OMX_PARAM_U32TYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 64,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLeft",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nTop",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "name" : "OMX_CONFIG_RECTTYPE",
   "referenced_type" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "self_type" : "_ZTI19OMX_CONFIG_RECTTYPE",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPorts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStartPortNumber",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "name" : "OMX_PORT_PARAM_TYPE",
   "referenced_type" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "self_type" : "_ZTI19OMX_PORT_PARAM_TYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTunnelFlags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSupplier",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22OMX_BUFFERSUPPLIERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "name" : "OMX_TUNNELSETUPTYPE",
   "referenced_type" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "self_type" : "_ZTI19OMX_TUNNELSETUPTYPE",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 16,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "nAllocLen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFilledLen",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pPlatformPrivate",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pInputPortPrivate",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pOutputPortPrivate",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "hMarkTargetComponent",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nTickCount",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeStamp",
     "field_offset" : 704,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nFlags",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOutputPortIndex",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nInputPortIndex",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE",
   "referenced_type" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "self_type" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "nAllocLen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFilledLen",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pPlatformPrivate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pInputPortPrivate",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pOutputPortPrivate",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hMarkTargetComponent",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTickCount",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeStamp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nFlags",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nOutputPortIndex",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nInputPortIndex",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE",
   "referenced_type" : "_ZTI20OMX_BUFFERHEADERTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump",
   "self_type" : "_ZTI20OMX_BUFFERHEADERTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGamma",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "name" : "OMX_CONFIG_GAMMATYPE",
   "referenced_type" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "self_type" : "_ZTI20OMX_CONFIG_GAMMATYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nX",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nY",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "name" : "OMX_CONFIG_POINTTYPE",
   "referenced_type" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "self_type" : "_ZTI20OMX_CONFIG_POINTTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nGroupPriority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGroupID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "name" : "OMX_PRIORITYMGMTTYPE",
   "referenced_type" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "self_type" : "_ZTI20OMX_PRIORITYMGMTTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eDither",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14OMX_DITHERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "name" : "OMX_CONFIG_DITHERTYPE",
   "referenced_type" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "self_type" : "_ZTI21OMX_CONFIG_DITHERTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMirror",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14OMX_MIRRORTYPE"
    }
   ],
   "linker_set_key" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "name" : "OMX_CONFIG_MIRRORTYPE",
   "referenced_type" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "self_type" : "_ZTI21OMX_CONFIG_MIRRORTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 48,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitsPerFrame",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSamplePerFrame",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCouplingQuantBits",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCouplingStartRegion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumRegions",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTI22OMX_AUDIO_RAFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_AUDIO_PARAM_RATYPE",
   "name" : "OMX_AUDIO_PARAM_RATYPE",
   "referenced_type" : "_ZTI22OMX_AUDIO_PARAM_RATYPE",
   "self_type" : "_ZTI22OMX_AUDIO_PARAM_RATYPE",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_CONFIG_BOOLEANTYPE",
   "name" : "OMX_CONFIG_BOOLEANTYPE",
   "referenced_type" : "_ZTI22OMX_CONFIG_BOOLEANTYPE",
   "self_type" : "_ZTI22OMX_CONFIG_BOOLEANTYPE",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eUnitType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16OMX_DATAUNITTYPE"
    },
    {
     "field_name" : "eEncapsulationType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI29OMX_DATAUNITENCAPSULATIONTYPE"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "name" : "OMX_PARAM_DATAUNITTYPE",
   "referenced_type" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "self_type" : "_ZTI22OMX_PARAM_DATAUNITTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nClientPrivate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eUpdateType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_TIME_UPDATETYPE"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nWallTimeAtMediaTime",
     "field_offset" : 256,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "eState",
     "field_offset" : 352,
     "referenced_type" : "_ZTI19OMX_TIME_CLOCKSTATE"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_TIME_MEDIATIMETYPE",
   "name" : "OMX_TIME_MEDIATIMETYPE",
   "referenced_type" : "_ZTI22OMX_TIME_MEDIATIMETYPE",
   "self_type" : "_ZTI22OMX_TIME_MEDIATIMETYPE",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22OMX_VIDEO_RVFORMATTYPE"
    },
    {
     "field_name" : "nBitsPerPixel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nPaddedWidth",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nPaddedHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitstreamFlags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitstreamVersion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxEncodeFrameSize",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnablePostFilter",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableTemporalInterpolation",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableLatencyMode",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "name" : "OMX_VIDEO_PARAM_RVTYPE",
   "referenced_type" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "self_type" : "_ZTI22OMX_VIDEO_PARAM_RVTYPE",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eAMRBandMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTI25OMX_AUDIO_AMRBANDMODETYPE"
    },
    {
     "field_name" : "eAMRDTXMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTI24OMX_AUDIO_AMRDTXMODETYPE"
    },
    {
     "field_name" : "eAMRFrameFormat",
     "field_offset" : 224,
     "referenced_type" : "_ZTI28OMX_AUDIO_AMRFRAMEFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_AMRTYPE",
   "name" : "OMX_AUDIO_PARAM_AMRTYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_AMRTYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_AMRTYPE",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 224,
     "referenced_type" : "_ZTI25OMX_AUDIO_CHANNELMODETYPE"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 256,
     "referenced_type" : "_ZTI29OMX_AUDIO_MP3STREAMFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_MP3TYPE",
   "name" : "OMX_AUDIO_PARAM_MP3TYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_MP3TYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_MP3TYPE",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBlocks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSubbands",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitPool",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableBitrate",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 320,
     "referenced_type" : "_ZTI25OMX_AUDIO_CHANNELMODETYPE"
    },
    {
     "field_name" : "eSBCAllocType",
     "field_offset" : 352,
     "referenced_type" : "_ZTI28OMX_AUDIO_SBCALLOCMETHODTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_SBCTYPE",
   "name" : "OMX_AUDIO_PARAM_SBCTYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_SBCTYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_SBCTYPE",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_AUDIO_CDMARATETYPE"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_SMVTYPE",
   "name" : "OMX_AUDIO_PARAM_SMVTYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_SMVTYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_SMVTYPE",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 160,
     "referenced_type" : "_ZTI23OMX_AUDIO_WMAFORMATTYPE"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 192,
     "referenced_type" : "_ZTI24OMX_AUDIO_WMAPROFILETYPE"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBlockAlign",
     "field_offset" : 256,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nEncodeOptions",
     "field_offset" : 272,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nSuperBlockAlign",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_AUDIO_PARAM_WMATYPE",
   "name" : "OMX_AUDIO_PARAM_WMATYPE",
   "referenced_type" : "_ZTI23OMX_AUDIO_PARAM_WMATYPE",
   "self_type" : "_ZTI23OMX_AUDIO_PARAM_WMATYPE",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nARGBColor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nARGBMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "name" : "OMX_CONFIG_COLORKEYTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_COLORKEYTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nContrast",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "name" : "OMX_CONFIG_CONTRASTTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_CONTRASTTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRotation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "name" : "OMX_CONFIG_ROTATIONTYPE",
   "referenced_type" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "self_type" : "_ZTI23OMX_CONFIG_ROTATIONTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eNaluFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_NALUFORMATSTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_NALSTREAMFORMATTYPE",
   "name" : "OMX_NALSTREAMFORMATTYPE",
   "referenced_type" : "_ZTI23OMX_NALSTREAMFORMATTYPE",
   "self_type" : "_ZTI23OMX_NALSTREAMFORMATTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI17OMX_EXTRADATATYPE"
    },
    {
     "field_name" : "nDataSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "name" : "OMX_OTHER_EXTRADATATYPE",
   "referenced_type" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "self_type" : "_ZTI23OMX_OTHER_EXTRADATATYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bUseHadamard",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nRefFrames",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefIdx10ActiveMinus1",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefIdx11ActiveMinus1",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableUEP",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableFMO",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableASO",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableRS",
     "field_offset" : 416,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 448,
     "referenced_type" : "_ZTI24OMX_VIDEO_AVCPROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 480,
     "referenced_type" : "_ZTI22OMX_VIDEO_AVCLEVELTYPE"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFrameMBsOnly",
     "field_offset" : 544,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bMBAFF",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEntropyCodingCABAC",
     "field_offset" : 608,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bWeightedPPrediction",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nWeightedBipredicitonMode",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bconstIpred",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDirect8x8Inference",
     "field_offset" : 736,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDirectSpatialTemporal",
     "field_offset" : 768,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nCabacInitIdc",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eLoopFilterMode",
     "field_offset" : 832,
     "referenced_type" : "_ZTI27OMX_VIDEO_AVCLOOPFILTERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "name" : "OMX_VIDEO_PARAM_AVCTYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_AVCTYPE",
   "size" : 108,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_VIDEO_VP8PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_VIDEO_VP8LEVELTYPE"
    },
    {
     "field_name" : "nDCTPartitions",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_VP8TYPE",
   "name" : "OMX_VIDEO_PARAM_VP8TYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_VP8TYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_VP8TYPE",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_VIDEO_VP9PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_VIDEO_VP9LEVELTYPE"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nTileRows",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTileColumns",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableFrameParallelDecoding",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_VP9TYPE",
   "name" : "OMX_VIDEO_PARAM_VP9TYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_VP9TYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_VP9TYPE",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_VIDEO_WMVFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "name" : "OMX_VIDEO_PARAM_WMVTYPE",
   "referenced_type" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "self_type" : "_ZTI23OMX_VIDEO_PARAM_WMVTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_AUDIO_CDMARATETYPE"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_EVRCTYPE",
   "name" : "OMX_AUDIO_PARAM_EVRCTYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_EVRCTYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_EVRCTYPE",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCompressionLevel",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_FLACTYPE",
   "name" : "OMX_AUDIO_PARAM_FLACTYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_FLACTYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_FLACTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eBitRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTI18OMX_AUDIO_G723RATE"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_G723TYPE",
   "name" : "OMX_AUDIO_PARAM_G723TYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_G723TYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_G723TYPE",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eG726Mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTI18OMX_AUDIO_G726MODE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_G726TYPE",
   "name" : "OMX_AUDIO_PARAM_G726TYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_G726TYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_G726TYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eBitType",
     "field_offset" : 160,
     "referenced_type" : "_ZTI18OMX_AUDIO_G729TYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_G729TYPE",
   "name" : "OMX_AUDIO_PARAM_G729TYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_G729TYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_G729TYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFileSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sMaxPolyphony",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "bLoadDefaultSound",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eMidiFormat",
     "field_offset" : 256,
     "referenced_type" : "_ZTI24OMX_AUDIO_MIDIFORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_AUDIO_PARAM_MIDITYPE",
   "name" : "OMX_AUDIO_PARAM_MIDITYPE",
   "referenced_type" : "_ZTI24OMX_AUDIO_PARAM_MIDITYPE",
   "self_type" : "_ZTI24OMX_AUDIO_PARAM_MIDITYPE",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBacklight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeout",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "name" : "OMX_CONFIG_BACKLIGHTTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_BACKLIGHTTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xEncodeFramerate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "name" : "OMX_CONFIG_FRAMERATETYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "self_type" : "_ZTI24OMX_CONFIG_FRAMERATETYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bStab",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "name" : "OMX_CONFIG_FRAMESTABTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_FRAMESTABTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLightness",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "name" : "OMX_CONFIG_LIGHTNESSTYPE",
   "referenced_type" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "self_type" : "_ZTI24OMX_CONFIG_LIGHTNESSTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "contentURI",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_CONTENTURITYPE",
   "name" : "OMX_PARAM_CONTENTURITYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_CONTENTURITYPE",
   "self_type" : "_ZTI24OMX_PARAM_CONTENTURITYPE",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDeblocking",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "name" : "OMX_PARAM_DEBLOCKINGTYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "self_type" : "_ZTI24OMX_PARAM_DEBLOCKINGTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nInterleavePortIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "name" : "OMX_PARAM_INTERLEAVETYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "self_type" : "_ZTI24OMX_PARAM_INTERLEAVETYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bOneShot",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sFrameSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTI17OMX_FRAMESIZETYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "name" : "OMX_PARAM_SENSORMODETYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "self_type" : "_ZTI24OMX_PARAM_SENSORMODETYPE",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI18OMX_SUSPENSIONTYPE"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_PARAM_SUSPENSIONTYPE",
   "name" : "OMX_PARAM_SUSPENSIONTYPE",
   "referenced_type" : "_ZTI24OMX_PARAM_SUSPENSIONTYPE",
   "self_type" : "_ZTI24OMX_PARAM_SUSPENSIONTYPE",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNaluBytes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "name" : "OMX_VIDEO_CONFIG_NALSIZE",
   "referenced_type" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "self_type" : "_ZTI24OMX_VIDEO_CONFIG_NALSIZE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "_ZTI25OMX_VIDEO_H263PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTI23OMX_VIDEO_H263LEVELTYPE"
    },
    {
     "field_name" : "bPLUSPTYPEAllowed",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bForceRoundingTypeToZero",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nPictureHeaderRepetition",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGOBHeaderInterval",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "name" : "OMX_VIDEO_PARAM_H263TYPE",
   "referenced_type" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "self_type" : "_ZTI24OMX_VIDEO_PARAM_H263TYPE",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTI25OMX_VIDEO_HEVCPROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI23OMX_VIDEO_HEVCLEVELTYPE"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24OMX_VIDEO_PARAM_HEVCTYPE",
   "name" : "OMX_VIDEO_PARAM_HEVCTYPE",
   "referenced_type" : "_ZTI24OMX_VIDEO_PARAM_HEVCTYPE",
   "self_type" : "_ZTI24OMX_VIDEO_PARAM_HEVCTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBass",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_CONFIG_BASSTYPE",
   "name" : "OMX_AUDIO_CONFIG_BASSTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_CONFIG_BASSTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_CONFIG_BASSTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_CONFIG_MUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_MUTETYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_CONFIG_MUTETYPE",
   "self_type" : "_ZTI25OMX_AUDIO_CONFIG_MUTETYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitsPerSample",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_ADPCMTYPE",
   "name" : "OMX_AUDIO_PARAM_ADPCMTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_ADPCMTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_ADPCMTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_GSMFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMFRTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_GSMFRTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_GSMFRTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_GSMHRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMHRTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_GSMHRTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_GSMHRTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_PDCFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCFRTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_PDCFRTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_PDCFRTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_AUDIO_PARAM_PDCHRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCHRTYPE",
   "referenced_type" : "_ZTI25OMX_AUDIO_PARAM_PDCHRTYPE",
   "self_type" : "_ZTI25OMX_AUDIO_PARAM_PDCHRTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pName",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "pInitialize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEPvE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "name" : "OMX_COMPONENTREGISTERTYPE",
   "referenced_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "self_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pName",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "pInitialize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF13OMX_ERRORTYPEjE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_COMPONENTREGISTERTYPE",
   "name" : "OMX_COMPONENTREGISTERTYPE",
   "referenced_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump",
   "self_type" : "_ZTI25OMX_COMPONENTREGISTERTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBrightness",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "name" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_BRIGHTNESSTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRGBAlphaConstant",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eColorBlend",
     "field_offset" : 128,
     "referenced_type" : "_ZTI18OMX_COLORBLENDTYPE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "name" : "OMX_CONFIG_COLORBLENDTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_COLORBLENDTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDepth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAlpha",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "name" : "OMX_CONFIG_PLANEBLENDTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_PLANEBLENDTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSaturation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "name" : "OMX_CONFIG_SATURATIONTYPE",
   "referenced_type" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "self_type" : "_ZTI25OMX_CONFIG_SATURATIONTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "hPipe",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_CONTENTPIPETYPE",
   "name" : "OMX_PARAM_CONTENTPIPETYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_CONTENTPIPETYPE",
   "self_type" : "_ZTI25OMX_PARAM_CONTENTPIPETYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "hPipe",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_CONTENTPIPETYPE",
   "name" : "OMX_PARAM_CONTENTPIPETYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_CONTENTPIPETYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI25OMX_PARAM_CONTENTPIPETYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFocusStatus",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_FOCUSSTATUSTYPE"
    },
    {
     "field_name" : "bCenterStatus",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bLeftStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bRightStatus",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopStatus",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomStatus",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopLeftStatus",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopRightStatus",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomLeftStatus",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomRightStatus",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "name" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "self_type" : "_ZTI25OMX_PARAM_FOCUSSTATUSTYPE",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMacroblocks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "name" : "OMX_PARAM_MACROBLOCKSTYPE",
   "referenced_type" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "self_type" : "_ZTI25OMX_PARAM_MACROBLOCKSTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_TIME_CONFIG_SCALETYPE",
   "name" : "OMX_TIME_CONFIG_SCALETYPE",
   "referenced_type" : "_ZTI25OMX_TIME_CONFIG_SCALETYPE",
   "self_type" : "_ZTI25OMX_TIME_CONFIG_SCALETYPE",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "_ZTI26OMX_VIDEO_MPEG2PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTI24OMX_VIDEO_MPEG2LEVELTYPE"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG2TYPE",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bSVH",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bGov",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDCVLCThreshold",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bACPred",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nMaxPacketSize",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimeIncRes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 384,
     "referenced_type" : "_ZTI26OMX_VIDEO_MPEG4PROFILETYPE"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 416,
     "referenced_type" : "_ZTI24OMX_VIDEO_MPEG4LEVELTYPE"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nHeaderExtension",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bReversibleVLC",
     "field_offset" : 512,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_MPEG4TYPE",
   "size" : 68,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "b16x16",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b16x8",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x16",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x8",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b8x4",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b4x8",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "b4x4",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "name" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "self_type" : "_ZTI25OMX_VIDEO_PARAM_VBSMCTYPE",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nMediaTimeUs",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nSystemTimeNs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI25OMX_VIDEO_RENDEREVENTTYPE",
   "name" : "OMX_VIDEO_RENDEREVENTTYPE",
   "referenced_type" : "_ZTI25OMX_VIDEO_RENDEREVENTTYPE",
   "self_type" : "_ZTI25OMX_VIDEO_RENDEREVENTTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_GSMEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMEFRTYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_GSMEFRTYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_GSMEFRTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_PDCEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCEFRTYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_PDCEFRTYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_PDCEFRTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 160,
     "referenced_type" : "_ZTI22OMX_AUDIO_CDMARATETYPE"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_QCELP8TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP8TYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_QCELP8TYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_QCELP8TYPE",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_TDMAFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAFRTYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_TDMAFRTYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_TDMAFRTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQuality",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bManaged",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bDownmix",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_AUDIO_PARAM_VORBISTYPE",
   "name" : "OMX_AUDIO_PARAM_VORBISTYPE",
   "referenced_type" : "_ZTI26OMX_AUDIO_PARAM_VORBISTYPE",
   "self_type" : "_ZTI26OMX_AUDIO_PARAM_VORBISTYPE",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bContinuous",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bFrameLimited",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nFrameLimit",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "name" : "OMX_CONFIG_CAPTUREMODETYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "self_type" : "_ZTI26OMX_CONFIG_CAPTUREMODETYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bCenter",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bLeft",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bRight",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTop",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottom",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopLeft",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bTopRight",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomLeft",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bBottomRight",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "name" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_FOCUSREGIONTYPE",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eImageFilter",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19OMX_IMAGEFILTERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "name" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_IMAGEFILTERTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xWidth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xHeight",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "name" : "OMX_CONFIG_SCALEFACTORTYPE",
   "referenced_type" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "self_type" : "_ZTI26OMX_CONFIG_SCALEFACTORTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bEnablePM",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_OTHER_CONFIG_POWERTYPE",
   "name" : "OMX_OTHER_CONFIG_POWERTYPE",
   "referenced_type" : "_ZTI26OMX_OTHER_CONFIG_POWERTYPE",
   "self_type" : "_ZTI26OMX_OTHER_CONFIG_POWERTYPE",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    }
   ],
   "linker_set_key" : "_ZTI26OMX_OTHER_CONFIG_STATSTYPE",
   "name" : "OMX_OTHER_CONFIG_STATSTYPE",
   "referenced_type" : "_ZTI26OMX_OTHER_CONFIG_STATSTYPE",
   "self_type" : "_ZTI26OMX_OTHER_CONFIG_STATSTYPE",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sDelay",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sModulationRate",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "nModulationDepth",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFeedback",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8OMX_BU32"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_CONFIG_CHORUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_CHORUSTYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_CONFIG_CHORUSTYPE",
   "self_type" : "_ZTI27OMX_AUDIO_CONFIG_CHORUSTYPE",
   "size" : 56,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nTreble",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_CONFIG_TREBLETYPE",
   "name" : "OMX_AUDIO_CONFIG_TREBLETYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_CONFIG_TREBLETYPE",
   "self_type" : "_ZTI27OMX_AUDIO_CONFIG_TREBLETYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BS32"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_CONFIG_VOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_VOLUMETYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_CONFIG_VOLUMETYPE",
   "self_type" : "_ZTI27OMX_AUDIO_CONFIG_VOLUMETYPE",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eNumData",
     "field_offset" : 128,
     "referenced_type" : "_ZTI21OMX_NUMERICALDATATYPE"
    },
    {
     "field_name" : "eEndian",
     "field_offset" : 160,
     "referenced_type" : "_ZTI14OMX_ENDIANTYPE"
    },
    {
     "field_name" : "bInterleaved",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBitPerSample",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ePCMMode",
     "field_offset" : 288,
     "referenced_type" : "_ZTI21OMX_AUDIO_PCMMODETYPE"
    },
    {
     "field_name" : "eChannelMapping",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_21OMX_AUDIO_CHANNELTYPE"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_PARAM_PCMMODETYPE",
   "name" : "OMX_AUDIO_PARAM_PCMMODETYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_PARAM_PCMMODETYPE",
   "self_type" : "_ZTI27OMX_AUDIO_PARAM_PCMMODETYPE",
   "size" : 104,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22OMX_AUDIO_CDMARATETYPE"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_PARAM_QCELP13TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP13TYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_PARAM_QCELP13TYPE",
   "self_type" : "_ZTI27OMX_AUDIO_PARAM_QCELP13TYPE",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "referenced_type" : "_ZTI27OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "self_type" : "_ZTI27OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21OMX_METADATASCOPETYPE"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMetadataItemIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSearchMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTI26OMX_METADATASEARCHMODETYPE"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 192,
     "referenced_type" : "_ZTI23OMX_METADATACHARSETTYPE"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 224,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 232,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "eValueCharset",
     "field_offset" : 1280,
     "referenced_type" : "_ZTI23OMX_METADATACHARSETTYPE"
    },
    {
     "field_name" : "sLanguageCountry",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "nValueMaxSize",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nValueSizeUsed",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nValue",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_CONFIG_METADATAITEMTYPE",
   "name" : "OMX_CONFIG_METADATAITEMTYPE",
   "referenced_type" : "_ZTI27OMX_CONFIG_METADATAITEMTYPE",
   "self_type" : "_ZTI27OMX_CONFIG_METADATAITEMTYPE",
   "size" : 192,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21OMX_METADATASCOPETYPE"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMetadataItemIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSearchMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTI26OMX_METADATASEARCHMODETYPE"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 192,
     "referenced_type" : "_ZTI23OMX_METADATACHARSETTYPE"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 224,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 232,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "eValueCharset",
     "field_offset" : 1280,
     "referenced_type" : "_ZTI23OMX_METADATACHARSETTYPE"
    },
    {
     "field_name" : "sLanguageCountry",
     "field_offset" : 1312,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nValueMaxSize",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nValueSizeUsed",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nValue",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_CONFIG_METADATAITEMTYPE",
   "name" : "OMX_CONFIG_METADATAITEMTYPE",
   "referenced_type" : "_ZTI27OMX_CONFIG_METADATAITEMTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI27OMX_CONFIG_METADATAITEMTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 180,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQFactor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_IMAGE_PARAM_QFACTORTYPE",
   "name" : "OMX_IMAGE_PARAM_QFACTORTYPE",
   "referenced_type" : "_ZTI27OMX_IMAGE_PARAM_QFACTORTYPE",
   "self_type" : "_ZTI27OMX_IMAGE_PARAM_QFACTORTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "cRole",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA128_h"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "name" : "OMX_PARAM_COMPONENTROLETYPE",
   "referenced_type" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "self_type" : "_ZTI27OMX_PARAM_COMPONENTROLETYPE",
   "size" : 136,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bResourceConcealmentForbidden",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_RESOURCECONCEALMENTTYPE",
   "name" : "OMX_RESOURCECONCEALMENTTYPE",
   "referenced_type" : "_ZTI27OMX_RESOURCECONCEALMENTTYPE",
   "self_type" : "_ZTI27OMX_RESOURCECONCEALMENTTYPE",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumSliceGroups",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nSliceGroupMapType",
     "field_offset" : 104,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "eSliceMode",
     "field_offset" : 128,
     "referenced_type" : "_ZTI26OMX_VIDEO_AVCSLICEMODETYPE"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "name" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "referenced_type" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "self_type" : "_ZTI27OMX_VIDEO_PARAM_AVCSLICEFMO",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eControlRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTI25OMX_VIDEO_CONTROLRATETYPE"
    },
    {
     "field_offset" : 128,
     "referenced_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "referenced_type" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "self_type" : "_ZTI27OMX_VIDEO_PARAM_BITRATETYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bDepedentSegments",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableLoopFilterAcrossSlices",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI27OMX_VIDEO_SLICESEGMENTSTYPE",
   "name" : "OMX_VIDEO_SLICESEGMENTSTYPE",
   "referenced_type" : "_ZTI27OMX_VIDEO_SLICESEGMENTSTYPE",
   "self_type" : "_ZTI27OMX_VIDEO_SLICESEGMENTSTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBalance",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_AUDIO_CONFIG_BALANCETYPE",
   "name" : "OMX_AUDIO_CONFIG_BALANCETYPE",
   "referenced_type" : "_ZTI28OMX_AUDIO_CONFIG_BALANCETYPE",
   "self_type" : "_ZTI28OMX_AUDIO_CONFIG_BALANCETYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 160,
     "referenced_type" : "_ZTI20OMX_AUDIO_CODINGTYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE",
   "name" : "OMX_AUDIO_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 96,
     "referenced_type" : "_ZTI20OMX_AUDIO_CODINGTYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE",
   "name" : "OMX_AUDIO_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMetering",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16OMX_METERINGTYPE"
    },
    {
     "field_name" : "xEVCompensation",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nApertureFNumber",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoAperture",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nShutterSpeedMsec",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoShutterSpeed",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nSensitivity",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bAutoSensitivity",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "name" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "referenced_type" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "self_type" : "_ZTI28OMX_CONFIG_EXPOSUREVALUETYPE",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 288,
     "referenced_type" : "_ZTI20OMX_IMAGE_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE",
   "name" : "OMX_IMAGE_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE",
   "size" : 56,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 224,
     "referenced_type" : "_ZTI20OMX_IMAGE_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 256,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE",
   "name" : "OMX_IMAGE_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "eFormat",
     "referenced_type" : "_ZTI20OMX_OTHER_FORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_OTHER_PORTDEFINITIONTYPE",
   "name" : "OMX_OTHER_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_OTHER_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_OTHER_PORTDEFINITIONTYPE",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eBufferSupplier",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22OMX_BUFFERSUPPLIERTYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "name" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "referenced_type" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "self_type" : "_ZTI28OMX_PARAM_BUFFERSUPPLIERTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_METADATACHARSETTYPE"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "nLanguageCountrySizeUsed",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nLanguageCountry",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 2240,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_PARAM_METADATAFILTERTYPE",
   "name" : "OMX_PARAM_METADATAFILTERTYPE",
   "referenced_type" : "_ZTI28OMX_PARAM_METADATAFILTERTYPE",
   "self_type" : "_ZTI28OMX_PARAM_METADATAFILTERTYPE",
   "size" : 284,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11OMX_DIRTYPE"
    },
    {
     "field_name" : "nBufferCountActual",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBufferCountMin",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBufferSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bPopulated",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eDomain",
     "field_offset" : 288,
     "referenced_type" : "_ZTI18OMX_PORTDOMAINTYPE"
    },
    {
     "field_name" : "format",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E"
    },
    {
     "field_name" : "bBuffersContiguous",
     "field_offset" : 832,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBufferAlignment",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_PARAM_PORTDEFINITIONTYPE",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_PARAM_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_PARAM_PORTDEFINITIONTYPE",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11OMX_DIRTYPE"
    },
    {
     "field_name" : "nBufferCountActual",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBufferCountMin",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBufferSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bPopulated",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eDomain",
     "field_offset" : 288,
     "referenced_type" : "_ZTI18OMX_PORTDOMAINTYPE"
    },
    {
     "field_name" : "format",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump"
    },
    {
     "field_name" : "bBuffersContiguous",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBufferAlignment",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_PARAM_PORTDEFINITIONTYPE",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_PARAM_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI28OMX_PARAM_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 96,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21OMX_TIME_SEEKMODETYPE"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_TIME_CONFIG_SEEKMODETYPE",
   "name" : "OMX_TIME_CONFIG_SEEKMODETYPE",
   "referenced_type" : "_ZTI28OMX_TIME_CONFIG_SEEKMODETYPE",
   "self_type" : "_ZTI28OMX_TIME_CONFIG_SEEKMODETYPE",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nEncodeBitrate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "name" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "referenced_type" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "self_type" : "_ZTI28OMX_VIDEO_CONFIG_BITRATETYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitrate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 352,
     "referenced_type" : "_ZTI20OMX_VIDEO_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 384,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "name" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "self_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitrate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 288,
     "referenced_type" : "_ZTI20OMX_VIDEO_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE",
   "name" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "referenced_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bLoudness",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI29OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "name" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "referenced_type" : "_ZTI29OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "self_type" : "_ZTI29OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTimestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI29OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "name" : "OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "referenced_type" : "_ZTI29OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "self_type" : "_ZTI29OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sBandIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sCenterFreq",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sBandLevel",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BS32"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "name" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "referenced_type" : "_ZTI30OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "self_type" : "_ZTI30OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFrameLength",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAACtools",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAACERtools",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eAACProfile",
     "field_offset" : 320,
     "referenced_type" : "_ZTI24OMX_AUDIO_AACPROFILETYPE"
    },
    {
     "field_name" : "eAACStreamFormat",
     "field_offset" : 352,
     "referenced_type" : "_ZTI29OMX_AUDIO_AACSTREAMFORMATTYPE"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 384,
     "referenced_type" : "_ZTI25OMX_AUDIO_CHANNELMODETYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_AUDIO_PARAM_AACPROFILETYPE",
   "name" : "OMX_AUDIO_PARAM_AACPROFILETYPE",
   "referenced_type" : "_ZTI30OMX_AUDIO_PARAM_AACPROFILETYPE",
   "self_type" : "_ZTI30OMX_AUDIO_PARAM_AACPROFILETYPE",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_AUDIO_CODINGTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xColorMatrix",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA3_A3_i"
    },
    {
     "field_name" : "xColorOffset",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA4_i"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "name" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_COLORCONVERSIONTYPE",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNodeIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNodeID",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cNodeName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "bIsLeafType",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_CONTAINERNODEIDTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODEIDTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_CONTAINERNODEIDTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_CONTAINERNODEIDTYPE",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNodeIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNodeID",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cNodeName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bIsLeafType",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_CONTAINERNODEIDTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODEIDTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_CONTAINERNODEIDTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI30OMX_CONFIG_CONTAINERNODEIDTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eExposureControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_EXPOSURECONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "name" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_EXPOSURECONTROLTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "IntraRefreshVOP",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "name" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eWhiteBalControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI23OMX_WHITEBALCONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "name" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "referenced_type" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "self_type" : "_ZTI30OMX_CONFIG_WHITEBALCONTROLTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_IMAGE_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "name" : "OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_OTHER_FORMATTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_OTHER_PARAM_PORTFORMATTYPE",
   "name" : "OMX_OTHER_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_OTHER_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_OTHER_PARAM_PORTFORMATTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "ePolicy",
     "field_offset" : 64,
     "referenced_type" : "_ZTI24OMX_SUSPENSIONPOLICYTYPE"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "name" : "OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "referenced_type" : "_ZTI30OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "self_type" : "_ZTI30OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eState",
     "field_offset" : 64,
     "referenced_type" : "_ZTI19OMX_TIME_CLOCKSTATE"
    },
    {
     "field_name" : "nStartTime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nWaitMask",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "name" : "OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "referenced_type" : "_ZTI30OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "self_type" : "_ZTI30OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20OMX_VIDEO_CODINGTYPE"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "_ZTI20OMX_COLOR_FORMATTYPE"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "self_type" : "_ZTI30OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumTracks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nDuration",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bVibra",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nNumMetaEvents",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumActiveVoices",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMIDIPlayBackState",
     "field_offset" : 288,
     "referenced_type" : "_ZTI31OMX_AUDIO_MIDIPLAYBACKSTATETYPE"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "referenced_type" : "_ZTI31OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "self_type" : "_ZTI31OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bColorEnhancement",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nCustomizedU",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nCustomizedV",
     "field_offset" : 136,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "name" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_COLORENHANCEMENTTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "name" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_MBERRORREPORTINGTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eEffect",
     "field_offset" : 96,
     "referenced_type" : "_ZTI24OMX_TRANSITIONEFFECTTYPE"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "name" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "referenced_type" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "self_type" : "_ZTI31OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDRPeriod",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "name" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "referenced_type" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "self_type" : "_ZTI31OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bPreviousFrameRefresh",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bGoldenFrameRefresh",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bAlternateFrameRefresh",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bUsePreviousFrame",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bUseGoldenFrame",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bUseAlternateFrame",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI31OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "referenced_type" : "_ZTI31OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "self_type" : "_ZTI31OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "referenced_type" : "_ZTI32OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "self_type" : "_ZTI32OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sPitchTransposition",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sPlayBackRate",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sTempo",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "nMaxPolyphony",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumRepeat",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nStopTime",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannelMuteMask",
     "field_offset" : 480,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nChannelSoloMask",
     "field_offset" : 496,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nTrack0031MuteMask",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTrack3263MuteMask",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTrack0031SoloMask",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTrack3263SoloMask",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "referenced_type" : "_ZTI32OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "self_type" : "_ZTI32OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21OMX_METADATASCOPETYPE"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMetadataItemCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "name" : "OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "referenced_type" : "_ZTI32OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "self_type" : "_ZTI32OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFlashControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_IMAGE_FLASHCONTROLTYPE"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "name" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "referenced_type" : "_ZTI32OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "self_type" : "_ZTI32OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eRefreshMode",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_VIDEO_INTRAREFRESHTYPE"
    },
    {
     "field_name" : "nAirMBs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nAirRef",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nCirMBs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eAccuracy",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_VIDEO_MOTIONVECTORTYPE"
    },
    {
     "field_name" : "bUnrestrictedMVs",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bFourMV",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sXSearchRange",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sYSearchRange",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "name" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nProfileIndex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "name" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpI",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpP",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQpB",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "name" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "referenced_type" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "self_type" : "_ZTI32OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumNodes",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "referenced_type" : "_ZTI33OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "self_type" : "_ZTI33OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nErrMapSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ErrMap",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "name" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "referenced_type" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "self_type" : "_ZTI33OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eFocusControl",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_IMAGE_FOCUSCONTROLTYPE"
    },
    {
     "field_name" : "nFocusSteps",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFocusStepIndex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "name" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "referenced_type" : "_ZTI33OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "self_type" : "_ZTI33OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eHuffmanTable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26OMX_IMAGE_HUFFMANTABLETYPE"
    },
    {
     "field_name" : "nNumberOfHuffmanCodeOfLength",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "nHuffmanTable",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA256_h"
    }
   ],
   "linker_set_key" : "_ZTI33OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "referenced_type" : "_ZTI33OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "self_type" : "_ZTI33OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "size" : 288,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 160,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 256,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI34OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "referenced_type" : "_ZTI34OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "self_type" : "_ZTI34OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMetaEventType",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTrack",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI34OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "referenced_type" : "_ZTI34OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "self_type" : "_ZTI34OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "sRoomLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sRoomHighFreqLevel",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sReflectionsLevel",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sReflectionsDelay",
     "field_offset" : 416,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sReverbLevel",
     "field_offset" : 512,
     "referenced_type" : "_ZTI8OMX_BS32"
    },
    {
     "field_name" : "sReverbDelay",
     "field_offset" : 608,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "sDecayTime",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "nDecayHighFreqRatio",
     "field_offset" : 800,
     "referenced_type" : "_ZTI8OMX_BU32"
    },
    {
     "field_name" : "nDensity",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDiffusion",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sReferenceHighFreq",
     "field_offset" : 960,
     "referenced_type" : "_ZTI8OMX_BU32"
    }
   ],
   "linker_set_key" : "_ZTI34OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "referenced_type" : "_ZTI34OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "self_type" : "_ZTI34OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "size" : 132,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "eClock",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21OMX_TIME_REFCLOCKTYPE"
    }
   ],
   "linker_set_key" : "_ZTI34OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "name" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "referenced_type" : "_ZTI34OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "self_type" : "_ZTI34OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bNoiseReduction",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "referenced_type" : "_ZTI35OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "self_type" : "_ZTI35OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "eWideningType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI28OMX_AUDIO_STEREOWIDENINGTYPE"
    },
    {
     "field_name" : "nStereoWidening",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "name" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "referenced_type" : "_ZTI35OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "self_type" : "_ZTI35OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cKey",
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "eValueType",
     "field_offset" : 1024,
     "referenced_type" : "_ZTI28OMX_ANDROID_VENDOR_VALUETYPE"
    },
    {
     "field_name" : "bSet",
     "field_offset" : 1056,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_offset" : 1088,
     "referenced_type" : "_ZTIN35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPEUt_E"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "referenced_type" : "_ZTI35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "self_type" : "_ZTI35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "size" : 264,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableHEC",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableResync",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nResynchMarkerSpacing",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableDataPartitioning",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bEnableRVLC",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "name" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "self_type" : "_ZTI35OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnableVFU",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nFirstGOB",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nFirstMB",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nNumMBs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "name" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "self_type" : "_ZTI35OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bIsIntraFrame",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "bIsGoldenOrAlternateFrame",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8OMX_BOOL"
    }
   ],
   "linker_set_key" : "_ZTI35OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "referenced_type" : "_ZTI35OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "self_type" : "_ZTI35OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eEchoCancelation",
     "field_offset" : 96,
     "referenced_type" : "_ZTI21OMX_AUDIO_ECHOCANTYPE"
    }
   ],
   "linker_set_key" : "_ZTI36OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "referenced_type" : "_ZTI36OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "self_type" : "_ZTI36OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pClientPrivate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 256,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI36OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "name" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "referenced_type" : "_ZTI36OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "self_type" : "_ZTI36OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pClientPrivate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI36OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "name" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "referenced_type" : "_ZTI36OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI36OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDLSIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDLSSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDLSData",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "eMidiSoundBank",
     "field_offset" : 256,
     "referenced_type" : "_ZTI27OMX_AUDIO_MIDISOUNDBANKTYPE"
    },
    {
     "field_name" : "eMidiSoundBankLayout",
     "field_offset" : 288,
     "referenced_type" : "_ZTI33OMX_AUDIO_MIDISOUNDBANKLAYOUTTYPE"
    }
   ],
   "linker_set_key" : "_ZTI37OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "name" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "referenced_type" : "_ZTI37OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "self_type" : "_ZTI37OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDLSIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nDLSSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDLSData",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eMidiSoundBank",
     "field_offset" : 192,
     "referenced_type" : "_ZTI27OMX_AUDIO_MIDISOUNDBANKTYPE"
    },
    {
     "field_name" : "eMidiSoundBankLayout",
     "field_offset" : 224,
     "referenced_type" : "_ZTI33OMX_AUDIO_MIDISOUNDBANKLAYOUTTYPE"
    }
   ],
   "linker_set_key" : "_ZTI37OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "name" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "referenced_type" : "_ZTI37OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTI37OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eQuantizationTable",
     "field_offset" : 96,
     "referenced_type" : "_ZTI31OMX_IMAGE_QUANTIZATIONTABLETYPE"
    },
    {
     "field_name" : "nQuantizationMatrix",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA64_h"
    }
   ],
   "linker_set_key" : "_ZTI37OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "referenced_type" : "_ZTI37OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "self_type" : "_ZTI37OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nTileWidth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTileHeight",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGridRows",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nGridCols",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI37OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "referenced_type" : "_ZTI37OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "self_type" : "_ZTI37OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nData",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI38OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "referenced_type" : "_ZTI38OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "self_type" : "_ZTI38OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eTemporalPattern",
     "field_offset" : 128,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_VPXTEMPORALLAYERPATTERNTYPE"
    },
    {
     "field_name" : "nTemporalLayerCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nTemporalLayerBitrateRatio",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA3_j"
    },
    {
     "field_name" : "nMinQuantizer",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMaxQuantizer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI38OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "referenced_type" : "_ZTI38OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "self_type" : "_ZTI38OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMidiEventSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMidiEvents",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI39OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "referenced_type" : "_ZTI39OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "self_type" : "_ZTI39OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cName",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA128_h"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 1120,
     "referenced_type" : "_ZTI11OMX_DIRTYPE"
    },
    {
     "field_name" : "nParamCount",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nParamSizeUsed",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "param",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIA1_35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE"
    }
   ],
   "linker_set_key" : "_ZTI39OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "referenced_type" : "_ZTI39OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "self_type" : "_ZTI39OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "size" : 416,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nIDProgram",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nIDSoundBank",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nUserSoundBankIndex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI41OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "referenced_type" : "_ZTI41OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "self_type" : "_ZTI41OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nRefreshPeriod",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI41OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "referenced_type" : "_ZTI41OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "self_type" : "_ZTI41OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "eSupportedPatterns",
     "field_offset" : 96,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_TEMPORALLAYERINGPATTERNTYPE"
    },
    {
     "field_name" : "nLayerCountMax",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBLayerCountMax",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 192,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_TEMPORALLAYERINGPATTERNTYPE"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI44OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "_ZTI44OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "self_type" : "_ZTI44OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "size" : 72,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15OMX_VERSIONTYPE"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 96,
     "referenced_type" : "_ZTI45OMX_VIDEO_ANDROID_TEMPORALLAYERINGPATTERNTYPE"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8OMX_BOOL"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI45OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "_ZTI45OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "self_type" : "_ZTI45OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "size" : 60,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8OMX_BS32",
   "name" : "OMX_BS32",
   "referenced_type" : "_ZTI8OMX_BS32",
   "self_type" : "_ZTI8OMX_BS32",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8OMX_BU32",
   "name" : "OMX_BU32",
   "referenced_type" : "_ZTI8OMX_BU32",
   "self_type" : "_ZTI8OMX_BU32",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nVersionMajor",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nVersionMinor",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nRevision",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nStep",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "name" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5)",
   "referenced_type" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "self_type" : "_ZTIN15OMX_VERSIONTYPEUt_E",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTargetBitrate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nQualityFactor",
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:270:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "self_type" : "_ZTIN27OMX_VIDEO_PARAM_BITRATETYPEUt_E",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "audio",
     "referenced_type" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE"
    },
    {
     "field_name" : "video",
     "referenced_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE"
    },
    {
     "field_name" : "image",
     "referenced_type" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE"
    },
    {
     "field_name" : "other",
     "referenced_type" : "_ZTI28OMX_OTHER_PORTDEFINITIONTYPE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E",
   "self_type" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "audio",
     "referenced_type" : "_ZTI28OMX_AUDIO_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump"
    },
    {
     "field_name" : "video",
     "referenced_type" : "_ZTI28OMX_VIDEO_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump"
    },
    {
     "field_name" : "image",
     "referenced_type" : "_ZTI28OMX_IMAGE_PORTDEFINITIONTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump"
    },
    {
     "field_name" : "other",
     "referenced_type" : "_ZTI28OMX_OTHER_PORTDEFINITIONTYPE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTIN28OMX_PARAM_PORTDEFINITIONTYPEUt_E#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nInt32",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nInt64",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "cString",
     "referenced_type" : "_ZTIA128_h"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPEUt_E",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:139:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPEUt_E",
   "self_type" : "_ZTIN35OMX_CONFIG_ANDROID_VENDOR_PARAMTYPEUt_E",
   "size" : 128,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android10ColorUtilsE",
   "name" : "android::ColorUtils",
   "referenced_type" : "_ZTIN7android10ColorUtilsE",
   "self_type" : "_ZTIN7android10ColorUtilsE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ColorUtils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10MediaImage9PlaneInfoE",
   "name" : "android::MediaImage::PlaneInfo",
   "referenced_type" : "_ZTIN7android10MediaImage9PlaneInfoE",
   "self_type" : "_ZTIN7android10MediaImage9PlaneInfoE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "_ZTIN7android10MediaImage4TypeE"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_N7android10MediaImage9PlaneInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10MediaImageE",
   "name" : "android::MediaImage",
   "referenced_type" : "_ZTIN7android10MediaImageE",
   "self_type" : "_ZTIN7android10MediaImageE",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKm"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10VectorImplE",
   "self_type" : "_ZTIN7android10VectorImplE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJEEE",
   "name" : "android::are_unique<>",
   "referenced_type" : "_ZTIN7android10are_uniqueIJEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJNS_2spINS_7ABufferEEENS1_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJNS_2spINS_7ABufferEEENS1_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJNS_2spINS_7ABufferEEENS1_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJNS_2spINS_7RefBaseEEEEEE",
   "name" : "android::are_unique<sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJNS_2spINS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJNS_2spINS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJNS_2spINS_8AMessageEEENS1_INS_7ABufferEEENS1_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJNS_2spINS_8AMessageEEENS1_INS_7ABufferEEENS1_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJNS_2spINS_8AMessageEEENS1_INS_7ABufferEEENS1_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJNS_7AStringEPvNS_2spINS_8AMessageEEENS3_INS_7ABufferEEENS3_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJNS_7AStringEPvNS_2spINS_8AMessageEEENS3_INS_7ABufferEEENS3_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJNS_7AStringEPvNS_2spINS_8AMessageEEENS3_INS_7ABufferEEENS3_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJPvNS_2spINS_8AMessageEEENS2_INS_7ABufferEEENS2_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJPvNS_2spINS_8AMessageEEENS2_INS_7ABufferEEENS2_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJPvNS_2spINS_8AMessageEEENS2_INS_7ABufferEEENS2_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJilmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJilmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJilmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJlmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJlmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJlmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10are_uniqueIJmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "name" : "android::are_unique<unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "_ZTIN7android10are_uniqueIJmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "self_type" : "_ZTIN7android10are_uniqueIJmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android2wpINS_7ALooperEEE"
    },
    {
     "access" : "private",
     "field_name" : "mReply",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN7android2spINS_8AMessageEEE"
    },
    {
     "access" : "private",
     "field_name" : "mReplied",
     "field_offset" : 320,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android11AReplyTokenE",
   "name" : "android::AReplyToken",
   "referenced_type" : "_ZTIN7android11AReplyTokenE",
   "self_type" : "_ZTIN7android11AReplyTokenE",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AReplyTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_13GraphicBufferEEE",
   "name" : "android::Flattenable<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11FlattenableINS_13GraphicBufferEEE",
   "self_type" : "_ZTIN7android11FlattenableINS_13GraphicBufferEEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android13GraphicBufferE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_5FenceEEE",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11FlattenableINS_5FenceEEE",
   "self_type" : "_ZTIN7android11FlattenableINS_5FenceEEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android5FenceE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_9FenceTime8SnapshotEEE",
   "name" : "android::Flattenable<android::FenceTime::Snapshot>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11FlattenableINS_9FenceTime8SnapshotEEE",
   "self_type" : "_ZTIN7android11FlattenableINS_9FenceTime8SnapshotEEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "_ZTIN7android9FenceTime8SnapshotE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEE",
   "name" : "android::KeyedVector<android::wp<android::hidl::base::V1_0::IBase>, android::sp<android::OMXNodeInstance> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEE",
   "self_type" : "_ZTIN7android11KeyedVectorINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" :
   [
    "_ZTIN7android2wpINS_4hidl4base4V1_05IBaseEEE",
    "_ZTIN7android2spINS_15OMXNodeInstanceEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorINS_7String8EPNS_13OMXPluginBaseEEE",
   "name" : "android::KeyedVector<android::String8, android::OMXPluginBase *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorINS_7String8EPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android11KeyedVectorINS_7String8EPNS_13OMXPluginBaseEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIN7android7String8E", "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "name" : "android::KeyedVector<OMX_COMPONENTTYPE *, android::OMXPluginBase *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "self_type" : "_ZTIN7android11KeyedVectorIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIP17OMX_COMPONENTTYPE", "_ZTIPN7android13OMXPluginBaseE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIP20OMX_BUFFERHEADERTYPEjEE",
   "name" : "android::KeyedVector<OMX_BUFFERHEADERTYPE *, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIP20OMX_BUFFERHEADERTYPEjEE",
   "self_type" : "_ZTIN7android11KeyedVectorIP20OMX_BUFFERHEADERTYPEjEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIP20OMX_BUFFERHEADERTYPE", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIP20OMX_BUFFERHEADERTYPEjEE",
   "name" : "android::KeyedVector<OMX_BUFFERHEADERTYPE *, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIP20OMX_BUFFERHEADERTYPEjEE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTIN7android11KeyedVectorIP20OMX_BUFFERHEADERTYPEjEE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" :
   [
    "_ZTIP20OMX_BUFFERHEADERTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEE",
   "name" : "android::KeyedVector<android::OMXNodeInstance *, android::wp<android::hidl::base::V1_0::IBase> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEE",
   "self_type" : "_ZTIN7android11KeyedVectorIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" :
   [
    "_ZTIPN7android15OMXNodeInstanceE",
    "_ZTIN7android2wpINS_4hidl4base4V1_05IBaseEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEE",
   "name" : "android::KeyedVector<android::OMXNodeInstance *, android::wp<android::hidl::base::V1_0::IBase> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTIN7android11KeyedVectorIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" :
   [
    "_ZTIPN7android15OMXNodeInstanceE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
    "_ZTIN7android2wpINS_4hidl4base4V1_05IBaseEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEE",
   "name" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::CachedBuffer> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEE",
   "self_type" : "_ZTIN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTINSt3__110shared_ptrIN7android19GraphicBufferSource12CachedBufferEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEE",
   "name" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::AcquiredBuffer> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEE",
   "self_type" : "_ZTIN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTINSt3__110shared_ptrIN7android19GraphicBufferSource14AcquiredBufferEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIjP20OMX_BUFFERHEADERTYPEEE",
   "name" : "android::KeyedVector<unsigned int, OMX_BUFFERHEADERTYPE *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIjP20OMX_BUFFERHEADERTYPEEE",
   "self_type" : "_ZTIN7android11KeyedVectorIjP20OMX_BUFFERHEADERTYPEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIj", "_ZTIP20OMX_BUFFERHEADERTYPE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIjP20OMX_BUFFERHEADERTYPEEE",
   "name" : "android::KeyedVector<unsigned int, OMX_BUFFERHEADERTYPE *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIjP20OMX_BUFFERHEADERTYPEEE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTIN7android11KeyedVectorIjP20OMX_BUFFERHEADERTYPEEE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIP20OMX_BUFFERHEADERTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIjjEE",
   "name" : "android::KeyedVector<unsigned int, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIjjEE",
   "self_type" : "_ZTIN7android11KeyedVectorIjjEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIj", "_ZTIj" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIllEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIllEE",
   "name" : "android::KeyedVector<long, long>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIllEE",
   "self_type" : "_ZTIN7android11KeyedVectorIllEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "_ZTIl", "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android11MediaImage29PlaneInfoE",
   "name" : "android::MediaImage2::PlaneInfo",
   "referenced_type" : "_ZTIN7android11MediaImage29PlaneInfoE",
   "self_type" : "_ZTIN7android11MediaImage29PlaneInfoE",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "_ZTIN7android11MediaImage24TypeE"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mBitDepthAllocated",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA4_N7android11MediaImage29PlaneInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11MediaImage2E",
   "name" : "android::MediaImage2",
   "referenced_type" : "_ZTIN7android11MediaImage2E",
   "self_type" : "_ZTIN7android11MediaImage2E",
   "size" : 104,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mRange",
     "referenced_type" : "_ZTIN7android12ColorAspects5RangeE"
    },
    {
     "field_name" : "mPrimaries",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android12ColorAspects9PrimariesE"
    },
    {
     "field_name" : "mTransfer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android12ColorAspects8TransferE"
    },
    {
     "field_name" : "mMatrixCoeffs",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android12ColorAspects12MatrixCoeffsE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12ColorAspectsE",
   "name" : "android::ColorAspects",
   "referenced_type" : "_ZTIN7android12ColorAspectsE",
   "self_type" : "_ZTIN7android12ColorAspectsE",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android12NativeHandleE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_5FenceEEE",
   "name" : "android::LightRefBase<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_5FenceEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_5FenceEEE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android5FenceE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12NativeHandleE",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12NativeHandleE",
   "self_type" : "_ZTIN7android12NativeHandleE",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorI13OMX_INDEXTYPEEE",
   "name" : "android::SortedVector<OMX_INDEXTYPE>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorI13OMX_INDEXTYPEEE",
   "self_type" : "_ZTIN7android12SortedVectorI13OMX_INDEXTYPEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTI13OMX_INDEXTYPE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorI13OMX_INDEXTYPEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorI13OMX_INDEXTYPEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorI13OMX_INDEXTYPEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorI13OMX_INDEXTYPEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorI13OMX_INDEXTYPEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorI13OMX_INDEXTYPEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorI13OMX_INDEXTYPEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorI13OMX_INDEXTYPEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorI13OMX_INDEXTYPEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorI13OMX_INDEXTYPEE10do_compareEPKvS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::wp<android::hidl::base::V1_0::IBase>, android::sp<android::OMXNodeInstance> > >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEE10do_compareEPKvSE_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String8, android::OMXPluginBase *> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEE10do_compareEPKvS8_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEE10do_compareEPKvS9_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<OMX_BUFFERHEADERTYPE *, unsigned int> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEE10do_compareEPKvS7_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::OMXNodeInstance *, android::wp<android::hidl::base::V1_0::IBase> > >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEE10do_compareEPKvSD_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<int, std::shared_ptr<android::GraphicBufferSource::CachedBuffer> > >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<int, std::shared_ptr<android::GraphicBufferSource::AcquiredBuffer> > >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<unsigned int, OMX_BUFFERHEADERTYPE *> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjP20OMX_BUFFERHEADERTYPEEEE10do_compareEPKvS7_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<unsigned int, unsigned int> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIjjEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIllEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<long, long> >",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIllEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIllEEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIllEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIllEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIllEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIllEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIllEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIllEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIllEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIllEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIllEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIllEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIllEEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEEE",
   "name" : "android::SortedVector<OMX_BUFFERHEADERTYPE *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEEE",
   "self_type" : "_ZTIN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEEE",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "_ZTIP20OMX_BUFFERHEADERTYPE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEEE",
   "name" : "android::SortedVector<OMX_BUFFERHEADERTYPE *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEEE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "self_type" : "_ZTIN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEEE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/1.0/WGraphicBufferSource.sdump",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" :
   [
    "_ZTIP20OMX_BUFFERHEADERTYPE#ODR:out/soong/.intermediates/frameworks/av/media/libstagefright/omx/libstagefright_omx/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/av/media/libstagefright/omx/OmxGraphicBufferSource.sdump"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIP20OMX_BUFFERHEADERTYPEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIP20OMX_BUFFERHEADERTYPEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android12_AUnion_implE",
   "name" : "android::_AUnion_impl",
   "referenced_type" : "_ZTIN7android12_AUnion_implE",
   "self_type" : "_ZTIN7android12_AUnion_implE",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AData.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "y",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android13HDRStaticInfo10Primaries1E",
   "name" : "android::HDRStaticInfo::Primaries1",
   "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E",
   "self_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mR",
     "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E"
    },
    {
     "field_name" : "mG",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E"
    },
    {
     "field_name" : "mB",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E"
    },
    {
     "field_name" : "mW",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android13HDRStaticInfo10Primaries1E"
    },
    {
     "field_name" : "mMaxDisplayLuminance",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mMinDisplayLuminance",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mMaxContentLightLevel",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mMaxFrameAverageLightLevel",
     "field_offset" : 176,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android13HDRStaticInfo5Type1E",
   "name" : "android::HDRStaticInfo::Type1",
   "referenced_type" : "_ZTIN7android13HDRStaticInfo5Type1E",
   "self_type" : "_ZTIN7android13HDRStaticInfo5Type1E",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mID",
     "referenced_type" : "_ZTIN7android13HDRStaticInfo2IDE"
    },
    {
     "field_offset" : 8,
     "referenced_type" : "_ZTIN7android13HDRStaticInfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android13HDRStaticInfoE",
   "name" : "android::HDRStaticInfo",
   "referenced_type" : "_ZTIN7android13HDRStaticInfoE",
   "self_type" : "_ZTIN7android13HDRStaticInfoE",
   "size" : 25,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "sType1",
     "referenced_type" : "_ZTIN7android13HDRStaticInfo5Type1E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android13HDRStaticInfoUt_E",
   "name" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android13HDRStaticInfoUt_E",
   "self_type" : "_ZTIN7android13HDRStaticInfoUt_E",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android13OMXPluginBaseE",
   "name" : "android::OMXPluginBase",
   "referenced_type" : "_ZTIN7android13OMXPluginBaseE",
   "self_type" : "_ZTIN7android13OMXPluginBaseE",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/OMXPluginBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13OMXPluginBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13OMXPluginBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13OMXPluginBaseD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase21makeComponentInstanceEPKcPK16OMX_CALLBACKTYPEPvPP17OMX_COMPONENTTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase24destroyComponentInstanceEP17OMX_COMPONENTTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase19enumerateComponentsEPcmj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase19getRolesOfComponentEPKcPNS_6VectorINS_7String8EEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android13OMXPluginBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android13SoftOMXPluginE",
   "name" : "android::SoftOMXPlugin",
   "referenced_type" : "_ZTIN7android13SoftOMXPluginE",
   "self_type" : "_ZTIN7android13SoftOMXPluginE",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/omx/include/media/stagefright/omx/SoftOMXPlugin.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13SoftOMXPluginE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13SoftOMXPluginD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13SoftOMXPluginD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin21makeComponentInstanceEPKcPK16OMX_CALLBACKTYPEPvPP17OMX_COMPONENTTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin24destroyComponentInstanceEP17OMX_COMPONENTTYPE"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin19enumerateComponentsEPcmj"
    },
    {
     "mangled_component_name" : "_ZN7android13SoftOMXPlugin19getRolesOfComponentEPKcPNS_6VectorINS_7String8EEE"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerI13OMX_INDEXTYPEEE",
   "name" : "android::trait_pointer<OMX_INDEXTYPE>",
   "referenced_type" : "_ZTIN7android13trait_pointerI13OMX_INDEXTYPEEE",
   "self_type" : "_ZTIN7android13trait_pointerI13OMX_INDEXTYPEEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTI13OMX_INDEXTYPE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_15OMXNodeInstance12ActiveBufferEEE",
   "name" : "android::trait_pointer<android::OMXNodeInstance::ActiveBuffer>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_15OMXNodeInstance12ActiveBufferEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_15OMXNodeInstance12ActiveBufferEEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android15OMXNodeInstance12ActiveBufferE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::wp<android::hidl::base::V1_0::IBase>, android::sp<android::OMXNodeInstance> > >",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEEEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tINS_2wpINS_4hidl4base4V1_05IBaseEEENS_2spINS_15OMXNodeInstanceEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::String8, android::OMXPluginBase *> >",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tINS_7String8EPNS_13OMXPluginBaseEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<OMX_COMPONENTTYPE *, android::OMXPluginBase *> >",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEEEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIP17OMX_COMPONENTTYPEPNS_13OMXPluginBaseEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<OMX_BUFFERHEADERTYPE *, unsigned int> >",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEEEE",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android16key_value_pair_tIP20OMX_BUFFERHEADERTYPEjEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIPNS_15OMXNodeInstanceENS_2wpINS_4hidl4base4V1_05IBaseEEEEEEE",
