{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA256_h",
   "name" : "unsigned char [256]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA256_h",
   "size" : 256,
   "source_file" : "/external/libxml2/include/libxml/chvalid.h"
  },
  {
   "linker_set_key" : "_ZTIA_h",
   "name" : "unsigned char []",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA_h",
   "source_file" : "/external/libxml2/include/libxml/parserInternals.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,

   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIA256_Kh",
   "name" : "unsigned char const[256]",
   "referenced_type" : "_ZTIA256_h",
   "self_type" : "_ZTIA256_Kh",
   "size" : 256,
   "source_file" : "/external/libxml2/include/libxml/chvalid.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIA_Kh",
   "name" : "unsigned char const[]",
   "referenced_type" : "_ZTIA_h",
   "self_type" : "_ZTIA_Kh",
   "source_file" : "/external/libxml2/include/libxml/parserInternals.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10_xmlBuffer",
   "name" : "const _xmlBuffer",
   "referenced_type" : "_ZTI10_xmlBuffer",
   "self_type" : "_ZTIK10_xmlBuffer",
   "size" : 32,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12_xmlChLRange",
   "name" : "const _xmlChLRange",
   "referenced_type" : "_ZTI12_xmlChLRange",
   "self_type" : "_ZTIK12_xmlChLRange",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/chvalid.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12_xmlChSRange",
   "name" : "const _xmlChSRange",
   "referenced_type" : "_ZTI12_xmlChSRange",
   "self_type" : "_ZTIK12_xmlChSRange",
   "size" : 4,
   "source_file" : "/external/libxml2/include/libxml/chvalid.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK16_xmlChRangeGroup",
   "name" : "const _xmlChRangeGroup",
   "referenced_type" : "_ZTI16_xmlChRangeGroup",
   "self_type" : "_ZTIK16_xmlChRangeGroup",
   "size" : 24,
   "source_file" : "/external/libxml2/include/libxml/chvalid.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK18_xmlParserNodeInfo",
   "name" : "const _xmlParserNodeInfo",
   "referenced_type" : "_ZTI18_xmlParserNodeInfo",
   "self_type" : "_ZTIK18_xmlParserNodeInfo",
   "size" : 40,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7_xmlBuf",
   "name" : "const _xmlBuf",
   "referenced_type" : "_ZTI7_xmlBuf",
   "self_type" : "_ZTIK7_xmlBuf",
   "size" : 64,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7_xmlDoc",
   "name" : "const _xmlDoc",
   "referenced_type" : "_ZTI7_xmlDoc",
   "self_type" : "_ZTIK7_xmlDoc",
   "size" : 176,
   "source_file" : "/external/libxml2/include/libxml/entities.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8_xmlNode",
   "name" : "const _xmlNode",
   "referenced_type" : "_ZTI8_xmlNode",
   "self_type" : "_ZTIK8_xmlNode",
   "size" : 120,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP14_xmlParserCtxt",
   "name" : "_xmlParserCtxt *const",
   "referenced_type" : "_ZTIP14_xmlParserCtxt",
   "self_type" : "_ZTIKP14_xmlParserCtxt",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP18_xmlParserNodeInfo",
   "name" : "_xmlParserNodeInfo *const",
   "referenced_type" : "_ZTIP18_xmlParserNodeInfo",
   "self_type" : "_ZTIKP18_xmlParserNodeInfo",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP21_xmlParserNodeInfoSeq",
   "name" : "_xmlParserNodeInfoSeq *const",
   "referenced_type" : "_ZTIP21_xmlParserNodeInfoSeq",
   "self_type" : "_ZTIKP21_xmlParserNodeInfoSeq",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7_xmlBuf",
   "name" : "_xmlBuf *const",
   "referenced_type" : "_ZTIP7_xmlBuf",
   "self_type" : "_ZTIKP7_xmlBuf",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP8_xmlList",
   "name" : "_xmlList *const",
   "referenced_type" : "_ZTIP8_xmlList",
   "self_type" : "_ZTIKP8_xmlList",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/list.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP8_xmlNode",
   "name" : "_xmlNode *const",
   "referenced_type" : "_ZTIP8_xmlNode",
   "self_type" : "_ZTIKP8_xmlNode",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPh",
   "name" : "unsigned char *const",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIKPh",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/xlink.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/external/libxml2/include/libxml/valid.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/external/libxml2/include/libxml/list.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "content",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "use",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alloc",
     "field_offset" : 128,
     "referenced_type" : "_ZTI25xmlBufferAllocationScheme"
    },
    {
     "field_name" : "contentIO",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTI10_xmlBuffer",
   "name" : "_xmlBuffer",
   "referenced_type" : "_ZTI10_xmlBuffer",
   "self_type" : "_ZTI10_xmlBuffer",
   "size" : 32,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_private",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14xmlElementType"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "children",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "last",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "parent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7_xmlDtd"
    },
    {
     "field_name" : "next",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "prev",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "doc",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "orig",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "content",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "length",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "etype",
     "field_offset" : 736,
     "referenced_type" : "_ZTI13xmlEntityType"
    },
    {
     "field_name" : "ExternalID",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "SystemID",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "nexte",
     "field_offset" : 896,
     "referenced_type" : "_ZTIP10_xmlEntity"
    },
    {
     "field_name" : "URI",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "owner",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "checked",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10_xmlEntity",
   "name" : "_xmlEntity",
   "referenced_type" : "_ZTI10_xmlEntity",
   "self_type" : "_ZTI10_xmlEntity",
   "size" : 136,
   "source_file" : "/external/libxml2/include/libxml/entities.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "targetNamespace",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "version",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "id",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "doc",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "annot",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP15_xmlSchemaAnnot"
    },
    {
     "field_name" : "flags",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "typeDecl",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "attrDecl",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "attrgrpDecl",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "elemDecl",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "notaDecl",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "schemasImports",
     "field_offset" : 768,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "_private",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "groupDecl",
     "field_offset" : 896,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "dict",
     "field_offset" : 960,
     "referenced_type" : "_ZTIP8_xmlDict"
    },
    {
     "field_name" : "includes",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "preserve",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "counter",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "idcDef",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "volatiles",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI10_xmlSchema",
   "name" : "_xmlSchema",
   "referenced_type" : "_ZTI10_xmlSchema",
   "self_type" : "_ZTI10_xmlSchema",
   "size" : 160,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_private",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14xmlElementType"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "children",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "last",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "parent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7_xmlDtd"
    },
    {
     "field_name" : "next",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "prev",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "doc",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "etype",
     "field_offset" : 576,
     "referenced_type" : "_ZTI17xmlElementTypeVal"
    },
    {
     "field_name" : "content",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP18_xmlElementContent"
    },
    {
     "field_name" : "attributes",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP13_xmlAttribute"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "contModel",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP10_xmlRegexp"
    }
   ],
   "linker_set_key" : "_ZTI11_xmlElement",
   "name" : "_xmlElement",
   "referenced_type" : "_ZTI11_xmlElement",
   "self_type" : "_ZTI11_xmlElement",
   "size" : 112,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nodeNr",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodeMax",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodeTab",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP8_xmlNode"
    }
   ],
   "linker_set_key" : "_ZTI11_xmlNodeSet",
   "name" : "_xmlNodeSet",
   "referenced_type" : "_ZTI11_xmlNodeSet",
   "self_type" : "_ZTI11_xmlNodeSet",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/xpath.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "low",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "high",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12_xmlChLRange",
   "name" : "_xmlChLRange",
   "referenced_type" : "_ZTI12_xmlChLRange",
   "self_type" : "_ZTI12_xmlChLRange",
   "size" : 8,
   "source_file" : "/external/libxml2/include/libxml/chvalid.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "low",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "high",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI12_xmlChSRange",
   "name" : "_xmlChSRange",
   "referenced_type" : "_ZTI12_xmlChSRange",
   "self_type" : "_ZTI12_xmlChSRange",
   "size" : 4,
   "source_file" : "/external/libxml2/include/libxml/chvalid.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "PublicID",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "SystemID",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI12_xmlNotation",
   "name" : "_xmlNotation",
   "referenced_type" : "_ZTI12_xmlNotation",
   "self_type" : "_ZTI12_xmlNotation",
   "size" : 24,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "simple",
     "referenced_type" : "_ZTIPFvPvP8_xmlNodePhS2_S2_E"
    },
    {
     "field_name" : "extended",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvP8_xmlNodeiPKPhS4_iS4_S4_P9xlinkShowP12xlinkActuateiS4_PPKhE"
    },
    {
     "field_name" : "set",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvPvP8_xmlNodeiPKPhS4_iS4_PPKhE"
    }
   ],
   "linker_set_key" : "_ZTI13_xlinkHandler",
   "name" : "_xlinkHandler",
   "referenced_type" : "_ZTI13_xlinkHandler",
   "self_type" : "_ZTI13_xlinkHandler",
   "size" : 24,
   "source_file" : "/external/libxml2/include/libxml/xlink.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_private",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14xmlElementType"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "children",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "last",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "parent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7_xmlDtd"
    },
    {
     "field_name" : "next",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "prev",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "doc",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "nexth",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP13_xmlAttribute"
    },
    {
     "field_name" : "atype",
     "field_offset" : 640,
     "referenced_type" : "_ZTI16xmlAttributeType"
    },
    {
     "field_name" : "def",
     "field_offset" : 672,
     "referenced_type" : "_ZTI19xmlAttributeDefault"
    },
    {
     "field_name" : "defaultValue",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "tree",
     "field_offset" : 768,
     "referenced_type" : "_ZTIP15_xmlEnumeration"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "elem",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI13_xmlAttribute",
   "name" : "_xmlAttribute",
   "referenced_type" : "_ZTI13_xmlAttribute",
   "self_type" : "_ZTI13_xmlAttribute",
   "size" : 120,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "filename",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "doc",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "node",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "pctxt",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP16_xmlXPathContext"
    },
    {
     "field_name" : "loaded",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "output",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7__sFILE"
    },
    {
     "field_name" : "input",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFPcS_E"
    }
   ],
   "linker_set_key" : "_ZTI13_xmlShellCtxt",
   "name" : "_xmlShellCtxt",
   "referenced_type" : "_ZTI13_xmlShellCtxt",
   "self_type" : "_ZTI13_xmlShellCtxt",
   "size" : 56,
   "source_file" : "/external/libxml2/include/libxml/debugXML.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "userData",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "error",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvPKczE"
    },
    {
     "field_name" : "warning",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvPvPKczE"
    },
    {
     "field_name" : "node",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "nodeNr",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodeMax",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodeTab",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPP8_xmlNode"
    },
    {
     "field_name" : "finishDtd",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "doc",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "valid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "vstate",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP14_xmlValidState"
    },
    {
     "field_name" : "vstateNr",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "vstateMax",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "vstateTab",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP14_xmlValidState"
    },
    {
     "field_name" : "am",
     "field_offset" : 768,
     "referenced_type" : "_ZTIP12_xmlAutomata"
    },
    {
     "field_name" : "state",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP17_xmlAutomataState"
    }
   ],
   "linker_set_key" : "_ZTI13_xmlValidCtxt",
   "name" : "_xmlValidCtxt",
   "referenced_type" : "_ZTI13_xmlValidCtxt",
   "self_type" : "_ZTI13_xmlValidCtxt",
   "size" : 112,
   "source_file" : "/external/libxml2/include/libxml/valid.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "func",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFP15_xmlXPathObjectP22_xmlXPathParserContextS0_E"
    }
   ],
   "linker_set_key" : "_ZTI13_xmlXPathAxis",
   "name" : "_xmlXPathAxis",
   "referenced_type" : "_ZTI13_xmlXPathAxis",
   "self_type" : "_ZTI13_xmlXPathAxis",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/xpath.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "func",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP15_xmlXPathObjectiE"
    }
   ],
   "linker_set_key" : "_ZTI13_xmlXPathType",
   "name" : "_xmlXPathType",
   "referenced_type" : "_ZTI13_xmlXPathType",
   "self_type" : "_ZTI13_xmlXPathType",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/xpath.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sax",
     "referenced_type" : "_ZTIP14_xmlSAXHandler"
    },
    {
     "field_name" : "userData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "myDoc",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "wellFormed",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "replaceEntities",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "version",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "standalone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "html",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "input",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP15_xmlParserInput"
    },
    {
     "field_name" : "inputNr",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "inputMax",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "inputTab",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPP15_xmlParserInput"
    },
    {
     "field_name" : "node",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "nodeNr",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodeMax",
     "field_offset" : 736,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodeTab",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPP8_xmlNode"
    },
    {
     "field_name" : "record_info",
     "field_offset" : 832,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "node_seq",
     "field_offset" : 896,
     "referenced_type" : "_ZTI21_xmlParserNodeInfoSeq"
    },
    {
     "field_name" : "errNo",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "hasExternalSubset",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "hasPErefs",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "external",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "valid",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "validate",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "vctxt",
     "field_offset" : 1280,
     "referenced_type" : "_ZTI13_xmlValidCtxt"
    },
    {
     "field_name" : "instate",
     "field_offset" : 2176,
     "referenced_type" : "_ZTI19xmlParserInputState"
    },
    {
     "field_name" : "token",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "directory",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "name",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "nameNr",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nameMax",
     "field_offset" : 2400,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nameTab",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIPPKh"
    },
    {
     "field_name" : "nbChars",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "checkIndex",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "keepBlanks",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "disableSAX",
     "field_offset" : 2656,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "inSubset",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "intSubName",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "extSubURI",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "extSubSystem",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "space",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "spaceNr",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "spaceMax",
     "field_offset" : 3040,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "spaceTab",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "depth",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "entity",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIP15_xmlParserInput"
    },
    {
     "field_name" : "charset",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodelen",
     "field_offset" : 3296,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodemem",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pedantic",
     "field_offset" : 3360,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_private",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "loadsubset",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "linenumbers",
     "field_offset" : 3488,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "catalogs",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "recovery",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "progressive",
     "field_offset" : 3616,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dict",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIP8_xmlDict"
    },
    {
     "field_name" : "atts",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPPKh"
    },
    {
     "field_name" : "maxatts",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "docdict",
     "field_offset" : 3808,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "str_xml",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "str_xmlns",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "str_xml_ns",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "sax2",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nsNr",
     "field_offset" : 4064,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nsMax",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nsTab",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIPPKh"
    },
    {
     "field_name" : "attallocs",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "pushTab",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIPPv"
    },
    {
     "field_name" : "attsDefault",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "attsSpecial",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "nsWellFormed",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "options",
     "field_offset" : 4512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dictNames",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "freeElemsNr",
     "field_offset" : 4576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "freeElems",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "freeAttrsNr",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "freeAttrs",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIP8_xmlAttr"
    },
    {
     "field_name" : "lastError",
     "field_offset" : 4800,
     "referenced_type" : "_ZTI9_xmlError"
    },
    {
     "field_name" : "parseMode",
     "field_offset" : 5504,
     "referenced_type" : "_ZTI13xmlParserMode"
    },
    {
     "field_name" : "nbentities",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sizeentities",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "nodeInfo",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIP18_xmlParserNodeInfo"
    },
    {
     "field_name" : "nodeInfoNr",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodeInfoMax",
     "field_offset" : 5792,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nodeInfoTab",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIP18_xmlParserNodeInfo"
    },
    {
     "field_name" : "input_id",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sizeentcopy",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI14_xmlParserCtxt",
   "name" : "_xmlParserCtxt",
   "referenced_type" : "_ZTI14_xmlParserCtxt",
   "self_type" : "_ZTI14_xmlParserCtxt",
   "size" : 752,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "internalSubset",
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_E"
    },
    {
     "field_name" : "isStandalone",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "hasInternalSubset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "hasExternalSubset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "resolveEntity",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFP15_xmlParserInputPvPKhS3_E"
    },
    {
     "field_name" : "getEntity",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP10_xmlEntityPvPKhE"
    },
    {
     "field_name" : "entityDecl",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvPvPKhiS1_S1_PhE"
    },
    {
     "field_name" : "notationDecl",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_E"
    },
    {
     "field_name" : "attributeDecl",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFvPvPKhS1_iiS1_P15_xmlEnumerationE"
    },
    {
     "field_name" : "elementDecl",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvPvPKhiP18_xmlElementContentE"
    },
    {
     "field_name" : "unparsedEntityDecl",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_S1_E"
    },
    {
     "field_name" : "setDocumentLocator",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvPvP14_xmlSAXLocatorE"
    },
    {
     "field_name" : "startDocument",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "endDocument",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "startElement",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFvPvPKhPS1_E"
    },
    {
     "field_name" : "endElement",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFvPvPKhE"
    },
    {
     "field_name" : "reference",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFvPvPKhE"
    },
    {
     "field_name" : "characters",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFvPvPKhiE"
    },
    {
     "field_name" : "ignorableWhitespace",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFvPvPKhiE"
    },
    {
     "field_name" : "processingInstruction",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFvPvPKhS1_E"
    },
    {
     "field_name" : "comment",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFvPvPKhE"
    },
    {
     "field_name" : "warning",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFvPvPKczE"
    },
    {
     "field_name" : "error",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFvPvPKczE"
    },
    {
     "field_name" : "fatalError",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFvPvPKczE"
    },
    {
     "field_name" : "getParameterEntity",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFP10_xmlEntityPvPKhE"
    },
    {
     "field_name" : "cdataBlock",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFvPvPKhiE"
    },
    {
     "field_name" : "externalSubset",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_E"
    },
    {
     "field_name" : "initialized",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_private",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "startElementNs",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_iPS1_iiS2_E"
    },
    {
     "field_name" : "endElementNs",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_E"
    },
    {
     "field_name" : "serror",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIPFvPvP9_xmlErrorE"
    }
   ],
   "linker_set_key" : "_ZTI14_xmlSAXHandler",
   "name" : "_xmlSAXHandler",
   "referenced_type" : "_ZTI14_xmlSAXHandler",
   "self_type" : "_ZTI14_xmlSAXHandler",
   "size" : 256,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "getPublicId",
     "referenced_type" : "_ZTIPFPKhPvE"
    },
    {
     "field_name" : "getSystemId",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFPKhPvE"
    },
    {
     "field_name" : "getLineNumber",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "getColumnNumber",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPvE"
    }
   ],
   "linker_set_key" : "_ZTI14_xmlSAXLocator",
   "name" : "_xmlSAXLocator",
   "referenced_type" : "_ZTI14_xmlSAXLocator",
   "self_type" : "_ZTI14_xmlSAXLocator",
   "size" : 32,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI17xmlSchemaTypeType"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "id",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "ref",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "refNs",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "annot",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP15_xmlSchemaAnnot"
    },
    {
     "field_name" : "subtypes",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    },
    {
     "field_name" : "attributes",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP19_xmlSchemaAttribute"
    },
    {
     "field_name" : "node",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "minOccurs",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxOccurs",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "contentType",
     "field_offset" : 736,
     "referenced_type" : "_ZTI20xmlSchemaContentType"
    },
    {
     "field_name" : "base",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "baseNs",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "baseType",
     "field_offset" : 896,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    },
    {
     "field_name" : "facets",
     "field_offset" : 960,
     "referenced_type" : "_ZTIP15_xmlSchemaFacet"
    },
    {
     "field_name" : "redef",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    },
    {
     "field_name" : "recurse",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "attributeUses",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPP23_xmlSchemaAttributeLink"
    },
    {
     "field_name" : "attributeWildcard",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIP18_xmlSchemaWildcard"
    },
    {
     "field_name" : "builtInType",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "memberTypes",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIP18_xmlSchemaTypeLink"
    },
    {
     "field_name" : "facetSet",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIP19_xmlSchemaFacetLink"
    },
    {
     "field_name" : "refPrefix",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "contentTypeDef",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    },
    {
     "field_name" : "contModel",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIP10_xmlRegexp"
    },
    {
     "field_name" : "targetNamespace",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "attrUses",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI14_xmlSchemaType",
   "name" : "_xmlSchemaType",
   "referenced_type" : "_ZTI14_xmlSchemaType",
   "self_type" : "_ZTI14_xmlSchemaType",
   "size" : 224,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "func",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvP22_xmlXPathParserContextiE"
    }
   ],
   "linker_set_key" : "_ZTI14_xmlXPathFunct",
   "name" : "_xmlXPathFunct",
   "referenced_type" : "_ZTI14_xmlXPathFunct",
   "self_type" : "_ZTI14_xmlXPathFunct",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/xpath.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_private",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "namespaceMap",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "getNsForNodeFunc",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFP6_xmlNsP15_xmlDOMWrapCtxtP8_xmlNodePKhS6_E"
    }
   ],
   "linker_set_key" : "_ZTI15_xmlDOMWrapCtxt",
   "name" : "_xmlDOMWrapCtxt",
   "referenced_type" : "_ZTI15_xmlDOMWrapCtxt",
   "self_type" : "_ZTI15_xmlDOMWrapCtxt",
   "size" : 32,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP15_xmlEnumeration"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI15_xmlEnumeration",
   "name" : "_xmlEnumeration",
   "referenced_type" : "_ZTI15_xmlEnumeration",
   "self_type" : "_ZTI15_xmlEnumeration",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "xmlParserVersion",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "xmlDefaultSAXLocator",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14_xmlSAXLocator"
    },
    {
     "field_name" : "xmlDefaultSAXHandler",
     "field_offset" : 320,
     "referenced_type" : "_ZTI16_xmlSAXHandlerV1"
    },
    {
     "field_name" : "docbDefaultSAXHandler",
     "field_offset" : 2112,
     "referenced_type" : "_ZTI16_xmlSAXHandlerV1"
    },
    {
     "field_name" : "htmlDefaultSAXHandler",
     "field_offset" : 3904,
     "referenced_type" : "_ZTI16_xmlSAXHandlerV1"
    },
    {
     "field_name" : "xmlFree",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "xmlMalloc",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIPFPvmE"
    },
    {
     "field_name" : "xmlMemStrdup",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIPFPcPKcE"
    },
    {
     "field_name" : "xmlRealloc",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIPFPvS_mE"
    },
    {
     "field_name" : "xmlGenericError",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIPFvPvPKczE"
    },
    {
     "field_name" : "xmlStructuredError",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPFvPvP9_xmlErrorE"
    },
    {
     "field_name" : "xmlGenericErrorContext",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "oldXMLWDcompatibility",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlBufferAllocScheme",
     "field_offset" : 6176,
     "referenced_type" : "_ZTI25xmlBufferAllocationScheme"
    },
    {
     "field_name" : "xmlDefaultBufferSize",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlSubstituteEntitiesDefaultValue",
     "field_offset" : 6240,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlDoValidityCheckingDefaultValue",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlGetWarningsDefaultValue",
     "field_offset" : 6304,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlKeepBlanksDefaultValue",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlLineNumbersDefaultValue",
     "field_offset" : 6368,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlLoadExtDtdDefaultValue",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlParserDebugEntities",
     "field_offset" : 6432,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlPedanticParserDefaultValue",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlSaveNoEmptyTags",
     "field_offset" : 6496,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlIndentTreeOutput",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xmlTreeIndentString",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "xmlRegisterNodeDefaultValue",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIPFvP8_xmlNodeE"
    },
    {
     "field_name" : "xmlDeregisterNodeDefaultValue",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIPFvP8_xmlNodeE"
    },
    {
     "field_name" : "xmlMallocAtomic",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIPFPvmE"
    },
    {
     "field_name" : "xmlLastError",
     "field_offset" : 6848,
     "referenced_type" : "_ZTI9_xmlError"
    },
    {
     "field_name" : "xmlParserInputBufferCreateFilenameValue",
     "field_offset" : 7552,
     "referenced_type" : "_ZTIPFP21_xmlParserInputBufferPKc15xmlCharEncodingE"
    },
    {
     "field_name" : "xmlOutputBufferCreateFilenameValue",
     "field_offset" : 7616,
     "referenced_type" : "_ZTIPFP16_xmlOutputBufferPKcP23_xmlCharEncodingHandleriE"
    },
    {
     "field_name" : "xmlStructuredErrorContext",
     "field_offset" : 7680,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15_xmlGlobalState",
   "name" : "_xmlGlobalState",
   "referenced_type" : "_ZTI15_xmlGlobalState",
   "self_type" : "_ZTI15_xmlGlobalState",
   "size" : 968,
   "source_file" : "/external/libxml2/include/libxml/globals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locNr",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "locMax",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "locTab",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP15_xmlXPathObject"
    }
   ],
   "linker_set_key" : "_ZTI15_xmlLocationSet",
   "name" : "_xmlLocationSet",
   "referenced_type" : "_ZTI15_xmlLocationSet",
   "self_type" : "_ZTI15_xmlLocationSet",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/xpointer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIP21_xmlParserInputBuffer"
    },
    {
     "field_name" : "filename",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "directory",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "base",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "cur",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "end",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "length",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "line",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "col",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "consumed",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "free",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvPhE"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "version",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "standalone",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "id",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15_xmlParserInput",
   "name" : "_xmlParserInput",
   "referenced_type" : "_ZTI15_xmlParserInput",
   "self_type" : "_ZTI15_xmlParserInput",
   "size" : 104,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP15_xmlSchemaAnnot"
    },
    {
     "field_name" : "content",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8_xmlNode"
    }
   ],
   "linker_set_key" : "_ZTI15_xmlSchemaAnnot",
   "name" : "_xmlSchemaAnnot",
   "referenced_type" : "_ZTI15_xmlSchemaAnnot",
   "self_type" : "_ZTI15_xmlSchemaAnnot",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI17xmlSchemaTypeType"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15_xmlSchemaFacet"
    },
    {
     "field_name" : "value",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "id",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "annot",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP15_xmlSchemaAnnot"
    },
    {
     "field_name" : "node",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "fixed",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "whitespace",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "val",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP13_xmlSchemaVal"
    },
    {
     "field_name" : "regexp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP10_xmlRegexp"
    }
   ],
   "linker_set_key" : "_ZTI15_xmlSchemaFacet",
   "name" : "_xmlSchemaFacet",
   "referenced_type" : "_ZTI15_xmlSchemaFacet",
   "self_type" : "_ZTI15_xmlSchemaFacet",
   "size" : 72,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI18xmlXPathObjectType"
    },
    {
     "field_name" : "nodesetval",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP11_xmlNodeSet"
    },
    {
     "field_name" : "boolval",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "floatval",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "stringval",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "user",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "index",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "user2",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "index2",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15_xmlXPathObject",
   "name" : "_xmlXPathObject",
   "referenced_type" : "_ZTI15_xmlXPathObject",
   "self_type" : "_ZTI15_xmlXPathObject",
   "size" : 72,
   "source_file" : "/external/libxml2/include/libxml/xpath.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nbShortRange",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nbLongRange",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shortRange",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK12_xmlChSRange"
    },
    {
     "field_name" : "longRange",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK12_xmlChLRange"
    }
   ],
   "linker_set_key" : "_ZTI16_xmlChRangeGroup",
   "name" : "_xmlChRangeGroup",
   "referenced_type" : "_ZTI16_xmlChRangeGroup",
   "self_type" : "_ZTI16_xmlChRangeGroup",
   "size" : 24,
   "source_file" : "/external/libxml2/include/libxml/chvalid.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "writecallback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPvPKciE"
    },
    {
     "field_name" : "closecallback",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "encoder",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP23_xmlCharEncodingHandler"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP7_xmlBuf"
    },
    {
     "field_name" : "conv",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7_xmlBuf"
    },
    {
     "field_name" : "written",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "error",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI16_xmlOutputBuffer",
   "name" : "_xmlOutputBuffer",
   "referenced_type" : "_ZTI16_xmlOutputBuffer",
   "self_type" : "_ZTI16_xmlOutputBuffer",
   "size" : 56,
   "source_file" : "/external/libxml2/include/libxml/xmlIO.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "internalSubset",
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_E"
    },
    {
     "field_name" : "isStandalone",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "hasInternalSubset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "hasExternalSubset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "resolveEntity",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFP15_xmlParserInputPvPKhS3_E"
    },
    {
     "field_name" : "getEntity",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP10_xmlEntityPvPKhE"
    },
    {
     "field_name" : "entityDecl",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvPvPKhiS1_S1_PhE"
    },
    {
     "field_name" : "notationDecl",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_E"
    },
    {
     "field_name" : "attributeDecl",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFvPvPKhS1_iiS1_P15_xmlEnumerationE"
    },
    {
     "field_name" : "elementDecl",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvPvPKhiP18_xmlElementContentE"
    },
    {
     "field_name" : "unparsedEntityDecl",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_S1_E"
    },
    {
     "field_name" : "setDocumentLocator",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvPvP14_xmlSAXLocatorE"
    },
    {
     "field_name" : "startDocument",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "endDocument",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "startElement",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFvPvPKhPS1_E"
    },
    {
     "field_name" : "endElement",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFvPvPKhE"
    },
    {
     "field_name" : "reference",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFvPvPKhE"
    },
    {
     "field_name" : "characters",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFvPvPKhiE"
    },
    {
     "field_name" : "ignorableWhitespace",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFvPvPKhiE"
    },
    {
     "field_name" : "processingInstruction",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFvPvPKhS1_E"
    },
    {
     "field_name" : "comment",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFvPvPKhE"
    },
    {
     "field_name" : "warning",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFvPvPKczE"
    },
    {
     "field_name" : "error",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFvPvPKczE"
    },
    {
     "field_name" : "fatalError",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFvPvPKczE"
    },
    {
     "field_name" : "getParameterEntity",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFP10_xmlEntityPvPKhE"
    },
    {
     "field_name" : "cdataBlock",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFvPvPKhiE"
    },
    {
     "field_name" : "externalSubset",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFvPvPKhS1_S1_E"
    },
    {
     "field_name" : "initialized",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16_xmlSAXHandlerV1",
   "name" : "_xmlSAXHandlerV1",
   "referenced_type" : "_ZTI16_xmlSAXHandlerV1",
   "self_type" : "_ZTI16_xmlSAXHandlerV1",
   "size" : 224,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "doc",
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "node",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "nb_variables_unused",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max_variables_unused",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "varHash",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "nb_types",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max_types",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "types",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP13_xmlXPathType"
    },
    {
     "field_name" : "nb_funcs_unused",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max_funcs_unused",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "funcHash",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "nb_axis",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max_axis",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "axis",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP13_xmlXPathAxis"
    },
    {
     "field_name" : "namespaces",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPP6_xmlNs"
    },
    {
     "field_name" : "nsNr",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "user",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "contextSize",
     "field_offset" : 832,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "proximityPosition",
     "field_offset" : 864,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "xptr",
     "field_offset" : 896,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "here",
     "field_offset" : 960,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "origin",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "nsHash",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIP13_xmlHashTable"
    },
    {
     "field_name" : "varLookupFunc",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFP15_xmlXPathObjectPvPKhS3_E"
    },
    {
     "field_name" : "varLookupData",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "extra",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "function",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "functionURI",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "funcLookupFunc",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFPFvP22_xmlXPathParserContextiEPvPKhS5_E"
    },
    {
     "field_name" : "funcLookupData",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "tmpNsList",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPP6_xmlNs"
    },
    {
     "field_name" : "tmpNsNr",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "userData",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "error",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPFvPvP9_xmlErrorE"
    },
    {
     "field_name" : "lastError",
     "field_offset" : 1856,
     "referenced_type" : "_ZTI9_xmlError"
    },
    {
     "field_name" : "debugNode",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "dict",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIP8_xmlDict"
    },
    {
     "field_name" : "flags",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cache",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI16_xmlXPathContext",
   "name" : "_xmlXPathContext",
   "referenced_type" : "_ZTI16_xmlXPathContext",
   "self_type" : "_ZTI16_xmlXPathContext",
   "size" : 352,
   "source_file" : "/external/libxml2/include/libxml/xpath.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI17xmlSchemaTypeType"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "id",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "ref",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "refNs",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "annot",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP15_xmlSchemaAnnot"
    },
    {
     "field_name" : "subtypes",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    },
    {
     "field_name" : "attributes",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP19_xmlSchemaAttribute"
    },
    {
     "field_name" : "node",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "minOccurs",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxOccurs",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "targetNamespace",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "namedType",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "namedTypeNs",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "substGroup",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "substGroupNs",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "scope",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "value",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "refDecl",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIP17_xmlSchemaElement"
    },
    {
     "field_name" : "contModel",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIP10_xmlRegexp"
    },
    {
     "field_name" : "contentType",
     "field_offset" : 1344,
     "referenced_type" : "_ZTI20xmlSchemaContentType"
    },
    {
     "field_name" : "refPrefix",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "defVal",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIP13_xmlSchemaVal"
    },
    {
     "field_name" : "idcs",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI17_xmlSchemaElement",
   "name" : "_xmlSchemaElement",
   "referenced_type" : "_ZTI17_xmlSchemaElement",
   "self_type" : "_ZTI17_xmlSchemaElement",
   "size" : 200,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15_xmlXPathObject"
    }
   ],
   "linker_set_key" : "_ZTI17_xmlXPathVariable",
   "name" : "_xmlXPathVariable",
   "referenced_type" : "_ZTI17_xmlXPathVariable",
   "self_type" : "_ZTI17_xmlXPathVariable",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/xpath.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI21xmlElementContentType"
    },
    {
     "field_name" : "ocur",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22xmlElementContentOccur"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "c1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP18_xmlElementContent"
    },
    {
     "field_name" : "c2",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP18_xmlElementContent"
    },
    {
     "field_name" : "parent",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP18_xmlElementContent"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI18_xmlElementContent",
   "name" : "_xmlElementContent",
   "referenced_type" : "_ZTI18_xmlElementContent",
   "self_type" : "_ZTI18_xmlElementContent",
   "size" : 48,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "node",
     "referenced_type" : "_ZTIPK8_xmlNode"
    },
    {
     "field_name" : "begin_pos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "begin_line",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "end_pos",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "end_line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI18_xmlParserNodeInfo",
   "name" : "_xmlParserNodeInfo",
   "referenced_type" : "_ZTI18_xmlParserNodeInfo",
   "self_type" : "_ZTI18_xmlParserNodeInfo",
   "size" : 40,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI17xmlSchemaTypeType"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "annot",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP15_xmlSchemaAnnot"
    },
    {
     "field_name" : "identifier",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "targetNamespace",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI18_xmlSchemaNotation",
   "name" : "_xmlSchemaNotation",
   "referenced_type" : "_ZTI18_xmlSchemaNotation",
   "self_type" : "_ZTI18_xmlSchemaNotation",
   "size" : 40,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP18_xmlSchemaTypeLink"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    }
   ],
   "linker_set_key" : "_ZTI18_xmlSchemaTypeLink",
   "name" : "_xmlSchemaTypeLink",
   "referenced_type" : "_ZTI18_xmlSchemaTypeLink",
   "self_type" : "_ZTI18_xmlSchemaTypeLink",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI17xmlSchemaTypeType"
    },
    {
     "field_name" : "id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "annot",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP15_xmlSchemaAnnot"
    },
    {
     "field_name" : "node",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "minOccurs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxOccurs",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "processContents",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "any",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nsSet",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP20_xmlSchemaWildcardNs"
    },
    {
     "field_name" : "negNsSet",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP20_xmlSchemaWildcardNs"
    },
    {
     "field_name" : "flags",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18_xmlSchemaWildcard",
   "name" : "_xmlSchemaWildcard",
   "referenced_type" : "_ZTI18_xmlSchemaWildcard",
   "self_type" : "_ZTI18_xmlSchemaWildcard",
   "size" : 72,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI17xmlSchemaTypeType"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP19_xmlSchemaAttribute"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "id",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "ref",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "refNs",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "typeName",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "typeNs",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "annot",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP15_xmlSchemaAnnot"
    },
    {
     "field_name" : "base",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    },
    {
     "field_name" : "occurs",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "defValue",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "subtypes",
     "field_offset" : 768,
     "referenced_type" : "_ZTIP14_xmlSchemaType"
    },
    {
     "field_name" : "node",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "targetNamespace",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 960,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "refPrefix",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "defVal",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIP13_xmlSchemaVal"
    },
    {
     "field_name" : "refDecl",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIP19_xmlSchemaAttribute"
    }
   ],
   "linker_set_key" : "_ZTI19_xmlSchemaAttribute",
   "name" : "_xmlSchemaAttribute",
   "referenced_type" : "_ZTI19_xmlSchemaAttribute",
   "self_type" : "_ZTI19_xmlSchemaAttribute",
   "size" : 152,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP19_xmlSchemaFacetLink"
    },
    {
     "field_name" : "facet",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15_xmlSchemaFacet"
    }
   ],
   "linker_set_key" : "_ZTI19_xmlSchemaFacetLink",
   "name" : "_xmlSchemaFacetLink",
   "referenced_type" : "_ZTI19_xmlSchemaFacetLink",
   "self_type" : "_ZTI19_xmlSchemaFacetLink",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP20_xmlSchemaWildcardNs"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI20_xmlSchemaWildcardNs",
   "name" : "_xmlSchemaWildcardNs",
   "referenced_type" : "_ZTI20_xmlSchemaWildcardNs",
   "self_type" : "_ZTI20_xmlSchemaWildcardNs",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "readcallback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPvPciE"
    },
    {
     "field_name" : "closecallback",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "encoder",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP23_xmlCharEncodingHandler"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP7_xmlBuf"
    },
    {
     "field_name" : "raw",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7_xmlBuf"
    },
    {
     "field_name" : "compressed",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "error",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rawconsumed",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI21_xmlParserInputBuffer",
   "name" : "_xmlParserInputBuffer",
   "referenced_type" : "_ZTI21_xmlParserInputBuffer",
   "self_type" : "_ZTI21_xmlParserInputBuffer",
   "size" : 64,
   "source_file" : "/external/libxml2/include/libxml/xmlIO.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "maximum",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP18_xmlParserNodeInfo"
    }
   ],
   "linker_set_key" : "_ZTI21_xmlParserNodeInfoSeq",
   "name" : "_xmlParserNodeInfoSeq",
   "referenced_type" : "_ZTI21_xmlParserNodeInfoSeq",
   "self_type" : "_ZTI21_xmlParserNodeInfoSeq",
   "size" : 24,
   "source_file" : "/external/libxml2/include/libxml/parser.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cur",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "error",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "context",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP16_xmlXPathContext"
    },
    {
     "field_name" : "value",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP15_xmlXPathObject"
    },
    {
     "field_name" : "valueNr",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "valueMax",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "valueTab",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPP15_xmlXPathObject"
    },
    {
     "field_name" : "comp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP17_xmlXPathCompExpr"
    },
    {
     "field_name" : "xptr",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ancestor",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "valueFrame",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI22_xmlXPathParserContext",
   "name" : "_xmlXPathParserContext",
   "referenced_type" : "_ZTI22_xmlXPathParserContext",
   "self_type" : "_ZTI22_xmlXPathParserContext",
   "size" : 88,
   "source_file" : "/external/libxml2/include/libxml/xpath.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "input",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiPhPiPKhS0_E"
    },
    {
     "field_name" : "output",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiPhPiPKhS0_E"
    }
   ],
   "linker_set_key" : "_ZTI23_xmlCharEncodingHandler",
   "name" : "_xmlCharEncodingHandler",
   "referenced_type" : "_ZTI23_xmlCharEncodingHandler",
   "self_type" : "_ZTI23_xmlCharEncodingHandler",
   "size" : 24,
   "source_file" : "/external/libxml2/include/libxml/encoding.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP23_xmlSchemaAttributeLink"
    },
    {
     "field_name" : "attr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP19_xmlSchemaAttribute"
    }
   ],
   "linker_set_key" : "_ZTI23_xmlSchemaAttributeLink",
   "name" : "_xmlSchemaAttributeLink",
   "referenced_type" : "_ZTI23_xmlSchemaAttributeLink",
   "self_type" : "_ZTI23_xmlSchemaAttributeLink",
   "size" : 16,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI17xmlSchemaTypeType"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP19_xmlSchemaAttribute"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "id",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "ref",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "refNs",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "annot",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP15_xmlSchemaAnnot"
    },
    {
     "field_name" : "attributes",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP19_xmlSchemaAttribute"
    },
    {
     "field_name" : "node",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "flags",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "attributeWildcard",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP18_xmlSchemaWildcard"
    },
    {
     "field_name" : "refPrefix",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "refItem",
     "field_offset" : 768,
     "referenced_type" : "_ZTIP24_xmlSchemaAttributeGroup"
    },
    {
     "field_name" : "targetNamespace",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "attrUses",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI24_xmlSchemaAttributeGroup",
   "name" : "_xmlSchemaAttributeGroup",
   "referenced_type" : "_ZTI24_xmlSchemaAttributeGroup",
   "self_type" : "_ZTI24_xmlSchemaAttributeGroup",
   "size" : 120,
   "source_file" : "/external/libxml2/include/libxml/schemasInternals.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP6_xmlID"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "attr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP8_xmlAttr"
    },
    {
     "field_name" : "name",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "lineno",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "doc",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7_xmlDoc"
    }
   ],
   "linker_set_key" : "_ZTI6_xmlID",
   "name" : "_xmlID",
   "referenced_type" : "_ZTI6_xmlID",
   "self_type" : "_ZTI6_xmlID",
   "size" : 48,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP6_xmlNs"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14xmlElementType"
    },
    {
     "field_name" : "href",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "_private",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "context",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7_xmlDoc"
    }
   ],
   "linker_set_key" : "_ZTI6_xmlNs",
   "name" : "_xmlNs",
   "referenced_type" : "_ZTI6_xmlNs",
   "self_type" : "_ZTI6_xmlNs",
   "size" : 48,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_private",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14xmlElementType"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "children",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "last",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "parent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "next",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "prev",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "doc",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "compression",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "standalone",
     "field_offset" : 608,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "intSubset",
     "field_offset" : 640,
     "referenced_type" : "_ZTIP7_xmlDtd"
    },
    {
     "field_name" : "extSubset",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP7_xmlDtd"
    },
    {
     "field_name" : "oldNs",
     "field_offset" : 768,
     "referenced_type" : "_ZTIP6_xmlNs"
    },
    {
     "field_name" : "version",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "ids",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "refs",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "URL",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "charset",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dict",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIP8_xmlDict"
    },
    {
     "field_name" : "psvi",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "parseFlags",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "properties",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7_xmlDoc",
   "name" : "_xmlDoc",
   "referenced_type" : "_ZTI7_xmlDoc",
   "self_type" : "_ZTI7_xmlDoc",
   "size" : 176,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_private",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14xmlElementType"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "children",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "last",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "parent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "next",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "prev",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "doc",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "notations",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "elements",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "attributes",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "entities",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ExternalID",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "SystemID",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "pentities",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI7_xmlDtd",
   "name" : "_xmlDtd",
   "referenced_type" : "_ZTI7_xmlDtd",
   "self_type" : "_ZTI7_xmlDtd",
   "size" : 128,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP7_xmlRef"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "attr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP8_xmlAttr"
    },
    {
     "field_name" : "name",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "lineno",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7_xmlRef",
   "name" : "_xmlRef",
   "referenced_type" : "_ZTI7_xmlRef",
   "self_type" : "_ZTI7_xmlRef",
   "size" : 40,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "scheme",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "opaque",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "authority",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "server",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "user",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "port",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "path",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "query",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "fragment",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "query_raw",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI7_xmlURI",
   "name" : "_xmlURI",
   "referenced_type" : "_ZTI7_xmlURI",
   "self_type" : "_ZTI7_xmlURI",
   "size" : 88,
   "source_file" : "/external/libxml2/include/libxml/uri.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_private",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14xmlElementType"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "children",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "last",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "parent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "next",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP8_xmlAttr"
    },
    {
     "field_name" : "prev",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP8_xmlAttr"
    },
    {
     "field_name" : "doc",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "ns",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP6_xmlNs"
    },
    {
     "field_name" : "atype",
     "field_offset" : 640,
     "referenced_type" : "_ZTI16xmlAttributeType"
    },
    {
     "field_name" : "psvi",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI8_xmlAttr",
   "name" : "_xmlAttr",
   "referenced_type" : "_ZTI8_xmlAttr",
   "self_type" : "_ZTI8_xmlAttr",
   "size" : 96,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_private",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14xmlElementType"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "children",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "last",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "parent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "next",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "prev",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP8_xmlNode"
    },
    {
     "field_name" : "doc",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP7_xmlDoc"
    },
    {
     "field_name" : "ns",
     "field_offset" : 576,
     "referenced_type" : "_ZTIP6_xmlNs"
    },
    {
     "field_name" : "content",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "properties",
     "field_offset" : 704,
     "referenced_type" : "_ZTIP8_xmlAttr"
    },
    {
     "field_name" : "nsDef",
     "field_offset" : 768,
     "referenced_type" : "_ZTIP6_xmlNs"
    },
    {
     "field_name" : "psvi",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "line",
     "field_offset" : 896,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "extra",
     "field_offset" : 912,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI8_xmlNode",
   "name" : "_xmlNode",
   "referenced_type" : "_ZTI8_xmlNode",
   "self_type" : "_ZTI8_xmlNode",
   "size" : 120,
   "source_file" : "/external/libxml2/include/libxml/tree.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "domain",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "message",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "level",
     "field_offset" : 128,
     "referenced_type" : "_ZTI13xmlErrorLevel"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "str1",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "str2",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "str3",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int1",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "int2",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ctxt",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "node",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI9_xmlError",
   "name" : "_xmlError",
   "referenced_type" : "_ZTI9_xmlError",
   "self_type" : "_ZTI9_xmlError",
   "size" : 88,
   "source_file" : "/external/libxml2/include/libxml/xmlerror.h"
  }
 ],
 "rvalue_reference_types" : []
}
