{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA5121_h",
   "name" : "unsigned char [5121]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA5121_h",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "linker_set_key" : "_ZTIA_c",
   "name" : "char []",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA_c",
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",

   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK7log_msg",
   "name" : "const log_msg *",
   "referenced_type" : "_ZTIK7log_msg",
   "self_type" : "_ZTIPK7log_msg",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPK8log_time",
   "name" : "const log_time *",
   "referenced_type" : "_ZTIK8log_time",
   "self_type" : "_ZTIPK8log_time",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP28android_log_context_internal",
   "name" : "android_log_context_internal **",
   "referenced_type" : "_ZTIP28android_log_context_internal",
   "self_type" : "_ZTIPP28android_log_context_internal",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKc",
   "name" : "const char **",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIPPKc",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/logprint.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIA_Kc",
   "name" : "char const[]",
   "referenced_type" : "_ZTIA_c",
   "self_type" : "_ZTIA_Kc",
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK11EventTagMap",
   "name" : "const EventTagMap",
   "referenced_type" : "_ZTI11EventTagMap",
   "self_type" : "_ZTIK11EventTagMap",
   "source_file" : "/system/core/liblog/include/log/logprint.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17AndroidLogEntry_t",
   "name" : "const AndroidLogEntry_t",
   "referenced_type" : "_ZTI17AndroidLogEntry_t",
   "self_type" : "_ZTIK17AndroidLogEntry_t",
   "size" : 64,
   "source_file" : "/system/core/liblog/include/log/logprint.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK21__android_log_message",
   "name" : "const __android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTIK21__android_log_message",
   "size" : 48,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK22android_log_event_list",
   "name" : "const android_log_event_list",
   "referenced_type" : "_ZTI22android_log_event_list",
   "self_type" : "_ZTIK22android_log_event_list",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK7log_msg",
   "name" : "const log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTIK7log_msg",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8log_time",
   "name" : "const log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTIK8log_time",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8timespec",
   "name" : "const timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTIK8timespec",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/system/core/liblog/include/log/log.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "priority",
     "field_offset" : 128,
     "referenced_type" : "_ZTI19android_LogPriority"
    },
    {
     "field_name" : "uid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "tagLen",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "messageLen",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "message",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI17AndroidLogEntry_t",
   "name" : "AndroidLogEntry_t",
   "referenced_type" : "_ZTI17AndroidLogEntry_t",
   "self_type" : "_ZTI17AndroidLogEntry_t",
   "size" : 64,
   "source_file" : "/system/core/liblog/include/log/logprint.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI19android_event_int_t",
   "name" : "android_event_int_t",
   "referenced_type" : "_ZTI19android_event_int_t",
   "self_type" : "_ZTI19android_event_int_t",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "element_count",
     "field_offset" : 8,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTI20android_event_list_t",
   "name" : "android_event_list_t",
   "referenced_type" : "_ZTI20android_event_list_t",
   "self_type" : "_ZTI20android_event_list_t",
   "size" : 2,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI20android_event_long_t",
   "name" : "android_event_long_t",
   "referenced_type" : "_ZTI20android_event_long_t",
   "self_type" : "_ZTI20android_event_long_t",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "tid",
     "field_offset" : 8,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "realtime",
     "field_offset" : 24,
     "referenced_type" : "_ZTI8log_time"
    }
   ],
   "linker_set_key" : "_ZTI20android_log_header_t",
   "name" : "android_log_header_t",
   "referenced_type" : "_ZTI20android_log_header_t",
   "self_type" : "_ZTI20android_log_header_t",
   "size" : 11,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 48,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI21android_event_float_t",
   "name" : "android_event_float_t",
   "referenced_type" : "_ZTI21android_event_float_t",
   "self_type" : "_ZTI21android_event_float_t",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI22android_event_header_t",
   "name" : "android_event_header_t",
   "referenced_type" : "_ZTI22android_event_header_t",
   "self_type" : "_ZTI22android_event_header_t",
   "size" : 4,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "length",
     "field_offset" : 8,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 40,
     "referenced_type" : "_ZTIA_c"
    }
   ],
   "linker_set_key" : "_ZTI22android_event_string_t",
   "name" : "android_event_string_t",
   "referenced_type" : "_ZTI22android_event_string_t",
   "self_type" : "_ZTI22android_event_string_t",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx",
     "referenced_type" : "_ZTIP28android_log_context_internal"
    },
    {
     "access" : "private",
     "field_name" : "ret",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI22android_log_event_list",
   "name" : "android_log_event_list",
   "record_kind" : "class",
   "referenced_type" : "_ZTI22android_log_event_list",
   "self_type" : "_ZTI22android_log_event_list",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "_ZTI22android_event_header_t"
    },
    {
     "field_name" : "payload",
     "field_offset" : 32,
     "referenced_type" : "_ZTI19android_event_int_t"
    }
   ],
   "linker_set_key" : "_ZTI23android_log_event_int_t",
   "name" : "android_log_event_int_t",
   "referenced_type" : "_ZTI23android_log_event_int_t",
   "self_type" : "_ZTI23android_log_event_int_t",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "_ZTI22android_event_header_t"
    },
    {
     "field_name" : "payload",
     "field_offset" : 32,
     "referenced_type" : "_ZTI20android_event_long_t"
    }
   ],
   "linker_set_key" : "_ZTI24android_log_event_long_t",
   "name" : "android_log_event_long_t",
   "referenced_type" : "_ZTI24android_log_event_long_t",
   "self_type" : "_ZTI24android_log_event_long_t",
   "size" : 13,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI19AndroidEventLogType"
    },
    {
     "field_name" : "complete",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "len",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN24android_log_list_elementUt_E"
    }
   ],
   "linker_set_key" : "_ZTI24android_log_list_element",
   "name" : "android_log_list_element",
   "referenced_type" : "_ZTI24android_log_list_element",
   "self_type" : "_ZTI24android_log_list_element",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "len",
     "field_offset" : 8,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "uid",
     "field_offset" : 24,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 40,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI25android_pmsg_log_header_t",
   "name" : "android_pmsg_log_header_t",
   "referenced_type" : "_ZTI25android_pmsg_log_header_t",
   "self_type" : "_ZTI25android_pmsg_log_header_t",
   "size" : 7,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "_ZTI22android_event_header_t"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "length",
     "field_offset" : 40,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 72,
     "referenced_type" : "_ZTIA_c"
    }
   ],
   "linker_set_key" : "_ZTI26android_log_event_string_t",
   "name" : "android_log_event_string_t",
   "referenced_type" : "_ZTI26android_log_event_string_t",
   "self_type" : "_ZTI26android_log_event_string_t",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int32",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "int64",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "string",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "float32",
     "referenced_type" : "_ZTIf"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN24android_log_list_elementUt_E",
   "name" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:48:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN24android_log_list_elementUt_E",
   "self_type" : "_ZTIN24android_log_list_elementUt_E",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIA5121_h"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "_ZTI12logger_entry"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7log_msgUt_E",
   "name" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:77:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7log_msgUt_E",
   "self_type" : "_ZTIN7log_msgUt_E",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  }
 ],
 "rvalue_reference_types" : []
}
