{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA102_N8tinyxml28MemPoolTILi40EE4ItemE",
   "name" : "tinyxml2::MemPoolT<40>::Item [102]",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi40EE4ItemE",
   "self_type" : "_ZTIA102_N8tinyxml28MemPoolTILi40EE4ItemE",
   "size" : 4080,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_PKc",
   "name" : "const char *[10]",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIA10_PKc",
   "size" : 40,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_PN8tinyxml27XMLNodeE",
   "name" : "tinyxml2::XMLNode *[10]",
   "referenced_type" : "_ZTIPN8tinyxml27XMLNodeE",
   "self_type" : "_ZTIA10_PN8tinyxml27XMLNodeE",
   "size" : 40,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_PN8tinyxml28MemPoolTILi40EE5BlockE",
   "name" : "tinyxml2::MemPoolT<40>::Block *[10]",
   "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi40EE5BlockE",
   "self_type" : "_ZTIA10_PN8tinyxml28MemPoolTILi40EE5BlockE",
   "size" : 40,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_PN8tinyxml28MemPoolTILi52EE5BlockE",
   "name" : "tinyxml2::MemPoolT<52>::Block *[10]",
   "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi52EE5BlockE",
   "self_type" : "_ZTIA10_PN8tinyxml28MemPoolTILi52EE5BlockE",

   "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi52EE5BlockELi10EEE",
   "self_type" : "_ZTIKN8tinyxml28DynArrayIPNS_8MemPoolTILi52EE5BlockELi10EEE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN8tinyxml28DynArrayIPNS_8MemPoolTILi56EE5BlockELi10EEE",
   "name" : "const tinyxml2::DynArray<tinyxml2::MemPoolT<56>::Block *, 10>",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi56EE5BlockELi10EEE",
   "self_type" : "_ZTIKN8tinyxml28DynArrayIPNS_8MemPoolTILi56EE5BlockELi10EEE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN8tinyxml28DynArrayIPNS_8MemPoolTILi60EE5BlockELi10EEE",
   "name" : "const tinyxml2::DynArray<tinyxml2::MemPoolT<60>::Block *, 10>",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi60EE5BlockELi10EEE",
   "self_type" : "_ZTIKN8tinyxml28DynArrayIPNS_8MemPoolTILi60EE5BlockELi10EEE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN8tinyxml28DynArrayIcLi20EEE",
   "name" : "const tinyxml2::DynArray<char, 20>",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIcLi20EEE",
   "self_type" : "_ZTIKN8tinyxml28DynArrayIcLi20EEE",
   "size" : 32,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN8tinyxml28MemPoolTILi40EEE",
   "name" : "const tinyxml2::MemPoolT<40>",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi40EEE",
   "self_type" : "_ZTIKN8tinyxml28MemPoolTILi40EEE",
   "size" : 76,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN8tinyxml28MemPoolTILi52EEE",
   "name" : "const tinyxml2::MemPoolT<52>",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi52EEE",
   "self_type" : "_ZTIKN8tinyxml28MemPoolTILi52EEE",
   "size" : 76,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN8tinyxml28MemPoolTILi56EEE",
   "name" : "const tinyxml2::MemPoolT<56>",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi56EEE",
   "self_type" : "_ZTIKN8tinyxml28MemPoolTILi56EEE",
   "size" : 76,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN8tinyxml28MemPoolTILi60EEE",
   "name" : "const tinyxml2::MemPoolT<60>",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi60EEE",
   "self_type" : "_ZTIKN8tinyxml28MemPoolTILi60EEE",
   "size" : 76,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN8tinyxml29XMLHandleE",
   "name" : "const tinyxml2::XMLHandle",
   "referenced_type" : "_ZTIN8tinyxml29XMLHandleE",
   "self_type" : "_ZTIKN8tinyxml29XMLHandleE",
   "size" : 4,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27XMLNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml210XMLCommentE",
   "name" : "tinyxml2::XMLComment",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml210XMLCommentE",
   "self_type" : "_ZTIN8tinyxml210XMLCommentE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml210XMLCommentE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLComment9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLComment9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLComment12ShallowCloneEPNS_11XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLComment12ShallowEqualEPKNS_7XMLNodeE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLComment6AcceptEPNS_10XMLVisitorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLCommentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLCommentD0Ev"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLComment9ParseDeepEPcPNS_7StrPairEPi"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27XMLNodeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_closingType",
     "field_offset" : 416,
     "referenced_type" : "_ZTIN8tinyxml210XMLElement18ElementClosingTypeE"
    },
    {
     "access" : "private",
     "field_name" : "_rootAttribute",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPN8tinyxml212XMLAttributeE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml210XMLElementE",
   "name" : "tinyxml2::XMLElement",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml210XMLElementE",
   "self_type" : "_ZTIN8tinyxml210XMLElementE",
   "size" : 60,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml210XMLElementE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLElement9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLElement9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLElement12ShallowCloneEPNS_11XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLElement12ShallowEqualEPKNS_7XMLNodeE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLElement6AcceptEPNS_10XMLVisitorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLElementD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLElementD0Ev"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLElement9ParseDeepEPcPNS_7StrPairEPi"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml210XMLVisitorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "_elementJustOpened",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "_stack",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN8tinyxml28DynArrayIPKcLi10EEE"
    },
    {
     "access" : "private",
     "field_name" : "_firstElement",
     "field_offset" : 480,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "_fp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP7__sFILE"
    },
    {
     "access" : "private",
     "field_name" : "_depth",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_textDepth",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_processEntities",
     "field_offset" : 608,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "_compactMode",
     "field_offset" : 616,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "_entityFlag",
     "field_offset" : 624,
     "referenced_type" : "_ZTIA64_b"
    },
    {
     "access" : "private",
     "field_name" : "_restrictedEntityFlag",
     "field_offset" : 1136,
     "referenced_type" : "_ZTIA64_b"
    },
    {
     "access" : "private",
     "field_name" : "_buffer",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIN8tinyxml28DynArrayIcLi20EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml210XMLPrinterE",
   "name" : "tinyxml2::XMLPrinter",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml210XMLPrinterE",
   "self_type" : "_ZTIN8tinyxml210XMLPrinterE",
   "size" : 240,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml210XMLPrinterE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinterD0Ev"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter10VisitEnterERKNS_11XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter9VisitExitERKNS_11XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter10VisitEnterERKNS_10XMLElementEPKNS_12XMLAttributeE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter9VisitExitERKNS_10XMLElementE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter5VisitERKNS_14XMLDeclarationE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter5VisitERKNS_7XMLTextE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter5VisitERKNS_10XMLCommentE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter5VisitERKNS_10XMLUnknownE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter12CloseElementEb"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter11CompactModeERKNS_10XMLElementE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLPrinter10PrintSpaceEi"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27XMLNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml210XMLUnknownE",
   "name" : "tinyxml2::XMLUnknown",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml210XMLUnknownE",
   "self_type" : "_ZTIN8tinyxml210XMLUnknownE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml210XMLUnknownE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLUnknown9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLUnknown9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLUnknown12ShallowCloneEPNS_11XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLUnknown12ShallowEqualEPKNS_7XMLNodeE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml210XMLUnknown6AcceptEPNS_10XMLVisitorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLUnknownD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLUnknownD0Ev"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLUnknown9ParseDeepEPcPNS_7StrPairEPi"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN8tinyxml210XMLVisitorE",
   "name" : "tinyxml2::XMLVisitor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml210XMLVisitorE",
   "self_type" : "_ZTIN8tinyxml210XMLVisitorE",
   "size" : 4,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml210XMLVisitorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitor10VisitEnterERKNS_11XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitor9VisitExitERKNS_11XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitor10VisitEnterERKNS_10XMLElementEPKNS_12XMLAttributeE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitor9VisitExitERKNS_10XMLElementE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitor5VisitERKNS_14XMLDeclarationE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitor5VisitERKNS_7XMLTextE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitor5VisitERKNS_10XMLCommentE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml210XMLVisitor5VisitERKNS_10XMLUnknownE"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_document",
     "referenced_type" : "_ZTIPN8tinyxml211XMLDocumentE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml211XMLDocument12DepthTrackerE",
   "name" : "tinyxml2::XMLDocument::DepthTracker",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml211XMLDocument12DepthTrackerE",
   "self_type" : "_ZTIN8tinyxml211XMLDocument12DepthTrackerE",
   "size" : 4,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27XMLNodeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_writeBOM",
     "field_offset" : 416,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "_processEntities",
     "field_offset" : 424,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "_errorID",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN8tinyxml28XMLErrorE"
    },
    {
     "access" : "private",
     "field_name" : "_whitespaceMode",
     "field_offset" : 480,
     "referenced_type" : "_ZTIN8tinyxml210WhitespaceE"
    },
    {
     "access" : "private",
     "field_name" : "_errorStr",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN8tinyxml27StrPairE"
    },
    {
     "access" : "private",
     "field_name" : "_errorLineNum",
     "field_offset" : 608,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_charBuffer",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "_parseCurLineNum",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_parsingDepth",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_unlinked",
     "field_offset" : 736,
     "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_7XMLNodeELi10EEE"
    },
    {
     "access" : "private",
     "field_name" : "_elementPool",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi60EEE"
    },
    {
     "access" : "private",
     "field_name" : "_attributePool",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi40EEE"
    },
    {
     "access" : "private",
     "field_name" : "_textPool",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi56EEE"
    },
    {
     "access" : "private",
     "field_name" : "_commentPool",
     "field_offset" : 2976,
     "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi52EEE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml211XMLDocumentE",
   "name" : "tinyxml2::XMLDocument",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml211XMLDocumentE",
   "self_type" : "_ZTIN8tinyxml211XMLDocumentE",
   "size" : 448,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml211XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml211XMLDocument10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml211XMLDocument10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml211XMLDocument12ShallowCloneEPS0_"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml211XMLDocument12ShallowEqualEPKNS_7XMLNodeE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml211XMLDocument6AcceptEPNS_10XMLVisitorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml211XMLDocumentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml211XMLDocumentD0Ev"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ParseDeepEPcPNS_7StrPairEPi"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN8tinyxml27StrPairE"
    },
    {
     "access" : "private",
     "field_name" : "_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8tinyxml27StrPairE"
    },
    {
     "access" : "private",
     "field_name" : "_parseLineNum",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_next",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPN8tinyxml212XMLAttributeE"
    },
    {
     "access" : "private",
     "field_name" : "_memPool",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPN8tinyxml27MemPoolE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml212XMLAttributeE",
   "name" : "tinyxml2::XMLAttribute",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml212XMLAttributeE",
   "self_type" : "_ZTIN8tinyxml212XMLAttributeE",
   "size" : 40,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml212XMLAttributeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml212XMLAttributeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml212XMLAttributeD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_node",
     "referenced_type" : "_ZTIPKN8tinyxml27XMLNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml214XMLConstHandleE",
   "name" : "tinyxml2::XMLConstHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml214XMLConstHandleE",
   "self_type" : "_ZTIN8tinyxml214XMLConstHandleE",
   "size" : 4,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27XMLNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml214XMLDeclarationE",
   "name" : "tinyxml2::XMLDeclaration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml214XMLDeclarationE",
   "self_type" : "_ZTIN8tinyxml214XMLDeclarationE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml214XMLDeclarationE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml214XMLDeclaration13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml214XMLDeclaration13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml214XMLDeclaration12ShallowCloneEPNS_11XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml214XMLDeclaration12ShallowEqualEPKNS_7XMLNodeE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml214XMLDeclaration6AcceptEPNS_10XMLVisitorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml214XMLDeclarationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml214XMLDeclarationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml214XMLDeclaration9ParseDeepEPcPNS_7StrPairEPi"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN8tinyxml27MemPoolE",
   "name" : "tinyxml2::MemPool",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml27MemPoolE",
   "self_type" : "_ZTIN8tinyxml27MemPoolE",
   "size" : 4,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml27MemPoolE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml27MemPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml27MemPoolD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8tinyxml27MemPool8ItemSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8tinyxml27MemPool5AllocEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8tinyxml27MemPool4FreeEPv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8tinyxml27MemPool10SetTrackedEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_start",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "_end",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml27StrPairE",
   "name" : "tinyxml2::StrPair",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml27StrPairE",
   "self_type" : "_ZTIN8tinyxml27StrPairE",
   "size" : 12,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "_document",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN8tinyxml211XMLDocumentE"
    },
    {
     "access" : "protected",
     "field_name" : "_parent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN8tinyxml27XMLNodeE"
    },
    {
     "access" : "protected",
     "field_name" : "_value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN8tinyxml27StrPairE"
    },
    {
     "access" : "protected",
     "field_name" : "_parseLineNum",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "_firstChild",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPN8tinyxml27XMLNodeE"
    },
    {
     "access" : "protected",
     "field_name" : "_lastChild",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPN8tinyxml27XMLNodeE"
    },
    {
     "access" : "protected",
     "field_name" : "_prev",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPN8tinyxml27XMLNodeE"
    },
    {
     "access" : "protected",
     "field_name" : "_next",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPN8tinyxml27XMLNodeE"
    },
    {
     "access" : "protected",
     "field_name" : "_userData",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "_memPool",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPN8tinyxml27MemPoolE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml27XMLNodeE",
   "name" : "tinyxml2::XMLNode",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml27XMLNodeE",
   "self_type" : "_ZTIN8tinyxml27XMLNodeE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml27XMLNodeE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode12ShallowCloneEPNS_11XMLDocumentE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode12ShallowEqualEPKS0_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode6AcceptEPNS_10XMLVisitorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml27XMLNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml27XMLNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ParseDeepEPcPNS_7StrPairEPi"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27XMLNodeE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_isCData",
     "field_offset" : 416,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml27XMLTextE",
   "name" : "tinyxml2::XMLText",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml27XMLTextE",
   "self_type" : "_ZTIN8tinyxml27XMLTextE",
   "size" : 56,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml27XMLTextE"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLText6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToElementEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLText6ToTextEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToCommentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode10ToDocumentEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode13ToDeclarationEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLNode9ToUnknownEv"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLText12ShallowCloneEPNS_11XMLDocumentE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLText12ShallowEqualEPKNS_7XMLNodeE"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml27XMLText6AcceptEPNS_10XMLVisitorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml27XMLTextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml27XMLTextD0Ev"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml27XMLText9ParseDeepEPcPNS_7StrPairEPi"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN8tinyxml27XMLUtilE",
   "name" : "tinyxml2::XMLUtil",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml27XMLUtilE",
   "self_type" : "_ZTIN8tinyxml27XMLUtilE",
   "size" : 1,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mem",
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "access" : "private",
     "field_name" : "_pool",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA10_PKc"
    },
    {
     "access" : "private",
     "field_name" : "_allocated",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28DynArrayIPKcLi10EEE",
   "name" : "tinyxml2::DynArray<const char *, 10>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIPKcLi10EEE",
   "self_type" : "_ZTIN8tinyxml28DynArrayIPKcLi10EEE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "template_args" : [ "_ZTIPKc" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mem",
     "referenced_type" : "_ZTIPPN8tinyxml27XMLNodeE"
    },
    {
     "access" : "private",
     "field_name" : "_pool",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA10_PN8tinyxml27XMLNodeE"
    },
    {
     "access" : "private",
     "field_name" : "_allocated",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28DynArrayIPNS_7XMLNodeELi10EEE",
   "name" : "tinyxml2::DynArray<tinyxml2::XMLNode *, 10>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_7XMLNodeELi10EEE",
   "self_type" : "_ZTIN8tinyxml28DynArrayIPNS_7XMLNodeELi10EEE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "template_args" : [ "_ZTIPN8tinyxml27XMLNodeE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mem",
     "referenced_type" : "_ZTIPPN8tinyxml28MemPoolTILi40EE5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "_pool",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA10_PN8tinyxml28MemPoolTILi40EE5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "_allocated",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi40EE5BlockELi10EEE",
   "name" : "tinyxml2::DynArray<tinyxml2::MemPoolT<40>::Block *, 10>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi40EE5BlockELi10EEE",
   "self_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi40EE5BlockELi10EEE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "template_args" : [ "_ZTIPN8tinyxml28MemPoolTILi40EE5BlockE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mem",
     "referenced_type" : "_ZTIPPN8tinyxml28MemPoolTILi52EE5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "_pool",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA10_PN8tinyxml28MemPoolTILi52EE5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "_allocated",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi52EE5BlockELi10EEE",
   "name" : "tinyxml2::DynArray<tinyxml2::MemPoolT<52>::Block *, 10>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi52EE5BlockELi10EEE",
   "self_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi52EE5BlockELi10EEE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "template_args" : [ "_ZTIPN8tinyxml28MemPoolTILi52EE5BlockE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mem",
     "referenced_type" : "_ZTIPPN8tinyxml28MemPoolTILi56EE5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "_pool",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA10_PN8tinyxml28MemPoolTILi56EE5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "_allocated",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi56EE5BlockELi10EEE",
   "name" : "tinyxml2::DynArray<tinyxml2::MemPoolT<56>::Block *, 10>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi56EE5BlockELi10EEE",
   "self_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi56EE5BlockELi10EEE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "template_args" : [ "_ZTIPN8tinyxml28MemPoolTILi56EE5BlockE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mem",
     "referenced_type" : "_ZTIPPN8tinyxml28MemPoolTILi60EE5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "_pool",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA10_PN8tinyxml28MemPoolTILi60EE5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "_allocated",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi60EE5BlockELi10EEE",
   "name" : "tinyxml2::DynArray<tinyxml2::MemPoolT<60>::Block *, 10>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi60EE5BlockELi10EEE",
   "self_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi60EE5BlockELi10EEE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "template_args" : [ "_ZTIPN8tinyxml28MemPoolTILi60EE5BlockE" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mem",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "_pool",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA20_c"
    },
    {
     "access" : "private",
     "field_name" : "_allocated",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_size",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28DynArrayIcLi20EEE",
   "name" : "tinyxml2::DynArray<char, 20>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28DynArrayIcLi20EEE",
   "self_type" : "_ZTIN8tinyxml28DynArrayIcLi20EEE",
   "size" : 32,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi40EE4ItemE"
    },
    {
     "field_name" : "itemData",
     "referenced_type" : "_ZTIA40_c"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi40EE4ItemE",
   "name" : "tinyxml2::MemPoolT<40>::Item",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi40EE4ItemE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi40EE4ItemE",
   "size" : 40,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "items",
     "referenced_type" : "_ZTIA102_N8tinyxml28MemPoolTILi40EE4ItemE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi40EE5BlockE",
   "name" : "tinyxml2::MemPoolT<40>::Block",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi40EE5BlockE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi40EE5BlockE",
   "size" : 4080,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27MemPoolE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_blockPtrs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi40EE5BlockELi10EEE"
    },
    {
     "access" : "private",
     "field_name" : "_root",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi40EE4ItemE"
    },
    {
     "access" : "private",
     "field_name" : "_currentAllocs",
     "field_offset" : 480,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_nAllocs",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_maxAllocs",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_nUntracked",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi40EEE",
   "name" : "tinyxml2::MemPoolT<40>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi40EEE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi40EEE",
   "size" : 76,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml28MemPoolTILi40EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi40EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi40EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml28MemPoolTILi40EE8ItemSizeEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi40EE5AllocEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi40EE4FreeEPv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi40EE10SetTrackedEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi52EE4ItemE"
    },
    {
     "field_name" : "itemData",
     "referenced_type" : "_ZTIA52_c"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi52EE4ItemE",
   "name" : "tinyxml2::MemPoolT<52>::Item",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi52EE4ItemE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi52EE4ItemE",
   "size" : 52,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "items",
     "referenced_type" : "_ZTIA78_N8tinyxml28MemPoolTILi52EE4ItemE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi52EE5BlockE",
   "name" : "tinyxml2::MemPoolT<52>::Block",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi52EE5BlockE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi52EE5BlockE",
   "size" : 4056,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27MemPoolE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_blockPtrs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi52EE5BlockELi10EEE"
    },
    {
     "access" : "private",
     "field_name" : "_root",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi52EE4ItemE"
    },
    {
     "access" : "private",
     "field_name" : "_currentAllocs",
     "field_offset" : 480,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_nAllocs",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_maxAllocs",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_nUntracked",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi52EEE",
   "name" : "tinyxml2::MemPoolT<52>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi52EEE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi52EEE",
   "size" : 76,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml28MemPoolTILi52EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi52EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi52EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml28MemPoolTILi52EE8ItemSizeEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi52EE5AllocEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi52EE4FreeEPv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi52EE10SetTrackedEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi56EE4ItemE"
    },
    {
     "field_name" : "itemData",
     "referenced_type" : "_ZTIA56_c"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi56EE4ItemE",
   "name" : "tinyxml2::MemPoolT<56>::Item",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi56EE4ItemE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi56EE4ItemE",
   "size" : 56,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "items",
     "referenced_type" : "_ZTIA73_N8tinyxml28MemPoolTILi56EE4ItemE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi56EE5BlockE",
   "name" : "tinyxml2::MemPoolT<56>::Block",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi56EE5BlockE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi56EE5BlockE",
   "size" : 4088,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27MemPoolE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_blockPtrs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi56EE5BlockELi10EEE"
    },
    {
     "access" : "private",
     "field_name" : "_root",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi56EE4ItemE"
    },
    {
     "access" : "private",
     "field_name" : "_currentAllocs",
     "field_offset" : 480,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_nAllocs",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_maxAllocs",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_nUntracked",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi56EEE",
   "name" : "tinyxml2::MemPoolT<56>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi56EEE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi56EEE",
   "size" : 76,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml28MemPoolTILi56EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi56EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi56EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml28MemPoolTILi56EE8ItemSizeEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi56EE5AllocEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi56EE4FreeEPv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi56EE10SetTrackedEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi60EE4ItemE"
    },
    {
     "field_name" : "itemData",
     "referenced_type" : "_ZTIA60_c"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi60EE4ItemE",
   "name" : "tinyxml2::MemPoolT<60>::Item",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi60EE4ItemE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi60EE4ItemE",
   "size" : 60,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "items",
     "referenced_type" : "_ZTIA68_N8tinyxml28MemPoolTILi60EE4ItemE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi60EE5BlockE",
   "name" : "tinyxml2::MemPoolT<60>::Block",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi60EE5BlockE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi60EE5BlockE",
   "size" : 4080,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN8tinyxml27MemPoolE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_blockPtrs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN8tinyxml28DynArrayIPNS_8MemPoolTILi60EE5BlockELi10EEE"
    },
    {
     "access" : "private",
     "field_name" : "_root",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPN8tinyxml28MemPoolTILi60EE4ItemE"
    },
    {
     "access" : "private",
     "field_name" : "_currentAllocs",
     "field_offset" : 480,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_nAllocs",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_maxAllocs",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "_nUntracked",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml28MemPoolTILi60EEE",
   "name" : "tinyxml2::MemPoolT<60>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml28MemPoolTILi60EEE",
   "self_type" : "_ZTIN8tinyxml28MemPoolTILi60EEE",
   "size" : 76,
   "source_file" : "/external/tinyxml2/tinyxml2.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8tinyxml28MemPoolTILi60EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi60EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi60EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK8tinyxml28MemPoolTILi60EE8ItemSizeEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi60EE5AllocEv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi60EE4FreeEPv"
    },
    {
     "mangled_component_name" : "_ZN8tinyxml28MemPoolTILi60EE10SetTrackedEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_node",
     "referenced_type" : "_ZTIPN8tinyxml27XMLNodeE"
    }
   ],
   "linker_set_key" : "_ZTIN8tinyxml29XMLHandleE",
   "name" : "tinyxml2::XMLHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN8tinyxml29XMLHandleE",
   "self_type" : "_ZTIN8tinyxml29XMLHandleE",
   "size" : 4,
   "source_file" : "/external/tinyxml2/tinyxml2.h"
  }
 ],
 "rvalue_reference_types" : []
}
