{
 "array_types" :
 [
  {
   "alignment" : 2,
   "linker_set_key" : "_fpreg [8]",
   "name" : "_fpreg [8]",
   "referenced_type" : "type-71",
   "self_type" : "type-70",
   "size" : 80,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_fpxreg [8]",
   "name" : "_fpxreg [8]",
   "referenced_type" : "type-25",
   "self_type" : "type-73",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_libc_fpreg [8]",
   "name" : "_libc_fpreg [8]",
   "referenced_type" : "type-5",
   "self_type" : "type-11",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_xmmreg [8]",
   "name" : "_xmmreg [8]",
   "referenced_type" : "type-47",
   "self_type" : "type-74",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-30",
   "self_type" : "type-134",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [32]",
   "name" : "char [32]",
   "referenced_type" : "type-30",
   "self_type" : "type-215",
   "size" : 32,

   "referenced_type" : "type-170",
   "self_type" : "type-169",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void (*)(int, siginfo *, void *)",
   "name" : "void (*)(int, siginfo *, void *)",
   "referenced_type" : "type-172",
   "self_type" : "type-171",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void (*)(sigval)",
   "name" : "void (*)(sigval)",
   "referenced_type" : "type-199",
   "self_type" : "type-198",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void (*)(void *)",
   "name" : "void (*)(void *)",
   "referenced_type" : "type-109",
   "self_type" : "type-108",
   "size" : 4,
   "source_file" : "/external/expat/lib/expat.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void (*)(void *, const void *)",
   "name" : "void (*)(void *, const void *)",
   "referenced_type" : "type-87",
   "self_type" : "type-86",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void (*)(void)",
   "name" : "void (*)(void)",
   "referenced_type" : "type-192",
   "self_type" : "type-191",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-19",
   "self_type" : "type-18",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *(*)(unsigned int)",
   "name" : "void *(*)(unsigned int)",
   "referenced_type" : "type-105",
   "self_type" : "type-104",
   "size" : 4,
   "source_file" : "/external/expat/lib/expat.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *(*)(unsigned int, const void *)",
   "name" : "void *(*)(unsigned int, const void *)",
   "referenced_type" : "type-66",
   "self_type" : "type-65",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *(*)(unsigned int, unsigned int, const void *)",
   "name" : "void *(*)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "type-90",
   "self_type" : "type-89",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *(*)(void *, unsigned int)",
   "name" : "void *(*)(void *, unsigned int)",
   "referenced_type" : "type-107",
   "self_type" : "type-106",
   "size" : 4,
   "source_file" : "/external/expat/lib/expat.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *(*)(void *, unsigned int, const void *)",
   "name" : "void *(*)(void *, unsigned int, const void *)",
   "referenced_type" : "type-84",
   "self_type" : "type-83",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-30",
   "self_type" : "type-29",
   "size" : 1,
   "source_file" : "/external/expat/lib/expat.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const char *const[65]",
   "name" : "const char *const[65]",
   "referenced_type" : "type-27",
   "self_type" : "type-31",
   "size" : 260,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/signal.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-19",
   "self_type" : "type-68",
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-86",
   "self_type" : "type-88",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "type-65",
   "self_type" : "type-82",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "type-89",
   "self_type" : "type-91",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned int, const void *)",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "type-83",
   "self_type" : "type-85",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "map",
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "data",
     "field_offset" : 8192,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "convert",
     "field_offset" : 8224,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "release",
     "field_offset" : 8256,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "XML_Encoding",
   "name" : "XML_Encoding",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 1036,
   "source_file" : "/external/expat/lib/expat.h",
   "unique_id" : "XML_Encoding"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "major",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "minor",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "micro",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "XML_Expat_Version",
   "name" : "XML_Expat_Version",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 12,
   "source_file" : "/external/expat/lib/expat.h",
   "unique_id" : "XML_Expat_Version"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "feature",
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "XML_Feature",
   "name" : "XML_Feature",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 12,
   "source_file" : "/external/expat/lib/expat.h",
   "unique_id" : "XML_Feature"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "malloc_fcn",
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "realloc_fcn",
     "field_offset" : 32,
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "free_fcn",
     "field_offset" : 64,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "XML_Memory_Handling_Suite",
   "name" : "XML_Memory_Handling_Suite",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 12,
   "source_file" : "/external/expat/lib/expat.h",
   "unique_id" : "XML_Memory_Handling_Suite"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "parsing",
     "referenced_type" : "type-114"
    },
    {
     "field_name" : "finalBuffer",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "XML_ParsingStatus",
   "name" : "XML_ParsingStatus",
   "referenced_type" : "type-115",
   "self_type" : "type-115",
   "size" : 8,
   "source_file" : "/external/expat/lib/expat.h",
   "unique_id" : "XML_ParsingStatus"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "quant",
     "field_offset" : 32,
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "numchildren",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "children",
     "field_offset" : 128,
     "referenced_type" : "type-102"
    }
   ],
   "linker_set_key" : "XML_cp",
   "name" : "XML_cp",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 20,
   "source_file" : "/external/expat/lib/expat.h",
   "unique_id" : "XML_cp"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-96",
   "self_type" : "type-96",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-146"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-146"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "__kernel_itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-168"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-191"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-167",
   "self_type" : "type-167",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-171"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3) at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3) at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3",
   "record_kind" : "union",
   "referenced_type" : "type-168",
   "self_type" : "type-168",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "__kernel_timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "type-178"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-182"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-188"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-189"
    }
   ],
   "linker_set_key" : "__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "referenced_type" : "type-178",
   "self_type" : "type-178",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-180"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "referenced_type" : "type-181",
   "self_type" : "type-181",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-42"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-18"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-184"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-187"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "record_kind" : "union",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-186"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-18"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "referenced_type" : "type-185",
   "self_type" : "type-185",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-186"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "referenced_type" : "type-189",
   "self_type" : "type-189",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3)"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "_fpreg",
   "name" : "_fpreg",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 10,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_fpreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cw",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "sw",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "ipoff",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "cssel",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "dataoff",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "datasel",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "_st",
     "field_offset" : 224,
     "referenced_type" : "type-70"
    },
    {
     "field_name" : "status",
     "field_offset" : 864,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "magic",
     "field_offset" : 880,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "_fxsr_env",
     "field_offset" : 896,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 1088,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 1120,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "_fxsr_st",
     "field_offset" : 1152,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "_xmm",
     "field_offset" : 2176,
     "referenced_type" : "type-74"
    },
    {
     "field_offset" : 3200,
     "referenced_type" : "type-75"
    },
    {
     "field_offset" : 4608,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "_fpstate_32",
   "name" : "_fpstate_32",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 624,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_fpstate_32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding1",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "type-76"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "record_kind" : "union",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 176,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding2",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-79"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "record_kind" : "union",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "twd",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "rip",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "rdp",
     "field_offset" : 128,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "mxcsr_mask",
     "field_offset" : 224,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 256,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "xmm_space",
     "field_offset" : 1280,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 3328,
     "referenced_type" : "type-78"
    },
    {
     "field_offset" : 3712,
     "referenced_type" : "type-154"
    }
   ],
   "linker_set_key" : "_fpstate_64",
   "name" : "_fpstate_64",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 512,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_fpstate_64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved3",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-79"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "name" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "record_kind" : "union",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic1",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "extended_size",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "xfeatures",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "xstate_size",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "padding",
     "field_offset" : 160,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "_fpx_sw_bytes",
   "name" : "_fpx_sw_bytes",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_fpx_sw_bytes"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "padding",
     "field_offset" : 80,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "_fpxreg",
   "name" : "_fpxreg",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_fpxreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "xfeatures",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 192,
     "referenced_type" : "type-157"
    }
   ],
   "linker_set_key" : "_header",
   "name" : "_header",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_header"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "_libc_fpreg",
   "name" : "_libc_fpreg",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 10,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "_libc_fpreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cw",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sw",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ipoff",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "cssel",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "dataoff",
     "field_offset" : 160,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "datasel",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "_st",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "status",
     "field_offset" : 864,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "_libc_fpstate",
   "name" : "_libc_fpstate",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 112,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "_libc_fpstate"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "element",
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "_xmmreg",
   "name" : "_xmmreg",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_xmmreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpstate",
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "xstate_hdr",
     "field_offset" : 4992,
     "referenced_type" : "type-155"
    },
    {
     "field_name" : "ymmh",
     "field_offset" : 5504,
     "referenced_type" : "type-158"
    }
   ],
   "linker_set_key" : "_xstate",
   "name" : "_xstate",
   "referenced_type" : "type-159",
   "self_type" : "type-159",
   "size" : 944,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_xstate"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ymmh_space",
     "referenced_type" : "type-153"
    }
   ],
   "linker_set_key" : "_ymmh_state",
   "name" : "_ymmh_state",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ymmh_state"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mixer",
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "num_mixer_ctls",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "mixer_state",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "mixer_path_size",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "num_mixer_paths",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "mixer_path",
     "field_offset" : 160,
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "audio_route",
   "name" : "audio_route",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 24,
   "source_file" : "/system/media/audio_route/audio_route.c",
   "unique_id" : "audio_route"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ar",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "path",
     "field_offset" : 32,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "level",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "config_parse_state",
   "name" : "config_parse_state",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 12,
   "source_file" : "/system/media/audio_route/audio_route.c",
   "unique_id" : "config_parse_state"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "enumerated",
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "integer",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "ptr",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "bytes",
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "ctl_values",
   "name" : "ctl_values",
   "record_kind" : "union",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 4,
   "source_file" : "/system/media/audio_route/audio_route.c",
   "unique_id" : "ctl_values"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "f_owner_ex",
   "name" : "f_owner_ex",
   "referenced_type" : "type-123",
   "self_type" : "type-123",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "f_owner_ex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 128,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 64,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "flock",
   "name" : "flock",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "flock"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 96,
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "flock64",
   "name" : "flock64",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "flock64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "iovec",
   "name" : "iovec",
   "referenced_type" : "type-131",
   "self_type" : "type-131",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/uio.h",
   "unique_id" : "iovec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "itimerval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-93",
   "self_type" : "type-93",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-139"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-140"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-135"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-133"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-139",
   "self_type" : "type-139",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-134"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-133",
   "self_type" : "type-133",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-134"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-134"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-134"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-137",
   "self_type" : "type-137",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gregs",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "fpregs",
     "field_offset" : 608,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 640,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 672,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "mcontext_t",
   "name" : "mcontext_t",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 88,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "mcontext_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "setting",
     "field_offset" : 96,
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "mixer_path",
   "name" : "mixer_path",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 16,
   "source_file" : "/system/media/audio_route/audio_route.c",
   "unique_id" : "mixer_path"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ctl_index",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "num_values",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "value",
     "field_offset" : 96,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "mixer_setting",
   "name" : "mixer_setting",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 16,
   "source_file" : "/system/media/audio_route/audio_route.c",
   "unique_id" : "mixer_setting"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ctl",
     "referenced_type" : "type-50"
    },
    {
     "field_name" : "num_values",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "old_value",
     "field_offset" : 64,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "new_value",
     "field_offset" : 96,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "reset_value",
     "field_offset" : 128,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "active_count",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "mixer_state",
   "name" : "mixer_state",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 24,
   "source_file" : "/system/media/audio_route/audio_route.c",
   "unique_id" : "mixer_state"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ctl_index",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "index",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "mixer_value",
   "name" : "mixer_value",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 12,
   "source_file" : "/system/media/audio_route/audio_route.c",
   "unique_id" : "mixer_value"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "channels",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "rate",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "period_size",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "period_count",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "start_threshold",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stop_threshold",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "silence_threshold",
     "field_offset" : 224,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "silence_size",
     "field_offset" : 256,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "avail_min",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "pcm_config",
   "name" : "pcm_config",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 40,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h",
   "unique_id" : "pcm_config"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bits",
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "pcm_mask",
   "name" : "pcm_mask",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 32,
   "source_file" : "/external/tinyalsa/include/tinyalsa/asoundlib.h",
   "unique_id" : "pcm_mask"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-150"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-166"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-165",
   "self_type" : "type-165",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-166"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-201"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-203"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-191"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-202",
   "self_type" : "type-202",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-205"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-204",
   "self_type" : "type-204",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-171"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:116:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:116:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-205",
   "self_type" : "type-205",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:116:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-171"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:105:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:105:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h:105:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "sigaltstack"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gs",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__gsh",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "fs",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__fsh",
     "field_offset" : 48,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "es",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__esh",
     "field_offset" : 80,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "ds",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__dsh",
     "field_offset" : 112,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "edi",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "esi",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "ebp",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "esp",
     "field_offset" : 224,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "ebx",
     "field_offset" : 256,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "edx",
     "field_offset" : 288,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "ecx",
     "field_offset" : 320,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "eax",
     "field_offset" : 352,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 384,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "err",
     "field_offset" : 416,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "eip",
     "field_offset" : 448,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "cs",
     "field_offset" : 480,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__csh",
     "field_offset" : 496,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 512,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "esp_at_signal",
     "field_offset" : 544,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "ss",
     "field_offset" : 576,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__ssh",
     "field_offset" : 592,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 608,
     "referenced_type" : "type-164"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 640,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 672,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 88,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "sigcontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gs",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__gsh",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "fs",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__fsh",
     "field_offset" : 48,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "es",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__esh",
     "field_offset" : 80,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "ds",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__dsh",
     "field_offset" : 112,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "di",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "si",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "bp",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "sp",
     "field_offset" : 224,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "bx",
     "field_offset" : 256,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "dx",
     "field_offset" : 288,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "cx",
     "field_offset" : 320,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "ax",
     "field_offset" : 352,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 384,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "err",
     "field_offset" : 416,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "ip",
     "field_offset" : 448,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "cs",
     "field_offset" : 480,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__csh",
     "field_offset" : 496,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "flags",
     "field_offset" : 512,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "sp_at_signal",
     "field_offset" : 544,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "ss",
     "field_offset" : 576,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__ssh",
     "field_offset" : 592,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 608,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 640,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 672,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "sigcontext_32",
   "name" : "sigcontext_32",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 88,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "sigcontext_32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r8",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "r9",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "r10",
     "field_offset" : 128,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "r11",
     "field_offset" : 192,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "r12",
     "field_offset" : 256,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "r13",
     "field_offset" : 320,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "r14",
     "field_offset" : 384,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "r15",
     "field_offset" : 448,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "di",
     "field_offset" : 512,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "si",
     "field_offset" : 576,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "bp",
     "field_offset" : 640,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "bx",
     "field_offset" : 704,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "dx",
     "field_offset" : 768,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "ax",
     "field_offset" : 832,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "cx",
     "field_offset" : 896,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "sp",
     "field_offset" : 960,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "ip",
     "field_offset" : 1024,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1088,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "cs",
     "field_offset" : 1152,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "gs",
     "field_offset" : 1168,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "fs",
     "field_offset" : 1184,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "ss",
     "field_offset" : 1200,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "err",
     "field_offset" : 1216,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 1280,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 1344,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 1408,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 1472,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 1536,
     "referenced_type" : "type-162"
    }
   ],
   "linker_set_key" : "sigcontext_64",
   "name" : "sigcontext_64",
   "referenced_type" : "type-161",
   "self_type" : "type-161",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "sigcontext_64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "type-195"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "sigevent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-196"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-197"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3",
   "record_kind" : "union",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 52,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-198"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5",
   "referenced_type" : "type-197",
   "self_type" : "type-197",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-175"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-174",
   "self_type" : "type-174",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "siginfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-176"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "type-190"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3",
   "record_kind" : "union",
   "referenced_type" : "type-175",
   "self_type" : "type-175",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "type-177"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5 <Spelling=bionic/libc/kernel/uapi/asm-generic/siginfo.h:95:19>",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5 <Spelling=bionic/libc/kernel/uapi/asm-generic/siginfo.h:95:19>",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "sigset64_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "sigval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stx_mask",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stx_blksize",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stx_attributes",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "stx_nlink",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stx_uid",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stx_gid",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stx_mode",
     "field_offset" : 224,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "__spare0",
     "field_offset" : 240,
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "stx_ino",
     "field_offset" : 256,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "stx_size",
     "field_offset" : 320,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "stx_blocks",
     "field_offset" : 384,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "stx_attributes_mask",
     "field_offset" : 448,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "stx_atime",
     "field_offset" : 512,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "stx_btime",
     "field_offset" : 640,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "stx_ctime",
     "field_offset" : 768,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "stx_mtime",
     "field_offset" : 896,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "stx_rdev_major",
     "field_offset" : 1024,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stx_rdev_minor",
     "field_offset" : 1056,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stx_dev_major",
     "field_offset" : 1088,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "stx_dev_minor",
     "field_offset" : 1120,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "__spare2",
     "field_offset" : 1152,
     "referenced_type" : "type-130"
    }
   ],
   "linker_set_key" : "statx",
   "name" : "statx",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/linux/stat.h",
   "unique_id" : "statx"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "statx_timestamp",
   "name" : "statx_timestamp",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/stat.h",
   "unique_id" : "statx_timestamp"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "timespec",
   "name" : "timespec",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "timeval",
   "name" : "timeval",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "timezone",
   "name" : "timezone",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "timezone"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_offset" : 864,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "__fpregs_mem",
     "field_offset" : 928,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "ucontext",
   "name" : "ucontext",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 228,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "ucontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "type-23"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:205:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:205:3",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:205:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:205:3",
   "record_kind" : "union",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:205:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:205:3)::(anonymous struct at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:206:5) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:206:5",
   "name" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:205:3)::(anonymous struct at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:206:5) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:206:5",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:205:3)::(anonymous struct at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/ucontext.h:206:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-211"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 544,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "i387",
     "field_offset" : 576,
     "referenced_type" : "type-206"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 1440,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 1472,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 1504,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 1536,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 1568,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "signal",
     "field_offset" : 1600,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 1632,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 1664,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "u_fpstate",
     "field_offset" : 1696,
     "referenced_type" : "type-214"
    },
    {
     "field_name" : "magic",
     "field_offset" : 1728,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 1760,
     "referenced_type" : "type-215"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 2016,
     "referenced_type" : "type-150"
    }
   ],
   "linker_set_key" : "user",
   "name" : "user",
   "referenced_type" : "type-212",
   "self_type" : "type-212",
   "size" : 284,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "swd",
     "field_offset" : 32,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "twd",
     "field_offset" : 64,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "fip",
     "field_offset" : 96,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "fcs",
     "field_offset" : 128,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "foo",
     "field_offset" : 160,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "fos",
     "field_offset" : 192,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 224,
     "referenced_type" : "type-207"
    }
   ],
   "linker_set_key" : "user_fpregs_struct",
   "name" : "user_fpregs_struct",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 108,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user_fpregs_struct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "twd",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "fip",
     "field_offset" : 64,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "fcs",
     "field_offset" : 96,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "foo",
     "field_offset" : 128,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "fos",
     "field_offset" : 160,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 224,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 256,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "xmm_space",
     "field_offset" : 1280,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "padding",
     "field_offset" : 2304,
     "referenced_type" : "type-210"
    }
   ],
   "linker_set_key" : "user_fpxregs_struct",
   "name" : "user_fpxregs_struct",
   "referenced_type" : "type-208",
   "self_type" : "type-208",
   "size" : 512,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user_fpxregs_struct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ebx",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "ecx",
     "field_offset" : 32,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "edx",
     "field_offset" : 64,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "esi",
     "field_offset" : 96,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "edi",
     "field_offset" : 128,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "ebp",
     "field_offset" : 160,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "eax",
     "field_offset" : 192,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "xds",
     "field_offset" : 224,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "xes",
     "field_offset" : 256,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "xfs",
     "field_offset" : 288,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "xgs",
     "field_offset" : 320,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "orig_eax",
     "field_offset" : 352,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "eip",
     "field_offset" : 384,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "xcs",
     "field_offset" : 416,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 448,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "esp",
     "field_offset" : 480,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "xss",
     "field_offset" : 512,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "type-211",
   "self_type" : "type-211",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_x86_64_vendor_shared/gen/include/sys/user.h",
   "unique_id" : "user_regs_struct"
  }
 ],
 "rvalue_reference_types" : []
}
