{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "CPpmd_See [16]",
   "name" : "CPpmd_See [16]",
   "referenced_type" : "type-253",
   "self_type" : "type-265",
   "size" : 64,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "CPpmd_See [25][16]",
   "name" : "CPpmd_See [25][16]",
   "referenced_type" : "type-265",
   "self_type" : "type-264",
   "size" : 1600,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "CSzBond [3]",
   "name" : "CSzBond [3]",
   "referenced_type" : "type-52",
   "self_type" : "type-64",
   "size" : 24,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "CSzCoderInfo [4]",
   "name" : "CSzCoderInfo [4]",
   "referenced_type" : "type-51",
   "self_type" : "type-65",
   "size" : 48,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "CXzFilter [4]",
   "name" : "CXzFilter [4]",
   "referenced_type" : "type-442",
   "self_type" : "type-441",
   "size" : 128,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_IStateCoder [4]",
   "name" : "_IStateCoder [4]",
   "referenced_type" : "type-432",
   "self_type" : "type-431",
   "size" : 96,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "const unsigned char *[4]",
   "name" : "const unsigned char *[4]",

   "self_type" : "type-94",
   "size" : 44,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const CSzArEx",
   "name" : "const CSzArEx",
   "referenced_type" : "type-96",
   "self_type" : "type-98",
   "size" : 120,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const CXzDecMtProps",
   "name" : "const CXzDecMtProps",
   "referenced_type" : "type-448",
   "self_type" : "type-462",
   "size" : 12,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const CXzProps",
   "name" : "const CXzProps",
   "referenced_type" : "type-605",
   "self_type" : "type-607",
   "size" : 128,
   "source_file" : "/external/lzma/C/XzEnc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const CXzStream",
   "name" : "const CXzStream",
   "referenced_type" : "type-453",
   "self_type" : "type-610",
   "size" : 20,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const CXzUnpacker",
   "name" : "const CXzUnpacker",
   "referenced_type" : "type-439",
   "self_type" : "type-458",
   "size" : 1772,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const CXzs",
   "name" : "const CXzs",
   "referenced_type" : "type-456",
   "self_type" : "type-613",
   "size" : 12,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const Cx86cpuid",
   "name" : "const Cx86cpuid",
   "referenced_type" : "type-14",
   "self_type" : "type-17",
   "size" : 32,
   "source_file" : "/external/lzma/C/CpuArch.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const IByteIn",
   "name" : "const IByteIn",
   "referenced_type" : "type-1",
   "self_type" : "type-6",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const IByteOut",
   "name" : "const IByteOut",
   "referenced_type" : "type-12",
   "self_type" : "type-11",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const ICompressProgress",
   "name" : "const ICompressProgress",
   "referenced_type" : "type-80",
   "self_type" : "type-85",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const ILookInStream",
   "name" : "const ILookInStream",
   "referenced_type" : "type-101",
   "self_type" : "type-106",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const IPpmd7_RangeDec",
   "name" : "const IPpmd7_RangeDec",
   "referenced_type" : "type-274",
   "self_type" : "type-278",
   "size" : 12,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const ISeekInStream",
   "name" : "const ISeekInStream",
   "referenced_type" : "type-126",
   "self_type" : "type-131",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const ISeqInStream",
   "name" : "const ISeqInStream",
   "referenced_type" : "type-24",
   "self_type" : "type-29",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const ISeqOutStream",
   "name" : "const ISeqOutStream",
   "referenced_type" : "type-72",
   "self_type" : "type-76",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const ISzAlloc",
   "name" : "const ISzAlloc",
   "referenced_type" : "type-148",
   "self_type" : "type-152",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const _CLzmaEncProps",
   "name" : "const _CLzmaEncProps",
   "referenced_type" : "type-66",
   "self_type" : "type-248",
   "size" : 56,
   "source_file" : "/external/lzma/C/LzmaEnc.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-160",
   "self_type" : "type-159",
   "size" : 1,
   "source_file" : "/external/lzma/C/7zFile.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-4",
   "self_type" : "type-43",
   "size" : 1,
   "source_file" : "/external/lzma/C/7z.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-33",
   "self_type" : "type-464",
   "size" : 8,
   "source_file" : "/external/lzma/C/Xz.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-9",
   "self_type" : "type-78",
   "source_file" : "/external/lzma/C/7zTypes.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[16]",
   "name" : "unsigned char const[16]",
   "referenced_type" : "type-270",
   "self_type" : "type-271",
   "size" : 16,
   "source_file" : "/external/lzma/C/Ppmd7.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[6]",
   "name" : "unsigned char const[6]",
   "referenced_type" : "type-19",
   "self_type" : "type-48",
   "size" : 6,
   "source_file" : "/external/lzma/C/7z.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "baseAlloc",
     "field_offset" : 64,
     "referenced_type" : "type-151"
    },
    {
     "field_name" : "numAlignBits",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "CAlignOffsetAlloc",
   "name" : "CAlignOffsetAlloc",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 20,
   "source_file" : "/external/lzma/C/Alloc.h",
   "unique_id" : "CAlignOffsetAlloc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bufs",
     "referenced_type" : "type-138"
    },
    {
     "field_name" : "lims",
     "field_offset" : 128,
     "referenced_type" : "type-138"
    },
    {
     "field_name" : "dest",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "destLim",
     "field_offset" : 288,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "state",
     "field_offset" : 320,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ip",
     "field_offset" : 352,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "temp",
     "field_offset" : 384,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "range",
     "field_offset" : 416,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "code",
     "field_offset" : 448,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "probs",
     "field_offset" : 480,
     "referenced_type" : "type-140"
    }
   ],
   "linker_set_key" : "CBcj2Dec",
   "name" : "CBcj2Dec",
   "referenced_type" : "type-137",
   "self_type" : "type-137",
   "size" : 576,
   "source_file" : "/external/lzma/C/Bcj2.h",
   "unique_id" : "CBcj2Dec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bufs",
     "referenced_type" : "type-143"
    },
    {
     "field_name" : "lims",
     "field_offset" : 128,
     "referenced_type" : "type-138"
    },
    {
     "field_name" : "src",
     "field_offset" : 256,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "srcLim",
     "field_offset" : 288,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "state",
     "field_offset" : 320,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "finishMode",
     "field_offset" : 352,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "prevByte",
     "field_offset" : 384,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "cache",
     "field_offset" : 392,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "range",
     "field_offset" : 416,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "low",
     "field_offset" : 448,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "cacheSize",
     "field_offset" : 512,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "ip",
     "field_offset" : 576,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "fileIp",
     "field_offset" : 608,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "fileSize",
     "field_offset" : 640,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "relatLimit",
     "field_offset" : 672,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tempTarget",
     "field_offset" : 704,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tempPos",
     "field_offset" : 736,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "temp",
     "field_offset" : 768,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "flushPos",
     "field_offset" : 832,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "probs",
     "field_offset" : 864,
     "referenced_type" : "type-140"
    }
   ],
   "linker_set_key" : "CBcj2Enc",
   "name" : "CBcj2Enc",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 624,
   "source_file" : "/external/lzma/C/Bcj2.h",
   "unique_id" : "CBcj2Enc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "CBuf",
   "name" : "CBuf",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zBuf.h",
   "unique_id" : "CBuf"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "pos",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "CDynBuf",
   "name" : "CDynBuf",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 12,
   "source_file" : "/external/lzma/C/7zBuf.h",
   "unique_id" : "CDynBuf"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "type-126"
    },
    {
     "field_name" : "file",
     "field_offset" : 64,
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "CFileInStream",
   "name" : "CFileInStream",
   "referenced_type" : "type-164",
   "self_type" : "type-164",
   "size" : 12,
   "source_file" : "/external/lzma/C/7zFile.h",
   "unique_id" : "CFileInStream"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "file",
     "field_offset" : 32,
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "CFileOutStream",
   "name" : "CFileOutStream",
   "referenced_type" : "type-166",
   "self_type" : "type-166",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zFile.h",
   "unique_id" : "CFileOutStream"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "file",
     "field_offset" : 32,
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "CFileSeqInStream",
   "name" : "CFileSeqInStream",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zFile.h",
   "unique_id" : "CFileSeqInStream"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "type-101"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 128,
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "pos",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "size",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "buf",
     "field_offset" : 224,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "bufSize",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "CLookToRead2",
   "name" : "CLookToRead2",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 36,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "CLookToRead2"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "control",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "needInitLevel",
     "field_offset" : 40,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "isExtraMode",
     "field_offset" : 48,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "_pad_",
     "field_offset" : 56,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "packSize",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "decoder",
     "field_offset" : 128,
     "referenced_type" : "type-55"
    }
   ],
   "linker_set_key" : "CLzma2Dec",
   "name" : "CLzma2Dec",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 116,
   "source_file" : "/external/lzma/C/Lzma2Dec.h",
   "unique_id" : "CLzma2Dec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lzmaProps",
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "blockSize",
     "field_offset" : 448,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "numBlockThreads_Reduced",
     "field_offset" : 512,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "numBlockThreads_Max",
     "field_offset" : 544,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "numTotalThreads",
     "field_offset" : 576,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "CLzma2EncProps",
   "name" : "CLzma2EncProps",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 76,
   "source_file" : "/external/lzma/C/Lzma2Enc.h",
   "unique_id" : "CLzma2EncProps"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "prop",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "probs",
     "field_offset" : 64,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "probs_1664",
     "field_offset" : 96,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "dic",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "dicBufSize",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "dicPos",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "buf",
     "field_offset" : 224,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "range",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "code",
     "field_offset" : 288,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "processedPos",
     "field_offset" : 320,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "checkDicSize",
     "field_offset" : 352,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "reps",
     "field_offset" : 384,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "state",
     "field_offset" : 512,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "remainLen",
     "field_offset" : 544,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numProbs",
     "field_offset" : 576,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tempBufSize",
     "field_offset" : 608,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tempBuf",
     "field_offset" : 640,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "CLzmaDec",
   "name" : "CLzmaDec",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 100,
   "source_file" : "/external/lzma/C/LzmaDec.h",
   "unique_id" : "CLzmaDec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alloc",
     "referenced_type" : "type-151"
    },
    {
     "field_name" : "buf",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "numCoders",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "outBuf",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "outBufSize",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "outWritten",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "wasFinished",
     "field_offset" : 192,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "res",
     "field_offset" : 224,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "status",
     "field_offset" : 256,
     "referenced_type" : "type-421"
    },
    {
     "field_name" : "finished",
     "field_offset" : 288,
     "referenced_type" : "type-427"
    },
    {
     "field_name" : "pos",
     "field_offset" : 384,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "size",
     "field_offset" : 480,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "ids",
     "field_offset" : 576,
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "results",
     "field_offset" : 832,
     "referenced_type" : "type-430"
    },
    {
     "field_name" : "coders",
     "field_offset" : 960,
     "referenced_type" : "type-431"
    }
   ],
   "linker_set_key" : "CMixCoder",
   "name" : "CMixCoder",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 216,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CMixCoder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Low",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "High",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "CNtfsFileTime",
   "name" : "CNtfsFileTime",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 8,
   "source_file" : "/external/lzma/C/7z.h",
   "unique_id" : "CNtfsFileTime"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "MinContext",
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "MaxContext",
     "field_offset" : 32,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "FoundState",
     "field_offset" : 64,
     "referenced_type" : "type-256"
    },
    {
     "field_name" : "OrderFall",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "InitEsc",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "PrevSuccess",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "MaxOrder",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "HiBitsFlag",
     "field_offset" : 224,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "RunLength",
     "field_offset" : 256,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "InitRL",
     "field_offset" : 288,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "Size",
     "field_offset" : 320,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "GlueCount",
     "field_offset" : 352,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "Base",
     "field_offset" : 384,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "LoUnit",
     "field_offset" : 416,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "HiUnit",
     "field_offset" : 448,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "Text",
     "field_offset" : 480,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "UnitsStart",
     "field_offset" : 512,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "AlignOffset",
     "field_offset" : 544,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "Indx2Units",
     "field_offset" : 576,
     "referenced_type" : "type-260"
    },
    {
     "field_name" : "Units2Indx",
     "field_offset" : 880,
     "referenced_type" : "type-261"
    },
    {
     "field_name" : "FreeList",
     "field_offset" : 1920,
     "referenced_type" : "type-262"
    },
    {
     "field_name" : "NS2Indx",
     "field_offset" : 3136,
     "referenced_type" : "type-263"
    },
    {
     "field_name" : "NS2BSIndx",
     "field_offset" : 5184,
     "referenced_type" : "type-263"
    },
    {
     "field_name" : "HB2Flag",
     "field_offset" : 7232,
     "referenced_type" : "type-263"
    },
    {
     "field_name" : "DummySee",
     "field_offset" : 9280,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "See",
     "field_offset" : 9312,
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "BinSumm",
     "field_offset" : 22112,
     "referenced_type" : "type-266"
    }
   ],
   "linker_set_key" : "CPpmd7",
   "name" : "CPpmd7",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 19148,
   "source_file" : "/external/lzma/C/Ppmd7.h",
   "unique_id" : "CPpmd7"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "NumStats",
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "SummFreq",
     "field_offset" : 16,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "Stats",
     "field_offset" : 32,
     "referenced_type" : "type-256"
    },
    {
     "field_name" : "Suffix",
     "field_offset" : 64,
     "referenced_type" : "type-257"
    }
   ],
   "linker_set_key" : "CPpmd7_Context_",
   "name" : "CPpmd7_Context_",
   "referenced_type" : "type-255",
   "self_type" : "type-255",
   "size" : 12,
   "source_file" : "/external/lzma/C/Ppmd7.h",
   "unique_id" : "CPpmd7_Context_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "type-274"
    },
    {
     "field_name" : "Range",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "Code",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "Stream",
     "field_offset" : 160,
     "referenced_type" : "type-282"
    }
   ],
   "linker_set_key" : "CPpmd7z_RangeDec",
   "name" : "CPpmd7z_RangeDec",
   "referenced_type" : "type-281",
   "self_type" : "type-281",
   "size" : 24,
   "source_file" : "/external/lzma/C/Ppmd7.h",
   "unique_id" : "CPpmd7z_RangeDec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Low",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "Range",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "Cache",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "CacheSize",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "Stream",
     "field_offset" : 192,
     "referenced_type" : "type-285"
    }
   ],
   "linker_set_key" : "CPpmd7z_RangeEnc",
   "name" : "CPpmd7z_RangeEnc",
   "referenced_type" : "type-284",
   "self_type" : "type-284",
   "size" : 28,
   "source_file" : "/external/lzma/C/Ppmd7.h",
   "unique_id" : "CPpmd7z_RangeEnc"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "Summ",
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "Shift",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "Count",
     "field_offset" : 24,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "CPpmd_See",
   "name" : "CPpmd_See",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 4,
   "source_file" : "/external/lzma/C/Ppmd.h",
   "unique_id" : "CPpmd_See"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "Symbol",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "Freq",
     "field_offset" : 8,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "SuccessorLow",
     "field_offset" : 16,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "SuccessorHigh",
     "field_offset" : 32,
     "referenced_type" : "type-58"
    }
   ],
   "linker_set_key" : "CPpmd_State",
   "name" : "CPpmd_State",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 6,
   "source_file" : "/external/lzma/C/Ppmd.h",
   "unique_id" : "CPpmd_State"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 32,
     "referenced_type" : "type-105"
    }
   ],
   "linker_set_key" : "CSecToLook",
   "name" : "CSecToLook",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "CSecToLook"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vt",
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "realStream",
     "field_offset" : 32,
     "referenced_type" : "type-105"
    }
   ],
   "linker_set_key" : "CSecToRead",
   "name" : "CSecToRead",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "CSecToRead"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "type-408"
    },
    {
     "field_name" : "count",
     "field_offset" : 256,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 320,
     "referenced_type" : "type-409"
    }
   ],
   "linker_set_key" : "CSha256",
   "name" : "CSha256",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 104,
   "source_file" : "/external/lzma/C/Sha256.h",
   "unique_id" : "CSha256"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "NumPackStreams",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "NumFolders",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "PackPositions",
     "field_offset" : 64,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "FolderCRCs",
     "field_offset" : 96,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "FoCodersOffsets",
     "field_offset" : 160,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "FoStartPackStreamIndex",
     "field_offset" : 192,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "FoToCoderUnpackSizes",
     "field_offset" : 224,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "FoToMainUnpackSizeIndex",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "CoderUnpackSizes",
     "field_offset" : 288,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "CodersData",
     "field_offset" : 320,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "CSzAr",
   "name" : "CSzAr",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 44,
   "source_file" : "/external/lzma/C/7z.h",
   "unique_id" : "CSzAr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "db",
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "startPosAfterHeader",
     "field_offset" : 352,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "dataPos",
     "field_offset" : 416,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "NumFiles",
     "field_offset" : 480,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "UnpackPositions",
     "field_offset" : 512,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "IsDirs",
     "field_offset" : 544,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "CRCs",
     "field_offset" : 576,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "Attribs",
     "field_offset" : 640,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "MTime",
     "field_offset" : 704,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "CTime",
     "field_offset" : 768,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "FolderToFile",
     "field_offset" : 832,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "FileToFolder",
     "field_offset" : 864,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "FileNameOffsets",
     "field_offset" : 896,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "FileNames",
     "field_offset" : 928,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "CSzArEx",
   "name" : "CSzArEx",
   "referenced_type" : "type-96",
   "self_type" : "type-96",
   "size" : 120,
   "source_file" : "/external/lzma/C/7z.h",
   "unique_id" : "CSzArEx"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Defs",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "Vals",
     "field_offset" : 32,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "CSzBitUi32s",
   "name" : "CSzBitUi32s",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 8,
   "source_file" : "/external/lzma/C/7z.h",
   "unique_id" : "CSzBitUi32s"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Defs",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "Vals",
     "field_offset" : 32,
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "CSzBitUi64s",
   "name" : "CSzBitUi64s",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 8,
   "source_file" : "/external/lzma/C/7z.h",
   "unique_id" : "CSzBitUi64s"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "InIndex",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "OutIndex",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "CSzBond",
   "name" : "CSzBond",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 8,
   "source_file" : "/external/lzma/C/7z.h",
   "unique_id" : "CSzBond"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "PropsOffset",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "MethodID",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "NumStreams",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "PropsSize",
     "field_offset" : 72,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "CSzCoderInfo",
   "name" : "CSzCoderInfo",
   "referenced_type" : "type-51",
   "self_type" : "type-51",
   "size" : 12,
   "source_file" : "/external/lzma/C/7z.h",
   "unique_id" : "CSzCoderInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Data",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "Size",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "CSzData",
   "name" : "CSzData",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 8,
   "source_file" : "/external/lzma/C/7z.h",
   "unique_id" : "CSzData"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "file",
     "referenced_type" : "type-156"
    }
   ],
   "linker_set_key" : "CSzFile",
   "name" : "CSzFile",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zFile.h",
   "unique_id" : "CSzFile"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "NumCoders",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "NumBonds",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "NumPackStreams",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "UnpackStream",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "PackStreams",
     "field_offset" : 128,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Bonds",
     "field_offset" : 256,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "Coders",
     "field_offset" : 448,
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "CSzFolder",
   "name" : "CSzFolder",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 104,
   "source_file" : "/external/lzma/C/7z.h",
   "unique_id" : "CSzFolder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "packSize",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "filters",
     "field_offset" : 160,
     "referenced_type" : "type-441"
    }
   ],
   "linker_set_key" : "CXzBlock",
   "name" : "CXzBlock",
   "referenced_type" : "type-440",
   "self_type" : "type-440",
   "size" : 148,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CXzBlock"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "unpackSize",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "totalSize",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "CXzBlockSizes",
   "name" : "CXzBlockSizes",
   "referenced_type" : "type-452",
   "self_type" : "type-452",
   "size" : 16,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CXzBlockSizes"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "crc",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "crc64",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "sha",
     "field_offset" : 128,
     "referenced_type" : "type-407"
    }
   ],
   "linker_set_key" : "CXzCheck",
   "name" : "CXzCheck",
   "referenced_type" : "type-444",
   "self_type" : "type-444",
   "size" : 120,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CXzCheck"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "inBufSize_ST",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "outStep_ST",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ignoreErrors",
     "field_offset" : 64,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "CXzDecMtProps",
   "name" : "CXzDecMtProps",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 12,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CXzDecMtProps"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "propsSize",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "props",
     "field_offset" : 96,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "CXzFilter",
   "name" : "CXzFilter",
   "referenced_type" : "type-442",
   "self_type" : "type-442",
   "size" : 32,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CXzFilter"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "delta",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ip",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ipDefined",
     "field_offset" : 96,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "CXzFilterProps",
   "name" : "CXzFilterProps",
   "referenced_type" : "type-603",
   "self_type" : "type-603",
   "size" : 16,
   "source_file" : "/external/lzma/C/XzEnc.h",
   "unique_id" : "CXzFilterProps"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lzma2Props",
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "filterProps",
     "field_offset" : 608,
     "referenced_type" : "type-603"
    },
    {
     "field_name" : "checkId",
     "field_offset" : 736,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "blockSize",
     "field_offset" : 768,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "numBlockThreads_Reduced",
     "field_offset" : 832,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "numBlockThreads_Max",
     "field_offset" : 864,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "numTotalThreads",
     "field_offset" : 896,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "forceWriteSizesInHeader",
     "field_offset" : 928,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "reduceSize",
     "field_offset" : 960,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "CXzProps",
   "name" : "CXzProps",
   "referenced_type" : "type-605",
   "self_type" : "type-605",
   "size" : 128,
   "source_file" : "/external/lzma/C/XzEnc.h",
   "unique_id" : "CXzProps"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "UnpackSize_Defined",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "NumStreams_Defined",
     "field_offset" : 8,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "NumBlocks_Defined",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "DataAfterEnd",
     "field_offset" : 24,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "DecodingTruncated",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "InSize",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "OutSize",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "NumStreams",
     "field_offset" : 192,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "NumBlocks",
     "field_offset" : 256,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "DecodeRes",
     "field_offset" : 320,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "ReadRes",
     "field_offset" : 352,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "ProgressRes",
     "field_offset" : 384,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "CombinedRes",
     "field_offset" : 416,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "CombinedRes_Type",
     "field_offset" : 448,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "CXzStatInfo",
   "name" : "CXzStatInfo",
   "referenced_type" : "type-449",
   "self_type" : "type-449",
   "size" : 60,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CXzStatInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "numBlocks",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "blocks",
     "field_offset" : 64,
     "referenced_type" : "type-454"
    },
    {
     "field_name" : "startOffset",
     "field_offset" : 96,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "CXzStream",
   "name" : "CXzStream",
   "referenced_type" : "type-453",
   "self_type" : "type-453",
   "size" : 20,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CXzStream"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "type-438"
    },
    {
     "field_name" : "pos",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "alignPos",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "indexPreSize",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "streamFlags",
     "field_offset" : 128,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "blockHeaderSize",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "packSize",
     "field_offset" : 192,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "unpackSize",
     "field_offset" : 256,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "numBlocks",
     "field_offset" : 320,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "indexSize",
     "field_offset" : 384,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "indexPos",
     "field_offset" : 448,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "padSize",
     "field_offset" : 512,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "numStartedStreams",
     "field_offset" : 576,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "numFinishedStreams",
     "field_offset" : 640,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "numTotalBlocks",
     "field_offset" : 704,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "crc",
     "field_offset" : 768,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "decoder",
     "field_offset" : 800,
     "referenced_type" : "type-425"
    },
    {
     "field_name" : "block",
     "field_offset" : 2528,
     "referenced_type" : "type-440"
    },
    {
     "field_name" : "check",
     "field_offset" : 3712,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "sha",
     "field_offset" : 4672,
     "referenced_type" : "type-407"
    },
    {
     "field_name" : "parseMode",
     "field_offset" : 5504,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "headerParsedOk",
     "field_offset" : 5536,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "decodeToStreamSignature",
     "field_offset" : 5568,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "decodeOnlyOneBlock",
     "field_offset" : 5600,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "outBuf",
     "field_offset" : 5632,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "outBufSize",
     "field_offset" : 5664,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "outDataWritten",
     "field_offset" : 5696,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "shaDigest",
     "field_offset" : 5728,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "buf",
     "field_offset" : 5984,
     "referenced_type" : "type-446"
    }
   ],
   "linker_set_key" : "CXzUnpacker",
   "name" : "CXzUnpacker",
   "referenced_type" : "type-439",
   "self_type" : "type-439",
   "size" : 1772,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CXzUnpacker"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numAllocated",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "streams",
     "field_offset" : 64,
     "referenced_type" : "type-455"
    }
   ],
   "linker_set_key" : "CXzs",
   "name" : "CXzs",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 12,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "CXzs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxFunc",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "vendor",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "ver",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "b",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "c",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "d",
     "field_offset" : 224,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "Cx86cpuid",
   "name" : "Cx86cpuid",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 32,
   "source_file" : "/external/lzma/C/CpuArch.h",
   "unique_id" : "Cx86cpuid"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "IByteIn",
   "name" : "IByteIn",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "IByteIn"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "IByteOut",
   "name" : "IByteOut",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "IByteOut"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Progress",
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "ICompressProgress",
   "name" : "ICompressProgress",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "ICompressProgress"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Look",
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 32,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "Read",
     "field_offset" : 64,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 96,
     "referenced_type" : "type-114"
    }
   ],
   "linker_set_key" : "ILookInStream",
   "name" : "ILookInStream",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 16,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "ILookInStream"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetThreshold",
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "Decode",
     "field_offset" : 32,
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "DecodeBit",
     "field_offset" : 64,
     "referenced_type" : "type-275"
    }
   ],
   "linker_set_key" : "IPpmd7_RangeDec",
   "name" : "IPpmd7_RangeDec",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 12,
   "source_file" : "/external/lzma/C/Ppmd7.h",
   "unique_id" : "IPpmd7_RangeDec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 32,
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "ISeekInStream",
   "name" : "ISeekInStream",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "ISeekInStream"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Read",
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "ISeqInStream",
   "name" : "ISeqInStream",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "ISeqInStream"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Write",
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "ISeqOutStream",
   "name" : "ISeqOutStream",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 4,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "ISeqOutStream"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Alloc",
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "Free",
     "field_offset" : 32,
     "referenced_type" : "type-153"
    }
   ],
   "linker_set_key" : "ISzAlloc",
   "name" : "ISzAlloc",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 8,
   "source_file" : "/external/lzma/C/7zTypes.h",
   "unique_id" : "ISzAlloc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "level",
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "dictSize",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "lc",
     "field_offset" : 64,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "lp",
     "field_offset" : 96,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "pb",
     "field_offset" : 128,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "algo",
     "field_offset" : 160,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "fb",
     "field_offset" : 192,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "btMode",
     "field_offset" : 224,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "numHashBytes",
     "field_offset" : 256,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "mc",
     "field_offset" : 288,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "writeEndMark",
     "field_offset" : 320,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numThreads",
     "field_offset" : 352,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "reduceSize",
     "field_offset" : 384,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "_CLzmaEncProps",
   "name" : "_CLzmaEncProps",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 56,
   "source_file" : "/external/lzma/C/LzmaEnc.h",
   "unique_id" : "_CLzmaEncProps"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "lp",
     "field_offset" : 8,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pb",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "_pad_",
     "field_offset" : 24,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "dicSize",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "_CLzmaProps",
   "name" : "_CLzmaProps",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 8,
   "source_file" : "/external/lzma/C/LzmaDec.h",
   "unique_id" : "_CLzmaProps"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "pos",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "posLimit",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "streamPos",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "lenLimit",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "cyclicBufferPos",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "cyclicBufferSize",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "streamEndWasReached",
     "field_offset" : 224,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "btMode",
     "field_offset" : 232,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bigHash",
     "field_offset" : 240,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "directInput",
     "field_offset" : 248,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "matchMaxLen",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "hash",
     "field_offset" : 288,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "son",
     "field_offset" : 320,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "hashMask",
     "field_offset" : 352,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "cutValue",
     "field_offset" : 384,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "bufferBase",
     "field_offset" : 416,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "stream",
     "field_offset" : 448,
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "blockSize",
     "field_offset" : 480,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "keepSizeBefore",
     "field_offset" : 512,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "keepSizeAfter",
     "field_offset" : 544,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numHashBytes",
     "field_offset" : 576,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "directInputRem",
     "field_offset" : 608,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "historySize",
     "field_offset" : 640,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "fixedHashSize",
     "field_offset" : 672,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "hashSizeSum",
     "field_offset" : 704,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "result",
     "field_offset" : 736,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "crc",
     "field_offset" : 768,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "numRefs",
     "field_offset" : 8960,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "expectedDataSize",
     "field_offset" : 8992,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "_CMatchFinder",
   "name" : "_CMatchFinder",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 1132,
   "source_file" : "/external/lzma/C/LzFind.h",
   "unique_id" : "_CMatchFinder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Init",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "GetNumAvailableBytes",
     "field_offset" : 32,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "GetPointerToCurrentPos",
     "field_offset" : 64,
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "GetMatches",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "Skip",
     "field_offset" : 128,
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "_IMatchFinder",
   "name" : "_IMatchFinder",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 20,
   "source_file" : "/external/lzma/C/LzFind.h",
   "unique_id" : "_IMatchFinder"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "Free",
     "field_offset" : 32,
     "referenced_type" : "type-433"
    },
    {
     "field_name" : "SetProps",
     "field_offset" : 64,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "Init",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "Code2",
     "field_offset" : 128,
     "referenced_type" : "type-415"
    },
    {
     "field_name" : "Filter",
     "field_offset" : 160,
     "referenced_type" : "type-424"
    }
   ],
   "linker_set_key" : "_IStateCoder",
   "name" : "_IStateCoder",
   "referenced_type" : "type-432",
   "self_type" : "type-432",
   "size" : 24,
   "source_file" : "/external/lzma/C/Xz.h",
   "unique_id" : "_IStateCoder"
  }
 ],
 "rvalue_reference_types" : []
}
