{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA0_c",
   "name" : "char [0]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA0_c",
   "source_file" : "/bionic/libc/system_properties/include/system_properties/prop_info.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1024_c",
   "name" : "char [1024]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1024_c",
   "size" : 1024,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/system_properties.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1025_c",
   "name" : "char [1025]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1025_c",
   "size" : 1025,
   "source_file" : "/bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char [120]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA120_c",
   "size" : 120,
   "source_file" : "/bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_m",
   "name" : "unsigned long [128]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA128_m",
   "size" : 512,
   "source_file" : "/bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 1,

   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties20PropertyInfoAreaFileE",
   "name" : "const android::properties::PropertyInfoAreaFile",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTIKN7android10properties20PropertyInfoAreaFileE",
   "size" : 8,
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties22PropertyInfoAreaHeaderE",
   "name" : "const android::properties::PropertyInfoAreaHeader",
   "referenced_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "self_type" : "_ZTIKN7android10properties22PropertyInfoAreaHeaderE",
   "size" : 24,
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties8TrieNodeE",
   "name" : "const android::properties::TrieNode",
   "referenced_type" : "_ZTIN7android10properties8TrieNodeE",
   "self_type" : "_ZTIKN7android10properties8TrieNodeE",
   "size" : 8,
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7prop_bt",
   "name" : "prop_bt *const",
   "referenced_type" : "_ZTIP7prop_bt",
   "self_type" : "_ZTIKP7prop_bt",
   "size" : 4,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 4,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIKPKv",
   "size" : 4,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPc",
   "name" : "char *const",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIKPc",
   "size" : 4,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPj",
   "name" : "unsigned int *const",
   "referenced_type" : "_ZTIPj",
   "self_type" : "_ZTIKPj",
   "size" : 4,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIKPv",
   "size" : 4,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/bionic/libc/include/signal.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "/bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/system_properties.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/bionic/libc/include/wchar.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 4,
   "source_file" : "/bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/fortify/poll.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "self_type" : "_ZTIVPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "self_type" : "_ZTIVPFPvjPKvE",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "self_type" : "_ZTIVPFPvjjPKvE",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10Elf32_Chdr",
   "name" : "Elf32_Chdr",
   "referenced_type" : "_ZTI10Elf32_Chdr",
   "self_type" : "_ZTI10Elf32_Chdr",
   "size" : 12,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI10Elf32_Move",
   "name" : "Elf32_Move",
   "referenced_type" : "_ZTI10Elf32_Move",
   "self_type" : "_ZTI10Elf32_Move",
   "size" : 24,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10Elf64_Chdr",
   "name" : "Elf64_Chdr",
   "referenced_type" : "_ZTI10Elf64_Chdr",
   "self_type" : "_ZTI10Elf64_Chdr",
   "size" : 24,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 208,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI10Elf64_Move",
   "name" : "Elf64_Move",
   "referenced_type" : "_ZTI10Elf64_Move",
   "self_type" : "_ZTI10Elf64_Move",
   "size" : 32,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10ns_namemap",
   "name" : "ns_namemap",
   "referenced_type" : "_ZTI10ns_namemap",
   "self_type" : "_ZTI10ns_namemap",
   "size" : 8,
   "source_file" : "/bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rm_so",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rm_eo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10regmatch_t",
   "name" : "regmatch_t",
   "referenced_type" : "_ZTI10regmatch_t",
   "self_type" : "_ZTI10regmatch_t",
   "size" : 8,
   "source_file" : "/bionic/libc/include/regex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI10sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "_ZTI10sigset64_t",
   "self_type" : "_ZTI10sigset64_t",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "lock_",
     "referenced_type" : "_ZTI4Lock"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "pa_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9prop_area"
    },
    {
     "access" : "private",
     "field_name" : "no_access_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI11ContextNode",
   "name" : "ContextNode",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11ContextNode",
   "self_type" : "_ZTI11ContextNode",
   "size" : 24,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/context_node.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__flag",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTI11atomic_flag",
   "name" : "atomic_flag",
   "referenced_type" : "_ZTI11atomic_flag",
   "self_type" : "_ZTI11atomic_flag",
   "size" : 1,
   "source_file" : "/bionic/libc/include/bits/stdatomic.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "e_termination",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "e_exit",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI11exit_status",
   "name" : "exit_status",
   "referenced_type" : "_ZTI11exit_status",
   "self_type" : "_ZTI11exit_status",
   "size" : 4,
   "source_file" : "/bionic/libc/include/utmp.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imsf_multiaddr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imsf_interface",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imsf_fmode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imsf_numsrc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imsf_slist",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI11ip_msfilter",
   "name" : "ip_msfilter",
   "referenced_type" : "_ZTI11ip_msfilter",
   "self_type" : "_ZTI11ip_msfilter",
   "size" : 20,
   "source_file" : "/bionic/libc/include/bits/ip_msfilter.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIA1025_c"
    },
    {
     "field_name" : "alg",
     "field_offset" : 8200,
     "referenced_type" : "_ZTIA1025_c"
    },
    {
     "field_name" : "data",
     "field_offset" : 16416,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "len",
     "field_offset" : 16448,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11ns_tsig_key",
   "name" : "ns_tsig_key",
   "referenced_type" : "_ZTI11ns_tsig_key",
   "self_type" : "_ZTI11ns_tsig_key",
   "size" : 2060,
   "source_file" : "/bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "referenced_type" : "_ZTI11sched_param",
   "self_type" : "_ZTI11sched_param",
   "size" : 4,
   "source_file" : "/bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "_ZTI11sigaction64",
   "self_type" : "_ZTI11sigaction64",
   "size" : 20,
   "source_file" : "/bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_6fp_reg"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "_ZTI11user_fpregs",
   "self_type" : "_ZTI11user_fpregs",
   "size" : 116,
   "source_file" : "/bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12Elf32_Verdef",
   "name" : "Elf32_Verdef",
   "referenced_type" : "_ZTI12Elf32_Verdef",
   "self_type" : "_ZTI12Elf32_Verdef",
   "size" : 20,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN12Elf32_auxv_tUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12Elf32_auxv_t",
   "name" : "Elf32_auxv_t",
   "referenced_type" : "_ZTI12Elf32_auxv_t",
   "self_type" : "_ZTI12Elf32_auxv_t",
   "size" : 8,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12Elf64_Verdef",
   "name" : "Elf64_Verdef",
   "referenced_type" : "_ZTI12Elf64_Verdef",
   "self_type" : "_ZTI12Elf64_Verdef",
   "size" : 20,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN12Elf64_auxv_tUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12Elf64_auxv_t",
   "name" : "Elf64_auxv_t",
   "referenced_type" : "_ZTI12Elf64_auxv_t",
   "self_type" : "_ZTI12Elf64_auxv_t",
   "size" : 16,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dlpi_addr",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dlpi_name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "dlpi_phdr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK10elf32_phdr"
    },
    {
     "field_name" : "dlpi_phnum",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dlpi_adds",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dlpi_subs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dlpi_tls_modid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dlpi_tls_data",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12dl_phdr_info",
   "name" : "dl_phdr_info",
   "referenced_type" : "_ZTI12dl_phdr_info",
   "self_type" : "_ZTI12dl_phdr_info",
   "size" : 40,
   "source_file" : "/bionic/libc/include/link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__hsearch",
     "referenced_type" : "_ZTIP9__hsearch"
    }
   ],
   "linker_set_key" : "_ZTI12hsearch_data",
   "name" : "hsearch_data",
   "referenced_type" : "_ZTI12hsearch_data",
   "self_type" : "_ZTI12hsearch_data",
   "size" : 4,
   "source_file" : "/bionic/libc/include/search.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "if_index",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "if_name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI12if_nameindex",
   "name" : "if_nameindex",
   "referenced_type" : "_ZTI12if_nameindex",
   "self_type" : "_ZTI12if_nameindex",
   "size" : 8,
   "source_file" : "/bionic/libc/include/net/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "_ZTI12user_vfp_exc",
   "self_type" : "_ZTI12user_vfp_exc",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8Contexts"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "prefixes_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP10PrefixNode"
    },
    {
     "access" : "private",
     "field_name" : "contexts_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15ContextListNode"
    },
    {
     "access" : "private",
     "field_name" : "serial_prop_area_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9prop_area"
    },
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI13ContextsSplit",
   "name" : "ContextsSplit",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13ContextsSplit",
   "self_type" : "_ZTI13ContextsSplit",
   "size" : 20,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/contexts_split.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI13ContextsSplit"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN13ContextsSplitD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN13ContextsSplitD0Ev"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit10InitializeEbPKcPb"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit18GetPropAreaForNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit17GetSerialPropAreaEv"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit11ResetAccessEv"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI13Elf32_Syminfo",
   "name" : "Elf32_Syminfo",
   "referenced_type" : "_ZTI13Elf32_Syminfo",
   "self_type" : "_ZTI13Elf32_Syminfo",
   "size" : 4,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf32_Verdaux",
   "name" : "Elf32_Verdaux",
   "referenced_type" : "_ZTI13Elf32_Verdaux",
   "self_type" : "_ZTI13Elf32_Verdaux",
   "size" : 8,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf32_Vernaux",
   "name" : "Elf32_Vernaux",
   "referenced_type" : "_ZTI13Elf32_Vernaux",
   "self_type" : "_ZTI13Elf32_Vernaux",
   "size" : 16,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf32_Verneed",
   "name" : "Elf32_Verneed",
   "referenced_type" : "_ZTI13Elf32_Verneed",
   "self_type" : "_ZTI13Elf32_Verneed",
   "size" : 16,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI13Elf64_Syminfo",
   "name" : "Elf64_Syminfo",
   "referenced_type" : "_ZTI13Elf64_Syminfo",
   "self_type" : "_ZTI13Elf64_Syminfo",
   "size" : 4,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf64_Verdaux",
   "name" : "Elf64_Verdaux",
   "referenced_type" : "_ZTI13Elf64_Verdaux",
   "self_type" : "_ZTI13Elf64_Verdaux",
   "size" : 8,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf64_Vernaux",
   "name" : "Elf64_Vernaux",
   "referenced_type" : "_ZTI13Elf64_Vernaux",
   "self_type" : "_ZTI13Elf64_Vernaux",
   "size" : 16,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf64_Verneed",
   "name" : "Elf64_Verneed",
   "referenced_type" : "_ZTI13Elf64_Verneed",
   "self_type" : "_ZTI13Elf64_Verneed",
   "size" : 16,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_interface",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_sourceaddr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI14ip_mreq_source",
   "name" : "ip_mreq_source",
   "referenced_type" : "_ZTI14ip_mreq_source",
   "self_type" : "_ZTI14ip_mreq_source",
   "size" : 12,
   "source_file" : "/bionic/libc/include/bits/ip_mreq_source.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 24,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8Contexts"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pre_split_prop_area_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9prop_area"
    }
   ],
   "linker_set_key" : "_ZTI16ContextsPreSplit",
   "name" : "ContextsPreSplit",
   "record_kind" : "class",
   "referenced_type" : "_ZTI16ContextsPreSplit",
   "self_type" : "_ZTI16ContextsPreSplit",
   "size" : 8,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/contexts_pre_split.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16ContextsPreSplit"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16ContextsPreSplitD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16ContextsPreSplitD0Ev"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit10InitializeEbPKcPb"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit18GetPropAreaForNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit17GetSerialPropAreaEv"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit11ResetAccessEv"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "contexts_data_",
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "access" : "private",
     "field_name" : "contexts_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8Contexts"
    },
    {
     "access" : "private",
     "field_name" : "initialized_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "property_filename_",
     "field_offset" : 296,
     "referenced_type" : "_ZTIA1024_c"
    }
   ],
   "linker_set_key" : "_ZTI16SystemProperties",
   "name" : "SystemProperties",
   "record_kind" : "class",
   "referenced_type" : "_ZTI16SystemProperties",
   "self_type" : "_ZTI16SystemProperties",
   "size" : 1064,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/system_properties.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "reserved_addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "relro_fd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "library_fd",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "library_fd_offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "library_namespace",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP19android_namespace_t"
    }
   ],
   "linker_set_key" : "_ZTI17android_dlextinfo",
   "name" : "android_dlextinfo",
   "referenced_type" : "_ZTI17android_dlextinfo",
   "self_type" : "_ZTI17android_dlextinfo",
   "size" : 40,
   "source_file" : "/bionic/libc/include/android/dlext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "counter",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "key",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7dst_key"
    },
    {
     "field_name" : "ctx",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "sig",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA512_h"
    },
    {
     "field_name" : "siglen",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI17ns_tcp_tsig_state",
   "name" : "ns_tcp_tsig_state",
   "referenced_type" : "_ZTI17ns_tcp_tsig_state",
   "self_type" : "_ZTI17ns_tcp_tsig_state",
   "size" : 528,
   "source_file" : "/bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8Contexts"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "property_info_area_file_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE"
    },
    {
     "access" : "private",
     "field_name" : "context_nodes_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP11ContextNode"
    },
    {
     "access" : "private",
     "field_name" : "num_context_nodes_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "context_nodes_mmap_size_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "serial_prop_area_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP9prop_area"
    }
   ],
   "linker_set_key" : "_ZTI18ContextsSerialized",
   "name" : "ContextsSerialized",
   "record_kind" : "class",
   "referenced_type" : "_ZTI18ContextsSerialized",
   "self_type" : "_ZTI18ContextsSerialized",
   "size" : 32,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/contexts_serialized.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI18ContextsSerialized"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN18ContextsSerializedD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN18ContextsSerializedD0Ev"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized10InitializeEbPKcPb"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized18GetPropAreaForNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized17GetSerialPropAreaEv"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized11ResetAccessEv"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "_ZTI19__pthread_cleanup_t",
   "self_type" : "_ZTI19__pthread_cleanup_t",
   "size" : 12,
   "source_file" : "/bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "referenced_type" : "_ZTI2tm",
   "self_type" : "_ZTI2tm",
   "size" : 44,
   "source_file" : "/bionic/libc/include/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_dev",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__st_ino",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_nlink",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_gid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_rdev",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad3",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "st_blksize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_blocks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "st_atim",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_mtim",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ctim",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ino",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI4stat",
   "name" : "stat",
   "referenced_type" : "_ZTI4stat",
   "self_type" : "_ZTI4stat",
   "size" : 104,
   "source_file" : "/bionic/libc/include/sys/stat.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "referenced_type" : "_ZTI4user",
   "self_type" : "_ZTI4user",
   "size" : 296,
   "source_file" : "/bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ut_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "ut_pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ut_line",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "ut_id",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "ut_user",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "ut_host",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "ut_exit",
     "field_offset" : 352,
     "referenced_type" : "_ZTI11exit_status"
    },
    {
     "field_name" : "ut_session",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ut_tv",
     "field_offset" : 416,
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "ut_addr_v6",
     "field_offset" : 480,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "unsed",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA20_c"
    }
   ],
   "linker_set_key" : "_ZTI4utmp",
   "name" : "utmp",
   "referenced_type" : "_ZTI4utmp",
   "self_type" : "_ZTI4utmp",
   "size" : 96,
   "source_file" : "/bionic/libc/include/utmp.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI5entry",
   "name" : "entry",
   "referenced_type" : "_ZTI5entry",
   "self_type" : "_ZTI5entry",
   "size" : 8,
   "source_file" : "/bionic/libc/include/search.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5flock",
   "name" : "flock",
   "referenced_type" : "_ZTI5flock",
   "self_type" : "_ZTI5flock",
   "size" : 16,
   "source_file" : "/bionic/libc/include/bits/flock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gr_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "gr_passwd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "gr_gid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gr_mem",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPPc"
    }
   ],
   "linker_set_key" : "_ZTI5group",
   "name" : "group",
   "referenced_type" : "_ZTI5group",
   "self_type" : "_ZTI5group",
   "size" : 16,
   "source_file" : "/bionic/libc/include/grp.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "decimal_point",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_curr_symbol",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "currency_symbol",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_decimal_point",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_thousands_sep",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_grouping",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "positive_sign",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "negative_sign",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_frac_digits",
     "field_offset" : 320,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "frac_digits",
     "field_offset" : 328,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_cs_precedes",
     "field_offset" : 336,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sep_by_space",
     "field_offset" : 344,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_cs_precedes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sep_by_space",
     "field_offset" : 360,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sign_posn",
     "field_offset" : 368,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sign_posn",
     "field_offset" : 376,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_cs_precedes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sep_by_space",
     "field_offset" : 392,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_cs_precedes",
     "field_offset" : 400,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sep_by_space",
     "field_offset" : 408,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sign_posn",
     "field_offset" : 416,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sign_posn",
     "field_offset" : 424,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI5lconv",
   "name" : "lconv",
   "referenced_type" : "_ZTI5lconv",
   "self_type" : "_ZTI5lconv",
   "size" : 56,
   "source_file" : "/bionic/libc/include/locale.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5ucred",
   "name" : "ucred",
   "referenced_type" : "_ZTI5ucred",
   "self_type" : "_ZTI5ucred",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rd",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tc",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "aa",
     "field_offset" : 18,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "opcode",
     "field_offset" : 19,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qr",
     "field_offset" : 23,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rcode",
     "field_offset" : 24,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cd",
     "field_offset" : 28,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ad",
     "field_offset" : 29,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 30,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ra",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qdcount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ancount",
     "field_offset" : 48,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nscount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arcount",
     "field_offset" : 80,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6HEADER",
   "name" : "HEADER",
   "referenced_type" : "_ZTI6HEADER",
   "self_type" : "_ZTI6HEADER",
   "size" : 12,
   "source_file" : "/bionic/libc/include/arpa/nameser_compat.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI6dirent",
   "name" : "dirent",
   "referenced_type" : "_ZTI6dirent",
   "self_type" : "_ZTI6dirent",
   "size" : 280,
   "source_file" : "/bionic/libc/include/dirent.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "referenced_type" : "_ZTI6fd_set",
   "self_type" : "_ZTI6fd_set",
   "size" : 128,
   "source_file" : "/bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6fp_reg",
   "name" : "fp_reg",
   "referenced_type" : "_ZTI6fp_reg",
   "self_type" : "_ZTI6fp_reg",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gl_pathc",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gl_matchc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gl_offs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gl_flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "gl_pathv",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "gl_errfunc",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiPKciE"
    },
    {
     "field_name" : "gl_closedir",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "gl_readdir",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFP6direntPvE"
    },
    {
     "field_name" : "gl_opendir",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFPvPKcE"
    },
    {
     "field_name" : "gl_lstat",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFiPKcP4statE"
    },
    {
     "field_name" : "gl_stat",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiPKcP4statE"
    }
   ],
   "linker_set_key" : "_ZTI6glob_t",
   "name" : "glob_t",
   "referenced_type" : "_ZTI6glob_t",
   "self_type" : "_ZTI6glob_t",
   "size" : 44,
   "source_file" : "/bionic/libc/include/glob.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_onoff",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l_linger",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6linger",
   "name" : "linger",
   "referenced_type" : "_ZTI6linger",
   "self_type" : "_ZTI6linger",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mnt_fsname",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mnt_dir",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mnt_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mnt_opts",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mnt_freq",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mnt_passno",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6mntent",
   "name" : "mntent",
   "referenced_type" : "_ZTI6mntent",
   "self_type" : "_ZTI6mntent",
   "size" : 24,
   "source_file" : "/bionic/libc/include/mntent.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_name",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "msg_namelen",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msg_iov",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP5iovec"
    },
    {
     "field_name" : "msg_iovlen",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "msg_control",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "msg_controllen",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "msg_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6msghdr",
   "name" : "msghdr",
   "referenced_type" : "_ZTI6msghdr",
   "self_type" : "_ZTI6msghdr",
   "size" : 28,
   "source_file" : "/bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "n_aliases",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "n_addrtype",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "n_net",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6netent",
   "name" : "netent",
   "referenced_type" : "_ZTI6netent",
   "self_type" : "_ZTI6netent",
   "size" : 16,
   "source_file" : "/bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "has_arg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flag",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "val",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6option",
   "name" : "option",
   "referenced_type" : "_ZTI6option",
   "self_type" : "_ZTI6option",
   "size" : 16,
   "source_file" : "/bionic/libc/include/getopt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pw_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pw_passwd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pw_uid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pw_gid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pw_dir",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pw_shell",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI6passwd",
   "name" : "passwd",
   "referenced_type" : "_ZTI6passwd",
   "self_type" : "_ZTI6passwd",
   "size" : 24,
   "source_file" : "/bionic/libc/include/pwd.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_dev",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__st_ino",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_nlink",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_gid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_rdev",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad3",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "st_blksize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_blocks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "st_atim",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_mtim",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ctim",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ino",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI6stat64",
   "name" : "stat64",
   "referenced_type" : "_ZTI6stat64",
   "self_type" : "_ZTI6stat64",
   "size" : 104,
   "source_file" : "/bionic/libc/include/sys/stat.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dli_fname",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "dli_fbase",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "dli_sname",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "dli_saddr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI7Dl_info",
   "name" : "Dl_info",
   "referenced_type" : "_ZTI7Dl_info",
   "self_type" : "_ZTI7Dl_info",
   "size" : 16,
   "source_file" : "/bionic/libc/include/dlfcn.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIA1025_c"
    },
    {
     "field_name" : "type",
     "field_offset" : 8208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rr_class",
     "field_offset" : 8224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ttl",
     "field_offset" : 8256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rdlength",
     "field_offset" : 8288,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rdata",
     "field_offset" : 8320,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI7__ns_rr",
   "name" : "__ns_rr",
   "referenced_type" : "_ZTI7__ns_rr",
   "self_type" : "_ZTI7__ns_rr",
   "size" : 1044,
   "source_file" : "/bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cmsg_len",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cmsg_level",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cmsg_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7cmsghdr",
   "name" : "cmsghdr",
   "referenced_type" : "_ZTI7cmsghdr",
   "self_type" : "_ZTI7cmsghdr",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7flock64",
   "name" : "flock64",
   "referenced_type" : "_ZTI7flock64",
   "self_type" : "_ZTI7flock64",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/flock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "h_aliases",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "h_addrtype",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_length",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_addr_list",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPPc"
    }
   ],
   "linker_set_key" : "_ZTI7hostent",
   "name" : "hostent",
   "referenced_type" : "_ZTI7hostent",
   "self_type" : "_ZTI7hostent",
   "size" : 20,
   "source_file" : "/bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_addr",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7in_addr",
   "name" : "in_addr",
   "referenced_type" : "_ZTI7in_addr",
   "self_type" : "_ZTI7in_addr",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/in_addr.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ll_time",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ll_line",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "ll_host",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI7lastlog",
   "name" : "lastlog",
   "referenced_type" : "_ZTI7lastlog",
   "self_type" : "_ZTI7lastlog",
   "size" : 28,
   "source_file" : "/bionic/libc/include/utmp.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "/bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_hdr",
     "referenced_type" : "_ZTI6msghdr"
    },
    {
     "field_name" : "msg_len",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7mmsghdr",
   "name" : "mmsghdr",
   "referenced_type" : "_ZTI7mmsghdr",
   "self_type" : "_ZTI7mmsghdr",
   "size" : 32,
   "source_file" : "/bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "namelen",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prop",
     "field_offset" : 32,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "left",
     "field_offset" : 64,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "right",
     "field_offset" : 96,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "children",
     "field_offset" : 128,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "name",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI7prop_bt",
   "name" : "prop_bt",
   "referenced_type" : "_ZTI7prop_bt",
   "self_type" : "_ZTI7prop_bt",
   "size" : 20,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "r_map",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8link_map"
    },
    {
     "field_name" : "r_brk",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_state",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7r_debug7$RT_ADDE"
    },
    {
     "field_name" : "r_ldbase",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7r_debug",
   "name" : "r_debug",
   "referenced_type" : "_ZTI7r_debug",
   "self_type" : "_ZTI7r_debug",
   "size" : 20,
   "source_file" : "/bionic/libc/include/link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "re_magic",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "re_nsub",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "re_endp",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "re_g",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP7re_guts"
    }
   ],
   "linker_set_key" : "_ZTI7regex_t",
   "name" : "regex_t",
   "referenced_type" : "_ZTI7regex_t",
   "self_type" : "_ZTI7regex_t",
   "size" : 16,
   "source_file" : "/bionic/libc/include/regex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "s_aliases",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "s_port",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "s_proto",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI7servent",
   "name" : "servent",
   "referenced_type" : "_ZTI7servent",
   "self_type" : "_ZTI7servent",
   "size" : 16,
   "source_file" : "/bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTI8Contexts",
   "name" : "Contexts",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8Contexts",
   "self_type" : "_ZTI8Contexts",
   "size" : 4,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/contexts.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8Contexts"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8ContextsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8ContextsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts10InitializeEbPKcPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts18GetPropAreaForNameEPKc"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts17GetSerialPropAreaEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts11ResetAccessEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_msg",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "_eom",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "_flags",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "_counts",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA4_t"
    },
    {
     "field_name" : "_sections",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA4_PKh"
    },
    {
     "field_name" : "_sect",
     "field_offset" : 288,
     "referenced_type" : "_ZTI9__ns_sect"
    },
    {
     "field_name" : "_rrnum",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_msg_ptr",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI8__ns_msg",
   "name" : "__ns_msg",
   "referenced_type" : "_ZTI8__ns_msg",
   "self_type" : "_ZTI8__ns_msg",
   "size" : 48,
   "source_file" : "/bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nname",
     "referenced_type" : "_ZTIA256_h"
    },
    {
     "field_name" : "nnamel",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rr_class",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ttl",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rdlength",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rdata",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI8__ns_rr2",
   "name" : "__ns_rr2",
   "referenced_type" : "_ZTI8__ns_rr2",
   "self_type" : "_ZTI8__ns_rr2",
   "size" : 280,
   "source_file" : "/bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ai_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ai_family",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ai_socktype",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ai_protocol",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ai_addrlen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ai_canonname",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "ai_addr",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP8sockaddr"
    },
    {
     "field_name" : "ai_next",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP8addrinfo"
    }
   ],
   "linker_set_key" : "_ZTI8addrinfo",
   "name" : "addrinfo",
   "referenced_type" : "_ZTI8addrinfo",
   "self_type" : "_ZTI8addrinfo",
   "size" : 32,
   "source_file" : "/bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI8dirent64",
   "name" : "dirent64",
   "referenced_type" : "_ZTI8dirent64",
   "self_type" : "_ZTI8dirent64",
   "size" : 280,
   "source_file" : "/bionic/libc/include/dirent.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_addr",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "l_ld",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP7dynamic"
    },
    {
     "field_name" : "l_next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP8link_map"
    },
    {
     "field_name" : "l_prev",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP8link_map"
    }
   ],
   "linker_set_key" : "_ZTI8link_map",
   "name" : "link_map",
   "referenced_type" : "_ZTI8link_map",
   "self_type" : "_ZTI8link_map",
   "size" : 20,
   "source_file" : "/bionic/libc/include/link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 40,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "p_aliases",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "p_proto",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8protoent",
   "name" : "protoent",
   "referenced_type" : "_ZTI8protoent",
   "self_type" : "_ZTI8protoent",
   "size" : 12,
   "source_file" : "/bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "sa_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sa_data",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA14_c"
    }
   ],
   "linker_set_key" : "_ZTI8sockaddr",
   "name" : "sockaddr",
   "referenced_type" : "_ZTI8sockaddr",
   "self_type" : "_ZTI8sockaddr",
   "size" : 16,
   "source_file" : "/bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "referenced_type" : "_ZTI8timespec",
   "self_type" : "_ZTI8timespec",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/timespec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10sigcontext"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIA128_m"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "referenced_type" : "_ZTI8ucontext",
   "self_type" : "_ZTI8ucontext",
   "size" : 744,
   "source_file" : "/bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA32_y"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "_ZTI8user_vfp",
   "self_type" : "_ZTI8user_vfp",
   "size" : 264,
   "source_file" : "/bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI9Elf32_Lib",
   "name" : "Elf32_Lib",
   "referenced_type" : "_ZTI9Elf32_Lib",
   "self_type" : "_ZTI9Elf32_Lib",
   "size" : 20,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI9Elf64_Lib",
   "name" : "Elf64_Lib",
   "referenced_type" : "_ZTI9Elf64_Lib",
   "self_type" : "_ZTI9Elf64_Lib",
   "size" : 20,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "_ZTI9cpu_set_t",
   "self_type" : "_ZTI9cpu_set_t",
   "size" : 4,
   "source_file" : "/bionic/libc/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI9imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "_ZTI9imaxdiv_t",
   "self_type" : "_ZTI9imaxdiv_t",
   "size" : 16,
   "source_file" : "/bionic/libc/include/inttypes.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "_ZTI9mbstate_t",
   "self_type" : "_ZTI9mbstate_t",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg",
     "referenced_type" : "_ZTI8__ns_msg"
    },
    {
     "field_name" : "dnptrs",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA25_PKh"
    },
    {
     "field_name" : "lastdnptr",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIPPKh"
    }
   ],
   "linker_set_key" : "_ZTI9ns_newmsg",
   "name" : "ns_newmsg",
   "referenced_type" : "_ZTI9ns_newmsg",
   "self_type" : "_ZTI9ns_newmsg",
   "size" : 152,
   "source_file" : "/bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "bytes_used_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "serial_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "access" : "private",
     "field_name" : "magic_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "version_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "reserved_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA28_j"
    },
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI9prop_area",
   "name" : "prop_area",
   "record_kind" : "class",
   "referenced_type" : "_ZTI9prop_area",
   "self_type" : "_ZTI9prop_area",
   "size" : 128,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "serial",
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN9prop_infoUt_E"
    },
    {
     "field_name" : "name",
     "field_offset" : 768,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI9prop_info",
   "name" : "prop_info",
   "referenced_type" : "_ZTI9prop_info",
   "self_type" : "_ZTI9prop_info",
   "size" : 96,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/prop_info.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "referenced_type" : "_ZTI9sigaction",
   "self_type" : "_ZTI9sigaction",
   "size" : 16,
   "source_file" : "/bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "_ZTIA18_m"
    }
   ],
   "linker_set_key" : "_ZTI9user_regs",
   "name" : "user_regs",
   "referenced_type" : "_ZTI9user_regs",
   "self_type" : "_ZTI9user_regs",
   "size" : 72,
   "source_file" : "/bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:100:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11sigaction64Ut_E",
   "self_type" : "_ZTIN11sigaction64Ut_E",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11user_fpregs6fp_regE",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "_ZTIN11user_fpregs6fp_regE",
   "self_type" : "_ZTIN11user_fpregs6fp_regE",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12Elf32_auxv_tUt_E",
   "name" : "Elf32_auxv_t::(anonymous union at bionic/libc/include/elf.h:47:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN12Elf32_auxv_tUt_E",
   "self_type" : "_ZTIN12Elf32_auxv_tUt_E",
   "size" : 4,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "_ZTIy"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12Elf64_auxv_tUt_E",
   "name" : "Elf64_auxv_t::(anonymous union at bionic/libc/include/elf.h:54:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN12Elf64_auxv_tUt_E",
   "self_type" : "_ZTIN12Elf64_auxv_tUt_E",
   "size" : 8,
   "source_file" : "/bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name_offset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "namelen",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "context_index",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type_index",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties13PropertyEntryE",
   "name" : "android::properties::PropertyEntry",
   "referenced_type" : "_ZTIN7android10properties13PropertyEntryE",
   "self_type" : "_ZTIN7android10properties13PropertyEntryE",
   "size" : 16,
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_base_",
     "referenced_type" : "_ZTIA0_Kc"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties14SerializedDataE",
   "name" : "android::properties::SerializedData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties14SerializedDataE",
   "self_type" : "_ZTIN7android10properties14SerializedDataE",
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10properties14SerializedDataE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "name" : "android::properties::PropertyInfoArea",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "self_type" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "property_entry",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_child_nodes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "child_nodes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_prefixes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prefix_entries",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_exact_matches",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exact_match_entries",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties16TrieNodeInternalE",
   "name" : "android::properties::TrieNodeInternal",
   "referenced_type" : "_ZTIN7android10properties16TrieNodeInternalE",
   "self_type" : "_ZTIN7android10properties16TrieNodeInternalE",
   "size" : 28,
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mmap_base_",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mmap_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "name" : "android::properties::PropertyInfoAreaFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "size" : 8,
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "current_version",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minimum_supported_version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "contexts_offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "types_offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "root_offset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "name" : "android::properties::PropertyInfoAreaHeader",
   "referenced_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "self_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "size" : 24,
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "serialized_data_",
     "referenced_type" : "_ZTIPKN7android10properties14SerializedDataE"
    },
    {
     "access" : "private",
     "field_name" : "trie_node_base_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKN7android10properties16TrieNodeInternalE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties8TrieNodeE",
   "name" : "android::properties::TrieNode",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties8TrieNodeE",
   "self_type" : "_ZTIN7android10properties8TrieNodeE",
   "size" : 8,
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN8ucontextUt_Ut_E"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN8ucontextUt_E",
   "self_type" : "_ZTIN8ucontextUt_E",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_Ut_E",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:91:5)",
   "referenced_type" : "_ZTIN8ucontextUt_Ut_E",
   "self_type" : "_ZTIN8ucontextUt_Ut_E",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIA92_c"
    },
    {
     "field_name" : "long_property",
     "referenced_type" : "_ZTIN9prop_infoUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9prop_infoUt_E",
   "name" : "prop_info::(anonymous union at bionic/libc/system_properties/include/system_properties/prop_info.h:61:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9prop_infoUt_E",
   "self_type" : "_ZTIN9prop_infoUt_E",
   "size" : 92,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/prop_info.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "error_message",
     "referenced_type" : "_ZTIA56_c"
    },
    {
     "field_name" : "offset",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9prop_infoUt_Ut_E",
   "name" : "prop_info::(anonymous union at bionic/libc/system_properties/include/system_properties/prop_info.h:61:3)::(anonymous struct at bionic/libc/system_properties/include/system_properties/prop_info.h:63:5)",
   "referenced_type" : "_ZTIN9prop_infoUt_Ut_E",
   "self_type" : "_ZTIN9prop_infoUt_Ut_E",
   "size" : 60,
   "source_file" : "/bionic/libc/system_properties/include/system_properties/prop_info.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:89:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9sigactionUt_E",
   "self_type" : "_ZTIN9sigactionUt_E",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/signal_types.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android10properties20PropertyInfoAreaFileE",
   "name" : "android::properties::PropertyInfoAreaFile &&",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTION7android10properties20PropertyInfoAreaFileE",
   "size" : 4,
   "source_file" : "/system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  }
 ]
}
