{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-8",
   "self_type" : "type-131",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-371",
   "self_type" : "type-629",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-15",
   "self_type" : "type-275",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [256]",
   "name" : "unsigned char [256]",
   "referenced_type" : "type-59",
   "self_type" : "type-156",
   "size" : 256,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [32]",
   "name" : "unsigned char [32]",
   "referenced_type" : "type-59",
   "self_type" : "type-290",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-59",
   "self_type" : "type-128",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [6]",

   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-738",
   "self_type" : "type-737",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-59",
   "self_type" : "type-481",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-106",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-9",
   "self_type" : "type-185",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-366",
   "self_type" : "type-553",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-130",
   "self_type" : "type-388",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-18",
   "self_type" : "type-510",
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-10",
   "self_type" : "type-225",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-15",
   "self_type" : "type-201",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 48,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-191", "type-152" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-306"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-305",
   "self_type" : "type-305",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-307" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-302"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-303" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-182"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-181",
   "self_type" : "type-181",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-639"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-305"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "type-308"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-644"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-643",
   "self_type" : "type-643",
   "size" : 56,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-648"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-647",
   "self_type" : "type-647",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-648"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTag",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::ScopedTrace",
   "name" : "android::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Trace.h",
   "unique_id" : "_ZTSN7android11ScopedTraceE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-198"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "type-197",
   "self_type" : "type-197",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-199" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-184"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-192"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 64,
     "referenced_type" : "type-222"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 128,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 192,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 512,
     "referenced_type" : "type-223"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 896,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 928,
     "referenced_type" : "type-225"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 936,
     "referenced_type" : "type-225"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 960,
     "referenced_type" : "type-219"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 1024,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 152,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 136,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcim"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-184"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-186" ],
   "unique_id" : "_ZTSN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-301"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-19"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 192,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BHwBinder",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 48,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware9BHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 64,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 192,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwRefBase",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 48,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware11BpHwRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-83"
    },
    {
     "referenced_type" : "type-30"
    },
    {
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::wifi::offload::V1_0::IOffload>",
   "name" : "android::hardware::BpInterface<android::hardware::wifi::offload::V1_0::IOffload>",
   "record_kind" : "class",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 64,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEEE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware4wifi7offload4V1_08IOffload8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload14configureScansERKNS3_9ScanParamERKNS3_10ScanFilterENSt3__18functionIFvRKNS3_13OffloadStatusEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload12getScanStatsENSt3__18functionIFvRKNS3_13OffloadStatusERKNS3_9ScanStatsEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload20subscribeScanResultsEjNSt3__18functionIFvRKNS3_13OffloadStatusEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload22unsubscribeScanResultsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload16setEventCallbackERKNS_2spINS3_16IOffloadCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEE10onAsBinderEv"
    },
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-28"
    },
    {
     "referenced_type" : "type-30"
    },
    {
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::wifi::offload::V1_0::IOffloadCallback>",
   "name" : "android::hardware::BpInterface<android::hardware::wifi::offload::V1_0::IOffloadCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 64,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-28" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware4wifi7offload4V1_016IOffloadCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback12onScanResultERKNS0_8hidl_vecINS3_10ScanResultEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback7onErrorERKNS3_13OffloadStatusE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    },
    {
     "referenced_type" : "type-30"
    },
    {
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "name" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-542",
   "self_type" : "type-542",
   "size" : 64,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-567"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 320,
     "referenced_type" : "type-568"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "record_kind" : "class",
   "referenced_type" : "type-566",
   "self_type" : "type-566",
   "size" : 64,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-254", "type-569" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEENS0_7details9SchedPrioEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-576"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 320,
     "referenced_type" : "type-577"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 64,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-254", "type-10" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEEbEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-581"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 320,
     "referenced_type" : "type-582"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "name" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 64,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-139", "type-12" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-597"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 320,
     "referenced_type" : "type-598"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-596",
   "self_type" : "type-596",
   "size" : 64,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-599", "type-600" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS_4hidl4base4V1_05IBaseEEEPvEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-587"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 320,
     "referenced_type" : "type-588"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 64,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-589", "type-590" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS0_7IBinderEEEPvEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-408"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 64,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder::DeathRecipient",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::hardware::IInterface",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "unique_id" : "_ZTSN7android8hardware10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "type-423"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "type-490"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "name" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "type-517",
   "self_type" : "type-517",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android8hardware12MQDescriptorIcLNS0_8MQFlavorE1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 64,
     "referenced_type" : "type-547"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 320,
     "referenced_type" : "type-58"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 384,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 448,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 512,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 576,
     "referenced_type" : "type-548"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 640,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 704,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 768,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 832,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 896,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 904,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 912,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 960,
     "referenced_type" : "type-549"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 1024,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 136,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 128,
     "referenced_type" : "type-366"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel::BufferInfo",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6Parcel10BufferInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 128,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 192,
     "referenced_type" : "type-178"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 512,
     "referenced_type" : "type-179"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 896,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 960,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 1024,
     "referenced_type" : "type-180"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 1088,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 1408,
     "referenced_type" : "type-183"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 1728,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 1792,
     "referenced_type" : "type-187"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 1856,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 1920,
     "referenced_type" : "type-196"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 2240,
     "referenced_type" : "type-200"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 2304,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 2312,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 2336,
     "referenced_type" : "type-201"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 2368,
     "referenced_type" : "type-185"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 2432,
     "referenced_type" : "type-202"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 328,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessStateE",
   "vtable_components" :
   [
    {
     "component_value" : 312,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -312,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -312,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "refs",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState::handle_entry",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 16,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessState12handle_entryE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-271"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::wifi::offload::V1_0::IOffload> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::wifi::offload::V1_0::IOffload> >",
   "record_kind" : "class",
   "referenced_type" : "type-280",
   "self_type" : "type-280",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_4wifi7offload4V1_08IOffloadEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-271"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-120"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::wifi::offload::V1_0::IOffloadCallback> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::wifi::offload::V1_0::IOffloadCallback> >",
   "record_kind" : "class",
   "referenced_type" : "type-745",
   "self_type" : "type-745",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-120" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_4wifi7offload4V1_016IOffloadCallbackEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-271"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 264,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::Return<bool>",
   "name" : "android::hardware::Return<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-270",
   "self_type" : "type-270",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIbEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-271"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-297",
   "self_type" : "type-297",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-261"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 64,
     "referenced_type" : "type-87"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 320,
     "referenced_type" : "type-88"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 512,
     "referenced_type" : "type-89"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-86",
   "self_type" : "type-86",
   "size" : 88,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_policy",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "prio",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android::hardware::details::SchedPrio",
   "name" : "android::hardware::details::SchedPrio",
   "referenced_type" : "type-569",
   "self_type" : "type-569",
   "size" : 8,
   "source_file" : "/system/libhidl/transport/include/hidl/Static.h",
   "unique_id" : "_ZTSN7android8hardware7details9SchedPrioE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mQueue",
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "android::hardware::details::TaskRunner",
   "name" : "android::hardware::details::TaskRunner",
   "record_kind" : "class",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/TaskRunner.h",
   "unique_id" : "_ZTSN7android8hardware7details10TaskRunnerE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-315",
   "self_type" : "type-315",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-326",
   "self_type" : "type-326",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-480"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<unsigned char, 256>",
   "name" : "android::hardware::details::const_accessor<unsigned char, 256>",
   "referenced_type" : "type-486",
   "self_type" : "type-486",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIhLm256EJEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-480"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<unsigned char, 6>",
   "name" : "android::hardware::details::const_accessor<unsigned char, 6>",
   "referenced_type" : "type-479",
   "self_type" : "type-479",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIhLm6EJEEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-426"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-164"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<LogRecord>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<LogRecord>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_4wifi7offload4V1_09LogRecordEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-465"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<NetworkInfo>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<NetworkInfo>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-464",
   "self_type" : "type-464",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_4wifi7offload4V1_011NetworkInfoEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-160"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<ScanRecord>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<ScanRecord>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-159",
   "self_type" : "type-159",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_4wifi7offload4V1_010ScanRecordEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-728"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<ScanResult>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<ScanResult>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-727",
   "self_type" : "type-727",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_4wifi7offload4V1_010ScanResultEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-425"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-424",
   "self_type" : "type-424",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-427" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<unsigned char, 32> >",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<unsigned char, 32> >",
   "referenced_type" : "type-286",
   "self_type" : "type-286",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-289" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLm32EJEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-215"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "referenced_type" : "type-214",
   "self_type" : "type-214",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-449"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_vec<unsigned char> >",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_vec<unsigned char> >",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_8hidl_vecIhEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-163"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::wifi::offload::V1_0::LogRecord>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::wifi::offload::V1_0::LogRecord>",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-117" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_4wifi7offload4V1_09LogRecordEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-464"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::wifi::offload::V1_0::NetworkInfo>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::wifi::offload::V1_0::NetworkInfo>",
   "referenced_type" : "type-463",
   "self_type" : "type-463",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-109" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_4wifi7offload4V1_011NetworkInfoEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-159"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::wifi::offload::V1_0::ScanRecord>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::wifi::offload::V1_0::ScanRecord>",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-114" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_4wifi7offload4V1_010ScanRecordEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-727"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::wifi::offload::V1_0::ScanResult>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::wifi::offload::V1_0::ScanResult>",
   "referenced_type" : "type-726",
   "self_type" : "type-726",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-669" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_4wifi7offload4V1_010ScanResultEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-417"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<char>",
   "name" : "android::hardware::details::hidl_pointer<char>",
   "referenced_type" : "type-416",
   "self_type" : "type-416",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIcEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-418"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-417",
   "self_type" : "type-417",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIcEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-348",
   "self_type" : "type-348",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-351" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-350"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-349",
   "self_type" : "type-349",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-288"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_array<unsigned char, 32> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_array<unsigned char, 32> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-287",
   "self_type" : "type-287",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLm32EJEEEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-216"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_string>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_string>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-450"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_vec<unsigned char> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_vec<unsigned char> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-449",
   "self_type" : "type-449",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_8hidl_vecIhEEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-440"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<int>",
   "name" : "android::hardware::details::hidl_pointer<int>",
   "referenced_type" : "type-439",
   "self_type" : "type-439",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIiEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-441"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-440",
   "self_type" : "type-440",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIiEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-491"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "type-490",
   "self_type" : "type-490",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-274" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-308"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-491",
   "self_type" : "type-491",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-57"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned char>",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIhEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIhEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-457"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-458"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-457",
   "self_type" : "type-457",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIjEUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-304",
   "self_type" : "type-304",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-260"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-271",
   "self_type" : "type-271",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned char, 256>",
   "name" : "android::hardware::details::std_array<unsigned char, 256>",
   "referenced_type" : "type-477",
   "self_type" : "type-477",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIhLm256EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned char, 32>",
   "name" : "android::hardware::details::std_array<unsigned char, 32>",
   "referenced_type" : "type-478",
   "self_type" : "type-478",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIhLm32EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned char, 6>",
   "name" : "android::hardware::details::std_array<unsigned char, 6>",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIhLm6EJEEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-156"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned char, 256>",
   "name" : "android::hardware::hidl_array<unsigned char, 256>",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 256,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIhLm256EJEEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-290"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned char, 32>",
   "name" : "android::hardware::hidl_array<unsigned char, 32>",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIhLm32EJEEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-493"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned char, 6>",
   "name" : "android::hardware::hidl_array<unsigned char, 6>",
   "referenced_type" : "type-492",
   "self_type" : "type-492",
   "size" : 6,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIhLm6EJEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-142"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRecipient",
     "field_offset" : 64,
     "referenced_type" : "type-253"
    },
    {
     "access" : "private",
     "field_name" : "mCookie",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mBase",
     "field_offset" : 256,
     "referenced_type" : "type-254"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_binder_death_recipient",
   "name" : "android::hardware::hidl_binder_death_recipient",
   "referenced_type" : "type-252",
   "self_type" : "type-252",
   "size" : 64,
   "source_file" : "/system/libhidl/transport/include/hidl/HidlBinderSupport.h",
   "unique_id" : "_ZTSN7android8hardware27hidl_binder_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware27hidl_binder_death_recipientE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipient10binderDiedERKNS_2wpINS0_7IBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware27hidl_binder_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware27hidl_binder_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware27hidl_binder_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_death_recipient",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware20hidl_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEmRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-348"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_handle",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "type-404",
   "self_type" : "type-404",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_handleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-404"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_memory",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "type-408",
   "self_type" : "type-408",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_memoryE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_string",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_stringE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-424"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-423",
   "self_type" : "type-423",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-427" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-286"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_array<unsigned char, 32> >",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_array<unsigned char, 32> >",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-289" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-214"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_string>",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_string>",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_11hidl_stringEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-448"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_vec<unsigned char> >",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_vec<unsigned char> >",
   "referenced_type" : "type-447",
   "self_type" : "type-447",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS1_IhEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-162"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::wifi::offload::V1_0::LogRecord>",
   "name" : "android::hardware::hidl_vec<android::hardware::wifi::offload::V1_0::LogRecord>",
   "referenced_type" : "type-161",
   "self_type" : "type-161",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-117" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_4wifi7offload4V1_09LogRecordEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-463"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::wifi::offload::V1_0::NetworkInfo>",
   "name" : "android::hardware::hidl_vec<android::hardware::wifi::offload::V1_0::NetworkInfo>",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-109" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_4wifi7offload4V1_011NetworkInfoEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-158"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::wifi::offload::V1_0::ScanRecord>",
   "name" : "android::hardware::hidl_vec<android::hardware::wifi::offload::V1_0::ScanRecord>",
   "referenced_type" : "type-157",
   "self_type" : "type-157",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-114" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_4wifi7offload4V1_010ScanRecordEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-726"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::wifi::offload::V1_0::ScanResult>",
   "name" : "android::hardware::hidl_vec<android::hardware::wifi::offload::V1_0::ScanResult>",
   "referenced_type" : "type-763",
   "self_type" : "type-763",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-669" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_4wifi7offload4V1_010ScanResultEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-416"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<char>",
   "name" : "android::hardware::hidl_vec<char>",
   "referenced_type" : "type-475",
   "self_type" : "type-475",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIcEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-439"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<int>",
   "name" : "android::hardware::hidl_vec<int>",
   "referenced_type" : "type-438",
   "self_type" : "type-438",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIiEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-56"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<unsigned char>",
   "name" : "android::hardware::hidl_vec<unsigned char>",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIhEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-456"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<unsigned int>",
   "name" : "android::hardware::hidl_vec<unsigned int>",
   "referenced_type" : "type-455",
   "self_type" : "type-455",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIjEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "type-130"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "type-130"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_version",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "type-505",
   "self_type" : "type-505",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware12hidl_versionE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-560"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 1024,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::BnHwOffload",
   "name" : "android::hardware::wifi::offload::V1_0::BnHwOffload",
   "referenced_type" : "type-771",
   "self_type" : "type-771",
   "size" : 152,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/BnHwOffload.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_011BnHwOffloadE",
   "vtable_components" :
   [
    {
     "component_value" : 136,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_011BnHwOffloadE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BnHwOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BnHwOffloadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BnHwOffload10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_011BnHwOffloadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn32_N7android8hardware4wifi7offload4V1_011BnHwOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn32_N7android8hardware4wifi7offload4V1_011BnHwOffloadD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_011BnHwOffloadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_011BnHwOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_011BnHwOffloadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-560"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 1024,
     "referenced_type" : "type-120"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::BnHwOffloadCallback",
   "name" : "android::hardware::wifi::offload::V1_0::BnHwOffloadCallback",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 152,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/BnHwOffloadCallback.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 136,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BnHwOffloadCallback10onTransactEjRKNS0_6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn32_N7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn32_N7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_019BnHwOffloadCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    },
    {
     "referenced_type" : "type-86"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 1088,
     "referenced_type" : "type-96"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 1408,
     "referenced_type" : "type-97"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::BpHwOffload",
   "name" : "android::hardware::wifi::offload::V1_0::BpHwOffload",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 216,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/BpHwOffload.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_011BpHwOffloadE",
   "vtable_components" :
   [
    {
     "component_value" : 200,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_011BpHwOffloadE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware4wifi7offload4V1_011BpHwOffload8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffloadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload14configureScansERKNS3_9ScanParamERKNS3_10ScanFilterENSt3__18functionIFvRKNS3_13OffloadStatusEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload12getScanStatsENSt3__18functionIFvRKNS3_13OffloadStatusERKNS3_9ScanStatsEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload20subscribeScanResultsEjNSt3__18functionIFvRKNS3_13OffloadStatusEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload22unsubscribeScanResultsEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_011BpHwOffload16setEventCallbackERKNS_2spINS3_16IOffloadCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEE10onAsBinderEv"
    },
    {
     "component_value" : 192,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_011BpHwOffloadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware4wifi7offload4V1_011BpHwOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware4wifi7offload4V1_011BpHwOffloadD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_08IOffloadEE10onAsBinderEv"
    },
    {
     "component_value" : 184,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_011BpHwOffloadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware4wifi7offload4V1_011BpHwOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware4wifi7offload4V1_011BpHwOffloadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_011BpHwOffloadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn48_N7android8hardware4wifi7offload4V1_011BpHwOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn48_N7android8hardware4wifi7offload4V1_011BpHwOffloadD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -184,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -184,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -184,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -200,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -200,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_011BpHwOffloadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_011BpHwOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_011BpHwOffloadD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-27"
    },
    {
     "referenced_type" : "type-86"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 1088,
     "referenced_type" : "type-235"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 1408,
     "referenced_type" : "type-236"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::BpHwOffloadCallback",
   "name" : "android::hardware::wifi::offload::V1_0::BpHwOffloadCallback",
   "referenced_type" : "type-234",
   "self_type" : "type-234",
   "size" : 216,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/BpHwOffloadCallback.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 200,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware4wifi7offload4V1_019BpHwOffloadCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback12onScanResultERKNS0_8hidl_vecINS3_10ScanResultEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_019BpHwOffloadCallback7onErrorERKNS3_13OffloadStatusE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 192,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_4wifi7offload4V1_016IOffloadCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 184,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn48_N7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn48_N7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -184,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -184,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -184,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -200,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -200,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_019BpHwOffloadCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-83"
    },
    {
     "referenced_type" : "type-86"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 768,
     "referenced_type" : "type-80"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 832,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::BsOffload",
   "name" : "android::hardware::wifi::offload::V1_0::BsOffload",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 136,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/BsOffload.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_09BsOffloadE",
   "vtable_components" :
   [
    {
     "component_value" : 120,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_09BsOffloadE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware4wifi7offload4V1_08IOffload8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffloadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload14configureScansERKNS3_9ScanParamERKNS3_10ScanFilterENSt3__18functionIFvRKNS3_13OffloadStatusEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload12getScanStatsENSt3__18functionIFvRKNS3_13OffloadStatusERKNS3_9ScanStatsEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload20subscribeScanResultsEjNSt3__18functionIFvRKNS3_13OffloadStatusEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload22unsubscribeScanResultsEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_09BsOffload16setEventCallbackERKNS_2spINS3_16IOffloadCallbackEEE"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_09BsOffloadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware4wifi7offload4V1_09BsOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware4wifi7offload4V1_09BsOffloadD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -120,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -120,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_09BsOffloadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_09BsOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_09BsOffloadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-28"
    },
    {
     "referenced_type" : "type-86"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 768,
     "referenced_type" : "type-119"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 832,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::BsOffloadCallback",
   "name" : "android::hardware::wifi::offload::V1_0::BsOffloadCallback",
   "referenced_type" : "type-739",
   "self_type" : "type-739",
   "size" : 136,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/BsOffloadCallback.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_017BsOffloadCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 120,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_017BsOffloadCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware4wifi7offload4V1_016IOffloadCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback12onScanResultERKNS0_8hidl_vecINS3_10ScanResultEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_017BsOffloadCallback7onErrorERKNS3_13OffloadStatusE"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_017BsOffloadCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware4wifi7offload4V1_017BsOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware4wifi7offload4V1_017BsOffloadCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -120,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -120,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_017BsOffloadCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_017BsOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_017BsOffloadCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::IOffload",
   "name" : "android::hardware::wifi::offload::V1_0::IOffload",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/IOffload.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_08IOffloadE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_08IOffloadE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware4wifi7offload4V1_08IOffload8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffloadD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload14configureScansERKNS3_9ScanParamERKNS3_10ScanFilterENSt3__18functionIFvRKNS3_13OffloadStatusEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload12getScanStatsENSt3__18functionIFvRKNS3_13OffloadStatusERKNS3_9ScanStatsEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload20subscribeScanResultsEjNSt3__18functionIFvRKNS3_13OffloadStatusEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload22unsubscribeScanResultsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_08IOffload16setEventCallbackERKNS_2spINS3_16IOffloadCallbackEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_08IOffloadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_08IOffloadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_08IOffloadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::IOffloadCallback",
   "name" : "android::hardware::wifi::offload::V1_0::IOffloadCallback",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/IOffloadCallback.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_016IOffloadCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_016IOffloadCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware4wifi7offload4V1_016IOffloadCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback12onScanResultERKNS0_8hidl_vecINS3_10ScanResultEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware4wifi7offload4V1_016IOffloadCallback7onErrorERKNS3_13OffloadStatusE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware4wifi7offload4V1_016IOffloadCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_016IOffloadCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware4wifi7offload4V1_016IOffloadCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "recordName",
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "logTimeMs",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::LogRecord",
   "name" : "android::hardware::wifi::offload::V1_0::LogRecord",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_09LogRecordE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ssid",
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::NetworkInfo",
   "name" : "android::hardware::wifi::offload::V1_0::NetworkInfo",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_011NetworkInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "code",
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "description",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::OffloadStatus",
   "name" : "android::hardware::wifi::offload::V1_0::OffloadStatus",
   "referenced_type" : "type-91",
   "self_type" : "type-91",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_013OffloadStatusE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "preferredNetworkInfoList",
     "referenced_type" : "type-462"
    },
    {
     "field_name" : "rssiThreshold",
     "field_offset" : 128,
     "referenced_type" : "type-383"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::ScanFilter",
   "name" : "android::hardware::wifi::offload::V1_0::ScanFilter",
   "referenced_type" : "type-671",
   "self_type" : "type-671",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_010ScanFilterE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ssidList",
     "referenced_type" : "type-447"
    },
    {
     "field_name" : "frequencyList",
     "field_offset" : 128,
     "referenced_type" : "type-455"
    },
    {
     "field_name" : "disconnectedModeScanIntervalMs",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::ScanParam",
   "name" : "android::hardware::wifi::offload::V1_0::ScanParam",
   "referenced_type" : "type-670",
   "self_type" : "type-670",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_09ScanParamE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "durationMs",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "numChannelsScanned",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numEntriesAggregated",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::ScanRecord",
   "name" : "android::hardware::wifi::offload::V1_0::ScanRecord",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_010ScanRecordE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "networkInfo",
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "bssid",
     "field_offset" : 192,
     "referenced_type" : "type-492"
    },
    {
     "field_name" : "capability",
     "field_offset" : 240,
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "frequency",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rssi",
     "field_offset" : 288,
     "referenced_type" : "type-383"
    },
    {
     "field_name" : "tsf",
     "field_offset" : 320,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::ScanResult",
   "name" : "android::hardware::wifi::offload::V1_0::ScanResult",
   "referenced_type" : "type-669",
   "self_type" : "type-669",
   "size" : 48,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_010ScanResultE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "numScansRequestedByWifi",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numScansServicedByWifi",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numScansServicedbyCache",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lastUpdated",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "lastRead",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "subscriptionDurationMs",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "histogramChannelsScanned",
     "field_offset" : 320,
     "referenced_type" : "type-155"
    },
    {
     "field_name" : "scanRecord",
     "field_offset" : 2368,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "logRecord",
     "field_offset" : 2496,
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "android::hardware::wifi::offload::V1_0::ScanStats",
   "name" : "android::hardware::wifi::offload::V1_0::ScanStats",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 328,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/wifi/offload/1.0/android.hardware.wifi.offload@1.0_genc++_headers/gen/android/hardware/wifi/offload/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware4wifi7offload4V1_09ScanStatsE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-14"
    },
    {
     "referenced_type" : "type-86"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 960,
     "referenced_type" : "type-63"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::BnHwBase",
   "name" : "android::hidl::base::V1_0::BnHwBase",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 144,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/BnHwBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_08BnHwBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 128,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBase10onTransactEjRKNS_8hardware6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn32_N7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn32_N7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -128,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -128,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-542"
    },
    {
     "referenced_type" : "type-86"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 1088,
     "referenced_type" : "type-693"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 1408,
     "referenced_type" : "type-694"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::BpHwBase",
   "name" : "android::hidl::base::V1_0::BpHwBase",
   "referenced_type" : "type-692",
   "self_type" : "type-692",
   "size" : 216,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/BpHwBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_08BpHwBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 200,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_08BpHwBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 192,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 184,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn48_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn48_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -184,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -184,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -184,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -200,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -200,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "type-522"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::DebugInfo",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "type-521",
   "self_type" : "type-521",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_09DebugInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::IBase",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_05IBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceManager",
   "name" : "android::hidl::manager::V1_0::IServiceManager",
   "referenced_type" : "type-209",
   "self_type" : "type-209",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_015IServiceManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_015IServiceManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager3getERKNS_8hardware11hidl_stringES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager3addERKNS_8hardware11hidl_stringERKNS_2spINS0_4base4V1_05IBaseEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getTransportERKNS_8hardware11hidl_stringES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager4listENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager15listByInterfaceERKNS_8hardware11hidl_stringENSt3__18functionIFvRKNS4_8hidl_vecIS5_EEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager24registerForNotificationsERKNS_8hardware11hidl_stringES7_RKNS_2spINS2_20IServiceNotificationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager9debugDumpENSt3__18functionIFvRKNS_8hardware8hidl_vecINS3_17InstanceDebugInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager25registerPassthroughClientERKNS_8hardware11hidl_stringES7_"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_015IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_015IServiceManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interfaceName",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "instanceName",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pid",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "clientPids",
     "field_offset" : 320,
     "referenced_type" : "type-438"
    },
    {
     "field_name" : "arch",
     "field_offset" : 448,
     "referenced_type" : "type-522"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo",
   "name" : "android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo",
   "referenced_type" : "type-658",
   "self_type" : "type-658",
   "size" : 64,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_015IServiceManager17InstanceDebugInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceNotification",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "type-228",
   "self_type" : "type-228",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_020IServiceNotificationE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-220"
    }
   ],
   "linker_set_key" : "android::sp<android::Thread>",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "type-219",
   "self_type" : "type-219",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-221" ],
   "unique_id" : "_ZTSN7android2spINS_6ThreadEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::BHwBinder>",
   "name" : "android::sp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-259",
   "self_type" : "type-259",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "name" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IBinder>",
   "name" : "android::sp<android::hardware::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-152",
   "self_type" : "type-152",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware7IBinderEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-174"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IInterface>",
   "name" : "android::sp<android::hardware::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware10IInterfaceEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-176"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::ProcessState>",
   "name" : "android::sp<android::hardware::ProcessState>",
   "record_kind" : "class",
   "referenced_type" : "type-175",
   "self_type" : "type-175",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-177" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware12ProcessStateEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-251"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_binder_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_binder_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-250",
   "self_type" : "type-250",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-252" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware27hidl_binder_death_recipientEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-45",
   "self_type" : "type-45",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-47" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::wifi::offload::V1_0::IOffload>",
   "name" : "android::sp<android::hardware::wifi::offload::V1_0::IOffload>",
   "record_kind" : "class",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware4wifi7offload4V1_08IOffloadEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-121"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::wifi::offload::V1_0::IOffloadCallback>",
   "name" : "android::sp<android::hardware::wifi::offload::V1_0::IOffloadCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-28" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware4wifi7offload4V1_016IOffloadCallbackEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::base::V1_0::IBase>",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl4base4V1_05IBaseEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-208"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::manager::V1_0::IServiceManager>",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceManager>",
   "record_kind" : "class",
   "referenced_type" : "type-207",
   "self_type" : "type-207",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-209" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl7manager4V1_015IServiceManagerEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-227"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-228" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-317",
   "self_type" : "type-317",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-321",
   "self_type" : "type-321",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-379",
   "self_type" : "type-379",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-377" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-374",
   "self_type" : "type-374",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-341",
   "self_type" : "type-341",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-363",
   "self_type" : "type-363",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-360" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-353",
   "self_type" : "type-353",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-331",
   "self_type" : "type-331",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-329" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-325",
   "self_type" : "type-325",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-345",
   "self_type" : "type-345",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-368",
   "self_type" : "type-368",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-366" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-357",
   "self_type" : "type-357",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-335",
   "self_type" : "type-335",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-130" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-312",
   "self_type" : "type-312",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-314",
   "self_type" : "type-314",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-319",
   "self_type" : "type-319",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-376",
   "self_type" : "type-376",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-377" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-370",
   "self_type" : "type-370",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-339",
   "self_type" : "type-339",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-359",
   "self_type" : "type-359",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-360" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-347",
   "self_type" : "type-347",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-328",
   "self_type" : "type-328",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-329" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-343",
   "self_type" : "type-343",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-365",
   "self_type" : "type-365",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-366" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-355",
   "self_type" : "type-355",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-130" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-310",
   "self_type" : "type-310",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-316",
   "self_type" : "type-316",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-320",
   "self_type" : "type-320",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-378",
   "self_type" : "type-378",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-377" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-340",
   "self_type" : "type-340",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-362",
   "self_type" : "type-362",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-360" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-352",
   "self_type" : "type-352",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-330",
   "self_type" : "type-330",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-329" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-324",
   "self_type" : "type-324",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-344",
   "self_type" : "type-344",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-367",
   "self_type" : "type-367",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-366" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-356",
   "self_type" : "type-356",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-334",
   "self_type" : "type-334",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-130" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-311",
   "self_type" : "type-311",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String16>",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "type-539",
   "self_type" : "type-539",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "template_args" : [ "type-191" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String8>",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "type-534",
   "self_type" : "type-534",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "type-200" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-318",
   "self_type" : "type-318",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-322",
   "self_type" : "type-322",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-380",
   "self_type" : "type-380",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-377" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-375",
   "self_type" : "type-375",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-342",
   "self_type" : "type-342",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-364",
   "self_type" : "type-364",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-360" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-354",
   "self_type" : "type-354",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-332",
   "self_type" : "type-332",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-329" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-327",
   "self_type" : "type-327",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-346",
   "self_type" : "type-346",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-366" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-358",
   "self_type" : "type-358",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-336",
   "self_type" : "type-336",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-130" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-313",
   "self_type" : "type-313",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::BHwBinder>",
   "name" : "android::wp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-141"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "name" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-724",
   "self_type" : "type-724",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-46"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::hidl_death_recipient>",
   "name" : "android::wp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-47" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-64"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::wp<android::hidl::base::V1_0::IBase>",
   "name" : "android::wp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-29" ],
   "unique_id" : "_ZTSN7android2wpINS_4hidl4base4V1_05IBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-371"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-632",
   "self_type" : "type-632",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-622"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-629"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-628",
   "self_type" : "type-628",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-625"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-627"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-626",
   "self_type" : "type-626",
   "size" : 16,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "component",
     "field_offset" : 64,
     "referenced_type" : "type-623"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-624",
   "self_type" : "type-624",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-630"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-630"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-630"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-630"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-371"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-631",
   "self_type" : "type-631",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-371"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-630",
   "self_type" : "type-630",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "cb",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "cr",
     "field_offset" : 128,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 320,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "type-622"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 80,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-127"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-128"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-133"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-134"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-454",
   "self_type" : "type-454",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-134",
   "self_type" : "type-134",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-133",
   "self_type" : "type-133",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-275"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::wifi::offload::V1_0::IOffload> > &&",
   "name" : "android::hardware::Return<android::sp<android::hardware::wifi::offload::V1_0::IOffload> > &&",
   "referenced_type" : "type-280",
   "self_type" : "type-282",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::wifi::offload::V1_0::IOffloadCallback> > &&",
   "name" : "android::hardware::Return<android::sp<android::hardware::wifi::offload::V1_0::IOffloadCallback> > &&",
   "referenced_type" : "type-745",
   "self_type" : "type-747",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::hardware::Return<bool> &&",
   "name" : "android::hardware::Return<bool> &&",
   "referenced_type" : "type-270",
   "self_type" : "type-273",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::hardware::Return<void> &&",
   "name" : "android::hardware::Return<void> &&",
   "referenced_type" : "type-297",
   "self_type" : "type-299",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::hardware::Status &&",
   "name" : "android::hardware::Status &&",
   "referenced_type" : "type-260",
   "self_type" : "type-267",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::hardware::details::return_status &&",
   "name" : "android::hardware::details::return_status &&",
   "referenced_type" : "type-271",
   "self_type" : "type-293",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::hardware::hidl_handle &&",
   "name" : "android::hardware::hidl_handle &&",
   "referenced_type" : "type-404",
   "self_type" : "type-410",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::hardware::hidl_memory &&",
   "name" : "android::hardware::hidl_memory &&",
   "referenced_type" : "type-408",
   "self_type" : "type-414",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::sp<android::hardware::hidl_binder_death_recipient> &&",
   "name" : "android::sp<android::hardware::hidl_binder_death_recipient> &&",
   "referenced_type" : "type-250",
   "self_type" : "type-255",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::sp<android::hardware::wifi::offload::V1_0::IOffload> &&",
   "name" : "android::sp<android::hardware::wifi::offload::V1_0::IOffload> &&",
   "referenced_type" : "type-81",
   "self_type" : "type-245",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::sp<android::hardware::wifi::offload::V1_0::IOffloadCallback> &&",
   "name" : "android::sp<android::hardware::wifi::offload::V1_0::IOffloadCallback> &&",
   "referenced_type" : "type-120",
   "self_type" : "type-240",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
