{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "const char *[30]",
   "name" : "const char *[30]",
   "referenced_type" : "type-70",
   "self_type" : "type-69",
   "size" : 240,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const char *[6]",
   "name" : "const char *[6]",
   "referenced_type" : "type-70",
   "self_type" : "type-84",
   "size" : 48,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [2]",
   "name" : "unsigned int [2]",
   "referenced_type" : "type-2",
   "self_type" : "type-66",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [30][2]",
   "name" : "unsigned int [30][2]",
   "referenced_type" : "type-66",
   "self_type" : "type-67",
   "size" : 240,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned long [6]",
   "name" : "unsigned long [6]",
   "referenced_type" : "type-82",
   "self_type" : "type-81",
   "size" : 48,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *[8]",
   "name" : "void *[8]",
   "referenced_type" : "type-92",
   "self_type" : "type-140",
   "size" : 64,

   "source_file" : "/system/media/camera/include/system/camera_vendor_tags.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "int *",
   "name" : "int *",
   "referenced_type" : "type-11",
   "self_type" : "type-105",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "long *",
   "name" : "long *",
   "referenced_type" : "type-38",
   "self_type" : "type-107",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned char *",
   "name" : "unsigned char *",
   "referenced_type" : "type-98",
   "self_type" : "type-104",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned int *",
   "name" : "unsigned int *",
   "referenced_type" : "type-2",
   "self_type" : "type-115",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(const vendor_tag_ops *, unsigned int *)",
   "name" : "void (*)(const vendor_tag_ops *, unsigned int *)",
   "referenced_type" : "type-135",
   "self_type" : "type-134",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_vendor_tags.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(const vendor_tag_query_ops *, unsigned int *)",
   "name" : "void (*)(const vendor_tag_query_ops *, unsigned int *)",
   "referenced_type" : "type-126",
   "self_type" : "type-125",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(unsigned int *, unsigned long)",
   "name" : "void (*)(unsigned int *, unsigned long)",
   "referenced_type" : "type-147",
   "self_type" : "type-146",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_vendor_tags.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-91",
   "self_type" : "type-92",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const camera_metadata",
   "name" : "const camera_metadata",
   "referenced_type" : "type-89",
   "self_type" : "type-88",
   "size" : 48,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const camera_metadata_rational",
   "name" : "const camera_metadata_rational",
   "referenced_type" : "type-78",
   "self_type" : "type-77",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-72",
   "self_type" : "type-71",
   "size" : 1,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const double",
   "name" : "const double",
   "referenced_type" : "type-74",
   "self_type" : "type-73",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const float",
   "name" : "const float",
   "referenced_type" : "type-4",
   "self_type" : "type-3",
   "size" : 4,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-11",
   "self_type" : "type-114",
   "size" : 4,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const long",
   "name" : "const long",
   "referenced_type" : "type-38",
   "self_type" : "type-37",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-98",
   "self_type" : "type-97",
   "size" : 1,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-82",
   "self_type" : "type-94",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const vendor_tag_ops",
   "name" : "const vendor_tag_ops",
   "referenced_type" : "type-129",
   "self_type" : "type-133",
   "size" : 104,
   "source_file" : "/system/media/camera/include/system/camera_vendor_tags.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const vendor_tag_query_ops",
   "name" : "const vendor_tag_query_ops",
   "referenced_type" : "type-116",
   "self_type" : "type-120",
   "size" : 40,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-91",
   "self_type" : "type-99",
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "unsigned long const[6]",
   "name" : "unsigned long const[6]",
   "referenced_type" : "type-81",
   "self_type" : "type-83",
   "size" : 48,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "type",
     "field_offset" : 96,
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "count",
     "field_offset" : 128,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "camera_metadata_entry",
   "name" : "camera_metadata_entry",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 32,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h",
   "unique_id" : "camera_metadata_entry"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "u8",
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "i32",
     "referenced_type" : "type-105"
    },
    {
     "field_name" : "f",
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "i64",
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "d",
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "r",
     "referenced_type" : "type-109"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "camera_metadata_entry::(anonymous union at system/media/camera/include/system/camera_metadata.h:85:5) at system/media/camera/include/system/camera_metadata.h:85:5",
   "name" : "camera_metadata_entry::(anonymous union at system/media/camera/include/system/camera_metadata.h:85:5) at system/media/camera/include/system/camera_metadata.h:85:5",
   "record_kind" : "union",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h",
   "unique_id" : "camera_metadata_entry::(anonymous union at system/media/camera/include/system/camera_metadata.h:85:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numerator",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "denominator",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "camera_metadata_rational",
   "name" : "camera_metadata_rational",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h",
   "unique_id" : "camera_metadata_rational"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "type",
     "field_offset" : 96,
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "count",
     "field_offset" : 128,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "camera_metadata_ro_entry",
   "name" : "camera_metadata_ro_entry",
   "referenced_type" : "type-111",
   "self_type" : "type-111",
   "size" : 32,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h",
   "unique_id" : "camera_metadata_ro_entry"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "u8",
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "i32",
     "referenced_type" : "type-113"
    },
    {
     "field_name" : "f",
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "i64",
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "d",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "r",
     "referenced_type" : "type-80"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "camera_metadata_ro_entry::(anonymous union at system/media/camera/include/system/camera_metadata.h:104:5) at system/media/camera/include/system/camera_metadata.h:104:5",
   "name" : "camera_metadata_ro_entry::(anonymous union at system/media/camera/include/system/camera_metadata.h:104:5) at system/media/camera/include/system/camera_metadata.h:104:5",
   "record_kind" : "union",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 8,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h",
   "unique_id" : "camera_metadata_ro_entry::(anonymous union at system/media/camera/include/system/camera_metadata.h:104:5)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "get_tag_count",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "get_all_tags",
     "field_offset" : 64,
     "referenced_type" : "type-146"
    },
    {
     "field_name" : "get_section_name",
     "field_offset" : 128,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "get_tag_name",
     "field_offset" : 192,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "get_tag_type",
     "field_offset" : 256,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 320,
     "referenced_type" : "type-140"
    }
   ],
   "linker_set_key" : "vendor_tag_cache_ops",
   "name" : "vendor_tag_cache_ops",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 104,
   "source_file" : "/system/media/camera/include/system/camera_vendor_tags.h",
   "unique_id" : "vendor_tag_cache_ops"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "get_tag_count",
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "get_all_tags",
     "field_offset" : 64,
     "referenced_type" : "type-134"
    },
    {
     "field_name" : "get_section_name",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "get_tag_name",
     "field_offset" : 192,
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "get_tag_type",
     "field_offset" : 256,
     "referenced_type" : "type-138"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 320,
     "referenced_type" : "type-140"
    }
   ],
   "linker_set_key" : "vendor_tag_ops",
   "name" : "vendor_tag_ops",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 104,
   "source_file" : "/system/media/camera/include/system/camera_vendor_tags.h",
   "unique_id" : "vendor_tag_ops"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "get_camera_vendor_section_name",
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "get_camera_vendor_tag_name",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "get_camera_vendor_tag_type",
     "field_offset" : 128,
     "referenced_type" : "type-121"
    },
    {
     "field_name" : "get_camera_vendor_tag_count",
     "field_offset" : 192,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "get_camera_vendor_tags",
     "field_offset" : 256,
     "referenced_type" : "type-125"
    }
   ],
   "linker_set_key" : "vendor_tag_query_ops",
   "name" : "vendor_tag_query_ops",
   "referenced_type" : "type-116",
   "self_type" : "type-116",
   "size" : 40,
   "source_file" : "/system/media/camera/include/system/camera_metadata.h",
   "unique_id" : "vendor_tag_query_ops"
  }
 ],
 "rvalue_reference_types" : []
}
