{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-19",
   "self_type" : "type-22",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 1
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "char16_t",
   "name" : "char16_t",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 2
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float",
   "name" : "float",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "long",
   "name" : "long",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "signed char",

   "alignment" : 8,
   "linker_set_key" : "const native_handle *",
   "name" : "const native_handle *",
   "referenced_type" : "type-23",
   "self_type" : "type-24",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const void *",
   "name" : "const void *",
   "referenced_type" : "type-33",
   "self_type" : "type-32",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/sockets.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "float *",
   "name" : "float *",
   "referenced_type" : "type-60",
   "self_type" : "type-59",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/str_parms.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "int (*)(void *)",
   "name" : "int (*)(void *)",
   "referenced_type" : "type-51",
   "self_type" : "type-52",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/hashmap.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "int *",
   "name" : "int *",
   "referenced_type" : "type-19",
   "self_type" : "type-18",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/iosched_policy.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "native_handle *",
   "name" : "native_handle *",
   "referenced_type" : "type-21",
   "self_type" : "type-25",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "str_parms *",
   "name" : "str_parms *",
   "referenced_type" : "type-58",
   "self_type" : "type-57",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/str_parms.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "str_parms *",
   "name" : "str_parms *",
   "referenced_type" : "type-83",
   "self_type" : "type-82",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/str_parms.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "str_parms *",
   "name" : "str_parms *",
   "referenced_type" : "type-94",
   "self_type" : "type-93",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/str_parms.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "thread_store_t *",
   "name" : "thread_store_t *",
   "referenced_type" : "type-38",
   "self_type" : "type-40",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/threads.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned int *",
   "name" : "unsigned int *",
   "referenced_type" : "type-6",
   "self_type" : "type-20",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/misc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned long *",
   "name" : "unsigned long *",
   "referenced_type" : "type-28",
   "self_type" : "type-30",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/record_stream.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(const char *, const char *, void *)",
   "name" : "void (*)(const char *, const char *, void *)",
   "referenced_type" : "type-13",
   "self_type" : "type-16",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/properties.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(void *)",
   "name" : "void (*)(void *)",
   "referenced_type" : "type-41",
   "self_type" : "type-42",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/threads.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-14",
   "self_type" : "type-15",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/misc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void **",
   "name" : "void **",
   "referenced_type" : "type-15",
   "self_type" : "type-29",
   "size" : 8,
   "source_file" : "/system/core/libcutils/include/cutils/record_stream.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-5",
   "self_type" : "type-4",
   "size" : 1,
   "source_file" : "/system/core/libcutils/include/cutils/config_utils.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const char16_t",
   "name" : "const char16_t",
   "referenced_type" : "type-35",
   "self_type" : "type-34",
   "size" : 2,
   "source_file" : "/system/core/libcutils/include/cutils/jstring.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const cutils_socket_buffer_t",
   "name" : "const cutils_socket_buffer_t",
   "referenced_type" : "type-31",
   "self_type" : "type-55",
   "size" : 16,
   "source_file" : "/system/core/libcutils/include/cutils/sockets.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const iovec",
   "name" : "const iovec",
   "referenced_type" : "type-99",
   "self_type" : "type-98",
   "size" : 16,
   "source_file" : "/system/core/libcutils/include/cutils/klog.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const iovec",
   "name" : "const iovec",
   "referenced_type" : "type-9",
   "self_type" : "type-8",
   "size" : 16,
   "source_file" : "/system/core/libcutils/include/cutils/klog.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const native_handle",
   "name" : "const native_handle",
   "referenced_type" : "type-21",
   "self_type" : "type-23",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-14",
   "self_type" : "type-33",
   "source_file" : "/system/core/libcutils/include/cutils/sockets.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "first_child",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "last_child",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "name",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "value",
     "field_offset" : 256,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "cnode",
   "name" : "cnode",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 40,
   "source_file" : "/system/core/libcutils/include/cutils/config_utils.h",
   "unique_id" : "cnode"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "cutils_socket_buffer_t",
   "name" : "cutils_socket_buffer_t",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 16,
   "source_file" : "/system/core/libcutils/include/cutils/sockets.h",
   "unique_id" : "cutils_socket_buffer_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lock",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "has_tls",
     "field_offset" : 320,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "tls",
     "field_offset" : 352,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "thread_store_t",
   "name" : "thread_store_t",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 48,
   "source_file" : "/system/core/libcutils/include/cutils/threads.h",
   "unique_id" : "thread_store_t"
  }
 ],
 "rvalue_reference_types" : []
}
