{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "ASN1_TEMPLATE_st [2]",
   "name" : "ASN1_TEMPLATE_st [2]",
   "referenced_type" : "type-6440",
   "self_type" : "type-6439",
   "size" : 80,
   "source_file" : "/system/keymaster/include/keymaster/wrapped_key.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",
   "referenced_type" : "type-1160",
   "self_type" : "type-1159",
   "size" : 1440,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",
   "referenced_type" : "type-1258",
   "self_type" : "type-1257",
   "size" : 1440,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",
   "referenced_type" : "type-1339",
   "self_type" : "type-1338",
   "size" : 1440,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",
   "referenced_type" : "type-1939",
   "self_type" : "type-1938",
   "size" : 1440,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",

   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-819",
   "self_type" : "type-818",
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-873",
   "self_type" : "type-872",
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-877",
   "self_type" : "type-876",
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-882",
   "self_type" : "type-881",
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-961",
   "self_type" : "type-960",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-3",
   "self_type" : "type-13",
   "size" : 1,
   "source_file" : "/hardware/libhardware/include/hardware/keymaster_defs.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned char *const",
   "name" : "const unsigned char *const",
   "referenced_type" : "type-12",
   "self_type" : "type-208",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-8",
   "self_type" : "type-1084",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/key_blob_utils/software_keyblobs.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-10",
   "self_type" : "type-271",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-48",
   "self_type" : "type-47",
   "source_file" : "/system/keymaster/include/keymaster/serializable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_block_mode_t const[2]",
   "name" : "keymaster_block_mode_t const[2]",
   "referenced_type" : "type-6410",
   "self_type" : "type-6409",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_block_mode_t const[4]",
   "name" : "keymaster_block_mode_t const[4]",
   "referenced_type" : "type-1213",
   "self_type" : "type-1212",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_digest_t const[5]",
   "name" : "keymaster_digest_t const[5]",
   "referenced_type" : "type-2646",
   "self_type" : "type-2645",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_digest_t const[6]",
   "name" : "keymaster_digest_t const[6]",
   "referenced_type" : "type-2478",
   "self_type" : "type-2477",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_digest_t const[7]",
   "name" : "keymaster_digest_t const[7]",
   "referenced_type" : "type-2916",
   "self_type" : "type-2915",
   "size" : 28,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_key_format_t const[1]",
   "name" : "keymaster_key_format_t const[1]",
   "referenced_type" : "type-1313",
   "self_type" : "type-1312",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_padding_t const[2]",
   "name" : "keymaster_padding_t const[2]",
   "referenced_type" : "type-2328",
   "self_type" : "type-2327",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_padding_t const[3]",
   "name" : "keymaster_padding_t const[3]",
   "referenced_type" : "type-2919",
   "self_type" : "type-2918",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[16]",
   "name" : "unsigned char const[16]",
   "referenced_type" : "type-1134",
   "self_type" : "type-1133",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[2]",
   "name" : "unsigned char const[2]",
   "referenced_type" : "type-1077",
   "self_type" : "type-1076",
   "size" : 2,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "challenge",
     "field_offset" : 8,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "user_id",
     "field_offset" : 72,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "authenticator_id",
     "field_offset" : 136,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "authenticator_type",
     "field_offset" : 200,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 232,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "hmac",
     "field_offset" : 296,
     "referenced_type" : "type-332"
    }
   ],
   "linker_set_key" : "hw_auth_token_t",
   "name" : "hw_auth_token_t",
   "referenced_type" : "type-377",
   "self_type" : "type-377",
   "size" : 69,
   "source_file" : "/hardware/libhardware/include/hardware/hw_auth_token.h",
   "unique_id" : "hw_auth_token_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::ASN1_STRING_Delete",
   "name" : "keymaster::ASN1_STRING_Delete",
   "referenced_type" : "type-1140",
   "self_type" : "type-1140",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster18ASN1_STRING_DeleteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::ASN1_TYPE_Delete",
   "name" : "keymaster::ASN1_TYPE_Delete",
   "referenced_type" : "type-1144",
   "self_type" : "type-1144",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster16ASN1_TYPE_DeleteE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::AbortOperationRequest",
   "name" : "keymaster::AbortOperationRequest",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21AbortOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21AbortOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21AbortOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21AbortOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "linker_set_key" : "keymaster::AbortOperationResponse",
   "name" : "keymaster::AbortOperationResponse",
   "referenced_type" : "type-528",
   "self_type" : "type-528",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22AbortOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22AbortOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22AbortOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22AbortOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "random_data",
     "field_offset" : 128,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::AddEntropyRequest",
   "name" : "keymaster::AddEntropyRequest",
   "referenced_type" : "type-532",
   "self_type" : "type-532",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17AddEntropyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17AddEntropyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AddEntropyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AddEntropyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "linker_set_key" : "keymaster::AddEntropyResponse",
   "name" : "keymaster::AddEntropyResponse",
   "referenced_type" : "type-534",
   "self_type" : "type-534",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18AddEntropyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18AddEntropyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18AddEntropyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18AddEntropyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1191"
    }
   ],
   "linker_set_key" : "keymaster::AesKey",
   "name" : "keymaster::AesKey",
   "record_kind" : "class",
   "referenced_type" : "type-1198",
   "self_type" : "type-1198",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/aes_key.h",
   "unique_id" : "_ZTSN9keymaster6AesKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6AesKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6AesKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6AesKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1184"
    }
   ],
   "linker_set_key" : "keymaster::AesKeyFactory",
   "name" : "keymaster::AesKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1194",
   "self_type" : "type-1194",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/aes_key.h",
   "unique_id" : "_ZTSN9keymaster13AesKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13AesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AesKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory18key_size_supportedEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory14key_size_bytesEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory13key_size_bitsEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13AesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster13AesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster13AesKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "type-349"
    },
    {
     "access" : "private",
     "field_name" : "operation_table_",
     "field_offset" : 128,
     "referenced_type" : "type-352"
    }
   ],
   "linker_set_key" : "keymaster::AndroidKeymaster",
   "name" : "keymaster::AndroidKeymaster",
   "record_kind" : "class",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster.h",
   "unique_id" : "_ZTSN9keymaster16AndroidKeymasterE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AndroidKeymasterE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AndroidKeymasterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AndroidKeymasterD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-296"
    }
   ],
   "linker_set_key" : "keymaster::AsymmetricKey",
   "name" : "keymaster::AsymmetricKey",
   "record_kind" : "class",
   "referenced_type" : "type-1239",
   "self_type" : "type-1239",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/asymmetric_key.h",
   "unique_id" : "_ZTSN9keymaster13AsymmetricKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13AsymmetricKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AsymmetricKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AsymmetricKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster13AsymmetricKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-300"
    }
   ],
   "linker_set_key" : "keymaster::AsymmetricKeyFactory",
   "name" : "keymaster::AsymmetricKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1291",
   "self_type" : "type-1291",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/asymmetric_key_factory.h",
   "unique_id" : "_ZTSN9keymaster20AsymmetricKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20AsymmetricKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20AsymmetricKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20AsymmetricKeyFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory18keymaster_key_typeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory12evp_key_typeEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 128,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "attest_params",
     "field_offset" : 256,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::AttestKeyRequest",
   "name" : "keymaster::AttestKeyRequest",
   "referenced_type" : "type-569",
   "self_type" : "type-569",
   "size" : 112,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16AttestKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AttestKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AttestKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AttestKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "certificate_chain",
     "field_offset" : 128,
     "referenced_type" : "type-572"
    }
   ],
   "linker_set_key" : "keymaster::AttestKeyResponse",
   "name" : "keymaster::AttestKeyResponse",
   "referenced_type" : "type-571",
   "self_type" : "type-571",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17AttestKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17AttestKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AttestKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AttestKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::AttestationRecordContext",
   "name" : "keymaster::AttestationRecordContext",
   "record_kind" : "class",
   "referenced_type" : "type-1168",
   "self_type" : "type-1168",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster24AttestationRecordContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24AttestationRecordContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24AttestationRecordContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24AttestationRecordContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GetSecurityLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext22VerifyAndCopyDeviceIdsERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GenerateUniqueIdEmRK16keymaster_blob_tbPNS_6BufferE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext21GetVerifiedBootParamsEP16keymaster_blob_tP25keymaster_verified_boot_tPb"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "hw_enforced_",
     "referenced_type" : "type-413"
    },
    {
     "access" : "private",
     "field_name" : "sw_enforced_",
     "field_offset" : 64,
     "referenced_type" : "type-413"
    }
   ],
   "linker_set_key" : "keymaster::AuthProxy",
   "name" : "keymaster::AuthProxy",
   "record_kind" : "class",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster9AuthProxyE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pos_",
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "auth_set1_",
     "field_offset" : 64,
     "referenced_type" : "type-414"
    },
    {
     "access" : "private",
     "field_name" : "auth_set2_",
     "field_offset" : 128,
     "referenced_type" : "type-414"
    }
   ],
   "linker_set_key" : "keymaster::AuthProxyIterator",
   "name" : "keymaster::AuthProxyIterator",
   "record_kind" : "class",
   "referenced_type" : "type-421",
   "self_type" : "type-421",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster17AuthProxyIteratorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    },
    {
     "referenced_type" : "type-25"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "elems_",
     "field_offset" : 192,
     "referenced_type" : "type-288"
    },
    {
     "access" : "private",
     "field_name" : "elems_size_",
     "field_offset" : 256,
     "referenced_type" : "type-289"
    },
    {
     "access" : "private",
     "field_name" : "elems_capacity_",
     "field_offset" : 320,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_",
     "field_offset" : 384,
     "referenced_type" : "type-119"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_size_",
     "field_offset" : 448,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_capacity_",
     "field_offset" : 512,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "error_",
     "field_offset" : 576,
     "referenced_type" : "type-290"
    }
   ],
   "linker_set_key" : "keymaster::AuthorizationSet",
   "name" : "keymaster::AuthorizationSet",
   "record_kind" : "class",
   "referenced_type" : "type-287",
   "self_type" : "type-287",
   "size" : 80,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster16AuthorizationSetE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AuthorizationSetE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSetD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSetD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AuthorizationSet14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AuthorizationSet9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSet11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "set",
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::AuthorizationSetBuilder",
   "name" : "keymaster::AuthorizationSetBuilder",
   "record_kind" : "class",
   "referenced_type" : "type-416",
   "self_type" : "type-416",
   "size" : 80,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster23AuthorizationSetBuilderE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "purpose",
     "field_offset" : 96,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "key_blob",
     "field_offset" : 128,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 256,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::BeginOperationRequest",
   "name" : "keymaster::BeginOperationRequest",
   "referenced_type" : "type-512",
   "self_type" : "type-512",
   "size" : 112,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21BeginOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21BeginOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21BeginOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21BeginOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 192,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::BeginOperationResponse",
   "name" : "keymaster::BeginOperationResponse",
   "referenced_type" : "type-514",
   "self_type" : "type-514",
   "size" : 104,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22BeginOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22BeginOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22BeginOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22BeginOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 64,
     "referenced_type" : "type-118"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "read_position_",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "write_position_",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::Buffer",
   "name" : "keymaster::Buffer",
   "record_kind" : "class",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h",
   "unique_id" : "_ZTSN9keymaster6BufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6BufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6BufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6BufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6Buffer14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6Buffer9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster6Buffer11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::CertificateChainDelete",
   "name" : "keymaster::CertificateChainDelete",
   "referenced_type" : "type-325",
   "self_type" : "type-325",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster22CertificateChainDeleteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Characteristics_Delete",
   "name" : "keymaster::Characteristics_Delete",
   "referenced_type" : "type-318",
   "self_type" : "type-318",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster22Characteristics_DeleteE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params_array",
     "field_offset" : 128,
     "referenced_type" : "type-591"
    }
   ],
   "linker_set_key" : "keymaster::ComputeSharedHmacRequest",
   "name" : "keymaster::ComputeSharedHmacRequest",
   "referenced_type" : "type-600",
   "self_type" : "type-600",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24ComputeSharedHmacRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24ComputeSharedHmacRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ComputeSharedHmacRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ComputeSharedHmacRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "sharing_check",
     "field_offset" : 128,
     "referenced_type" : "type-275"
    }
   ],
   "linker_set_key" : "keymaster::ComputeSharedHmacResponse",
   "name" : "keymaster::ComputeSharedHmacResponse",
   "referenced_type" : "type-337",
   "self_type" : "type-337",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster25ComputeSharedHmacResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25ComputeSharedHmacResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25ComputeSharedHmacResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25ComputeSharedHmacResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "os_version",
     "field_offset" : 96,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "os_patchlevel",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "keymaster::ConfigureRequest",
   "name" : "keymaster::ConfigureRequest",
   "referenced_type" : "type-582",
   "self_type" : "type-582",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ConfigureRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ConfigureRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ConfigureRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ConfigureRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "linker_set_key" : "keymaster::ConfigureResponse",
   "name" : "keymaster::ConfigureResponse",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ConfigureResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ConfigureResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ConfigureResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ConfigureResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<UniquePtr<Operation, DefaultDelete<Operation> > []>",
   "name" : "keymaster::DefaultDelete<UniquePtr<Operation, DefaultDelete<Operation> > []>",
   "referenced_type" : "type-293",
   "self_type" : "type-293",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-292" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_NS_9UniquePtrINS_9OperationENS0_IS2_EEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::AsymmetricKey>",
   "name" : "keymaster::DefaultDelete<keymaster::AsymmetricKey>",
   "referenced_type" : "type-1298",
   "self_type" : "type-1298",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1239" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_13AsymmetricKeyEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::HmacOperation>",
   "name" : "keymaster::DefaultDelete<keymaster::HmacOperation>",
   "referenced_type" : "type-2589",
   "self_type" : "type-2589",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2590" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_13HmacOperationEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::Key>",
   "name" : "keymaster::DefaultDelete<keymaster::Key>",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-296" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_3KeyEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::KeyExchange>",
   "name" : "keymaster::DefaultDelete<keymaster::KeyExchange>",
   "referenced_type" : "type-2480",
   "self_type" : "type-2480",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2481" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_11KeyExchangeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::KeymasterContext>",
   "name" : "keymaster::DefaultDelete<keymaster::KeymasterContext>",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-42" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_16KeymasterContextEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::NistCurveKeyExchange>",
   "name" : "keymaster::DefaultDelete<keymaster::NistCurveKeyExchange>",
   "referenced_type" : "type-2669",
   "self_type" : "type-2669",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2509" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_20NistCurveKeyExchangeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::Operation>",
   "name" : "keymaster::DefaultDelete<keymaster::Operation>",
   "referenced_type" : "type-291",
   "self_type" : "type-291",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-286" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_9OperationEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::OperationTable>",
   "name" : "keymaster::DefaultDelete<keymaster::OperationTable>",
   "referenced_type" : "type-280",
   "self_type" : "type-280",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-281" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_14OperationTableEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::Rfc5869Sha256Kdf>",
   "name" : "keymaster::DefaultDelete<keymaster::Rfc5869Sha256Kdf>",
   "referenced_type" : "type-2489",
   "self_type" : "type-2489",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2490" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_16Rfc5869Sha256KdfEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::RsaOperation>",
   "name" : "keymaster::DefaultDelete<keymaster::RsaOperation>",
   "referenced_type" : "type-2921",
   "self_type" : "type-2921",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2805" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_12RsaOperationEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_algorithm_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_algorithm_t []>",
   "referenced_type" : "type-499",
   "self_type" : "type-499",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_21keymaster_algorithm_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_block_mode_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_block_mode_t []>",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-564" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_22keymaster_block_mode_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_digest_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_digest_t []>",
   "referenced_type" : "type-698",
   "self_type" : "type-698",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-699" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_key_format_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_key_format_t []>",
   "referenced_type" : "type-720",
   "self_type" : "type-720",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-721" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_22keymaster_key_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_padding_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_padding_t []>",
   "referenced_type" : "type-634",
   "self_type" : "type-634",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-635" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<unsigned char []>",
   "name" : "keymaster::DefaultDelete<unsigned char []>",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_hEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<v3_ext_ctx>",
   "name" : "keymaster::DefaultDelete<v3_ext_ctx>",
   "referenced_type" : "type-2170",
   "self_type" : "type-2170",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2171" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteI10v3_ext_ctxEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "linker_set_key" : "keymaster::DeleteAllKeysRequest",
   "name" : "keymaster::DeleteAllKeysRequest",
   "referenced_type" : "type-552",
   "self_type" : "type-552",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster20DeleteAllKeysRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20DeleteAllKeysRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20DeleteAllKeysRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20DeleteAllKeysRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "linker_set_key" : "keymaster::DeleteAllKeysResponse",
   "name" : "keymaster::DeleteAllKeysResponse",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21DeleteAllKeysResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21DeleteAllKeysResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21DeleteAllKeysResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21DeleteAllKeysResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 128,
     "referenced_type" : "type-229"
    }
   ],
   "linker_set_key" : "keymaster::DeleteKeyRequest",
   "name" : "keymaster::DeleteKeyRequest",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16DeleteKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16DeleteKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16DeleteKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16DeleteKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "linker_set_key" : "keymaster::DeleteKeyResponse",
   "name" : "keymaster::DeleteKeyResponse",
   "referenced_type" : "type-548",
   "self_type" : "type-548",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17DeleteKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17DeleteKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17DeleteKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17DeleteKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1239"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ec_key_",
     "field_offset" : 1536,
     "referenced_type" : "type-1109"
    }
   ],
   "linker_set_key" : "keymaster::EcKey",
   "name" : "keymaster::EcKey",
   "record_kind" : "class",
   "referenced_type" : "type-2359",
   "self_type" : "type-2359",
   "size" : 200,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ec_key.h",
   "unique_id" : "_ZTSN9keymaster5EcKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster5EcKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster5EcKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster5EcKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster5EcKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "mangled_component_name" : "_ZN9keymaster5EcKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1291"
    },
    {
     "referenced_type" : "type-1178"
    }
   ],
   "linker_set_key" : "keymaster::EcKeyFactory",
   "name" : "keymaster::EcKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2402",
   "self_type" : "type-2402",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ec_key_factory.h",
   "unique_id" : "_ZTSN9keymaster12EcKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12EcKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12EcKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12EcKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12EcKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster12EcKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster12EcKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-286"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "digest_",
     "field_offset" : 1536,
     "referenced_type" : "type-61"
    },
    {
     "access" : "protected",
     "field_name" : "digest_algorithm_",
     "field_offset" : 1600,
     "referenced_type" : "type-2415"
    },
    {
     "access" : "protected",
     "field_name" : "ecdsa_key_",
     "field_offset" : 1664,
     "referenced_type" : "type-2418"
    },
    {
     "access" : "protected",
     "field_name" : "digest_ctx_",
     "field_offset" : 1728,
     "referenced_type" : "type-2420"
    },
    {
     "access" : "protected",
     "field_name" : "data_",
     "field_offset" : 1984,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaOperation",
   "name" : "keymaster::EcdsaOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2414",
   "self_type" : "type-2414",
   "size" : 288,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster14EcdsaOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster14EcdsaOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperation5AbortEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-703"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaOperationFactory",
   "name" : "keymaster::EcdsaOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2428",
   "self_type" : "type-2428",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster21EcdsaOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21EcdsaOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21EcdsaOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21EcdsaOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory7purposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2414"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaSignOperation",
   "name" : "keymaster::EcdsaSignOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2424",
   "self_type" : "type-2424",
   "size" : 288,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster18EcdsaSignOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18EcdsaSignOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperation5AbortEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2428"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaSignOperationFactory",
   "name" : "keymaster::EcdsaSignOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2432",
   "self_type" : "type-2432",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster25EcdsaSignOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25EcdsaSignOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25EcdsaSignOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25EcdsaSignOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaSignOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaSignOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2414"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaVerifyOperation",
   "name" : "keymaster::EcdsaVerifyOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2426",
   "self_type" : "type-2426",
   "size" : 288,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster20EcdsaVerifyOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20EcdsaVerifyOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperation5AbortEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2428"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaVerifyOperationFactory",
   "name" : "keymaster::EcdsaVerifyOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2435",
   "self_type" : "type-2435",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster27EcdsaVerifyOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27EcdsaVerifyOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27EcdsaVerifyOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27EcdsaVerifyOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27EcdsaVerifyOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27EcdsaVerifyOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2507"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "key_exchange_",
     "field_offset" : 64,
     "referenced_type" : "type-2505"
    },
    {
     "access" : "private",
     "field_name" : "kdf_",
     "field_offset" : 128,
     "referenced_type" : "type-2506"
    },
    {
     "access" : "private",
     "field_name" : "single_hash_mode_",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "key_bytes_to_generate_",
     "field_offset" : 224,
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "curve_",
     "field_offset" : 256,
     "referenced_type" : "type-211"
    }
   ],
   "linker_set_key" : "keymaster::EciesKem",
   "name" : "keymaster::EciesKem",
   "record_kind" : "class",
   "referenced_type" : "type-2504",
   "self_type" : "type-2504",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecies_kem.h",
   "unique_id" : "_ZTSN9keymaster8EciesKemE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster8EciesKemE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster8EciesKemD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster8EciesKemD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9keymaster8EciesKem7EncryptERKNS_6BufferEPS1_S4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster8EciesKem7EncryptEPKhmPNS_6BufferES4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster8EciesKem7DecryptEP9ec_key_stRKNS_6BufferEPS3_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster8EciesKem7DecryptEP9ec_key_stPKhmPNS_6BufferE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buf_",
     "referenced_type" : "type-119"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::Eraser",
   "name" : "keymaster::Eraser",
   "record_kind" : "class",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster6EraserE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx_",
     "referenced_type" : "type-1095"
    }
   ],
   "linker_set_key" : "keymaster::EvpMdCtxCleaner",
   "name" : "keymaster::EvpMdCtxCleaner",
   "record_kind" : "class",
   "referenced_type" : "type-1094",
   "self_type" : "type-1094",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "unique_id" : "_ZTSN9keymaster15EvpMdCtxCleanerE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "additional_params",
     "field_offset" : 128,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "key_format",
     "field_offset" : 768,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "key_blob",
     "field_offset" : 832,
     "referenced_type" : "type-229"
    }
   ],
   "linker_set_key" : "keymaster::ExportKeyRequest",
   "name" : "keymaster::ExportKeyRequest",
   "referenced_type" : "type-542",
   "self_type" : "type-542",
   "size" : 120,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ExportKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ExportKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ExportKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ExportKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_data",
     "field_offset" : 128,
     "referenced_type" : "type-119"
    },
    {
     "field_name" : "key_data_length",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::ExportKeyResponse",
   "name" : "keymaster::ExportKeyResponse",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ExportKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ExportKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ExportKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ExportKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "input",
     "field_offset" : 192,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "signature",
     "field_offset" : 512,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 832,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::FinishOperationRequest",
   "name" : "keymaster::FinishOperationRequest",
   "referenced_type" : "type-520",
   "self_type" : "type-520",
   "size" : 184,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22FinishOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22FinishOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22FinishOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22FinishOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "output",
     "field_offset" : 128,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 448,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::FinishOperationResponse",
   "name" : "keymaster::FinishOperationResponse",
   "referenced_type" : "type-522",
   "self_type" : "type-522",
   "size" : 136,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23FinishOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23FinishOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23FinishOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23FinishOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_description",
     "field_offset" : 128,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::GenerateKeyRequest",
   "name" : "keymaster::GenerateKeyRequest",
   "referenced_type" : "type-501",
   "self_type" : "type-501",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18GenerateKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18GenerateKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GenerateKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GenerateKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 128,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 256,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 896,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::GenerateKeyResponse",
   "name" : "keymaster::GenerateKeyResponse",
   "referenced_type" : "type-505",
   "self_type" : "type-505",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster19GenerateKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19GenerateKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19GenerateKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19GenerateKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params",
     "field_offset" : 128,
     "referenced_type" : "type-331"
    }
   ],
   "linker_set_key" : "keymaster::GetHmacSharingParametersResponse",
   "name" : "keymaster::GetHmacSharingParametersResponse",
   "referenced_type" : "type-594",
   "self_type" : "type-594",
   "size" : 72,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster32GetHmacSharingParametersResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster32GetHmacSharingParametersResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster32GetHmacSharingParametersResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster32GetHmacSharingParametersResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 128,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 256,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::GetKeyCharacteristicsRequest",
   "name" : "keymaster::GetKeyCharacteristicsRequest",
   "referenced_type" : "type-507",
   "self_type" : "type-507",
   "size" : 112,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster28GetKeyCharacteristicsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28GetKeyCharacteristicsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28GetKeyCharacteristicsRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28GetKeyCharacteristicsRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "enforced",
     "field_offset" : 128,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 768,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::GetKeyCharacteristicsResponse",
   "name" : "keymaster::GetKeyCharacteristicsResponse",
   "referenced_type" : "type-509",
   "self_type" : "type-509",
   "size" : 176,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29GetKeyCharacteristicsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29GetKeyCharacteristicsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29GetKeyCharacteristicsResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29GetKeyCharacteristicsResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "linker_set_key" : "keymaster::GetVersionRequest",
   "name" : "keymaster::GetVersionRequest",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17GetVersionRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17GetVersionRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17GetVersionRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17GetVersionRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "major_ver",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "minor_ver",
     "field_offset" : 136,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "subminor_ver",
     "field_offset" : 144,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "keymaster::GetVersionResponse",
   "name" : "keymaster::GetVersionResponse",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18GetVersionResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18GetVersionResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GetVersionResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GetVersionResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "user_id",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "authenticator_id",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "authenticator_type",
     "field_offset" : 256,
     "referenced_type" : "type-203"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 320,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "mac",
     "field_offset" : 384,
     "referenced_type" : "type-275"
    }
   ],
   "linker_set_key" : "keymaster::HardwareAuthToken",
   "name" : "keymaster::HardwareAuthToken",
   "referenced_type" : "type-611",
   "self_type" : "type-611",
   "size" : 64,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17HardwareAuthTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17HardwareAuthTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17HardwareAuthToken14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17HardwareAuthToken9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthToken11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1191"
    }
   ],
   "linker_set_key" : "keymaster::HmacKey",
   "name" : "keymaster::HmacKey",
   "record_kind" : "class",
   "referenced_type" : "type-2573",
   "self_type" : "type-2573",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/hmac_key.h",
   "unique_id" : "_ZTSN9keymaster7HmacKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster7HmacKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster7HmacKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster7HmacKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1184"
    }
   ],
   "linker_set_key" : "keymaster::HmacKeyFactory",
   "name" : "keymaster::HmacKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2569",
   "self_type" : "type-2569",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/hmac_key.h",
   "unique_id" : "_ZTSN9keymaster14HmacKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster14HmacKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14HmacKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14HmacKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory18key_size_supportedEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory14key_size_bytesEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory13key_size_bitsEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster14HmacKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster14HmacKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster14HmacKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "key_",
     "referenced_type" : "type-118"
    },
    {
     "access" : "private",
     "field_name" : "key_len_",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::HmacSha256",
   "name" : "keymaster::HmacSha256",
   "record_kind" : "class",
   "referenced_type" : "type-2532",
   "self_type" : "type-2532",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/hmac.h",
   "unique_id" : "_ZTSN9keymaster10HmacSha256E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "seed",
     "field_offset" : 64,
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "nonce",
     "field_offset" : 192,
     "referenced_type" : "type-332"
    }
   ],
   "linker_set_key" : "keymaster::HmacSharingParameters",
   "name" : "keymaster::HmacSharingParameters",
   "referenced_type" : "type-331",
   "self_type" : "type-331",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21HmacSharingParametersE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21HmacSharingParametersE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParametersD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParametersD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21HmacSharingParameters14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21HmacSharingParameters9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParameters11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params_array",
     "field_offset" : 64,
     "referenced_type" : "type-590"
    },
    {
     "field_name" : "num_params",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::HmacSharingParametersArray",
   "name" : "keymaster::HmacSharingParametersArray",
   "referenced_type" : "type-591",
   "self_type" : "type-591",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26HmacSharingParametersArrayE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26HmacSharingParametersArrayE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArrayD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArrayD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26HmacSharingParametersArray14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26HmacSharingParametersArray9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArray11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_description",
     "field_offset" : 128,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "key_format",
     "field_offset" : 768,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "key_data",
     "field_offset" : 832,
     "referenced_type" : "type-119"
    },
    {
     "field_name" : "key_data_length",
     "field_offset" : 896,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::ImportKeyRequest",
   "name" : "keymaster::ImportKeyRequest",
   "referenced_type" : "type-538",
   "self_type" : "type-538",
   "size" : 120,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ImportKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ImportKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ImportKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ImportKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 128,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 256,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 896,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::ImportKeyResponse",
   "name" : "keymaster::ImportKeyResponse",
   "referenced_type" : "type-540",
   "self_type" : "type-540",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ImportKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ImportKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ImportKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ImportKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "wrapped_key",
     "field_offset" : 128,
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "wrapping_key",
     "field_offset" : 256,
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "masking_key",
     "field_offset" : 384,
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 512,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "password_sid",
     "field_offset" : 1152,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "biometric_sid",
     "field_offset" : 1216,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::ImportWrappedKeyRequest",
   "name" : "keymaster::ImportWrappedKeyRequest",
   "referenced_type" : "type-606",
   "self_type" : "type-606",
   "size" : 160,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23ImportWrappedKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23ImportWrappedKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23ImportWrappedKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23ImportWrappedKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 128,
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 256,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 896,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::ImportWrappedKeyResponse",
   "name" : "keymaster::ImportWrappedKeyResponse",
   "referenced_type" : "type-609",
   "self_type" : "type-609",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24ImportWrappedKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24ImportWrappedKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ImportWrappedKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ImportWrappedKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2491"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "start_counter_",
     "field_offset" : 448,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "keymaster::Iso18033Kdf",
   "name" : "keymaster::Iso18033Kdf",
   "record_kind" : "class",
   "referenced_type" : "type-2657",
   "self_type" : "type-2657",
   "size" : 64,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/iso18033kdf.h",
   "unique_id" : "_ZTSN9keymaster11Iso18033KdfE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster11Iso18033KdfE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster11Iso18033KdfD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster11Iso18033KdfD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9keymaster11Iso18033Kdf11GenerateKeyEPKhmPhm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "secret_key_",
     "field_offset" : 64,
     "referenced_type" : "type-118"
    },
    {
     "access" : "protected",
     "field_name" : "secret_key_len_",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "access" : "protected",
     "field_name" : "salt_",
     "field_offset" : 192,
     "referenced_type" : "type-118"
    },
    {
     "access" : "protected",
     "field_name" : "salt_len_",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    },
    {
     "access" : "protected",
     "field_name" : "is_initialized_",
     "field_offset" : 320,
     "referenced_type" : "type-9"
    },
    {
     "access" : "protected",
     "field_name" : "digest_type_",
     "field_offset" : 352,
     "referenced_type" : "type-61"
    },
    {
     "access" : "protected",
     "field_name" : "digest_size_",
     "field_offset" : 384,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::Kdf",
   "name" : "keymaster::Kdf",
   "record_kind" : "class",
   "referenced_type" : "type-2491",
   "self_type" : "type-2491",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/kdf.h",
   "unique_id" : "_ZTSN9keymaster3KdfE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster3KdfE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KdfD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KdfD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster3Kdf11GenerateKeyEPKhmPhm"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::Kem",
   "name" : "keymaster::Kem",
   "record_kind" : "class",
   "referenced_type" : "type-2507",
   "self_type" : "type-2507",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/kem.h",
   "unique_id" : "_ZTSN9keymaster3KemE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster3KemE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KemD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KemD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster3Kem7EncryptERKNS_6BufferEPS1_S4_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster3Kem7EncryptEPKhmPNS_6BufferES4_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster3Kem7DecryptEP9ec_key_stRKNS_6BufferEPS3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster3Kem7DecryptEP9ec_key_stPKhmPNS_6BufferE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "hw_enforced_",
     "field_offset" : 64,
     "referenced_type" : "type-287"
    },
    {
     "access" : "protected",
     "field_name" : "sw_enforced_",
     "field_offset" : 704,
     "referenced_type" : "type-287"
    },
    {
     "access" : "protected",
     "field_name" : "key_material_",
     "field_offset" : 1344,
     "referenced_type" : "type-297"
    },
    {
     "access" : "protected",
     "field_name" : "key_factory_",
     "field_offset" : 1472,
     "referenced_type" : "type-298"
    }
   ],
   "linker_set_key" : "keymaster::Key",
   "name" : "keymaster::Key",
   "record_kind" : "class",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/key.h",
   "unique_id" : "_ZTSN9keymaster3KeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster3KeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KeyD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster3Key22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPm"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::KeyExchange",
   "name" : "keymaster::KeyExchange",
   "record_kind" : "class",
   "referenced_type" : "type-2481",
   "self_type" : "type-2481",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/key_exchange.h",
   "unique_id" : "_ZTSN9keymaster11KeyExchangeE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster11KeyExchangeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster11KeyExchangeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster11KeyExchangeD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster11KeyExchange18CalculateSharedKeyERKNS_6BufferEPS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster11KeyExchange18CalculateSharedKeyEPKhmPNS_6BufferE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster11KeyExchange12public_valueEPNS_6BufferE"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::KeyFactory",
   "name" : "keymaster::KeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-300",
   "self_type" : "type-300",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/key_factory.h",
   "unique_id" : "_ZTSN9keymaster10KeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster10KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster10KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster10KeyFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory22SupportedImportFormatsEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory22SupportedExportFormatsEPm"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::KeymasterContext",
   "name" : "keymaster::KeymasterContext",
   "record_kind" : "class",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_context.h",
   "unique_id" : "_ZTSN9keymaster16KeymasterContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16KeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterContextD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster16KeymasterContext16SetSystemVersionEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext16GetSystemVersionEPjS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext13GetKeyFactoryE21keymaster_algorithm_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext19GetOperationFactoryE21keymaster_algorithm_t19keymaster_purpose_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext22GetSupportedAlgorithmsEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext14UpgradeKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPS3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext12ParseKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext9DeleteKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext13DeleteAllKeysEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext13AddRngEntropyEPKhm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster16KeymasterContext18enforcement_policyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext19GenerateAttestationERKNS_3KeyERKNS_16AuthorizationSetEPNS_9UniquePtrI22keymaster_cert_chain_tNS_22CertificateChainDeleteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext9UnwrapKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEES5_RKNS_16AuthorizationSetES5_PS6_P22keymaster_key_format_tPS3_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "access_time_map_",
     "field_offset" : 64,
     "referenced_type" : "type-686"
    },
    {
     "access" : "private",
     "field_name" : "access_count_map_",
     "field_offset" : 128,
     "referenced_type" : "type-688"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterEnforcement",
   "name" : "keymaster::KeymasterEnforcement",
   "record_kind" : "class",
   "referenced_type" : "type-685",
   "self_type" : "type-685",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_enforcement.h",
   "unique_id" : "_ZTSN9keymaster20KeymasterEnforcementE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20KeymasterEnforcementE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcementD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcementD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement21activation_date_validEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement22expiration_date_passedEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement20auth_token_timed_outERK15hw_auth_token_tj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement19get_current_time_msEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement13SecurityLevelEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement22ValidateTokenSignatureERK15hw_auth_token_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcement24GetHmacSharingParametersEPNS_21HmacSharingParametersE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcement17ComputeSharedHmacERKNS_26HmacSharingParametersArrayEPNS_14TKeymasterBlobI16keymaster_blob_tEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcement19VerifyAuthorizationERKNS_26VerifyAuthorizationRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement11CreateKeyIdERK20keymaster_key_blob_tPm"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::KeymasterEnforcementContext",
   "name" : "keymaster::KeymasterEnforcementContext",
   "record_kind" : "class",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_enforcement.h",
   "unique_id" : "_ZTSN9keymaster27KeymasterEnforcementContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27KeymasterEnforcementContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27KeymasterEnforcementContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27KeymasterEnforcementContextD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "message_version",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterMessage",
   "name" : "keymaster::KeymasterMessage",
   "referenced_type" : "type-339",
   "self_type" : "type-339",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16KeymasterMessageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16KeymasterMessageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterMessageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterMessageD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable14SerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable9SerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12Serializable11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "error",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterResponse",
   "name" : "keymaster::KeymasterResponse",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17KeymasterResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17KeymasterResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse22NonErrorSerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse17NonErrorSerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::List<AccessCount>::CONST_ITERATOR<keymaster::AccessCountMap::AccessCount>",
   "name" : "keymaster::List<AccessCount>::CONST_ITERATOR<keymaster::AccessCountMap::AccessCount>",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-126" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_14AccessCountMap11AccessCountEE14CONST_ITERATORIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::List<AccessCount>::NON_CONST_ITERATOR<keymaster::AccessCountMap::AccessCount>",
   "name" : "keymaster::List<AccessCount>::NON_CONST_ITERATOR<keymaster::AccessCountMap::AccessCount>",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-128" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_14AccessCountMap11AccessCountEE18NON_CONST_ITERATORIS2_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "keymaster::List<AccessCount>::_ListIterator<keymaster::AccessCountMap::AccessCount, keymaster::List<AccessCount>::CONST_ITERATOR>",
   "name" : "keymaster::List<AccessCount>::_ListIterator<keymaster::AccessCountMap::AccessCount, keymaster::List<AccessCount>::CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-137" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_14AccessCountMap11AccessCountEE13_ListIteratorIS2_NS3_14CONST_ITERATOREEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "keymaster::List<AccessCount>::_ListIterator<keymaster::AccessCountMap::AccessCount, keymaster::List<AccessCount>::NON_CONST_ITERATOR>",
   "name" : "keymaster::List<AccessCount>::_ListIterator<keymaster::AccessCountMap::AccessCount, keymaster::List<AccessCount>::NON_CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-130" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_14AccessCountMap11AccessCountEE13_ListIteratorIS2_NS3_18NON_CONST_ITERATOREEE"
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "referenced_type" : "type-113"
    },
    {
     "access" : "private",
     "field_name" : "mpPrev",
     "field_offset" : 128,
     "referenced_type" : "type-111"
    },
    {
     "access" : "private",
     "field_name" : "mpNext",
     "field_offset" : 192,
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "keymaster::List<AccessCount>::_Node",
   "name" : "keymaster::List<AccessCount>::_Node",
   "record_kind" : "class",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "unique_id" : "_ZTSN9keymaster4ListINS_14AccessCountMap11AccessCountEE5_NodeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::List<AccessTime>::CONST_ITERATOR<keymaster::AccessTimeMap::AccessTime>",
   "name" : "keymaster::List<AccessTime>::CONST_ITERATOR<keymaster::AccessTimeMap::AccessTime>",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-85" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_13AccessTimeMap10AccessTimeEE14CONST_ITERATORIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::List<AccessTime>::NON_CONST_ITERATOR<keymaster::AccessTimeMap::AccessTime>",
   "name" : "keymaster::List<AccessTime>::NON_CONST_ITERATOR<keymaster::AccessTimeMap::AccessTime>",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-88" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_13AccessTimeMap10AccessTimeEE18NON_CONST_ITERATORIS2_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "keymaster::List<AccessTime>::_ListIterator<keymaster::AccessTimeMap::AccessTime, keymaster::List<AccessTime>::CONST_ITERATOR>",
   "name" : "keymaster::List<AccessTime>::_ListIterator<keymaster::AccessTimeMap::AccessTime, keymaster::List<AccessTime>::CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-99",
   "self_type" : "type-99",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_13AccessTimeMap10AccessTimeEE13_ListIteratorIS2_NS3_14CONST_ITERATOREEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "keymaster::List<AccessTime>::_ListIterator<keymaster::AccessTimeMap::AccessTime, keymaster::List<AccessTime>::NON_CONST_ITERATOR>",
   "name" : "keymaster::List<AccessTime>::_ListIterator<keymaster::AccessTimeMap::AccessTime, keymaster::List<AccessTime>::NON_CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_13AccessTimeMap10AccessTimeEE13_ListIteratorIS2_NS3_18NON_CONST_ITERATOREEE"
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "referenced_type" : "type-74"
    },
    {
     "access" : "private",
     "field_name" : "mpPrev",
     "field_offset" : 128,
     "referenced_type" : "type-72"
    },
    {
     "access" : "private",
     "field_name" : "mpNext",
     "field_offset" : 192,
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "keymaster::List<AccessTime>::_Node",
   "name" : "keymaster::List<AccessTime>::_Node",
   "record_kind" : "class",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "unique_id" : "_ZTSN9keymaster4ListINS_13AccessTimeMap10AccessTimeEE5_NodeE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "keymaster::List<keymaster::AccessCountMap::AccessCount>",
   "name" : "keymaster::List<keymaster::AccessCountMap::AccessCount>",
   "record_kind" : "class",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-114" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_14AccessCountMap11AccessCountEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster4ListINS_14AccessCountMap11AccessCountEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster4ListINS_14AccessCountMap11AccessCountEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster4ListINS_14AccessCountMap11AccessCountEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "keymaster::List<keymaster::AccessTimeMap::AccessTime>",
   "name" : "keymaster::List<keymaster::AccessTimeMap::AccessTime>",
   "record_kind" : "class",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/List.h",
   "template_args" : [ "type-75" ],
   "unique_id" : "_ZTSN9keymaster4ListINS_13AccessTimeMap10AccessTimeEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster4ListINS_13AccessTimeMap10AccessTimeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster4ListINS_13AccessTimeMap10AccessTimeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster4ListINS_13AccessTimeMap10AccessTimeEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::Logger",
   "name" : "keymaster::Logger",
   "record_kind" : "class",
   "referenced_type" : "type-700",
   "self_type" : "type-700",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/logger.h",
   "unique_id" : "_ZTSN9keymaster6LoggerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6LoggerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6LoggerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6LoggerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster6Logger7log_msgENS0_8LogLevelEPKcSt9__va_list"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Malloc_Delete",
   "name" : "keymaster::Malloc_Delete",
   "referenced_type" : "type-320",
   "self_type" : "type-320",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster13Malloc_DeleteE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2481"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "private_key_",
     "field_offset" : 64,
     "referenced_type" : "type-1109"
    },
    {
     "access" : "private",
     "field_name" : "public_key_",
     "field_offset" : 128,
     "referenced_type" : "type-118"
    },
    {
     "access" : "private",
     "field_name" : "public_key_len_",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "shared_secret_len_",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::NistCurveKeyExchange",
   "name" : "keymaster::NistCurveKeyExchange",
   "record_kind" : "class",
   "referenced_type" : "type-2509",
   "self_type" : "type-2509",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/nist_curve_key_exchange.h",
   "unique_id" : "_ZTSN9keymaster20NistCurveKeyExchangeE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20NistCurveKeyExchangeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20NistCurveKeyExchangeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20NistCurveKeyExchangeD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20NistCurveKeyExchange18CalculateSharedKeyERKNS_6BufferEPS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20NistCurveKeyExchange18CalculateSharedKeyEPKhmPNS_6BufferE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20NistCurveKeyExchange12public_valueEPNS_6BufferE"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<X509_extension_st, &X509_EXTENSION_free>",
   "name" : "keymaster::OpenSslObjectDeleter<X509_extension_st, &X509_EXTENSION_free>",
   "referenced_type" : "type-2150",
   "self_type" : "type-2150",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2151" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI17X509_extension_stXadL_Z19X509_EXTENSION_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<X509_name_st, &X509_NAME_free>",
   "name" : "keymaster::OpenSslObjectDeleter<X509_name_st, &X509_NAME_free>",
   "referenced_type" : "type-2160",
   "self_type" : "type-2160",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2161" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI12X509_name_stXadL_Z14X509_NAME_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<asn1_object_st, &ASN1_OBJECT_free>",
   "name" : "keymaster::OpenSslObjectDeleter<asn1_object_st, &ASN1_OBJECT_free>",
   "referenced_type" : "type-2207",
   "self_type" : "type-2207",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2208" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI14asn1_object_stXadL_Z16ASN1_OBJECT_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_BIT_STRING_free>",
   "name" : "keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_BIT_STRING_free>",
   "referenced_type" : "type-2204",
   "self_type" : "type-2204",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2205" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI14asn1_string_stXadL_Z20ASN1_BIT_STRING_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_INTEGER_free>",
   "name" : "keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_INTEGER_free>",
   "referenced_type" : "type-1356",
   "self_type" : "type-1356",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-1357" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI14asn1_string_stXadL_Z17ASN1_INTEGER_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_OCTET_STRING_free>",
   "name" : "keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_OCTET_STRING_free>",
   "referenced_type" : "type-2211",
   "self_type" : "type-2211",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2212" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI14asn1_string_stXadL_Z22ASN1_OCTET_STRING_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_TIME_free>",
   "name" : "keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_TIME_free>",
   "referenced_type" : "type-2214",
   "self_type" : "type-2214",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2215" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI14asn1_string_stXadL_Z14ASN1_TIME_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<bignum_ctx, &BN_CTX_free>",
   "name" : "keymaster::OpenSslObjectDeleter<bignum_ctx, &BN_CTX_free>",
   "referenced_type" : "type-2712",
   "self_type" : "type-2712",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2713" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI10bignum_ctxXadL_Z11BN_CTX_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<bignum_st, &BN_free>",
   "name" : "keymaster::OpenSslObjectDeleter<bignum_st, &BN_free>",
   "referenced_type" : "type-1359",
   "self_type" : "type-1359",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-1360" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI9bignum_stXadL_Z7BN_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<cmac_ctx_st, &CMAC_CTX_free>",
   "name" : "keymaster::OpenSslObjectDeleter<cmac_ctx_st, &CMAC_CTX_free>",
   "referenced_type" : "type-2335",
   "self_type" : "type-2335",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2336" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI11cmac_ctx_stXadL_Z13CMAC_CTX_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<ec_group_st, &EC_GROUP_free>",
   "name" : "keymaster::OpenSslObjectDeleter<ec_group_st, &EC_GROUP_free>",
   "referenced_type" : "type-2411",
   "self_type" : "type-2411",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2412" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI11ec_group_stXadL_Z13EC_GROUP_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<ec_key_st, &EC_KEY_free>",
   "name" : "keymaster::OpenSslObjectDeleter<ec_key_st, &EC_KEY_free>",
   "referenced_type" : "type-1099",
   "self_type" : "type-1099",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-1100" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI9ec_key_stXadL_Z11EC_KEY_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<ec_point_st, &EC_POINT_free>",
   "name" : "keymaster::OpenSslObjectDeleter<ec_point_st, &EC_POINT_free>",
   "referenced_type" : "type-2683",
   "self_type" : "type-2683",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2684" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI11ec_point_stXadL_Z13EC_POINT_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<evp_pkey_st, &EVP_PKEY_free>",
   "name" : "keymaster::OpenSslObjectDeleter<evp_pkey_st, &EVP_PKEY_free>",
   "referenced_type" : "type-1102",
   "self_type" : "type-1102",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-1103" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI11evp_pkey_stXadL_Z13EVP_PKEY_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<pkcs8_priv_key_info_st, &PKCS8_PRIV_KEY_INFO_free>",
   "name" : "keymaster::OpenSslObjectDeleter<pkcs8_priv_key_info_st, &PKCS8_PRIV_KEY_INFO_free>",
   "referenced_type" : "type-2728",
   "self_type" : "type-2728",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2729" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI22pkcs8_priv_key_info_stXadL_Z24PKCS8_PRIV_KEY_INFO_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<rsa_st, &RSA_free>",
   "name" : "keymaster::OpenSslObjectDeleter<rsa_st, &RSA_free>",
   "referenced_type" : "type-1106",
   "self_type" : "type-1106",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-1107" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI6rsa_stXadL_Z8RSA_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<x509_st, &X509_free>",
   "name" : "keymaster::OpenSslObjectDeleter<x509_st, &X509_free>",
   "referenced_type" : "type-2139",
   "self_type" : "type-2139",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-2140" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI7x509_stXadL_Z9X509_freeEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "operation_handle_",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "purpose_",
     "field_offset" : 128,
     "referenced_type" : "type-39"
    },
    {
     "access" : "private",
     "field_name" : "hw_enforced_",
     "field_offset" : 192,
     "referenced_type" : "type-287"
    },
    {
     "access" : "private",
     "field_name" : "sw_enforced_",
     "field_offset" : 832,
     "referenced_type" : "type-287"
    },
    {
     "access" : "private",
     "field_name" : "key_id_",
     "field_offset" : 1472,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::Operation",
   "name" : "keymaster::Operation",
   "record_kind" : "class",
   "referenced_type" : "type-286",
   "self_type" : "type-286",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/operation.h",
   "unique_id" : "_ZTSN9keymaster9OperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster9OperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster9OperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster9OperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation5AbortEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::OperationFactory",
   "name" : "keymaster::OperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-703",
   "self_type" : "type-703",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/operation.h",
   "unique_id" : "_ZTSN9keymaster16OperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16OperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16OperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16OperationFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory12registry_keyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory16SupportedDigestsEPm"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "purpose",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "keymaster::OperationFactory::KeyType",
   "name" : "keymaster::OperationFactory::KeyType",
   "referenced_type" : "type-706",
   "self_type" : "type-706",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/operation.h",
   "unique_id" : "_ZTSN9keymaster16OperationFactory7KeyTypeE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "table_",
     "referenced_type" : "type-282"
    },
    {
     "access" : "private",
     "field_name" : "table_size_",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::OperationTable",
   "name" : "keymaster::OperationTable",
   "record_kind" : "class",
   "referenced_type" : "type-281",
   "self_type" : "type-281",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/operation_table.h",
   "unique_id" : "_ZTSN9keymaster14OperationTableE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::RandomSource",
   "name" : "keymaster::RandomSource",
   "record_kind" : "class",
   "referenced_type" : "type-717",
   "self_type" : "type-717",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/random_source.h",
   "unique_id" : "_ZTSN9keymaster12RandomSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12RandomSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RandomSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RandomSourceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12RandomSource14GenerateRandomEPhm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2491"
    }
   ],
   "linker_set_key" : "keymaster::Rfc5869Sha256Kdf",
   "name" : "keymaster::Rfc5869Sha256Kdf",
   "record_kind" : "class",
   "referenced_type" : "type-2490",
   "self_type" : "type-2490",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/hkdf.h",
   "unique_id" : "_ZTSN9keymaster16Rfc5869Sha256KdfE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16Rfc5869Sha256KdfE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16Rfc5869Sha256KdfD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16Rfc5869Sha256KdfD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16Rfc5869Sha256Kdf11GenerateKeyEPKhmPhm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2805"
    }
   ],
   "linker_set_key" : "keymaster::RsaCryptOperation",
   "name" : "keymaster::RsaCryptOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2821",
   "self_type" : "type-2821",
   "size" : 264,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster17RsaCryptOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17RsaCryptOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17RsaCryptOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2830"
    }
   ],
   "linker_set_key" : "keymaster::RsaCryptingOperationFactory",
   "name" : "keymaster::RsaCryptingOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2834",
   "self_type" : "type-2834",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster27RsaCryptingOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27RsaCryptingOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27RsaCryptingOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27RsaCryptingOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2821"
    }
   ],
   "linker_set_key" : "keymaster::RsaDecryptOperation",
   "name" : "keymaster::RsaDecryptOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2827",
   "self_type" : "type-2827",
   "size" : 264,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster19RsaDecryptOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19RsaDecryptOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaDecryptOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaDecryptOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "mangled_component_name" : "_ZN9keymaster19RsaDecryptOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17RsaCryptOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2834"
    }
   ],
   "linker_set_key" : "keymaster::RsaDecryptionOperationFactory",
   "name" : "keymaster::RsaDecryptionOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2845",
   "self_type" : "type-2845",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster29RsaDecryptionOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29RsaDecryptionOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29RsaDecryptionOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29RsaDecryptionOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29RsaDecryptionOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29RsaDecryptionOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2805"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "digest_ctx_",
     "field_offset" : 2112,
     "referenced_type" : "type-2813"
    }
   ],
   "linker_set_key" : "keymaster::RsaDigestingOperation",
   "name" : "keymaster::RsaDigestingOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2812",
   "self_type" : "type-2812",
   "size" : 296,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster21RsaDigestingOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21RsaDigestingOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21RsaDigestingOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2830"
    }
   ],
   "linker_set_key" : "keymaster::RsaDigestingOperationFactory",
   "name" : "keymaster::RsaDigestingOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2833",
   "self_type" : "type-2833",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster28RsaDigestingOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28RsaDigestingOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28RsaDigestingOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28RsaDigestingOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28RsaDigestingOperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2821"
    }
   ],
   "linker_set_key" : "keymaster::RsaEncryptOperation",
   "name" : "keymaster::RsaEncryptOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2825",
   "self_type" : "type-2825",
   "size" : 264,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster19RsaEncryptOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19RsaEncryptOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaEncryptOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaEncryptOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "mangled_component_name" : "_ZN9keymaster19RsaEncryptOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17RsaCryptOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2834"
    }
   ],
   "linker_set_key" : "keymaster::RsaEncryptionOperationFactory",
   "name" : "keymaster::RsaEncryptionOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2842",
   "self_type" : "type-2842",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster29RsaEncryptionOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29RsaEncryptionOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29RsaEncryptionOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29RsaEncryptionOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29RsaEncryptionOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29RsaEncryptionOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1239"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "rsa_key_",
     "field_offset" : 1536,
     "referenced_type" : "type-2771"
    }
   ],
   "linker_set_key" : "keymaster::RsaKey",
   "name" : "keymaster::RsaKey",
   "record_kind" : "class",
   "referenced_type" : "type-2770",
   "self_type" : "type-2770",
   "size" : 200,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_key.h",
   "unique_id" : "_ZTSN9keymaster6RsaKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6RsaKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6RsaKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6RsaKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6RsaKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "mangled_component_name" : "_ZN9keymaster6RsaKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::RsaKey::RSA_Delete",
   "name" : "keymaster::RsaKey::RSA_Delete",
   "referenced_type" : "type-2775",
   "self_type" : "type-2775",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_key.h",
   "unique_id" : "_ZTSN9keymaster6RsaKey10RSA_DeleteE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1291"
    },
    {
     "referenced_type" : "type-1178"
    }
   ],
   "linker_set_key" : "keymaster::RsaKeyFactory",
   "name" : "keymaster::RsaKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2896",
   "self_type" : "type-2896",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_key_factory.h",
   "unique_id" : "_ZTSN9keymaster13RsaKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13RsaKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13RsaKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13RsaKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13RsaKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster13RsaKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster13RsaKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-286"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "rsa_key_",
     "field_offset" : 1536,
     "referenced_type" : "type-2780"
    },
    {
     "access" : "protected",
     "field_name" : "padding_",
     "field_offset" : 1600,
     "referenced_type" : "type-56"
    },
    {
     "access" : "protected",
     "field_name" : "data_",
     "field_offset" : 1664,
     "referenced_type" : "type-117"
    },
    {
     "access" : "protected",
     "field_name" : "digest_",
     "field_offset" : 1984,
     "referenced_type" : "type-60"
    },
    {
     "access" : "protected",
     "field_name" : "digest_algorithm_",
     "field_offset" : 2048,
     "referenced_type" : "type-2806"
    }
   ],
   "linker_set_key" : "keymaster::RsaOperation",
   "name" : "keymaster::RsaOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2805",
   "self_type" : "type-2805",
   "size" : 264,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster12RsaOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12RsaOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RsaOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RsaOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12RsaOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12RsaOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-703"
    }
   ],
   "linker_set_key" : "keymaster::RsaOperationFactory",
   "name" : "keymaster::RsaOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2830",
   "self_type" : "type-2830",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster19RsaOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19RsaOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2812"
    }
   ],
   "linker_set_key" : "keymaster::RsaSignOperation",
   "name" : "keymaster::RsaSignOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2816",
   "self_type" : "type-2816",
   "size" : 296,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster16RsaSignOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16RsaSignOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21RsaDigestingOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2833"
    }
   ],
   "linker_set_key" : "keymaster::RsaSigningOperationFactory",
   "name" : "keymaster::RsaSigningOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2835",
   "self_type" : "type-2835",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster26RsaSigningOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26RsaSigningOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26RsaSigningOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26RsaSigningOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28RsaDigestingOperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26RsaSigningOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26RsaSigningOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2833"
    }
   ],
   "linker_set_key" : "keymaster::RsaVerificationOperationFactory",
   "name" : "keymaster::RsaVerificationOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-2838",
   "self_type" : "type-2838",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster31RsaVerificationOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster31RsaVerificationOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster31RsaVerificationOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster31RsaVerificationOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28RsaDigestingOperationFactory21SupportedPaddingModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster31RsaVerificationOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster31RsaVerificationOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2812"
    }
   ],
   "linker_set_key" : "keymaster::RsaVerifyOperation",
   "name" : "keymaster::RsaVerifyOperation",
   "record_kind" : "class",
   "referenced_type" : "type-2819",
   "self_type" : "type-2819",
   "size" : 296,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster18RsaVerifyOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18RsaVerifyOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pm"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21RsaDigestingOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::Serializable",
   "name" : "keymaster::Serializable",
   "record_kind" : "class",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h",
   "unique_id" : "_ZTSN9keymaster12SerializableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12SerializableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SerializableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SerializableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable14SerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable9SerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12Serializable11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "blob_maker_",
     "field_offset" : 64,
     "referenced_type" : "type-1179"
    }
   ],
   "linker_set_key" : "keymaster::SoftKeyFactoryMixin",
   "name" : "keymaster::SoftKeyFactoryMixin",
   "record_kind" : "class",
   "referenced_type" : "type-1178",
   "self_type" : "type-1178",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/soft_key_factory.h",
   "unique_id" : "_ZTSN9keymaster19SoftKeyFactoryMixinE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SoftKeyFactoryMixinE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeyFactoryMixinD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeyFactoryMixinD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "keymaster::SoftwareKeyBlobMaker",
   "name" : "keymaster::SoftwareKeyBlobMaker",
   "record_kind" : "class",
   "referenced_type" : "type-1176",
   "self_type" : "type-1176",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/soft_key_factory.h",
   "unique_id" : "_ZTSN9keymaster20SoftwareKeyBlobMakerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftwareKeyBlobMakerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareKeyBlobMakerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareKeyBlobMakerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20SoftwareKeyBlobMaker13CreateKeyBlobERKNS_16AuthorizationSetE22keymaster_key_origin_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-717"
    }
   ],
   "linker_set_key" : "keymaster::SoftwareRandomSource",
   "name" : "keymaster::SoftwareRandomSource",
   "record_kind" : "class",
   "referenced_type" : "type-2957",
   "self_type" : "type-2957",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/software_random_source.h",
   "unique_id" : "_ZTSN9keymaster20SoftwareRandomSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftwareRandomSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareRandomSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareRandomSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftwareRandomSource14GenerateRandomEPhm"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::StaticAssert<true>",
   "name" : "keymaster::StaticAssert<true>",
   "referenced_type" : "type-379",
   "self_type" : "type-379",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12StaticAssertILb1EEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "linker_set_key" : "keymaster::SupportedAlgorithmsRequest",
   "name" : "keymaster::SupportedAlgorithmsRequest",
   "referenced_type" : "type-437",
   "self_type" : "type-437",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26SupportedAlgorithmsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26SupportedAlgorithmsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26SupportedAlgorithmsRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26SupportedAlgorithmsRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-460"
    }
   ],
   "linker_set_key" : "keymaster::SupportedAlgorithmsResponse",
   "name" : "keymaster::SupportedAlgorithmsResponse",
   "referenced_type" : "type-486",
   "self_type" : "type-486",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedAlgorithmsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedAlgorithmsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedAlgorithmsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedAlgorithmsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-450"
    }
   ],
   "linker_set_key" : "keymaster::SupportedBlockModesRequest",
   "name" : "keymaster::SupportedBlockModesRequest",
   "referenced_type" : "type-454",
   "self_type" : "type-454",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26SupportedBlockModesRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26SupportedBlockModesRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedBlockModesRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedBlockModesRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-466"
    }
   ],
   "linker_set_key" : "keymaster::SupportedBlockModesResponse",
   "name" : "keymaster::SupportedBlockModesResponse",
   "referenced_type" : "type-488",
   "self_type" : "type-488",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedBlockModesResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedBlockModesResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedBlockModesResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedBlockModesResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "field_offset" : 96,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "purpose",
     "field_offset" : 128,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "keymaster::SupportedByAlgorithmAndPurposeRequest",
   "name" : "keymaster::SupportedByAlgorithmAndPurposeRequest",
   "referenced_type" : "type-450",
   "self_type" : "type-450",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster37SupportedByAlgorithmAndPurposeRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster37SupportedByAlgorithmAndPurposeRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "field_offset" : 96,
     "referenced_type" : "type-51"
    }
   ],
   "linker_set_key" : "keymaster::SupportedByAlgorithmRequest",
   "name" : "keymaster::SupportedByAlgorithmRequest",
   "referenced_type" : "type-442",
   "self_type" : "type-442",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedByAlgorithmRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedByAlgorithmRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-450"
    }
   ],
   "linker_set_key" : "keymaster::SupportedDigestsRequest",
   "name" : "keymaster::SupportedDigestsRequest",
   "referenced_type" : "type-458",
   "self_type" : "type-458",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23SupportedDigestsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23SupportedDigestsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23SupportedDigestsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23SupportedDigestsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-476"
    }
   ],
   "linker_set_key" : "keymaster::SupportedDigestsResponse",
   "name" : "keymaster::SupportedDigestsResponse",
   "referenced_type" : "type-492",
   "self_type" : "type-492",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24SupportedDigestsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24SupportedDigestsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SupportedDigestsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SupportedDigestsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-442"
    }
   ],
   "linker_set_key" : "keymaster::SupportedExportFormatsRequest",
   "name" : "keymaster::SupportedExportFormatsRequest",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedExportFormatsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedExportFormatsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedExportFormatsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedExportFormatsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-481"
    }
   ],
   "linker_set_key" : "keymaster::SupportedExportFormatsResponse",
   "name" : "keymaster::SupportedExportFormatsResponse",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster30SupportedExportFormatsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster30SupportedExportFormatsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedExportFormatsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedExportFormatsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-442"
    }
   ],
   "linker_set_key" : "keymaster::SupportedImportFormatsRequest",
   "name" : "keymaster::SupportedImportFormatsRequest",
   "referenced_type" : "type-446",
   "self_type" : "type-446",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedImportFormatsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedImportFormatsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedImportFormatsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedImportFormatsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-481"
    }
   ],
   "linker_set_key" : "keymaster::SupportedImportFormatsResponse",
   "name" : "keymaster::SupportedImportFormatsResponse",
   "referenced_type" : "type-494",
   "self_type" : "type-494",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster30SupportedImportFormatsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster30SupportedImportFormatsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedImportFormatsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedImportFormatsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-450"
    }
   ],
   "linker_set_key" : "keymaster::SupportedPaddingModesRequest",
   "name" : "keymaster::SupportedPaddingModesRequest",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster28SupportedPaddingModesRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28SupportedPaddingModesRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28SupportedPaddingModesRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28SupportedPaddingModesRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-471"
    }
   ],
   "linker_set_key" : "keymaster::SupportedPaddingModesResponse",
   "name" : "keymaster::SupportedPaddingModesResponse",
   "referenced_type" : "type-490",
   "self_type" : "type-490",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedPaddingModesResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedPaddingModesResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedPaddingModesResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedPaddingModesResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 128,
     "referenced_type" : "type-367"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_algorithm_t>",
   "name" : "keymaster::SupportedResponse<keymaster_algorithm_t>",
   "referenced_type" : "type-460",
   "self_type" : "type-460",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-51" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI21keymaster_algorithm_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI21keymaster_algorithm_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 128,
     "referenced_type" : "type-467"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_block_mode_t>",
   "name" : "keymaster::SupportedResponse<keymaster_block_mode_t>",
   "referenced_type" : "type-466",
   "self_type" : "type-466",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-54" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI22keymaster_block_mode_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI22keymaster_block_mode_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 128,
     "referenced_type" : "type-477"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_digest_t>",
   "name" : "keymaster::SupportedResponse<keymaster_digest_t>",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI18keymaster_digest_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI18keymaster_digest_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 128,
     "referenced_type" : "type-482"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_key_format_t>",
   "name" : "keymaster::SupportedResponse<keymaster_key_format_t>",
   "referenced_type" : "type-481",
   "self_type" : "type-481",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-64" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI22keymaster_key_format_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI22keymaster_key_format_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 128,
     "referenced_type" : "type-472"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_padding_t>",
   "name" : "keymaster::SupportedResponse<keymaster_padding_t>",
   "referenced_type" : "type-471",
   "self_type" : "type-471",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI19keymaster_padding_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI19keymaster_padding_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-296"
    }
   ],
   "linker_set_key" : "keymaster::SymmetricKey",
   "name" : "keymaster::SymmetricKey",
   "record_kind" : "class",
   "referenced_type" : "type-1191",
   "self_type" : "type-1191",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/symmetric_key.h",
   "unique_id" : "_ZTSN9keymaster12SymmetricKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12SymmetricKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SymmetricKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SymmetricKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-300"
    },
    {
     "referenced_type" : "type-1178"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "random_source_",
     "field_offset" : 192,
     "referenced_type" : "type-1185"
    }
   ],
   "linker_set_key" : "keymaster::SymmetricKeyFactory",
   "name" : "keymaster::SymmetricKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1184",
   "self_type" : "type-1184",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/symmetric_key.h",
   "unique_id" : "_ZTSN9keymaster19SymmetricKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SymmetricKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SymmetricKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SymmetricKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory18key_size_supportedEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory14key_size_bytesEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory13key_size_bitsEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SymmetricKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster19SymmetricKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster19SymmetricKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "keymaster::TKeymasterBlob<keymaster_blob_t>",
   "name" : "keymaster::TKeymasterBlob<keymaster_blob_t>",
   "referenced_type" : "type-275",
   "self_type" : "type-275",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTSN9keymaster14TKeymasterBlobI16keymaster_blob_tEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-229"
    }
   ],
   "linker_set_key" : "keymaster::TKeymasterBlob<keymaster_key_blob_t>",
   "name" : "keymaster::TKeymasterBlob<keymaster_key_blob_t>",
   "referenced_type" : "type-297",
   "self_type" : "type-297",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-229" ],
   "unique_id" : "_ZTSN9keymaster14TKeymasterBlobI20keymaster_key_blob_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BIGNUM>",
   "name" : "keymaster::TagValueType<KM_BIGNUM>",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn2147483648EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BOOL>",
   "name" : "keymaster::TagValueType<KM_BOOL>",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1879048192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BYTES>",
   "name" : "keymaster::TagValueType<KM_BYTES>",
   "referenced_type" : "type-388",
   "self_type" : "type-388",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn1879048192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_DATE>",
   "name" : "keymaster::TagValueType<KM_DATE>",
   "referenced_type" : "type-383",
   "self_type" : "type-383",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1610612736EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_INVALID>",
   "name" : "keymaster::TagValueType<KM_INVALID>",
   "referenced_type" : "type-386",
   "self_type" : "type-386",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_UINT>",
   "name" : "keymaster::TagValueType<KM_UINT>",
   "referenced_type" : "type-384",
   "self_type" : "type-384",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t805306368EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_UINT_REP>",
   "name" : "keymaster::TagValueType<KM_UINT_REP>",
   "referenced_type" : "type-385",
   "self_type" : "type-385",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1073741824EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_ULONG>",
   "name" : "keymaster::TagValueType<KM_ULONG>",
   "referenced_type" : "type-381",
   "self_type" : "type-381",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1342177280EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_ULONG_REP>",
   "name" : "keymaster::TagValueType<KM_ULONG_REP>",
   "referenced_type" : "type-382",
   "self_type" : "type-382",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn1610612736EEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1191"
    }
   ],
   "linker_set_key" : "keymaster::TripleDesKey",
   "name" : "keymaster::TripleDesKey",
   "record_kind" : "class",
   "referenced_type" : "type-6396",
   "self_type" : "type-6396",
   "size" : 192,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/triple_des_key.h",
   "unique_id" : "_ZTSN9keymaster12TripleDesKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12TripleDesKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12TripleDesKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12TripleDesKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1184"
    }
   ],
   "linker_set_key" : "keymaster::TripleDesKeyFactory",
   "name" : "keymaster::TripleDesKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-6392",
   "self_type" : "type-6392",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/triple_des_key.h",
   "unique_id" : "_ZTSN9keymaster19TripleDesKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19TripleDesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19TripleDesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19TripleDesKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory18key_size_supportedEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory14key_size_bytesEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory13key_size_bitsEm"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19TripleDesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster19TripleDesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster19TripleDesKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, 268435461, keymaster_digest_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, 268435461, keymaster_digest_t>",
   "record_kind" : "class",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435461E18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, 268435463, keymaster_padding_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, 268435463, keymaster_padding_t>",
   "record_kind" : "class",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435463E19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t>",
   "record_kind" : "class",
   "referenced_type" : "type-365",
   "self_type" : "type-365",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-51" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435458E21keymaster_algorithm_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_BLOB_USAGE_REQUIREMENTS, keymaster_key_blob_usage_requirements_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_BLOB_USAGE_REQUIREMENTS, keymaster_key_blob_usage_requirements_t>",
   "record_kind" : "class",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435757E39keymaster_key_blob_usage_requirements_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_EC_CURVE, keymaster_ec_curve_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_EC_CURVE, keymaster_ec_curve_t>",
   "record_kind" : "class",
   "referenced_type" : "type-210",
   "self_type" : "type-210",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-211" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435466E20keymaster_ec_curve_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ORIGIN, keymaster_key_origin_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ORIGIN, keymaster_key_origin_t>",
   "record_kind" : "class",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-200" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268436158E22keymaster_key_origin_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_USER_AUTH_TYPE, hw_authenticator_type_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_USER_AUTH_TYPE, hw_authenticator_type_t>",
   "record_kind" : "class",
   "referenced_type" : "type-202",
   "self_type" : "type-202",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-203" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435960E23hw_authenticator_type_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_BLOCK_MODE, keymaster_block_mode_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_BLOCK_MODE, keymaster_block_mode_t>",
   "record_kind" : "class",
   "referenced_type" : "type-402",
   "self_type" : "type-402",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-54" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870916E22keymaster_block_mode_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_DIGEST, keymaster_digest_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_DIGEST, keymaster_digest_t>",
   "record_kind" : "class",
   "referenced_type" : "type-264",
   "self_type" : "type-264",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870917E18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_KDF, keymaster_kdf_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_KDF, keymaster_kdf_t>",
   "record_kind" : "class",
   "referenced_type" : "type-205",
   "self_type" : "type-205",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-206" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870921E15keymaster_kdf_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PADDING, keymaster_padding_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PADDING, keymaster_padding_t>",
   "record_kind" : "class",
   "referenced_type" : "type-309",
   "self_type" : "type-309",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870918E19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PURPOSE, keymaster_purpose_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PURPOSE, keymaster_purpose_t>",
   "record_kind" : "class",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870913E19keymaster_purpose_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALLOW_WHILE_ON_BODY>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALLOW_WHILE_ON_BODY>",
   "record_kind" : "class",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048698EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_APPLICATIONS>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_APPLICATIONS>",
   "record_kind" : "class",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048792EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_USERS>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_USERS>",
   "record_kind" : "class",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048692EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_BOOTLOADER_ONLY>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_BOOTLOADER_ONLY>",
   "record_kind" : "class",
   "referenced_type" : "type-167",
   "self_type" : "type-167",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048494EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_CALLER_NONCE>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_CALLER_NONCE>",
   "record_kind" : "class",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048199EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ECIES_SINGLE_HASH_MODE>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ECIES_SINGLE_HASH_MODE>",
   "record_kind" : "class",
   "referenced_type" : "type-222",
   "self_type" : "type-222",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048393EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_INCLUDE_UNIQUE_ID>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_INCLUDE_UNIQUE_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048394EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_NO_AUTH_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_NO_AUTH_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-243",
   "self_type" : "type-243",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048695EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_RESET_SINCE_ID_ROTATION>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_RESET_SINCE_ID_ROTATION>",
   "record_kind" : "class",
   "referenced_type" : "type-1319",
   "self_type" : "type-1319",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879049196EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ROLLBACK_RESISTANT>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ROLLBACK_RESISTANT>",
   "record_kind" : "class",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048895EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_TRUSTED_CONFIRMATION_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_TRUSTED_CONFIRMATION_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-252",
   "self_type" : "type-252",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048700EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_UNLOCKED_DEVICE_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_UNLOCKED_DEVICE_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048701EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_DATA>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_DATA>",
   "record_kind" : "class",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047492EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047591EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ASSOCIATED_DATA>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ASSOCIATED_DATA>",
   "record_kind" : "class",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_APPLICATION_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_APPLICATION_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047483EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_CHALLENGE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_CHALLENGE>",
   "record_kind" : "class",
   "referenced_type" : "type-1317",
   "self_type" : "type-1317",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047484EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_BRAND>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_BRAND>",
   "record_kind" : "class",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047482EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_DEVICE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_DEVICE>",
   "record_kind" : "class",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047481EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_IMEI>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_IMEI>",
   "record_kind" : "class",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047478EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MANUFACTURER>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MANUFACTURER>",
   "record_kind" : "class",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047476EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MEID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MEID>",
   "record_kind" : "class",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047477EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MODEL>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MODEL>",
   "record_kind" : "class",
   "referenced_type" : "type-189",
   "self_type" : "type-189",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047475EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_PRODUCT>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_PRODUCT>",
   "record_kind" : "class",
   "referenced_type" : "type-178",
   "self_type" : "type-178",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047480EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_SERIAL>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_SERIAL>",
   "record_kind" : "class",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047479EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_AUTH_TOKEN>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_AUTH_TOKEN>",
   "record_kind" : "class",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047190EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_NONCE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_NONCE>",
   "record_kind" : "class",
   "referenced_type" : "type-164",
   "self_type" : "type-164",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047191EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ROOT_OF_TRUST>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ROOT_OF_TRUST>",
   "record_kind" : "class",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047488EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_UNIQUE_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_UNIQUE_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047485EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_ACTIVE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_ACTIVE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613136EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_CREATION_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_CREATION_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613437EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_ORIGINATION_EXPIRE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_ORIGINATION_EXPIRE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-230",
   "self_type" : "type-230",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613137EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_USAGE_EXPIRE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_USAGE_EXPIRE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-232",
   "self_type" : "type-232",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613138EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_INVALID, KM_TAG_INVALID>",
   "name" : "keymaster::TypedTag<KM_INVALID, KM_TAG_INVALID>",
   "record_kind" : "class",
   "referenced_type" : "type-213",
   "self_type" : "type-213",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t0EL15keymaster_tag_t0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_AUTH_TIMEOUT>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_AUTH_TIMEOUT>",
   "record_kind" : "class",
   "referenced_type" : "type-245",
   "self_type" : "type-245",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306873EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_KEY_SIZE>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_KEY_SIZE>",
   "record_kind" : "class",
   "referenced_type" : "type-390",
   "self_type" : "type-390",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306371EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAC_LENGTH>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAC_LENGTH>",
   "record_kind" : "class",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307371EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAX_USES_PER_BOOT>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAX_USES_PER_BOOT>",
   "record_kind" : "class",
   "referenced_type" : "type-236",
   "self_type" : "type-236",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306772EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_MAC_LENGTH>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_MAC_LENGTH>",
   "record_kind" : "class",
   "referenced_type" : "type-220",
   "self_type" : "type-220",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306376EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_SECONDS_BETWEEN_OPS>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_SECONDS_BETWEEN_OPS>",
   "record_kind" : "class",
   "referenced_type" : "type-234",
   "self_type" : "type-234",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306771EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_PATCHLEVEL>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_PATCHLEVEL>",
   "record_kind" : "class",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307074EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_VERSION>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_VERSION>",
   "record_kind" : "class",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307073EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_USER_ID>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_USER_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306869EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_ULONG, KM_TAG_RSA_PUBLIC_EXPONENT>",
   "name" : "keymaster::TypedTag<KM_ULONG, KM_TAG_RSA_PUBLIC_EXPONENT>",
   "record_kind" : "class",
   "referenced_type" : "type-392",
   "self_type" : "type-392",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1342177280EL15keymaster_tag_t1342177480EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_ULONG_REP, KM_TAG_USER_SECURE_ID>",
   "name" : "keymaster::TypedTag<KM_ULONG_REP, KM_TAG_USER_SECURE_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-394",
   "self_type" : "type-394",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1610612736EL15keymaster_tag_tn1610612234EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-283"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<UniquePtr<Operation, DefaultDelete<Operation> > [], keymaster::DefaultDelete<UniquePtr<Operation, DefaultDelete<Operation> > []> >",
   "name" : "keymaster::UniquePtr<UniquePtr<Operation, DefaultDelete<Operation> > [], keymaster::DefaultDelete<UniquePtr<Operation, DefaultDelete<Operation> > []> >",
   "record_kind" : "class",
   "referenced_type" : "type-282",
   "self_type" : "type-282",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-292", "type-293" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_NS0_INS_9OperationENS_13DefaultDeleteIS1_EEEENS2_IS5_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2147"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<X509_extension_st, keymaster::OpenSslObjectDeleter<X509_extension_st, &X509_EXTENSION_free> >",
   "name" : "keymaster::UniquePtr<X509_extension_st, keymaster::OpenSslObjectDeleter<X509_extension_st, &X509_EXTENSION_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2146",
   "self_type" : "type-2146",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2149", "type-2150" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI17X509_extension_stNS_20OpenSslObjectDeleterIS1_XadL_Z19X509_EXTENSION_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2157"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<X509_name_st, keymaster::OpenSslObjectDeleter<X509_name_st, &X509_NAME_free> >",
   "name" : "keymaster::UniquePtr<X509_name_st, keymaster::OpenSslObjectDeleter<X509_name_st, &X509_NAME_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2156",
   "self_type" : "type-2156",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2159", "type-2160" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI12X509_name_stNS_20OpenSslObjectDeleterIS1_XadL_Z14X509_NAME_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2263"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<asn1_object_st, keymaster::OpenSslObjectDeleter<asn1_object_st, &ASN1_OBJECT_free> >",
   "name" : "keymaster::UniquePtr<asn1_object_st, keymaster::OpenSslObjectDeleter<asn1_object_st, &ASN1_OBJECT_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2262",
   "self_type" : "type-2262",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2265", "type-2207" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI14asn1_object_stNS_20OpenSslObjectDeleterIS1_XadL_Z16ASN1_OBJECT_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2255"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<asn1_string_st, keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_BIT_STRING_free> >",
   "name" : "keymaster::UniquePtr<asn1_string_st, keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_BIT_STRING_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2254",
   "self_type" : "type-2254",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2257", "type-2204" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI14asn1_string_stNS_20OpenSslObjectDeleterIS1_XadL_Z20ASN1_BIT_STRING_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1364"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<asn1_string_st, keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_INTEGER_free> >",
   "name" : "keymaster::UniquePtr<asn1_string_st, keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_INTEGER_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-1363",
   "self_type" : "type-1363",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1366", "type-1356" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI14asn1_string_stNS_20OpenSslObjectDeleterIS1_XadL_Z17ASN1_INTEGER_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2255"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<asn1_string_st, keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_OCTET_STRING_free> >",
   "name" : "keymaster::UniquePtr<asn1_string_st, keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_OCTET_STRING_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2270",
   "self_type" : "type-2270",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2271", "type-2211" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI14asn1_string_stNS_20OpenSslObjectDeleterIS1_XadL_Z22ASN1_OCTET_STRING_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2255"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<asn1_string_st, keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_TIME_free> >",
   "name" : "keymaster::UniquePtr<asn1_string_st, keymaster::OpenSslObjectDeleter<asn1_string_st, &ASN1_TIME_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2275",
   "self_type" : "type-2275",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2276", "type-2214" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI14asn1_string_stNS_20OpenSslObjectDeleterIS1_XadL_Z14ASN1_TIME_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2707"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<bignum_ctx, keymaster::OpenSslObjectDeleter<bignum_ctx, &BN_CTX_free> >",
   "name" : "keymaster::UniquePtr<bignum_ctx, keymaster::OpenSslObjectDeleter<bignum_ctx, &BN_CTX_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2716",
   "self_type" : "type-2716",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2717", "type-2712" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI10bignum_ctxNS_20OpenSslObjectDeleterIS1_XadL_Z11BN_CTX_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1371"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<bignum_st, keymaster::OpenSslObjectDeleter<bignum_st, &BN_free> >",
   "name" : "keymaster::UniquePtr<bignum_st, keymaster::OpenSslObjectDeleter<bignum_st, &BN_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-1370",
   "self_type" : "type-1370",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1373", "type-1359" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI9bignum_stNS_20OpenSslObjectDeleterIS1_XadL_Z7BN_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2338"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<cmac_ctx_st, keymaster::OpenSslObjectDeleter<cmac_ctx_st, &CMAC_CTX_free> >",
   "name" : "keymaster::UniquePtr<cmac_ctx_st, keymaster::OpenSslObjectDeleter<cmac_ctx_st, &CMAC_CTX_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2337",
   "self_type" : "type-2337",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2340", "type-2335" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI11cmac_ctx_stNS_20OpenSslObjectDeleterIS1_XadL_Z13CMAC_CTX_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2441"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<ec_group_st, keymaster::OpenSslObjectDeleter<ec_group_st, &EC_GROUP_free> >",
   "name" : "keymaster::UniquePtr<ec_group_st, keymaster::OpenSslObjectDeleter<ec_group_st, &EC_GROUP_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2440",
   "self_type" : "type-2440",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2443", "type-2411" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI11ec_group_stNS_20OpenSslObjectDeleterIS1_XadL_Z13EC_GROUP_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1110"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<ec_key_st, keymaster::OpenSslObjectDeleter<ec_key_st, &EC_KEY_free> >",
   "name" : "keymaster::UniquePtr<ec_key_st, keymaster::OpenSslObjectDeleter<ec_key_st, &EC_KEY_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-1109",
   "self_type" : "type-1109",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1112", "type-1099" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI9ec_key_stNS_20OpenSslObjectDeleterIS1_XadL_Z11EC_KEY_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2691"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<ec_point_st, keymaster::OpenSslObjectDeleter<ec_point_st, &EC_POINT_free> >",
   "name" : "keymaster::UniquePtr<ec_point_st, keymaster::OpenSslObjectDeleter<ec_point_st, &EC_POINT_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2690",
   "self_type" : "type-2690",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2693", "type-2683" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI11ec_point_stNS_20OpenSslObjectDeleterIS1_XadL_Z13EC_POINT_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2948"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<evp_pkey_ctx_st, keymaster::EVP_PKEY_CTX_Delete>",
   "name" : "keymaster::UniquePtr<evp_pkey_ctx_st, keymaster::EVP_PKEY_CTX_Delete>",
   "record_kind" : "class",
   "referenced_type" : "type-2947",
   "self_type" : "type-2947",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2950", "type-2951" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI15evp_pkey_ctx_stNS_19EVP_PKEY_CTX_DeleteEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1117"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<evp_pkey_st, keymaster::OpenSslObjectDeleter<evp_pkey_st, &EVP_PKEY_free> >",
   "name" : "keymaster::UniquePtr<evp_pkey_st, keymaster::OpenSslObjectDeleter<evp_pkey_st, &EVP_PKEY_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-1116",
   "self_type" : "type-1116",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1119", "type-1102" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI11evp_pkey_stNS_20OpenSslObjectDeleterIS1_XadL_Z13EVP_PKEY_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1240"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::AsymmetricKey, keymaster::DefaultDelete<keymaster::AsymmetricKey> >",
   "name" : "keymaster::UniquePtr<keymaster::AsymmetricKey, keymaster::DefaultDelete<keymaster::AsymmetricKey> >",
   "record_kind" : "class",
   "referenced_type" : "type-1302",
   "self_type" : "type-1302",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1239", "type-1298" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2586"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::HmacOperation, keymaster::DefaultDelete<keymaster::HmacOperation> >",
   "name" : "keymaster::UniquePtr<keymaster::HmacOperation, keymaster::DefaultDelete<keymaster::HmacOperation> >",
   "record_kind" : "class",
   "referenced_type" : "type-2585",
   "self_type" : "type-2585",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2588", "type-2589" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_13HmacOperationENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-736"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::Key, keymaster::DefaultDelete<keymaster::Key> >",
   "name" : "keymaster::UniquePtr<keymaster::Key, keymaster::DefaultDelete<keymaster::Key> >",
   "record_kind" : "class",
   "referenced_type" : "type-735",
   "self_type" : "type-735",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-296", "type-575" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_3KeyENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2488"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::KeyExchange, keymaster::DefaultDelete<keymaster::KeyExchange> >",
   "name" : "keymaster::UniquePtr<keymaster::KeyExchange, keymaster::DefaultDelete<keymaster::KeyExchange> >",
   "record_kind" : "class",
   "referenced_type" : "type-2505",
   "self_type" : "type-2505",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2481", "type-2480" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_11KeyExchangeENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-218"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::KeymasterContext, keymaster::DefaultDelete<keymaster::KeymasterContext> >",
   "name" : "keymaster::UniquePtr<keymaster::KeymasterContext, keymaster::DefaultDelete<keymaster::KeymasterContext> >",
   "record_kind" : "class",
   "referenced_type" : "type-349",
   "self_type" : "type-349",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-42", "type-41" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_16KeymasterContextENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2510"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::NistCurveKeyExchange, keymaster::DefaultDelete<keymaster::NistCurveKeyExchange> >",
   "name" : "keymaster::UniquePtr<keymaster::NistCurveKeyExchange, keymaster::DefaultDelete<keymaster::NistCurveKeyExchange> >",
   "record_kind" : "class",
   "referenced_type" : "type-2698",
   "self_type" : "type-2698",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2509", "type-2669" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_20NistCurveKeyExchangeENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-285"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::Operation, keymaster::DefaultDelete<keymaster::Operation> >",
   "name" : "keymaster::UniquePtr<keymaster::Operation, keymaster::DefaultDelete<keymaster::Operation> >",
   "record_kind" : "class",
   "referenced_type" : "type-284",
   "self_type" : "type-284",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-286", "type-291" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_9OperationENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-353"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::OperationTable, keymaster::DefaultDelete<keymaster::OperationTable> >",
   "name" : "keymaster::UniquePtr<keymaster::OperationTable, keymaster::DefaultDelete<keymaster::OperationTable> >",
   "record_kind" : "class",
   "referenced_type" : "type-352",
   "self_type" : "type-352",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-281", "type-280" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_14OperationTableENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2498"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::Rfc5869Sha256Kdf, keymaster::DefaultDelete<keymaster::Rfc5869Sha256Kdf> >",
   "name" : "keymaster::UniquePtr<keymaster::Rfc5869Sha256Kdf, keymaster::DefaultDelete<keymaster::Rfc5869Sha256Kdf> >",
   "record_kind" : "class",
   "referenced_type" : "type-2506",
   "self_type" : "type-2506",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2490", "type-2489" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_16Rfc5869Sha256KdfENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2809"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::RsaOperation, keymaster::DefaultDelete<keymaster::RsaOperation> >",
   "name" : "keymaster::UniquePtr<keymaster::RsaOperation, keymaster::DefaultDelete<keymaster::RsaOperation> >",
   "record_kind" : "class",
   "referenced_type" : "type-2943",
   "self_type" : "type-2943",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2805", "type-2921" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_12RsaOperationENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1348"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::km_key_description, keymaster::KM_KEY_DESCRIPTION_Delete>",
   "name" : "keymaster::UniquePtr<keymaster::km_key_description, keymaster::KM_KEY_DESCRIPTION_Delete>",
   "record_kind" : "class",
   "referenced_type" : "type-1377",
   "self_type" : "type-1377",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1162", "type-1378" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_18km_key_descriptionENS_25KM_KEY_DESCRIPTION_DeleteEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-6448"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::km_wrapped_key, keymaster::KM_WRAPPED_KEY_Delete>",
   "name" : "keymaster::UniquePtr<keymaster::km_wrapped_key, keymaster::KM_WRAPPED_KEY_Delete>",
   "record_kind" : "class",
   "referenced_type" : "type-6453",
   "self_type" : "type-6453",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-6449", "type-6454" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_14km_wrapped_keyENS_21KM_WRAPPED_KEY_DeleteEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-367"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_algorithm_t [], keymaster::DefaultDelete<keymaster_algorithm_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_algorithm_t [], keymaster::DefaultDelete<keymaster_algorithm_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-607",
   "self_type" : "type-607",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-500", "type-499" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_21keymaster_algorithm_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-467"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_block_mode_t [], keymaster::DefaultDelete<keymaster_block_mode_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_block_mode_t [], keymaster::DefaultDelete<keymaster_block_mode_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-705",
   "self_type" : "type-705",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-564", "type-563" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_22keymaster_block_mode_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-730"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_cert_chain_t, keymaster::CertificateChainDelete>",
   "name" : "keymaster::UniquePtr<keymaster_cert_chain_t, keymaster::CertificateChainDelete>",
   "record_kind" : "class",
   "referenced_type" : "type-729",
   "self_type" : "type-729",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-572", "type-325" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI22keymaster_cert_chain_tNS_22CertificateChainDeleteEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-477"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_digest_t [], keymaster::DefaultDelete<keymaster_digest_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_digest_t [], keymaster::DefaultDelete<keymaster_digest_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-764",
   "self_type" : "type-764",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-699", "type-698" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_18keymaster_digest_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-482"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_key_format_t [], keymaster::DefaultDelete<keymaster_key_format_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_key_format_t [], keymaster::DefaultDelete<keymaster_key_format_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-791",
   "self_type" : "type-791",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-721", "type-720" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_22keymaster_key_format_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-472"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_padding_t [], keymaster::DefaultDelete<keymaster_padding_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_padding_t [], keymaster::DefaultDelete<keymaster_padding_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-635", "type-634" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_19keymaster_padding_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2725"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<pkcs8_priv_key_info_st, keymaster::OpenSslObjectDeleter<pkcs8_priv_key_info_st, &PKCS8_PRIV_KEY_INFO_free> >",
   "name" : "keymaster::UniquePtr<pkcs8_priv_key_info_st, keymaster::OpenSslObjectDeleter<pkcs8_priv_key_info_st, &PKCS8_PRIV_KEY_INFO_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2724",
   "self_type" : "type-2724",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2727", "type-2728" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI22pkcs8_priv_key_info_stNS_20OpenSslObjectDeleterIS1_XadL_Z24PKCS8_PRIV_KEY_INFO_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1125"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<rsa_st, keymaster::OpenSslObjectDeleter<rsa_st, &RSA_free> >",
   "name" : "keymaster::UniquePtr<rsa_st, keymaster::OpenSslObjectDeleter<rsa_st, &RSA_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-1124",
   "self_type" : "type-1124",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1127", "type-1106" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI6rsa_stNS_20OpenSslObjectDeleterIS1_XadL_Z8RSA_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2772"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<rsa_st, keymaster::RsaKey::RSA_Delete>",
   "name" : "keymaster::UniquePtr<rsa_st, keymaster::RsaKey::RSA_Delete>",
   "record_kind" : "class",
   "referenced_type" : "type-2771",
   "self_type" : "type-2771",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2774", "type-2775" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI6rsa_stNS_6RsaKey10RSA_DeleteEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-119"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<unsigned char [], keymaster::DefaultDelete<unsigned char []> >",
   "name" : "keymaster::UniquePtr<unsigned char [], keymaster::DefaultDelete<unsigned char []> >",
   "record_kind" : "class",
   "referenced_type" : "type-118",
   "self_type" : "type-118",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2", "type-1" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_hNS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2167"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<v3_ext_ctx, keymaster::DefaultDelete<v3_ext_ctx> >",
   "name" : "keymaster::UniquePtr<v3_ext_ctx, keymaster::DefaultDelete<v3_ext_ctx> >",
   "record_kind" : "class",
   "referenced_type" : "type-2166",
   "self_type" : "type-2166",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2169", "type-2170" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI10v3_ext_ctxNS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-2137"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<x509_st, keymaster::OpenSslObjectDeleter<x509_st, &X509_free> >",
   "name" : "keymaster::UniquePtr<x509_st, keymaster::OpenSslObjectDeleter<x509_st, &X509_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-2142",
   "self_type" : "type-2142",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-2143", "type-2139" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI7x509_stNS_20OpenSslObjectDeleterIS1_XadL_Z9X509_freeEEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "input",
     "field_offset" : 192,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 512,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::UpdateOperationRequest",
   "name" : "keymaster::UpdateOperationRequest",
   "referenced_type" : "type-516",
   "self_type" : "type-516",
   "size" : 144,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22UpdateOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22UpdateOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22UpdateOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22UpdateOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "output",
     "field_offset" : 128,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "input_consumed",
     "field_offset" : 448,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 512,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::UpdateOperationResponse",
   "name" : "keymaster::UpdateOperationResponse",
   "referenced_type" : "type-518",
   "self_type" : "type-518",
   "size" : 144,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23UpdateOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23UpdateOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23UpdateOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23UpdateOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 128,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "upgrade_params",
     "field_offset" : 256,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "keymaster::UpgradeKeyRequest",
   "name" : "keymaster::UpgradeKeyRequest",
   "referenced_type" : "type-577",
   "self_type" : "type-577",
   "size" : 112,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17UpgradeKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17UpgradeKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17UpgradeKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17UpgradeKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "upgraded_key",
     "field_offset" : 128,
     "referenced_type" : "type-229"
    }
   ],
   "linker_set_key" : "keymaster::UpgradeKeyResponse",
   "name" : "keymaster::UpgradeKeyResponse",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18UpgradeKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18UpgradeKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18UpgradeKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18UpgradeKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "parameters_verified",
     "field_offset" : 192,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "security_level",
     "field_offset" : 832,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "mac",
     "field_offset" : 896,
     "referenced_type" : "type-275"
    }
   ],
   "linker_set_key" : "keymaster::VerificationToken",
   "name" : "keymaster::VerificationToken",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 128,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17VerificationTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17VerificationTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17VerificationTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17VerificationTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17VerificationToken14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17VerificationToken9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17VerificationToken11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-339"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "parameters_to_verify",
     "field_offset" : 192,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "auth_token",
     "field_offset" : 832,
     "referenced_type" : "type-611"
    }
   ],
   "linker_set_key" : "keymaster::VerifyAuthorizationRequest",
   "name" : "keymaster::VerifyAuthorizationRequest",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 168,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26VerifyAuthorizationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26VerifyAuthorizationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26VerifyAuthorizationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26VerifyAuthorizationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-338"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "error",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "token",
     "field_offset" : 192,
     "referenced_type" : "type-614"
    }
   ],
   "linker_set_key" : "keymaster::VerifyAuthorizationResponse",
   "name" : "keymaster::VerifyAuthorizationResponse",
   "referenced_type" : "type-622",
   "self_type" : "type-622",
   "size" : 152,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27VerifyAuthorizationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27VerifyAuthorizationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27VerifyAuthorizationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27VerifyAuthorizationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Void",
   "name" : "keymaster::Void",
   "record_kind" : "class",
   "referenced_type" : "type-380",
   "self_type" : "type-380",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster4VoidE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "purpose",
     "referenced_type" : "type-1156"
    },
    {
     "field_name" : "algorithm",
     "field_offset" : 64,
     "referenced_type" : "type-1142"
    },
    {
     "field_name" : "key_size",
     "field_offset" : 128,
     "referenced_type" : "type-1142"
    },
    {
