{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [4]",
   "name" : "unsigned char [4]",
   "referenced_type" : "type-3",
   "self_type" : "type-17",
   "size" : 4,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [8]",
   "name" : "unsigned char [8]",
   "referenced_type" : "type-3",
   "self_type" : "type-5",
   "size" : 8,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [2]",
   "name" : "unsigned int [2]",
   "referenced_type" : "type-7",
   "self_type" : "type-12",
   "size" : 8,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [32768]",
   "name" : "unsigned int [32768]",
   "referenced_type" : "type-7",
   "self_type" : "type-53",
   "size" : 131072,
   "source_file" : "/external/lz4/lib/lz4hc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [3]",
   "name" : "unsigned int [3]",
   "referenced_type" : "type-7",
   "self_type" : "type-67",
   "size" : 12,
   "source_file" : "/external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [4096]",
   "name" : "unsigned int [4096]",
   "referenced_type" : "type-7",
   "self_type" : "type-29",
   "size" : 16384,
   "source_file" : "/external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [4]",

   "referenced_type" : "type-14",
   "self_type" : "type-13",
   "size" : 8,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const XXH64_canonical_t *",
   "name" : "const XXH64_canonical_t *",
   "referenced_type" : "type-24",
   "self_type" : "type-25",
   "size" : 8,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const XXH64_state_s *",
   "name" : "const XXH64_state_s *",
   "referenced_type" : "type-21",
   "self_type" : "type-22",
   "size" : 8,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const char *",
   "name" : "const char *",
   "referenced_type" : "type-42",
   "self_type" : "type-41",
   "size" : 8,
   "source_file" : "/external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const unsigned char *",
   "name" : "const unsigned char *",
   "referenced_type" : "type-2",
   "self_type" : "type-31",
   "size" : 8,
   "source_file" : "/external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "const void *",
   "name" : "const void *",
   "referenced_type" : "type-70",
   "self_type" : "type-71",
   "size" : 8,
   "source_file" : "/external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "int *",
   "name" : "int *",
   "referenced_type" : "type-1",
   "self_type" : "type-47",
   "size" : 8,
   "source_file" : "/external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned long *",
   "name" : "unsigned long *",
   "referenced_type" : "type-36",
   "self_type" : "type-83",
   "size" : 8,
   "source_file" : "/external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-45",
   "self_type" : "type-46",
   "size" : 8,
   "source_file" : "/external/lz4/lib/lz4.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const LZ4F_CDict_s",
   "name" : "const LZ4F_CDict_s",
   "referenced_type" : "type-90",
   "self_type" : "type-89",
   "size" : 24,
   "source_file" : "/external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const LZ4F_compressOptions_t",
   "name" : "const LZ4F_compressOptions_t",
   "referenced_type" : "type-72",
   "self_type" : "type-76",
   "size" : 16,
   "source_file" : "/external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const LZ4F_decompressOptions_t",
   "name" : "const LZ4F_decompressOptions_t",
   "referenced_type" : "type-78",
   "self_type" : "type-84",
   "size" : 16,
   "source_file" : "/external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const LZ4F_preferences_t",
   "name" : "const LZ4F_preferences_t",
   "referenced_type" : "type-66",
   "self_type" : "type-68",
   "size" : 56,
   "source_file" : "/external/lz4/lib/lz4frame.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const LZ4HC_CCtx_internal",
   "name" : "const LZ4HC_CCtx_internal",
   "referenced_type" : "type-52",
   "self_type" : "type-57",
   "size" : 262192,
   "source_file" : "/external/lz4/lib/lz4hc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const LZ4_streamHC_u",
   "name" : "const LZ4_streamHC_u",
   "referenced_type" : "type-50",
   "self_type" : "type-58",
   "size" : 262200,
   "source_file" : "/external/lz4/lib/lz4hc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const LZ4_stream_t_internal",
   "name" : "const LZ4_stream_t_internal",
   "referenced_type" : "type-28",
   "self_type" : "type-27",
   "size" : 16416,
   "source_file" : "/external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const LZ4_stream_u",
   "name" : "const LZ4_stream_u",
   "referenced_type" : "type-38",
   "self_type" : "type-37",
   "size" : 16416,
   "source_file" : "/external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const XXH32_canonical_t",
   "name" : "const XXH32_canonical_t",
   "referenced_type" : "type-16",
   "self_type" : "type-18",
   "size" : 4,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const XXH32_state_s",
   "name" : "const XXH32_state_s",
   "referenced_type" : "type-6",
   "self_type" : "type-14",
   "size" : 48,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const XXH64_canonical_t",
   "name" : "const XXH64_canonical_t",
   "referenced_type" : "type-4",
   "self_type" : "type-24",
   "size" : 8,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const XXH64_state_s",
   "name" : "const XXH64_state_s",
   "referenced_type" : "type-9",
   "self_type" : "type-21",
   "size" : 88,
   "source_file" : "/external/lz4/lib/xxhash.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-43",
   "self_type" : "type-42",
   "size" : 1,
   "source_file" : "/external/lz4/lib/lz4.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-3",
   "self_type" : "type-2",
   "size" : 1,
   "source_file" : "/external/lz4/lib/lz4.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-45",
   "self_type" : "type-70",
   "source_file" : "/external/lz4/lib/lz4frame.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stableSrc",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-67"
    }
   ],
   "linker_set_key" : "LZ4F_compressOptions_t",
   "name" : "LZ4F_compressOptions_t",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 16,
   "source_file" : "/external/lz4/lib/lz4frame.h",
   "unique_id" : "LZ4F_compressOptions_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stableDst",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-67"
    }
   ],
   "linker_set_key" : "LZ4F_decompressOptions_t",
   "name" : "LZ4F_decompressOptions_t",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 16,
   "source_file" : "/external/lz4/lib/lz4frame.h",
   "unique_id" : "LZ4F_decompressOptions_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "blockSizeID",
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "blockMode",
     "field_offset" : 32,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "contentChecksumFlag",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "frameType",
     "field_offset" : 96,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "contentSize",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "dictID",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "blockChecksumFlag",
     "field_offset" : 224,
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "LZ4F_frameInfo_t",
   "name" : "LZ4F_frameInfo_t",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 32,
   "source_file" : "/external/lz4/lib/lz4frame.h",
   "unique_id" : "LZ4F_frameInfo_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameInfo",
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "compressionLevel",
     "field_offset" : 256,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "autoFlush",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "favorDecSpeed",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 352,
     "referenced_type" : "type-67"
    }
   ],
   "linker_set_key" : "LZ4F_preferences_t",
   "name" : "LZ4F_preferences_t",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 56,
   "source_file" : "/external/lz4/lib/lz4frame.h",
   "unique_id" : "LZ4F_preferences_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hashTable",
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "chainTable",
     "field_offset" : 1048576,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "end",
     "field_offset" : 2097152,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "base",
     "field_offset" : 2097216,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "dictBase",
     "field_offset" : 2097280,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "dictLimit",
     "field_offset" : 2097344,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "lowLimit",
     "field_offset" : 2097376,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nextToUpdate",
     "field_offset" : 2097408,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "compressionLevel",
     "field_offset" : 2097440,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "favorDecSpeed",
     "field_offset" : 2097456,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "dictCtx",
     "field_offset" : 2097472,
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "LZ4HC_CCtx_internal",
   "name" : "LZ4HC_CCtx_internal",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 262192,
   "source_file" : "/external/lz4/lib/lz4hc.h",
   "unique_id" : "LZ4HC_CCtx_internal"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "externalDict",
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "extDictSize",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "prefixEnd",
     "field_offset" : 128,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "prefixSize",
     "field_offset" : 192,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "LZ4_streamDecode_t_internal",
   "name" : "LZ4_streamDecode_t_internal",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 32,
   "source_file" : "/external/lz4/lib/lz4.h",
   "unique_id" : "LZ4_streamDecode_t_internal"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "table",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "internal_donotuse",
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "LZ4_streamDecode_u",
   "name" : "LZ4_streamDecode_u",
   "record_kind" : "union",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 32,
   "source_file" : "/external/lz4/lib/lz4.h",
   "unique_id" : "LZ4_streamDecode_u"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "table",
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "internal_donotuse",
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "LZ4_streamHC_u",
   "name" : "LZ4_streamHC_u",
   "record_kind" : "union",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 262200,
   "source_file" : "/external/lz4/lib/lz4hc.h",
   "unique_id" : "LZ4_streamHC_u"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hashTable",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "currentOffset",
     "field_offset" : 131072,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "initCheck",
     "field_offset" : 131104,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "tableType",
     "field_offset" : 131120,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "dictionary",
     "field_offset" : 131136,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "dictCtx",
     "field_offset" : 131200,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "dictSize",
     "field_offset" : 131264,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "LZ4_stream_t_internal",
   "name" : "LZ4_stream_t_internal",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 16416,
   "source_file" : "/external/lz4/lib/lz4.h",
   "unique_id" : "LZ4_stream_t_internal"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "table",
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "internal_donotuse",
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "LZ4_stream_u",
   "name" : "LZ4_stream_u",
   "record_kind" : "union",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 16416,
   "source_file" : "/external/lz4/lib/lz4.h",
   "unique_id" : "LZ4_stream_u"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "digest",
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "XXH32_canonical_t",
   "name" : "XXH32_canonical_t",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 4,
   "source_file" : "/external/lz4/lib/xxhash.h",
   "unique_id" : "XXH32_canonical_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "total_len_32",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "large_len",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "v1",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "v2",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "v3",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "v4",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mem32",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "memsize",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 352,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "XXH32_state_s",
   "name" : "XXH32_state_s",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 48,
   "source_file" : "/external/lz4/lib/xxhash.h",
   "unique_id" : "XXH32_state_s"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "digest",
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "XXH64_canonical_t",
   "name" : "XXH64_canonical_t",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 8,
   "source_file" : "/external/lz4/lib/xxhash.h",
   "unique_id" : "XXH64_canonical_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "total_len",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "v1",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "v2",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "v3",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "v4",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "mem64",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "memsize",
     "field_offset" : 576,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 608,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "XXH64_state_s",
   "name" : "XXH64_state_s",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 88,
   "source_file" : "/external/lz4/lib/xxhash.h",
   "unique_id" : "XXH64_state_s"
  }
 ],
 "rvalue_reference_types" : []
}
