{
 "array_types" :
 [
  {
   "linker_set_key" : "android::TypeConverter<android::AudioFlagTraits>::Table []",
   "name" : "android::TypeConverter<android::AudioFlagTraits>::Table []",
   "referenced_type" : "type-245",
   "self_type" : "type-244",
   "source_file" : "/frameworks/av/media/libmedia/include/media/TypeConverter.h"
  },
  {
   "linker_set_key" : "android::TypeConverter<android::ChannelIndexTraits>::Table []",
   "name" : "android::TypeConverter<android::ChannelIndexTraits>::Table []",
   "referenced_type" : "type-224",
   "self_type" : "type-223",
   "source_file" : "/frameworks/av/media/libmedia/include/media/TypeConverter.h"
  },
  {
   "linker_set_key" : "android::TypeConverter<android::DefaultTraits<audio_content_type_t> >::Table []",
   "name" : "android::TypeConverter<android::DefaultTraits<audio_content_type_t> >::Table []",
   "referenced_type" : "type-196",
   "self_type" : "type-198",
   "source_file" : "/frameworks/av/media/libmedia/include/media/TypeConverter.h"
  },
  {
   "linker_set_key" : "android::TypeConverter<android::DefaultTraits<audio_input_flags_t> >::Table []",
   "name" : "android::TypeConverter<android::DefaultTraits<audio_input_flags_t> >::Table []",
   "referenced_type" : "type-210",
   "self_type" : "type-209",
   "source_file" : "/frameworks/av/media/libmedia/include/media/TypeConverter.h"
  },
  {
   "linker_set_key" : "android::TypeConverter<android::DefaultTraits<audio_mode_t> >::Table []",

   "self_type" : "type-280",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_compareEPKvS6_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "android::SortedVector<unsigned int>",
   "name" : "android::SortedVector<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-93",
   "self_type" : "type-93",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android12SortedVectorIjEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorIjEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIjED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIjED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE10do_compareEPKvS3_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::SortedVectorTraits<unsigned int>",
   "name" : "android::SortedVectorTraits<unsigned int>",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/TypeConverter.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18SortedVectorTraitsIjEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "literal",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "android::TypeConverter<DefaultTraits<audio_content_type_t> >::Table",
   "name" : "android::TypeConverter<DefaultTraits<audio_content_type_t> >::Table",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmedia/include/media/TypeConverter.h",
   "unique_id" : "_ZTSN7android13TypeConverterINS_13DefaultTraitsI20audio_content_type_tEEE5TableE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::TypeConverter<android::DefaultTraits<audio_content_type_t> >",
   "name" : "android::TypeConverter<android::DefaultTraits<audio_content_type_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-190",
   "self_type" : "type-190",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/TypeConverter.h",
   "template_args" : [ "type-166" ],
   "unique_id" : "_ZTSN7android13TypeConverterINS_13DefaultTraitsI20audio_content_type_tEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "android::Vector<audio_format_t>",
   "name" : "android::Vector<audio_format_t>",
   "record_kind" : "class",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android6VectorI14audio_format_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorI14audio_format_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorI14audio_format_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorI14audio_format_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorI14audio_format_tE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorI14audio_format_tE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorI14audio_format_tE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorI14audio_format_tE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorI14audio_format_tE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorI14audio_format_tE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "type-96"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "type-51"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "type-80"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "type-97"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::VectorTraits<audio_format_t>",
   "name" : "android::VectorTraits<audio_format_t>",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/TypeConverter.h",
   "template_args" : [ "type-177" ],
   "unique_id" : "_ZTSN7android12VectorTraitsI14audio_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<android::String8, android::String8>",
   "name" : "android::aggregate_traits<android::String8, android::String8>",
   "referenced_type" : "type-311",
   "self_type" : "type-311",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5", "type-5" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsINS_7String8ES1_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::key_value_pair_t<android::String8, android::String8>",
   "name" : "android::key_value_pair_t<android::String8, android::String8>",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5", "type-5" ],
   "unique_id" : "_ZTSN7android16key_value_pair_tINS_7String8ES1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::String8>",
   "name" : "android::trait_pointer<android::String8>",
   "referenced_type" : "type-308",
   "self_type" : "type-308",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<audio_format_t>",
   "name" : "android::trait_pointer<audio_format_t>",
   "referenced_type" : "type-255",
   "self_type" : "type-255",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-256" ],
   "unique_id" : "_ZTSN7android13trait_pointerI14audio_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<unsigned int>",
   "name" : "android::trait_pointer<unsigned int>",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android13trait_pointerIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::String8>",
   "name" : "android::trait_trivial_copy<android::String8>",
   "referenced_type" : "type-304",
   "self_type" : "type-304",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-305",
   "self_type" : "type-305",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<audio_format_t>",
   "name" : "android::trait_trivial_copy<audio_format_t>",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-250" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyI14audio_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-72" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-66" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-56" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-22" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-51" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-32" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::String8>",
   "name" : "android::trait_trivial_ctor<android::String8>",
   "referenced_type" : "type-300",
   "self_type" : "type-300",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-299",
   "self_type" : "type-299",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<audio_format_t>",
   "name" : "android::trait_trivial_ctor<audio_format_t>",
   "referenced_type" : "type-228",
   "self_type" : "type-228",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-229" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorI14audio_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-72" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-66" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-56" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-45",
   "self_type" : "type-45",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-22" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-51" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-32" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-312",
   "self_type" : "type-312",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::String8>",
   "name" : "android::trait_trivial_dtor<android::String8>",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-302",
   "self_type" : "type-302",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<audio_format_t>",
   "name" : "android::trait_trivial_dtor<audio_format_t>",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-248" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorI14audio_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-72" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-66" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-56" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-22" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-51" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-32" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-314",
   "self_type" : "type-314",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String8>",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "type-292",
   "self_type" : "type-292",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<audio_format_t>",
   "name" : "android::trait_trivial_move<audio_format_t>",
   "referenced_type" : "type-251",
   "self_type" : "type-251",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-252" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveI14audio_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-294",
   "self_type" : "type-294",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-72" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-66" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-56" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-22" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-61" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-51" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-32" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::String8>",
   "name" : "android::traits<android::String8>",
   "referenced_type" : "type-310",
   "self_type" : "type-310",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android6traitsINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::traits<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-309",
   "self_type" : "type-309",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<audio_format_t>",
   "name" : "android::traits<audio_format_t>",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-259" ],
   "unique_id" : "_ZTSN7android6traitsI14audio_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<unsigned int>",
   "name" : "android::traits<unsigned int>",
   "referenced_type" : "type-257",
   "self_type" : "type-257",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android6traitsIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::key_value_pair_t<android::String8, android::String8> >",
   "name" : "android::use_trivial_move<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_16key_value_pair_tINS_7String8ES2_EEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-88"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<audio_format_t>",
   "name" : "android::use_trivial_move<audio_format_t>",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-89" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveI14audio_format_tEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<unsigned int>",
   "name" : "android::use_trivial_move<unsigned int>",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionFromStringAllowed<bool>",
   "name" : "android::utilities::details::ConversionFromStringAllowed<bool>",
   "referenced_type" : "type-111",
   "self_type" : "type-111",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android9utilities7details27ConversionFromStringAllowedIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionFromStringAllowed<double>",
   "name" : "android::utilities::details::ConversionFromStringAllowed<double>",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-72" ],
   "unique_id" : "_ZTSN7android9utilities7details27ConversionFromStringAllowedIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionFromStringAllowed<float>",
   "name" : "android::utilities::details::ConversionFromStringAllowed<float>",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-66" ],
   "unique_id" : "_ZTSN7android9utilities7details27ConversionFromStringAllowedIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionFromStringAllowed<int16_t>",
   "name" : "android::utilities::details::ConversionFromStringAllowed<int16_t>",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android9utilities7details27ConversionFromStringAllowedIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionFromStringAllowed<int32_t>",
   "name" : "android::utilities::details::ConversionFromStringAllowed<int32_t>",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android9utilities7details27ConversionFromStringAllowedIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionFromStringAllowed<int64_t>",
   "name" : "android::utilities::details::ConversionFromStringAllowed<int64_t>",
   "referenced_type" : "type-113",
   "self_type" : "type-113",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSN7android9utilities7details27ConversionFromStringAllowedIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionFromStringAllowed<uint16_t>",
   "name" : "android::utilities::details::ConversionFromStringAllowed<uint16_t>",
   "referenced_type" : "type-118",
   "self_type" : "type-118",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-32" ],
   "unique_id" : "_ZTSN7android9utilities7details27ConversionFromStringAllowedItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionFromStringAllowed<uint32_t>",
   "name" : "android::utilities::details::ConversionFromStringAllowed<uint32_t>",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android9utilities7details27ConversionFromStringAllowedIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionFromStringAllowed<uint64_t>",
   "name" : "android::utilities::details::ConversionFromStringAllowed<uint64_t>",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-51" ],
   "unique_id" : "_ZTSN7android9utilities7details27ConversionFromStringAllowedImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionToStringAllowed<double>",
   "name" : "android::utilities::details::ConversionToStringAllowed<double>",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-72" ],
   "unique_id" : "_ZTSN7android9utilities7details25ConversionToStringAllowedIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionToStringAllowed<float>",
   "name" : "android::utilities::details::ConversionToStringAllowed<float>",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-66" ],
   "unique_id" : "_ZTSN7android9utilities7details25ConversionToStringAllowedIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionToStringAllowed<int32_t>",
   "name" : "android::utilities::details::ConversionToStringAllowed<int32_t>",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android9utilities7details25ConversionToStringAllowedIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionToStringAllowed<int64_t>",
   "name" : "android::utilities::details::ConversionToStringAllowed<int64_t>",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSN7android9utilities7details25ConversionToStringAllowedIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionToStringAllowed<uint32_t>",
   "name" : "android::utilities::details::ConversionToStringAllowed<uint32_t>",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android9utilities7details25ConversionToStringAllowedIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::ConversionToStringAllowed<uint64_t>",
   "name" : "android::utilities::details::ConversionToStringAllowed<uint64_t>",
   "referenced_type" : "type-123",
   "self_type" : "type-123",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-51" ],
   "unique_id" : "_ZTSN7android9utilities7details25ConversionToStringAllowedImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::Converter<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, double>",
   "name" : "android::utilities::details::Converter<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, double>",
   "record_kind" : "class",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-136", "type-72" ],
   "unique_id" : "_ZTSN7android9utilities7details9ConverterINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::Converter<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, float>",
   "name" : "android::utilities::details::Converter<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, float>",
   "record_kind" : "class",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-130", "type-66" ],
   "unique_id" : "_ZTSN7android9utilities7details9ConverterINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::Converter<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, long>",
   "name" : "android::utilities::details::Converter<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, long>",
   "record_kind" : "class",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-139", "type-46" ],
   "unique_id" : "_ZTSN7android9utilities7details9ConverterINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEElEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::utilities::details::Converter<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, unsigned int>",
   "name" : "android::utilities::details::Converter<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmedia/include/media/convert.h",
   "template_args" : [ "type-142", "type-2" ],
   "unique_id" : "_ZTSN7android9utilities7details9ConverterINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-270"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-269",
   "self_type" : "type-269",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-271"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-260"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-260"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-188"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-272"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-270",
   "self_type" : "type-270",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-313",
   "self_type" : "type-313",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-272",
   "self_type" : "type-272",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-115",
   "self_type" : "type-115",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  }
 ],
 "rvalue_reference_types" : []
}
