{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "const char *[33]",
   "name" : "const char *[33]",
   "referenced_type" : "type-24",
   "self_type" : "type-72",
   "size" : 264,
   "source_file" : "/external/selinux/libselinux/include/selinux/selinux.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_Bool",
   "name" : "_Bool",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned char",
   "name" : "unsigned char",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned int",
   "name" : "unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned long",
   "name" : "unsigned long",

   "linker_set_key" : "selabel_handle *",
   "name" : "selabel_handle *",
   "referenced_type" : "type-8",
   "self_type" : "type-7",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/android.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "selabel_handle *",
   "name" : "selabel_handle *",
   "referenced_type" : "type-94",
   "self_type" : "type-93",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/label.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "selabel_handle *",
   "name" : "selabel_handle *",
   "referenced_type" : "type-99",
   "self_type" : "type-98",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/android.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "selinux_opt *",
   "name" : "selinux_opt *",
   "referenced_type" : "type-55",
   "self_type" : "type-54",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned char *",
   "name" : "unsigned char *",
   "referenced_type" : "type-82",
   "self_type" : "type-83",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/label.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned char **",
   "name" : "unsigned char **",
   "referenced_type" : "type-83",
   "self_type" : "type-85",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/label.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned int *",
   "name" : "unsigned int *",
   "referenced_type" : "type-2",
   "self_type" : "type-60",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned long *",
   "name" : "unsigned long *",
   "referenced_type" : "type-18",
   "self_type" : "type-86",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/label.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(const char *, ...)",
   "name" : "void (*)(const char *, ...)",
   "referenced_type" : "type-23",
   "self_type" : "type-22",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(void *)",
   "name" : "void (*)(void *)",
   "referenced_type" : "type-20",
   "self_type" : "type-19",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(void *, unsigned short, char *, unsigned long)",
   "name" : "void (*)(void *, unsigned short, char *, unsigned long)",
   "referenced_type" : "type-27",
   "self_type" : "type-26",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(void)",
   "name" : "void (*)(void)",
   "referenced_type" : "type-32",
   "self_type" : "type-31",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-4",
   "self_type" : "type-3",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *(*)(unsigned long)",
   "name" : "void *(*)(unsigned long)",
   "referenced_type" : "type-17",
   "self_type" : "type-16",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *(*)(void (*)(void))",
   "name" : "void *(*)(void (*)(void))",
   "referenced_type" : "type-30",
   "self_type" : "type-29",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *(*)(void)",
   "name" : "void *(*)(void)",
   "referenced_type" : "type-35",
   "self_type" : "type-34",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const avc_lock_callback",
   "name" : "const avc_lock_callback",
   "referenced_type" : "type-33",
   "self_type" : "type-52",
   "size" : 32,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const avc_log_callback",
   "name" : "const avc_log_callback",
   "referenced_type" : "type-21",
   "self_type" : "type-48",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const avc_memory_callback",
   "name" : "const avc_memory_callback",
   "referenced_type" : "type-15",
   "self_type" : "type-46",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const avc_thread_callback",
   "name" : "const avc_thread_callback",
   "referenced_type" : "type-28",
   "self_type" : "type-50",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-11",
   "self_type" : "type-25",
   "size" : 1,
   "source_file" : "/external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const selinux_opt",
   "name" : "const selinux_opt",
   "referenced_type" : "type-55",
   "self_type" : "type-79",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/label.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "SELboolean",
   "name" : "SELboolean",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/selinux.h",
   "unique_id" : "SELboolean"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "allowed",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "decided",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "auditallow",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "auditdeny",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "seqno",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "av_decision",
   "name" : "av_decision",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 24,
   "source_file" : "/external/selinux/libselinux/include/selinux/selinux.h",
   "unique_id" : "av_decision"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "entry_lookups",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "entry_hits",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "entry_misses",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "entry_discards",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cav_lookups",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cav_hits",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cav_probes",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cav_misses",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "avc_cache_stats",
   "name" : "avc_cache_stats",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 32,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h",
   "unique_id" : "avc_cache_stats"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ae",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "avc_entry_ref",
   "name" : "avc_entry_ref",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h",
   "unique_id" : "avc_entry_ref"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "func_alloc_lock",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "func_get_lock",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "func_release_lock",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "func_free_lock",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "avc_lock_callback",
   "name" : "avc_lock_callback",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 32,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h",
   "unique_id" : "avc_lock_callback"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "func_log",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "func_audit",
     "field_offset" : 64,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "avc_log_callback",
   "name" : "avc_log_callback",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h",
   "unique_id" : "avc_log_callback"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "func_malloc",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "func_free",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "avc_memory_callback",
   "name" : "avc_memory_callback",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h",
   "unique_id" : "avc_memory_callback"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "func_create_thread",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "func_stop_thread",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "avc_thread_callback",
   "name" : "avc_thread_callback",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h",
   "unique_id" : "avc_thread_callback"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "context_s_t",
   "name" : "context_s_t",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/context.h",
   "unique_id" : "context_s_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "perms",
     "field_offset" : 64,
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "security_class_mapping",
   "name" : "security_class_mapping",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 272,
   "source_file" : "/external/selinux/libselinux/include/selinux/selinux.h",
   "unique_id" : "security_class_mapping"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ctx",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "refcnt",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "security_id",
   "name" : "security_id",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/avc.h",
   "unique_id" : "security_id"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "func_log",
     "referenced_type" : "type-74"
    },
    {
     "field_name" : "func_audit",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "func_validate",
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "func_setenforce",
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "func_policyload",
     "referenced_type" : "type-66"
    }
   ],
   "linker_set_key" : "selinux_callback",
   "name" : "selinux_callback",
   "record_kind" : "union",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 8,
   "source_file" : "/external/selinux/libselinux/include/selinux/selinux.h",
   "unique_id" : "selinux_callback"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "selinux_opt",
   "name" : "selinux_opt",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 16,
   "source_file" : "/external/selinux/libselinux/include/selinux/selinux.h",
   "unique_id" : "selinux_opt"
  }
 ],
 "rvalue_reference_types" : []
}
