{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "OMX_AUDIO_CHANNELTYPE [16]",
   "name" : "OMX_AUDIO_CHANNELTYPE [16]",
   "referenced_type" : "type-542",
   "self_type" : "type-544",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "linker_set_key" : "OMX_COMPONENTREGISTERTYPE []",
   "name" : "OMX_COMPONENTREGISTERTYPE []",
   "referenced_type" : "type-346",
   "self_type" : "type-349",
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::MediaImage2::PlaneInfo [4]",
   "name" : "android::MediaImage2::PlaneInfo [4]",
   "referenced_type" : "type-524",
   "self_type" : "type-523",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::MediaImage::PlaneInfo [3]",
   "name" : "android::MediaImage::PlaneInfo [3]",
   "referenced_type" : "type-729",
   "self_type" : "type-728",
   "size" : 60,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-14",
   "self_type" : "type-13",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",

   "linker_set_key" : "const std::array<android::hardware::media::omx::V1_0::ColorAspects::Primaries, 8>",
   "name" : "const std::array<android::hardware::media::omx::V1_0::ColorAspects::Primaries, 8>",
   "referenced_type" : "type-306",
   "self_type" : "type-305",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::array<android::hardware::media::omx::V1_0::ColorAspects::Range, 4>",
   "name" : "const std::array<android::hardware::media::omx::V1_0::ColorAspects::Range, 4>",
   "referenced_type" : "type-303",
   "self_type" : "type-302",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::array<android::hardware::media::omx::V1_0::ColorAspects::Transfer, 13>",
   "name" : "const std::array<android::hardware::media::omx::V1_0::ColorAspects::Transfer, 13>",
   "referenced_type" : "type-308",
   "self_type" : "type-307",
   "size" : 52,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::array<android::hardware::media::omx::V1_0::Message::Type, 4>",
   "name" : "const std::array<android::hardware::media::omx::V1_0::Message::Type, 4>",
   "referenced_type" : "type-296",
   "self_type" : "type-295",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::array<android::hardware::media::omx::V1_0::PortMode, 9>",
   "name" : "const std::array<android::hardware::media::omx::V1_0::PortMode, 9>",
   "referenced_type" : "type-300",
   "self_type" : "type-299",
   "size" : 36,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::array<android::hardware::media::omx::V1_0::Status, 15>",
   "name" : "const std::array<android::hardware::media::omx::V1_0::Status, 15>",
   "referenced_type" : "type-294",
   "self_type" : "type-293",
   "size" : 60,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::array<android::hidl::base::V1_0::DebugInfo::Architecture, 3>",
   "name" : "const std::array<android::hidl::base::V1_0::DebugInfo::Architecture, 3>",
   "referenced_type" : "type-317",
   "self_type" : "type-316",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-156",
   "self_type" : "type-155",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-21",
   "self_type" : "type-104",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-7",
   "self_type" : "type-37",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-5",
   "self_type" : "type-38",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-98",
   "self_type" : "type-106",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-11",
   "self_type" : "type-472",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-36",
   "self_type" : "type-41",
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBalance",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_BALANCETYPE",
   "name" : "OMX_AUDIO_CONFIG_BALANCETYPE",
   "referenced_type" : "type-605",
   "self_type" : "type-605",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_BALANCETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nBass",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_BASSTYPE",
   "name" : "OMX_AUDIO_CONFIG_BASSTYPE",
   "referenced_type" : "type-611",
   "self_type" : "type-611",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_BASSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "referenced_type" : "type-608",
   "self_type" : "type-608",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 160,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "referenced_type" : "type-604",
   "self_type" : "type-604",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "sDelay",
     "field_offset" : 128,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "sModulationRate",
     "field_offset" : 224,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "nModulationDepth",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFeedback",
     "field_offset" : 352,
     "referenced_type" : "type-332"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_CHORUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_CHORUSTYPE",
   "referenced_type" : "type-616",
   "self_type" : "type-616",
   "size" : 56,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_CHORUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eEchoCancelation",
     "field_offset" : 96,
     "referenced_type" : "type-618"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "sBandIndex",
     "field_offset" : 128,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "sCenterFreq",
     "field_offset" : 224,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "sBandLevel",
     "field_offset" : 320,
     "referenced_type" : "type-334"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "name" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "referenced_type" : "type-613",
   "self_type" : "type-613",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bLoudness",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "name" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "referenced_type" : "type-610",
   "self_type" : "type-610",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sPitchTransposition",
     "field_offset" : 96,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "sPlayBackRate",
     "field_offset" : 192,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "sTempo",
     "field_offset" : 288,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "nMaxPolyphony",
     "field_offset" : 384,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNumRepeat",
     "field_offset" : 416,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nStopTime",
     "field_offset" : 448,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannelMuteMask",
     "field_offset" : 480,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nChannelSoloMask",
     "field_offset" : 496,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nTrack0031MuteMask",
     "field_offset" : 512,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTrack3263MuteMask",
     "field_offset" : 544,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTrack0031SoloMask",
     "field_offset" : 576,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTrack3263SoloMask",
     "field_offset" : 608,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "referenced_type" : "type-598",
   "self_type" : "type-598",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMidiEventSize",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMidiEvents",
     "field_offset" : 128,
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "referenced_type" : "type-595",
   "self_type" : "type-595",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nData",
     "field_offset" : 160,
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "referenced_type" : "type-602",
   "self_type" : "type-602",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMetaEventType",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTrack",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nIDProgram",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nIDSoundBank",
     "field_offset" : 144,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nUserSoundBankIndex",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "referenced_type" : "type-597",
   "self_type" : "type-597",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNumTracks",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nDuration",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bVibra",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nNumMetaEvents",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNumActiveVoices",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eMIDIPlayBackState",
     "field_offset" : 288,
     "referenced_type" : "type-599"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "referenced_type" : "type-600",
   "self_type" : "type-600",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_MUTETYPE",
   "referenced_type" : "type-606",
   "self_type" : "type-606",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MUTETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bNoiseReduction",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "referenced_type" : "type-622",
   "self_type" : "type-622",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "sRoomLevel",
     "field_offset" : 128,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "sRoomHighFreqLevel",
     "field_offset" : 224,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "sReflectionsLevel",
     "field_offset" : 320,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "sReflectionsDelay",
     "field_offset" : 416,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "sReverbLevel",
     "field_offset" : 512,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "sReverbDelay",
     "field_offset" : 608,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "sDecayTime",
     "field_offset" : 704,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "nDecayHighFreqRatio",
     "field_offset" : 800,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "nDensity",
     "field_offset" : 896,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nDiffusion",
     "field_offset" : 928,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sReferenceHighFreq",
     "field_offset" : 960,
     "referenced_type" : "type-332"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 132,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eWideningType",
     "field_offset" : 128,
     "referenced_type" : "type-614"
    },
    {
     "field_name" : "nStereoWidening",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "name" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "referenced_type" : "type-615",
   "self_type" : "type-615",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nTreble",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_TREBLETYPE",
   "name" : "OMX_AUDIO_CONFIG_TREBLETYPE",
   "referenced_type" : "type-612",
   "self_type" : "type-612",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_TREBLETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 128,
     "referenced_type" : "type-334"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_VOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_VOLUMETYPE",
   "referenced_type" : "type-603",
   "self_type" : "type-603",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_VOLUMETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFrameLength",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nAACtools",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nAACERtools",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eAACProfile",
     "field_offset" : 320,
     "referenced_type" : "type-549"
    },
    {
     "field_name" : "eAACStreamFormat",
     "field_offset" : 352,
     "referenced_type" : "type-548"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 384,
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_AACPROFILETYPE",
   "name" : "OMX_AUDIO_PARAM_AACPROFILETYPE",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_AACPROFILETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitsPerSample",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_ADPCMTYPE",
   "name" : "OMX_AUDIO_PARAM_ADPCMTYPE",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_ADPCMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eAMRBandMode",
     "field_offset" : 160,
     "referenced_type" : "type-572"
    },
    {
     "field_name" : "eAMRDTXMode",
     "field_offset" : 192,
     "referenced_type" : "type-573"
    },
    {
     "field_name" : "eAMRFrameFormat",
     "field_offset" : 224,
     "referenced_type" : "type-571"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_AMRTYPE",
   "name" : "OMX_AUDIO_PARAM_AMRTYPE",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_AMRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "type-584"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_EVRCTYPE",
   "name" : "OMX_AUDIO_PARAM_EVRCTYPE",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_EVRCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nCompressionLevel",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_FLACTYPE",
   "name" : "OMX_AUDIO_PARAM_FLACTYPE",
   "referenced_type" : "type-553",
   "self_type" : "type-553",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_FLACTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-564"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_G723TYPE",
   "name" : "OMX_AUDIO_PARAM_G723TYPE",
   "referenced_type" : "type-565",
   "self_type" : "type-565",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_G723TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eG726Mode",
     "field_offset" : 128,
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_G726TYPE",
   "name" : "OMX_AUDIO_PARAM_G726TYPE",
   "referenced_type" : "type-568",
   "self_type" : "type-568",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_G726TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eBitType",
     "field_offset" : 160,
     "referenced_type" : "type-569"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_G729TYPE",
   "name" : "OMX_AUDIO_PARAM_G729TYPE",
   "referenced_type" : "type-570",
   "self_type" : "type-570",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_G729TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_GSMEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMEFRTYPE",
   "referenced_type" : "type-578",
   "self_type" : "type-578",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_GSMEFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_GSMFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMFRTYPE",
   "referenced_type" : "type-576",
   "self_type" : "type-576",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_GSMFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_GSMHRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMHRTYPE",
   "referenced_type" : "type-577",
   "self_type" : "type-577",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_GSMHRTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nDLSIndex",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nDLSSize",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pDLSData",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eMidiSoundBank",
     "field_offset" : 256,
     "referenced_type" : "type-592"
    },
    {
     "field_name" : "eMidiSoundBankLayout",
     "field_offset" : 288,
     "referenced_type" : "type-593"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "name" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "referenced_type" : "type-594",
   "self_type" : "type-594",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFileSize",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sMaxPolyphony",
     "field_offset" : 128,
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "bLoadDefaultSound",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eMidiFormat",
     "field_offset" : 256,
     "referenced_type" : "type-590"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_MIDITYPE",
   "name" : "OMX_AUDIO_PARAM_MIDITYPE",
   "referenced_type" : "type-591",
   "self_type" : "type-591",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_MIDITYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 224,
     "referenced_type" : "type-545"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 256,
     "referenced_type" : "type-546"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_MP3TYPE",
   "name" : "OMX_AUDIO_PARAM_MP3TYPE",
   "referenced_type" : "type-547",
   "self_type" : "type-547",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_MP3TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eNumData",
     "field_offset" : 128,
     "referenced_type" : "type-331"
    },
    {
     "field_name" : "eEndian",
     "field_offset" : 160,
     "referenced_type" : "type-330"
    },
    {
     "field_name" : "bInterleaved",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nBitPerSample",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ePCMMode",
     "field_offset" : 288,
     "referenced_type" : "type-541"
    },
    {
     "field_name" : "eChannelMapping",
     "field_offset" : 320,
     "referenced_type" : "type-544"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PCMMODETYPE",
   "name" : "OMX_AUDIO_PARAM_PCMMODETYPE",
   "referenced_type" : "type-543",
   "self_type" : "type-543",
   "size" : 104,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PCMMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PDCEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCEFRTYPE",
   "referenced_type" : "type-582",
   "self_type" : "type-582",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PDCEFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PDCFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCFRTYPE",
   "referenced_type" : "type-581",
   "self_type" : "type-581",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PDCFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PDCHRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCHRTYPE",
   "referenced_type" : "type-583",
   "self_type" : "type-583",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PDCHRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 128,
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-540",
   "self_type" : "type-540",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "type-584"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_QCELP13TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP13TYPE",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_QCELP13TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 160,
     "referenced_type" : "type-584"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_QCELP8TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP8TYPE",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_QCELP8TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitsPerFrame",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSamplePerFrame",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nCouplingQuantBits",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nCouplingStartRegion",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNumRegions",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 320,
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_RATYPE",
   "name" : "OMX_AUDIO_PARAM_RATYPE",
   "referenced_type" : "type-559",
   "self_type" : "type-559",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_RATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBlocks",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSubbands",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitPool",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnableBitrate",
     "field_offset" : 288,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 320,
     "referenced_type" : "type-545"
    },
    {
     "field_name" : "eSBCAllocType",
     "field_offset" : 352,
     "referenced_type" : "type-560"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_SBCTYPE",
   "name" : "OMX_AUDIO_PARAM_SBCTYPE",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_SBCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "type-584"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_SMVTYPE",
   "name" : "OMX_AUDIO_PARAM_SMVTYPE",
   "referenced_type" : "type-589",
   "self_type" : "type-589",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_SMVTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_TDMAEFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_TDMAFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAFRTYPE",
   "referenced_type" : "type-579",
   "self_type" : "type-579",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_TDMAFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nQuality",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "bManaged",
     "field_offset" : 320,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bDownmix",
     "field_offset" : 352,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_VORBISTYPE",
   "name" : "OMX_AUDIO_PARAM_VORBISTYPE",
   "referenced_type" : "type-552",
   "self_type" : "type-552",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_VORBISTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 160,
     "referenced_type" : "type-554"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBlockAlign",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nEncodeOptions",
     "field_offset" : 272,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nSuperBlockAlign",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_WMATYPE",
   "name" : "OMX_AUDIO_PARAM_WMATYPE",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_WMATYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 160,
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PORTDEFINITIONTYPE",
   "name" : "OMX_AUDIO_PORTDEFINITIONTYPE",
   "referenced_type" : "type-538",
   "self_type" : "type-538",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_BS32",
   "name" : "OMX_BS32",
   "referenced_type" : "type-334",
   "self_type" : "type-334",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_BS32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_BU32",
   "name" : "OMX_BU32",
   "referenced_type" : "type-332",
   "self_type" : "type-332",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_BU32"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "nAllocLen",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFilledLen",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 256,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pPlatformPrivate",
     "field_offset" : 320,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pInputPortPrivate",
     "field_offset" : 384,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pOutputPortPrivate",
     "field_offset" : 448,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "hMarkTargetComponent",
     "field_offset" : 512,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 576,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nTickCount",
     "field_offset" : 640,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTimeStamp",
     "field_offset" : 704,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "nFlags",
     "field_offset" : 768,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nOutputPortIndex",
     "field_offset" : 800,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nInputPortIndex",
     "field_offset" : 832,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE",
   "referenced_type" : "type-353",
   "self_type" : "type-353",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_BUFFERHEADERTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EventHandler",
     "referenced_type" : "type-360"
    },
    {
     "field_name" : "EmptyBufferDone",
     "field_offset" : 64,
     "referenced_type" : "type-362"
    },
    {
     "field_name" : "FillBufferDone",
     "field_offset" : 128,
     "referenced_type" : "type-362"
    }
   ],
   "linker_set_key" : "OMX_CALLBACKTYPE",
   "name" : "OMX_CALLBACKTYPE",
   "referenced_type" : "type-359",
   "self_type" : "type-359",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_CALLBACKTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pName",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "pInitialize",
     "field_offset" : 64,
     "referenced_type" : "type-347"
    }
   ],
   "linker_set_key" : "OMX_COMPONENTREGISTERTYPE",
   "name" : "OMX_COMPONENTREGISTERTYPE",
   "referenced_type" : "type-346",
   "self_type" : "type-346",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_COMPONENTREGISTERTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "pComponentPrivate",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pApplicationPrivate",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "GetComponentVersion",
     "field_offset" : 192,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "SendCommand",
     "field_offset" : 256,
     "referenced_type" : "type-689"
    },
    {
     "field_name" : "GetParameter",
     "field_offset" : 320,
     "referenced_type" : "type-691"
    },
    {
     "field_name" : "SetParameter",
     "field_offset" : 384,
     "referenced_type" : "type-691"
    },
    {
     "field_name" : "GetConfig",
     "field_offset" : 448,
     "referenced_type" : "type-691"
    },
    {
     "field_name" : "SetConfig",
     "field_offset" : 512,
     "referenced_type" : "type-691"
    },
    {
     "field_name" : "GetExtensionIndex",
     "field_offset" : 576,
     "referenced_type" : "type-693"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 640,
     "referenced_type" : "type-696"
    },
    {
     "field_name" : "ComponentTunnelRequest",
     "field_offset" : 704,
     "referenced_type" : "type-699"
    },
    {
     "field_name" : "UseBuffer",
     "field_offset" : 768,
     "referenced_type" : "type-702"
    },
    {
     "field_name" : "AllocateBuffer",
     "field_offset" : 832,
     "referenced_type" : "type-705"
    },
    {
     "field_name" : "FreeBuffer",
     "field_offset" : 896,
     "referenced_type" : "type-707"
    },
    {
     "field_name" : "EmptyThisBuffer",
     "field_offset" : 960,
     "referenced_type" : "type-709"
    },
    {
     "field_name" : "FillThisBuffer",
     "field_offset" : 1024,
     "referenced_type" : "type-709"
    },
    {
     "field_name" : "SetCallbacks",
     "field_offset" : 1088,
     "referenced_type" : "type-711"
    },
    {
     "field_name" : "ComponentDeInit",
     "field_offset" : 1152,
     "referenced_type" : "type-347"
    },
    {
     "field_name" : "UseEGLImage",
     "field_offset" : 1216,
     "referenced_type" : "type-714"
    },
    {
     "field_name" : "ComponentRoleEnum",
     "field_offset" : 1280,
     "referenced_type" : "type-716"
    }
   ],
   "linker_set_key" : "OMX_COMPONENTTYPE",
   "name" : "OMX_COMPONENTTYPE",
   "referenced_type" : "type-684",
   "self_type" : "type-684",
   "size" : 168,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_COMPONENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBacklight",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTimeout",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BACKLIGHTTYPE",
   "name" : "OMX_CONFIG_BACKLIGHTTYPE",
   "referenced_type" : "type-400",
   "self_type" : "type-400",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_BACKLIGHTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BOOLEANTYPE",
   "name" : "OMX_CONFIG_BOOLEANTYPE",
   "referenced_type" : "type-670",
   "self_type" : "type-670",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_BOOLEANTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBrightness",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "name" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_BRIGHTNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bContinuous",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bFrameLimited",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nFrameLimit",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CAPTUREMODETYPE",
   "name" : "OMX_CONFIG_CAPTUREMODETYPE",
   "referenced_type" : "type-416",
   "self_type" : "type-416",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_CAPTUREMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nRGBAlphaConstant",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eColorBlend",
     "field_offset" : 128,
     "referenced_type" : "type-380"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORBLENDTYPE",
   "name" : "OMX_CONFIG_COLORBLENDTYPE",
   "referenced_type" : "type-381",
   "self_type" : "type-381",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORBLENDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "xColorMatrix",
     "field_offset" : 96,
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "xColorOffset",
     "field_offset" : 384,
     "referenced_type" : "type-373"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "name" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "referenced_type" : "type-370",
   "self_type" : "type-370",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORCONVERSIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bColorEnhancement",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nCustomizedU",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nCustomizedV",
     "field_offset" : 136,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "name" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "referenced_type" : "type-378",
   "self_type" : "type-378",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORENHANCEMENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nARGBColor",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nARGBMask",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORKEYTYPE",
   "name" : "OMX_CONFIG_COLORKEYTYPE",
   "referenced_type" : "type-379",
   "self_type" : "type-379",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORKEYTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNumNodes",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "referenced_type" : "type-681",
   "self_type" : "type-681",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNodeIndex",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNodeID",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cNodeName",
     "field_offset" : 192,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "bIsLeafType",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTAINERNODEIDTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODEIDTYPE",
   "referenced_type" : "type-682",
   "self_type" : "type-682",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_CONTAINERNODEIDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nContrast",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTRASTTYPE",
   "name" : "OMX_CONFIG_CONTRASTTYPE",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_CONTRASTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eDither",
     "field_offset" : 96,
     "referenced_type" : "type-414"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_DITHERTYPE",
   "name" : "OMX_CONFIG_DITHERTYPE",
   "referenced_type" : "type-415",
   "self_type" : "type-415",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_DITHERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eExposureControl",
     "field_offset" : 96,
     "referenced_type" : "type-393"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "name" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "referenced_type" : "type-394",
   "self_type" : "type-394",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_EXPOSURECONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eMetering",
     "field_offset" : 96,
     "referenced_type" : "type-417"
    },
    {
     "field_name" : "xEVCompensation",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nApertureFNumber",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bAutoAperture",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nShutterSpeedMsec",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bAutoShutterSpeed",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nSensitivity",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bAutoSensitivity",
     "field_offset" : 320,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "name" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "referenced_type" : "type-418",
   "self_type" : "type-418",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_EXPOSUREVALUETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bCenter",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bLeft",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bRight",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bTop",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bBottom",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bTopLeft",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bTopRight",
     "field_offset" : 288,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bBottomLeft",
     "field_offset" : 320,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bBottomRight",
     "field_offset" : 352,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "name" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_FOCUSREGIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "xEncodeFramerate",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FRAMERATETYPE",
   "name" : "OMX_CONFIG_FRAMERATETYPE",
   "referenced_type" : "type-460",
   "self_type" : "type-460",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_FRAMERATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bStab",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FRAMESTABTYPE",
   "name" : "OMX_CONFIG_FRAMESTABTYPE",
   "referenced_type" : "type-390",
   "self_type" : "type-390",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_FRAMESTABTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nGamma",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_GAMMATYPE",
   "name" : "OMX_CONFIG_GAMMATYPE",
   "referenced_type" : "type-401",
   "self_type" : "type-401",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_GAMMATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eImageFilter",
     "field_offset" : 96,
     "referenced_type" : "type-376"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "name" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "referenced_type" : "type-377",
   "self_type" : "type-377",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_IMAGEFILTERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "IntraRefreshVOP",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "name" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_INTRAREFRESHVOPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nLightness",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_LIGHTNESSTYPE",
   "name" : "OMX_CONFIG_LIGHTNESSTYPE",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_LIGHTNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nErrMapSize",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ErrMap",
     "field_offset" : 128,
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "name" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "referenced_type" : "type-463",
   "self_type" : "type-463",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "name" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "referenced_type" : "type-464",
   "self_type" : "type-464",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_MBERRORREPORTINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "type-676"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMetadataItemCount",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "name" : "OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "referenced_type" : "type-678",
   "self_type" : "type-678",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_METADATAITEMCOUNTTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "type-676"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMetadataItemIndex",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eSearchMode",
     "field_offset" : 160,
     "referenced_type" : "type-677"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 192,
     "referenced_type" : "type-674"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 224,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 232,
     "referenced_type" : "type-352"
    },
    {
     "field_name" : "eValueCharset",
     "field_offset" : 1280,
     "referenced_type" : "type-674"
    },
    {
     "field_name" : "sLanguageCountry",
     "field_offset" : 1344,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "nValueMaxSize",
     "field_offset" : 1408,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nValueSizeUsed",
     "field_offset" : 1440,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nValue",
     "field_offset" : 1472,
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_METADATAITEMTYPE",
   "name" : "OMX_CONFIG_METADATAITEMTYPE",
   "referenced_type" : "type-679",
   "self_type" : "type-679",
   "size" : 192,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_METADATAITEMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eMirror",
     "field_offset" : 96,
     "referenced_type" : "type-384"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MIRRORTYPE",
   "name" : "OMX_CONFIG_MIRRORTYPE",
   "referenced_type" : "type-385",
   "self_type" : "type-385",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_MIRRORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nDepth",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nAlpha",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_PLANEBLENDTYPE",
   "name" : "OMX_CONFIG_PLANEBLENDTYPE",
   "referenced_type" : "type-404",
   "self_type" : "type-404",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_PLANEBLENDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nX",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nY",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_POINTTYPE",
   "name" : "OMX_CONFIG_POINTTYPE",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_POINTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nLeft",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nTop",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_RECTTYPE",
   "name" : "OMX_CONFIG_RECTTYPE",
   "referenced_type" : "type-388",
   "self_type" : "type-388",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_RECTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nRotation",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_ROTATIONTYPE",
   "name" : "OMX_CONFIG_ROTATIONTYPE",
   "referenced_type" : "type-383",
   "self_type" : "type-383",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_ROTATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSaturation",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_SATURATIONTYPE",
   "name" : "OMX_CONFIG_SATURATIONTYPE",
   "referenced_type" : "type-402",
   "self_type" : "type-402",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_SATURATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "xWidth",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "xHeight",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_SCALEFACTORTYPE",
   "name" : "OMX_CONFIG_SCALEFACTORTYPE",
   "referenced_type" : "type-374",
   "self_type" : "type-374",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_SCALEFACTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eEffect",
     "field_offset" : 96,
     "referenced_type" : "type-406"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "name" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_TRANSITIONEFFECTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eWhiteBalControl",
     "field_offset" : 96,
     "referenced_type" : "type-391"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "name" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "referenced_type" : "type-392",
   "self_type" : "type-392",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_WHITEBALCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_FRAMESIZETYPE",
   "name" : "OMX_FRAMESIZETYPE",
   "referenced_type" : "type-382",
   "self_type" : "type-382",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_FRAMESIZETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eFocusControl",
     "field_offset" : 96,
     "referenced_type" : "type-628"
    },
    {
     "field_name" : "nFocusSteps",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFocusStepIndex",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "name" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "referenced_type" : "type-629",
   "self_type" : "type-629",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eFlashControl",
     "field_offset" : 96,
     "referenced_type" : "type-626"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "name" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eHuffmanTable",
     "field_offset" : 96,
     "referenced_type" : "type-636"
    },
    {
     "field_name" : "nNumberOfHuffmanCodeOfLength",
     "field_offset" : 128,
     "referenced_type" : "type-638"
    },
    {
     "field_name" : "nHuffmanTable",
     "field_offset" : 256,
     "referenced_type" : "type-639"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "referenced_type" : "type-637",
   "self_type" : "type-637",
   "size" : 288,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "type-623"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "type-369"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "name" : "OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nQFactor",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_QFACTORTYPE",
   "name" : "OMX_IMAGE_PARAM_QFACTORTYPE",
   "referenced_type" : "type-630",
   "self_type" : "type-630",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_QFACTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eQuantizationTable",
     "field_offset" : 96,
     "referenced_type" : "type-633"
    },
    {
     "field_name" : "nQuantizationMatrix",
     "field_offset" : 128,
     "referenced_type" : "type-635"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "referenced_type" : "type-634",
   "self_type" : "type-634",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 288,
     "referenced_type" : "type-623"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 320,
     "referenced_type" : "type-369"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 384,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PORTDEFINITIONTYPE",
   "name" : "OMX_IMAGE_PORTDEFINITIONTYPE",
   "referenced_type" : "type-624",
   "self_type" : "type-624",
   "size" : 56,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hMarkTargetComponent",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_MARKTYPE",
   "name" : "OMX_MARKTYPE",
   "referenced_type" : "type-335",
   "self_type" : "type-335",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_MARKTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eNaluFormat",
     "field_offset" : 96,
     "referenced_type" : "type-471"
    }
   ],
   "linker_set_key" : "OMX_NALSTREAMFORMATTYPE",
   "name" : "OMX_NALSTREAMFORMATTYPE",
   "referenced_type" : "type-473",
   "self_type" : "type-473",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_NALSTREAMFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "bEnablePM",
     "field_offset" : 64,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_OTHER_CONFIG_POWERTYPE",
   "name" : "OMX_OTHER_CONFIG_POWERTYPE",
   "referenced_type" : "type-654",
   "self_type" : "type-654",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_CONFIG_POWERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    }
   ],
   "linker_set_key" : "OMX_OTHER_CONFIG_STATSTYPE",
   "name" : "OMX_OTHER_CONFIG_STATSTYPE",
   "referenced_type" : "type-657",
   "self_type" : "type-657",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_CONFIG_STATSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eType",
     "field_offset" : 96,
     "referenced_type" : "type-354"
    },
    {
     "field_name" : "nDataSize",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "OMX_OTHER_EXTRADATATYPE",
   "name" : "OMX_OTHER_EXTRADATATYPE",
   "referenced_type" : "type-355",
   "self_type" : "type-355",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_OTHER_EXTRADATATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 128,
     "referenced_type" : "type-640"
    }
   ],
   "linker_set_key" : "OMX_OTHER_PARAM_PORTFORMATTYPE",
   "name" : "OMX_OTHER_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-659",
   "self_type" : "type-659",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "eFormat",
     "referenced_type" : "type-640"
    }
   ],
   "linker_set_key" : "OMX_OTHER_PORTDEFINITIONTYPE",
   "name" : "OMX_OTHER_PORTDEFINITIONTYPE",
   "referenced_type" : "type-658",
   "self_type" : "type-658",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eBufferSupplier",
     "field_offset" : 96,
     "referenced_type" : "type-365"
    }
   ],
   "linker_set_key" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "name" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "referenced_type" : "type-367",
   "self_type" : "type-367",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PARAM_BUFFERSUPPLIERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "cRole",
     "field_offset" : 64,
     "referenced_type" : "type-352"
    }
   ],
   "linker_set_key" : "OMX_PARAM_COMPONENTROLETYPE",
   "name" : "OMX_PARAM_COMPONENTROLETYPE",
   "referenced_type" : "type-351",
   "self_type" : "type-351",
   "size" : 136,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PARAM_COMPONENTROLETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "hPipe",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_PARAM_CONTENTPIPETYPE",
   "name" : "OMX_PARAM_CONTENTPIPETYPE",
   "referenced_type" : "type-672",
   "self_type" : "type-672",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_CONTENTPIPETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "contentURI",
     "field_offset" : 64,
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "OMX_PARAM_CONTENTURITYPE",
   "name" : "OMX_PARAM_CONTENTURITYPE",
   "referenced_type" : "type-671",
   "self_type" : "type-671",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_CONTENTURITYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eUnitType",
     "field_offset" : 96,
     "referenced_type" : "type-409"
    },
    {
     "field_name" : "eEncapsulationType",
     "field_offset" : 128,
     "referenced_type" : "type-412"
    }
   ],
   "linker_set_key" : "OMX_PARAM_DATAUNITTYPE",
   "name" : "OMX_PARAM_DATAUNITTYPE",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_DATAUNITTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDeblocking",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_PARAM_DEBLOCKINGTYPE",
   "name" : "OMX_PARAM_DEBLOCKINGTYPE",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_DEBLOCKINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eFocusStatus",
     "field_offset" : 96,
     "referenced_type" : "type-420"
    },
    {
     "field_name" : "bCenterStatus",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bLeftStatus",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bRightStatus",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bTopStatus",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bBottomStatus",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bTopLeftStatus",
     "field_offset" : 288,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bTopRightStatus",
     "field_offset" : 320,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bBottomLeftStatus",
     "field_offset" : 352,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bBottomRightStatus",
     "field_offset" : 384,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "name" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "referenced_type" : "type-421",
   "self_type" : "type-421",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_FOCUSSTATUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nInterleavePortIndex",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_PARAM_INTERLEAVETYPE",
   "name" : "OMX_PARAM_INTERLEAVETYPE",
   "referenced_type" : "type-405",
   "self_type" : "type-405",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_INTERLEAVETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMacroblocks",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_PARAM_MACROBLOCKSTYPE",
   "name" : "OMX_PARAM_MACROBLOCKSTYPE",
   "referenced_type" : "type-465",
   "self_type" : "type-465",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_PARAM_MACROBLOCKSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 96,
     "referenced_type" : "type-674"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 160,
     "referenced_type" : "type-352"
    },
    {
     "field_name" : "nLanguageCountrySizeUsed",
     "field_offset" : 1184,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nLanguageCountry",
     "field_offset" : 1216,
     "referenced_type" : "type-352"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 2240,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_PARAM_METADATAFILTERTYPE",
   "name" : "OMX_PARAM_METADATAFILTERTYPE",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 284,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_METADATAFILTERTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 96,
     "referenced_type" : "type-329"
    },
    {
     "field_name" : "nBufferCountActual",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBufferCountMin",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBufferSize",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bPopulated",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eDomain",
     "field_offset" : 288,
     "referenced_type" : "type-660"
    },
    {
     "field_name" : "format",
     "field_offset" : 320,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "bBuffersContiguous",
     "field_offset" : 832,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nBufferAlignment",
     "field_offset" : 864,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_PARAM_PORTDEFINITIONTYPE",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE",
   "referenced_type" : "type-661",
   "self_type" : "type-661",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "audio",
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "video",
     "referenced_type" : "type-423"
    },
    {
     "field_name" : "image",
     "referenced_type" : "type-624"
    },
    {
     "field_name" : "other",
     "referenced_type" : "type-658"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5",
   "record_kind" : "union",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bOneShot",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "sFrameSize",
     "field_offset" : 160,
     "referenced_type" : "type-382"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SENSORMODETYPE",
   "name" : "OMX_PARAM_SENSORMODETYPE",
   "referenced_type" : "type-395",
   "self_type" : "type-395",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_SENSORMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "ePolicy",
     "field_offset" : 64,
     "referenced_type" : "type-665"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "name" : "OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "referenced_type" : "type-666",
   "self_type" : "type-666",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_SUSPENSIONPOLICYTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "type-667"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SUSPENSIONTYPE",
   "name" : "OMX_PARAM_SUSPENSIONTYPE",
   "referenced_type" : "type-669",
   "self_type" : "type-669",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_SUSPENSIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nU32",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_PARAM_U32TYPE",
   "name" : "OMX_PARAM_U32TYPE",
   "referenced_type" : "type-663",
   "self_type" : "type-663",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_U32TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPorts",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nStartPortNumber",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_PORT_PARAM_TYPE",
   "name" : "OMX_PORT_PARAM_TYPE",
   "referenced_type" : "type-357",
   "self_type" : "type-357",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PORT_PARAM_TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nGroupPriority",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nGroupID",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_PRIORITYMGMTTYPE",
   "name" : "OMX_PRIORITYMGMTTYPE",
   "referenced_type" : "type-350",
   "self_type" : "type-350",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PRIORITYMGMTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "bResourceConcealmentForbidden",
     "field_offset" : 64,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_RESOURCECONCEALMENTTYPE",
   "name" : "OMX_RESOURCECONCEALMENTTYPE",
   "referenced_type" : "type-673",
   "self_type" : "type-673",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_RESOURCECONCEALMENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "eClock",
     "field_offset" : 64,
     "referenced_type" : "type-646"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "name" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "eState",
     "field_offset" : 64,
     "referenced_type" : "type-647"
    },
    {
     "field_name" : "nStartTime",
     "field_offset" : 128,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "nWaitMask",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "name" : "OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "referenced_type" : "type-651",
   "self_type" : "type-651",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_CLOCKSTATETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pClientPrivate",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 192,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 256,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "name" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "referenced_type" : "type-648",
   "self_type" : "type-648",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_SCALETYPE",
   "name" : "OMX_TIME_CONFIG_SCALETYPE",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_SCALETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "type-641"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_SEEKMODETYPE",
   "name" : "OMX_TIME_CONFIG_SEEKMODETYPE",
   "referenced_type" : "type-643",
   "self_type" : "type-643",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_SEEKMODETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTimestamp",
     "field_offset" : 128,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "name" : "OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_TIMESTAMPTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nClientPrivate",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eUpdateType",
     "field_offset" : 96,
     "referenced_type" : "type-645"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 128,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "nWallTimeAtMediaTime",
     "field_offset" : 256,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 320,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "eState",
     "field_offset" : 352,
     "referenced_type" : "type-647"
    }
   ],
   "linker_set_key" : "OMX_TIME_MEDIATIMETYPE",
   "name" : "OMX_TIME_MEDIATIMETYPE",
   "referenced_type" : "type-649",
   "self_type" : "type-649",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_MEDIATIMETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTunnelFlags",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eSupplier",
     "field_offset" : 32,
     "referenced_type" : "type-365"
    }
   ],
   "linker_set_key" : "OMX_TUNNELSETUPTYPE",
   "name" : "OMX_TUNNELSETUPTYPE",
   "referenced_type" : "type-368",
   "self_type" : "type-368",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_TUNNELSETUPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-337"
    },
    {
     "field_name" : "nVersion",
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VERSIONTYPE",
   "name" : "OMX_VERSIONTYPE",
   "record_kind" : "union",
   "referenced_type" : "type-336",
   "self_type" : "type-336",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_VERSIONTYPE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nVersionMajor",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nVersionMinor",
     "field_offset" : 8,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nRevision",
     "field_offset" : 16,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nStep",
     "field_offset" : 24,
     "referenced_type" : "type-21"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5",
   "name" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5",
   "referenced_type" : "type-337",
   "self_type" : "type-337",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nRefreshPeriod",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 96,
     "referenced_type" : "type-497"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 224,
     "referenced_type" : "type-499"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "type-500",
   "self_type" : "type-500",
   "size" : 60,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nIDRPeriod",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "name" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "referenced_type" : "type-469",
   "self_type" : "type-469",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nEncodeBitrate",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "name" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "referenced_type" : "type-459",
   "self_type" : "type-459",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_BITRATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNaluBytes",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_NALSIZE",
   "name" : "OMX_VIDEO_CONFIG_NALSIZE",
   "referenced_type" : "type-470",
   "self_type" : "type-470",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_NALSIZE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nTileWidth",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTileHeight",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nGridRows",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nGridCols",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "referenced_type" : "type-501",
   "self_type" : "type-501",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eSupportedPatterns",
     "field_offset" : 96,
     "referenced_type" : "type-497"
    },
    {
     "field_name" : "nLayerCountMax",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBLayerCountMax",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 192,
     "referenced_type" : "type-497"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 288,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 320,
     "referenced_type" : "type-499"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "type-498",
   "self_type" : "type-498",
   "size" : 72,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eTemporalPattern",
     "field_offset" : 128,
     "referenced_type" : "type-481"
    },
    {
     "field_name" : "nTemporalLayerCount",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTemporalLayerBitrateRatio",
     "field_offset" : 192,
     "referenced_type" : "type-483"
    },
    {
     "field_name" : "nMinQuantizer",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMaxQuantizer",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "referenced_type" : "type-482",
   "self_type" : "type-482",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNumSliceGroups",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "nSliceGroupMapType",
     "field_offset" : 104,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "eSliceMode",
     "field_offset" : 128,
     "referenced_type" : "type-466"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "name" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "referenced_type" : "type-468",
   "self_type" : "type-468",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_AVCSLICEFMO"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bUseHadamard",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nRefFrames",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nRefIdx10ActiveMinus1",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nRefIdx11ActiveMinus1",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnableUEP",
     "field_offset" : 320,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bEnableFMO",
     "field_offset" : 352,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bEnableASO",
     "field_offset" : 384,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bEnableRS",
     "field_offset" : 416,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 448,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 480,
     "referenced_type" : "type-454"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 512,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bFrameMBsOnly",
     "field_offset" : 544,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bMBAFF",
     "field_offset" : 576,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bEntropyCodingCABAC",
     "field_offset" : 608,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bWeightedPPrediction",
     "field_offset" : 640,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nWeightedBipredicitonMode",
     "field_offset" : 672,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bconstIpred",
     "field_offset" : 704,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bDirect8x8Inference",
     "field_offset" : 736,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bDirectSpatialTemporal",
     "field_offset" : 768,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nCabacInitIdc",
     "field_offset" : 800,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eLoopFilterMode",
     "field_offset" : 832,
     "referenced_type" : "type-456"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_AVCTYPE",
   "name" : "OMX_VIDEO_PARAM_AVCTYPE",
   "referenced_type" : "type-457",
   "self_type" : "type-457",
   "size" : 108,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_AVCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eControlRate",
     "field_offset" : 96,
     "referenced_type" : "type-427"
    },
    {
     "field_offset" : 128,
     "referenced_type" : "type-429"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_BITRATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTargetBitrate",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nQualityFactor",
     "referenced_type" : "type-7"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5",
   "record_kind" : "union",
   "referenced_type" : "type-429",
   "self_type" : "type-429",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnableHEC",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bEnableResync",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nResynchMarkerSpacing",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnableDataPartitioning",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bEnableRVLC",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "name" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "type-437"
    },
    {
     "field_name" : "bPLUSPTYPEAllowed",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bForceRoundingTypeToZero",
     "field_offset" : 288,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nPictureHeaderRepetition",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nGOBHeaderInterval",
     "field_offset" : 352,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_H263TYPE",
   "name" : "OMX_VIDEO_PARAM_H263TYPE",
   "referenced_type" : "type-441",
   "self_type" : "type-441",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_H263TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-487"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_HEVCTYPE",
   "name" : "OMX_VIDEO_PARAM_HEVCTYPE",
   "referenced_type" : "type-489",
   "self_type" : "type-489",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_HEVCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eRefreshMode",
     "field_offset" : 96,
     "referenced_type" : "type-432"
    },
    {
     "field_name" : "nAirMBs",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nAirRef",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nCirMBs",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eAccuracy",
     "field_offset" : 96,
     "referenced_type" : "type-430"
    },
    {
     "field_name" : "bUnrestrictedMVs",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bFourMV",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "sXSearchRange",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sYSearchRange",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "name" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "referenced_type" : "type-431",
   "self_type" : "type-431",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "type-442"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "type-443"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "referenced_type" : "type-445",
   "self_type" : "type-445",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MPEG2TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bSVH",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bGov",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nIDCVLCThreshold",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bACPred",
     "field_offset" : 288,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nMaxPacketSize",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTimeIncRes",
     "field_offset" : 352,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 384,
     "referenced_type" : "type-446"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 416,
     "referenced_type" : "type-447"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 448,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nHeaderExtension",
     "field_offset" : 480,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bReversibleVLC",
     "field_offset" : 512,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 68,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MPEG4TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "type-422"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "type-369"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-424",
   "self_type" : "type-424",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nProfileIndex",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "name" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "referenced_type" : "type-458",
   "self_type" : "type-458",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nQpI",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nQpP",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nQpB",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "name" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "nBitsPerPixel",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nPaddedWidth",
     "field_offset" : 144,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nPaddedHeight",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitstreamFlags",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitstreamVersion",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMaxEncodeFrameSize",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnablePostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bEnableTemporalInterpolation",
     "field_offset" : 352,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bEnableLatencyMode",
     "field_offset" : 384,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_RVTYPE",
   "name" : "OMX_VIDEO_PARAM_RVTYPE",
   "referenced_type" : "type-452",
   "self_type" : "type-452",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_RVTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "b16x16",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "b16x8",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "b8x16",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "b8x8",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "b8x4",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "b4x8",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "b4x4",
     "field_offset" : 288,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "name" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "referenced_type" : "type-435",
   "self_type" : "type-435",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_VBSMCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnableVFU",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nFirstGOB",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFirstMB",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nNumMBs",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "name" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "referenced_type" : "type-426",
   "self_type" : "type-426",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-475"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-476"
    },
    {
     "field_name" : "nDCTPartitions",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VP8TYPE",
   "name" : "OMX_VIDEO_PARAM_VP8TYPE",
   "referenced_type" : "type-477",
   "self_type" : "type-477",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_VP8TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-484"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-485"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nTileRows",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nTileColumns",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnableFrameParallelDecoding",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VP9TYPE",
   "name" : "OMX_VIDEO_PARAM_VP9TYPE",
   "referenced_type" : "type-486",
   "self_type" : "type-486",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_VP9TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "type-449"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_WMVTYPE",
   "name" : "OMX_VIDEO_PARAM_WMVTYPE",
   "referenced_type" : "type-450",
   "self_type" : "type-450",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_WMVTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nBitrate",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 320,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 352,
     "referenced_type" : "type-422"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 384,
     "referenced_type" : "type-369"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 448,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "name" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "referenced_type" : "type-423",
   "self_type" : "type-423",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nMediaTimeUs",
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "nSystemTimeNs",
     "field_offset" : 64,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_RENDEREVENTTYPE",
   "name" : "OMX_VIDEO_RENDEREVENTTYPE",
   "referenced_type" : "type-492",
   "self_type" : "type-492",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_RENDEREVENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bDepedentSegments",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bEnableLoopFilterAcrossSlices",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_SLICESEGMENTSTYPE",
   "name" : "OMX_VIDEO_SLICESEGMENTSTYPE",
   "referenced_type" : "type-491",
   "self_type" : "type-491",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_SLICESEGMENTSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bIsIntraFrame",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bIsGoldenOrAlternateFrame",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bPreviousFrameRefresh",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bGoldenFrameRefresh",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bAlternateFrameRefresh",
     "field_offset" : 160,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bUsePreviousFrame",
     "field_offset" : 192,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bUseGoldenFrame",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bUseAlternateFrame",
     "field_offset" : 256,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "referenced_type" : "type-478",
   "self_type" : "type-478",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ADebug",
   "name" : "android::ADebug",
   "referenced_type" : "type-533",
   "self_type" : "type-533",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ADebug.h",
   "unique_id" : "_ZTSN7android6ADebugE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mAllocSize",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::AString",
   "name" : "android::AString",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h",
   "unique_id" : "_ZTSN7android7AStringE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-25"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 64,
     "referenced_type" : "type-49"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android::BBinder",
   "name" : "android::BBinder",
   "record_kind" : "class",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android7BBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-60"
    },
    {
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IOMXNode>",
   "name" : "android::BnInterface<android::IOMXNode>",
   "record_kind" : "class",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-60" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_8IOMXNodeEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-63"
    },
    {
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IOMXObserver>",
   "name" : "android::BnInterface<android::IOMXObserver>",
   "record_kind" : "class",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-63" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_12IOMXObserverEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "android::BnOMXNode",
   "name" : "android::BnOMXNode",
   "record_kind" : "class",
   "referenced_type" : "type-514",
   "self_type" : "type-514",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android9BnOMXNodeE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BnOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BnOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BnOMXNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android9BnOMXNode10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZNK7android9BnOMXNode8isSecureEv"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BnOMXNodeE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android9BnOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android9BnOMXNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android9BnOMXNode10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BnOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BnOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BnOMXNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-62"
    }
   ],
   "linker_set_key" : "android::BnOMXObserver",
   "name" : "android::BnOMXObserver",
   "record_kind" : "class",
   "referenced_type" : "type-517",
   "self_type" : "type-517",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android13BnOMXObserverE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13BnOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13BnOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13BnOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android13BnOMXObserver10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13BnOMXObserverE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android13BnOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android13BnOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android13BnOMXObserver10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13BnOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android13BnOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android13BnOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-26"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 64,
     "referenced_type" : "type-51"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 128,
     "referenced_type" : "type-52"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 192,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "android::BpRefBase",
   "name" : "android::BpRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android9BpRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mRange",
     "referenced_type" : "type-738"
    },
    {
     "field_name" : "mPrimaries",
     "field_offset" : 32,
     "referenced_type" : "type-739"
    },
    {
     "field_name" : "mTransfer",
     "field_offset" : 64,
     "referenced_type" : "type-740"
    },
    {
     "field_name" : "mMatrixCoeffs",
     "field_offset" : 96,
     "referenced_type" : "type-741"
    }
   ],
   "linker_set_key" : "android::ColorAspects",
   "name" : "android::ColorAspects",
   "referenced_type" : "type-737",
   "self_type" : "type-737",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android12ColorAspectsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-85",
   "self_type" : "type-85",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bTunneled",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nAudioHwSync",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pSidebandWindow",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android::ConfigureVideoTunnelModeParams",
   "name" : "android::ConfigureVideoTunnelModeParams",
   "referenced_type" : "type-774",
   "self_type" : "type-774",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android30ConfigureVideoTunnelModeParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bRequestingDataSpace",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "bDataSpaceChanged",
     "field_offset" : 128,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nPixelFormat",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nDataSpace",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sAspects",
     "field_offset" : 224,
     "referenced_type" : "type-737"
    }
   ],
   "linker_set_key" : "android::DescribeColorAspectsParams",
   "name" : "android::DescribeColorAspectsParams",
   "referenced_type" : "type-775",
   "self_type" : "type-775",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android26DescribeColorAspectsParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 64,
     "referenced_type" : "type-369"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bUsingNativeBuffers",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "sMediaImage",
     "field_offset" : 256,
     "referenced_type" : "type-521"
    }
   ],
   "linker_set_key" : "android::DescribeColorFormat2Params",
   "name" : "android::DescribeColorFormat2Params",
   "referenced_type" : "type-520",
   "self_type" : "type-520",
   "size" : 136,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android26DescribeColorFormat2ParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 64,
     "referenced_type" : "type-369"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bUsingNativeBuffers",
     "field_offset" : 224,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "sMediaImage",
     "field_offset" : 256,
     "referenced_type" : "type-726"
    }
   ],
   "linker_set_key" : "android::DescribeColorFormatParams",
   "name" : "android::DescribeColorFormatParams",
   "referenced_type" : "type-764",
   "self_type" : "type-764",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android25DescribeColorFormatParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nParamSize",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nParamSizeUsed",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nValue",
     "field_offset" : 160,
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "android::DescribeHDR10PlusInfoParams",
   "name" : "android::DescribeHDR10PlusInfoParams",
   "referenced_type" : "type-777",
   "self_type" : "type-777",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android27DescribeHDR10PlusInfoParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sInfo",
     "field_offset" : 96,
     "referenced_type" : "type-743"
    }
   ],
   "linker_set_key" : "android::DescribeHDRStaticInfoParams",
   "name" : "android::DescribeHDRStaticInfoParams",
   "referenced_type" : "type-776",
   "self_type" : "type-776",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android27DescribeHDRStaticInfoParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "enable",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "android::EnableAndroidNativeBuffersParams",
   "name" : "android::EnableAndroidNativeBuffersParams",
   "referenced_type" : "type-749",
   "self_type" : "type-749",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android32EnableAndroidNativeBuffersParamsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::FlattenableUtils",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-86",
   "self_type" : "type-86",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "unique_id" : "_ZTSN7android16FlattenableUtilsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nUsage",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::GetAndroidNativeBufferUsageParams",
   "name" : "android::GetAndroidNativeBufferUsageParams",
   "referenced_type" : "type-762",
   "self_type" : "type-762",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android33GetAndroidNativeBufferUsageParamsE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mID",
     "referenced_type" : "type-744"
    },
    {
     "field_offset" : 8,
     "referenced_type" : "type-745"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo",
   "name" : "android::HDRStaticInfo",
   "referenced_type" : "type-743",
   "self_type" : "type-743",
   "size" : 25,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "sType1",
     "referenced_type" : "type-746"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "name" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "record_kind" : "union",
   "referenced_type" : "type-745",
   "self_type" : "type-745",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoUt_E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "y",
     "field_offset" : 16,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Primaries1",
   "name" : "android::HDRStaticInfo::Primaries1",
   "referenced_type" : "type-747",
   "self_type" : "type-747",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo10Primaries1E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mR",
     "referenced_type" : "type-747"
    },
    {
     "field_name" : "mG",
     "field_offset" : 32,
     "referenced_type" : "type-747"
    },
    {
     "field_name" : "mB",
     "field_offset" : 64,
     "referenced_type" : "type-747"
    },
    {
     "field_name" : "mW",
     "field_offset" : 96,
     "referenced_type" : "type-747"
    },
    {
     "field_name" : "mMaxDisplayLuminance",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "mMinDisplayLuminance",
     "field_offset" : 144,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "mMaxContentLightLevel",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "mMaxFrameAverageLightLevel",
     "field_offset" : 176,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Type1",
   "name" : "android::HDRStaticInfo::Type1",
   "referenced_type" : "type-746",
   "self_type" : "type-746",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo5Type1E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::IBinder",
   "name" : "android::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder13isBinderAliveEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder10pingBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder11linkToDeathERKNS_2spINS0_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder13unlinkToDeathERKNS_2wpINS0_14DeathRecipientEEEPvjPS3_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::IBinder::DeathRecipient",
   "name" : "android::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipient10binderDiedERKNS_2wpIS0_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::IInterface",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "unique_id" : "_ZTSN7android10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::IOMX",
   "name" : "android::IOMX",
   "record_kind" : "class",
   "referenced_type" : "type-503",
   "self_type" : "type-503",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android4IOMXE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4IOMXE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4IOMXD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4IOMXD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IOMX9listNodesEPNS_4ListINS0_13ComponentInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IOMX12allocateNodeEPKcRKNS_2spINS_12IOMXObserverEEEPNS3_INS_8IOMXNodeEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IOMX18createInputSurfaceEPNS_2spINS_22IGraphicBufferProducerEEEPNS1_INS_20IGraphicBufferSourceEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mName",
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "mRoles",
     "field_offset" : 64,
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::IOMX::ComponentInfo",
   "name" : "android::IOMX::ComponentInfo",
   "referenced_type" : "type-506",
   "self_type" : "type-506",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android4IOMX13ComponentInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "android::IOMXNode",
   "name" : "android::IOMXNode",
   "record_kind" : "class",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android8IOMXNodeE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8IOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8IOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8IOMXNodeD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8IOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8IOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8IOMXNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "android::IOMXObserver",
   "name" : "android::IOMXObserver",
   "record_kind" : "class",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android12IOMXObserverE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12IOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12IOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12IOMXObserverD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12IOMXObserver22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12IOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12IOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12IOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-219"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-218",
   "self_type" : "type-218",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-217" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "type-70"
    }
   ],
   "linker_set_key" : "android::List<android::String8>",
   "name" : "android::List<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-72" ],
   "unique_id" : "_ZTSN7android4ListINS_7String8EEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7String8EED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "type-727"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 160,
     "referenced_type" : "type-728"
    }
   ],
   "linker_set_key" : "android::MediaImage",
   "name" : "android::MediaImage",
   "referenced_type" : "type-726",
   "self_type" : "type-726",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android10MediaImageE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "type-522"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mBitDepthAllocated",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 192,
     "referenced_type" : "type-523"
    }
   ],
   "linker_set_key" : "android::MediaImage2",
   "name" : "android::MediaImage2",
   "referenced_type" : "type-521",
   "self_type" : "type-521",
   "size" : 104,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android11MediaImage2E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::MediaImage2::PlaneInfo",
   "name" : "android::MediaImage2::PlaneInfo",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android11MediaImage29PlaneInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::MediaImage::PlaneInfo",
   "name" : "android::MediaImage::PlaneInfo",
   "referenced_type" : "type-729",
   "self_type" : "type-729",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android10MediaImage9PlaneInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-218"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::OMXPluginBase",
   "name" : "android::OMXPluginBase",
   "referenced_type" : "type-724",
   "self_type" : "type-724",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/OMXPluginBase.h",
   "unique_id" : "_ZTSN7android13OMXPluginBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13OMXPluginBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13OMXPluginBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13OMXPluginBaseD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase21makeComponentInstanceEPKcPK16OMX_CALLBACKTYPEPvPP17OMX_COMPONENTTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase24destroyComponentInstanceEP17OMX_COMPONENTTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase19enumerateComponentsEPcmj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13OMXPluginBase19getRolesOfComponentEPKcPNS_6VectorINS_7String8EEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mError",
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "type-96"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 320,
     "referenced_type" : "type-97"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 384,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 448,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 512,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSorted",
     "field_offset" : 576,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "mRequestHeaderPresent",
     "field_offset" : 584,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "mWorkSourceRequestHeaderPosition",
     "field_offset" : 640,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 704,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 712,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 720,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 768,
     "referenced_type" : "type-100"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 832,
     "referenced_type" : "type-35"
    },
    {
     "access" : "private",
     "field_name" : "mOpenAshmemSize",
     "field_offset" : 896,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::Parcel",
   "name" : "android::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 120,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFd",
     "referenced_type" : "type-12"
    },
    {
     "access" : "protected",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "access" : "protected",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    },
    {
     "access" : "protected",
     "field_name" : "mMutable",
     "field_offset" : 192,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "android::Parcel::Blob",
   "name" : "android::Parcel::Blob",
   "record_kind" : "class",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel4BlobE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "linker_set_key" : "android::Parcel::FlattenableHelperInterface",
   "name" : "android::Parcel::FlattenableHelperInterface",
   "record_kind" : "class",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel26FlattenableHelperInterfaceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface16getFlattenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface10getFdCountEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface7flattenEPvmPim"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Parcel26FlattenableHelperInterface9unflattenEPKvmPKim"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-109"
    }
   ],
   "linker_set_key" : "android::Parcel::ReadableBlob",
   "name" : "android::Parcel::ReadableBlob",
   "record_kind" : "class",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel12ReadableBlobE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-109"
    }
   ],
   "linker_set_key" : "android::Parcel::WritableBlob",
   "name" : "android::Parcel::WritableBlob",
   "record_kind" : "class",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel12WritableBlobE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::Parcelable",
   "name" : "android::Parcelable",
   "record_kind" : "class",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcelable.h",
   "unique_id" : "_ZTSN7android10ParcelableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10ParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "nMaxFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nMaxFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::PrepareForAdaptivePlaybackParams",
   "name" : "android::PrepareForAdaptivePlaybackParams",
   "referenced_type" : "type-757",
   "self_type" : "type-757",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android32PrepareForAdaptivePlaybackParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 64,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "android::PrependSPSPPSToIDRFramesParams",
   "name" : "android::PrependSPSPPSToIDRFramesParams",
   "referenced_type" : "type-763",
   "self_type" : "type-763",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android30PrependSPSPPSToIDRFramesParamsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-721",
   "self_type" : "type-721",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-664",
   "self_type" : "type-664",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bStoreMetaData",
     "field_offset" : 96,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "android::StoreMetaDataInBuffersParams",
   "name" : "android::StoreMetaDataInBuffersParams",
   "referenced_type" : "type-750",
   "self_type" : "type-750",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android28StoreMetaDataInBuffersParamsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-815"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-814",
   "self_type" : "type-814",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-336"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bufferHeader",
     "field_offset" : 192,
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "nativeBuffer",
     "field_offset" : 256,
     "referenced_type" : "type-759"
    }
   ],
   "linker_set_key" : "android::UseAndroidNativeBufferParams",
   "name" : "android::UseAndroidNativeBufferParams",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android28UseAndroidNativeBufferParamsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "type-37"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-751"
    }
   ],
   "linker_set_key" : "android::VideoDecoderOutputMetaData",
   "name" : "android::VideoDecoderOutputMetaData",
   "referenced_type" : "type-752",
   "self_type" : "type-752",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android26VideoDecoderOutputMetaDataE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "eType",
     "referenced_type" : "type-214"
    },
    {
     "field_name" : "pHandle",
     "field_offset" : 64,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "android::VideoGrallocMetadata",
   "name" : "android::VideoGrallocMetadata",
   "referenced_type" : "type-751",
   "self_type" : "type-751",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android20VideoGrallocMetadataE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "eType",
     "referenced_type" : "type-214"
    },
    {
     "field_name" : "pHandle",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "android::VideoNativeHandleMetadata",
   "name" : "android::VideoNativeHandleMetadata",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android25VideoNativeHandleMetadataE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "eType",
     "referenced_type" : "type-214"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "type-754"
    },
    {
     "field_name" : "nFenceFd",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::VideoNativeMetadata",
   "name" : "android::VideoNativeMetadata",
   "referenced_type" : "type-753",
   "self_type" : "type-753",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android19VideoNativeMetadataE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::base::DefaultCloser",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "unique_id" : "_ZTSN7android4base13DefaultCloserE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-186"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 64,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-170"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-160"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-159",
   "self_type" : "type-159",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 64,
     "referenced_type" : "type-150"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 256,
     "referenced_type" : "type-99"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 320,
     "referenced_type" : "type-151"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 512,
     "referenced_type" : "type-152"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 88,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-133",
   "self_type" : "type-133",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-5"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-143"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-145" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-139"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-74" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-5"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-139",
   "self_type" : "type-139",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-135"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-134",
   "self_type" : "type-134",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-137" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-5"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-147"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-75" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-5"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned char>",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIhEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-5"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<unsigned char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIhEUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-159"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 256,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-170",
   "self_type" : "type-170",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_death_recipient",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware20hidl_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEmRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-134"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_handle",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_handleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-182"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "type-183"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_memory",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_memoryE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-138"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_string",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_stringE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-142"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-204",
   "self_type" : "type-204",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-145" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-140"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<unsigned char>",
   "name" : "android::hardware::hidl_vec<unsigned char>",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIhEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_version",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "type-205",
   "self_type" : "type-205",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware12hidl_versionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nativeHandle",
     "referenced_type" : "type-182"
    },
    {
     "field_name" : "attr",
     "field_offset" : 128,
     "referenced_type" : "type-257"
    }
   ],
   "linker_set_key" : "android::hardware::media::V1_0::AnwBuffer",
   "name" : "android::hardware::media::V1_0::AnwBuffer",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/1.0/android.hardware.media@1.0_genc++_headers/gen/android/hardware/media/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media4V1_09AnwBufferE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "generationNumber",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "id",
     "field_offset" : 256,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::hardware::media::V1_0::AnwBufferAttributes",
   "name" : "android::hardware::media::V1_0::AnwBufferAttributes",
   "referenced_type" : "type-257",
   "self_type" : "type-257",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/1.0/android.hardware.media@1.0_genc++_headers/gen/android/hardware/media/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media4V1_019AnwBufferAttributesE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::hardware::media::V1_0::Rect",
   "name" : "android::hardware::media::V1_0::Rect",
   "referenced_type" : "type-259",
   "self_type" : "type-259",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/1.0/android.hardware.media@1.0_genc++_headers/gen/android/hardware/media/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media4V1_04RectE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-273"
    },
    {
     "field_name" : "attr",
     "field_offset" : 64,
     "referenced_type" : "type-274"
    },
    {
     "field_name" : "nativeHandle",
     "field_offset" : 384,
     "referenced_type" : "type-182"
    },
    {
     "field_name" : "sharedMemory",
     "field_offset" : 512,
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::hardware::media::omx::V1_0::CodecBuffer",
   "name" : "android::hardware::media::omx::V1_0::CodecBuffer",
   "referenced_type" : "type-272",
   "self_type" : "type-272",
   "size" : 104,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media3omx4V1_011CodecBufferE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "preset",
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "anwBuffer",
     "referenced_type" : "type-257"
    }
   ],
   "linker_set_key" : "android::hardware::media::omx::V1_0::CodecBuffer::Attributes",
   "name" : "android::hardware::media::omx::V1_0::CodecBuffer::Attributes",
   "record_kind" : "union",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media3omx4V1_011CodecBuffer10AttributesE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rangeOffset",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "rangeLength",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::hardware::media::omx::V1_0::CodecBuffer::PresetAttributes",
   "name" : "android::hardware::media::omx::V1_0::CodecBuffer::PresetAttributes",
   "referenced_type" : "type-275",
   "self_type" : "type-275",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media3omx4V1_011CodecBuffer16PresetAttributesE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "range",
     "referenced_type" : "type-278"
    },
    {
     "field_name" : "primaries",
     "field_offset" : 32,
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "transfer",
     "field_offset" : 64,
     "referenced_type" : "type-280"
    },
    {
     "field_name" : "matrixCoeffs",
     "field_offset" : 96,
     "referenced_type" : "type-281"
    }
   ],
   "linker_set_key" : "android::hardware::media::omx::V1_0::ColorAspects",
   "name" : "android::hardware::media::omx::V1_0::ColorAspects",
   "referenced_type" : "type-277",
   "self_type" : "type-277",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware5media3omx4V1_012ColorAspectsE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "android::hardware::media::omx::V1_0::IOmxBufferSource",
   "name" : "android::hardware::media::omx::V1_0::IOmxBufferSource",
   "referenced_type" : "type-271",
   "self_type" : "type-271",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/media/omx/1.0/android.hardware.media.omx@1.0_genc++_headers/gen/android/hardware/media/omx/1.0/IOmxBufferSource.h",
   "unique_id" : "_ZTSN7android8hardware5media3omx4V1_016IOmxBufferSourceE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware5media3omx4V1_016IOmxBufferSourceE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware5media3omx4V1_016IOmxBufferSource8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSourceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource14onOmxExecutingEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource9onOmxIdleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource11onOmxLoadedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource18onInputBufferAddedEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware5media3omx4V1_016IOmxBufferSource20onInputBufferEmptiedEjRKNS0_11hidl_handleE"
    },
    {
     "kind" : "vcall_offset"
    },
