{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [1024]",
   "name" : "char [1024]",
   "referenced_type" : "type-64",
   "self_type" : "type-63",
   "size" : 1024,
   "source_file" : "/system/core/base/include/android-base/file.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "long",
   "name" : "long",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "signed char",
   "name" : "signed char",
   "referenced_type" : "type-107",
   "self_type" : "type-107",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned char",
   "name" : "unsigned char",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 1
  },
  {
   "alignment" : 4,

   "name" : "void **",
   "referenced_type" : "type-46",
   "self_type" : "type-50",
   "size" : 8,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "zip_archive::Reader *",
   "name" : "zip_archive::Reader *",
   "referenced_type" : "type-56",
   "self_type" : "type-57",
   "size" : 8,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "zip_archive::Writer *",
   "name" : "zip_archive::Writer *",
   "referenced_type" : "type-54",
   "self_type" : "type-55",
   "size" : 8,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "ZipArchive *const",
   "name" : "ZipArchive *const",
   "referenced_type" : "type-42",
   "self_type" : "type-48",
   "size" : 8,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const ZipEntry",
   "name" : "const ZipEntry",
   "referenced_type" : "type-16",
   "self_type" : "type-15",
   "size" : 40,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const ZipString",
   "name" : "const ZipString",
   "referenced_type" : "type-1",
   "self_type" : "type-17",
   "size" : 16,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::base::ErrnoRestorer",
   "name" : "const android::base::ErrnoRestorer",
   "referenced_type" : "type-71",
   "self_type" : "type-73",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const bool",
   "name" : "const bool",
   "referenced_type" : "type-12",
   "self_type" : "type-75",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-64",
   "self_type" : "type-85",
   "size" : 1,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-22",
   "self_type" : "type-45",
   "size" : 4,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const signed char",
   "name" : "const signed char",
   "referenced_type" : "type-107",
   "self_type" : "type-106",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-123",
   "self_type" : "type-122",
   "size" : 24,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-39",
   "self_type" : "type-38",
   "size" : 24,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::unique_ptr<android::base::LogMessageData, std::default_delete<android::base::LogMessageData> >",
   "name" : "const std::unique_ptr<android::base::LogMessageData, std::default_delete<android::base::LogMessageData> >",
   "referenced_type" : "type-118",
   "self_type" : "type-117",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::unique_ptr<android::base::LogMessageData, std::default_delete<android::base::LogMessageData> >",
   "name" : "const std::unique_ptr<android::base::LogMessageData, std::default_delete<android::base::LogMessageData> >",
   "referenced_type" : "type-35",
   "self_type" : "type-34",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-4",
   "self_type" : "type-3",
   "size" : 1,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-11",
   "self_type" : "type-60",
   "size" : 4,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-47",
   "self_type" : "type-82",
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const zip_archive::Reader",
   "name" : "const zip_archive::Reader",
   "referenced_type" : "type-56",
   "self_type" : "type-58",
   "size" : 8,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "path",
     "referenced_type" : "type-63"
    },
    {
     "access" : "private",
     "field_name" : "remove_dir_and_contents_",
     "field_offset" : 8192,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "TemporaryDir",
   "name" : "TemporaryDir",
   "record_kind" : "class",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 1025,
   "source_file" : "/system/core/base/include/android-base/file.h",
   "unique_id" : "_ZTS12TemporaryDir"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "path",
     "field_offset" : 32,
     "referenced_type" : "type-63"
    },
    {
     "access" : "private",
     "field_name" : "remove_file_",
     "field_offset" : 8224,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "TemporaryFile",
   "name" : "TemporaryFile",
   "record_kind" : "class",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 1032,
   "source_file" : "/system/core/base/include/android-base/file.h",
   "unique_id" : "_ZTS13TemporaryFile"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "handle_",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "access" : "protected",
     "field_name" : "offset_",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "access" : "protected",
     "field_name" : "crc32_",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "ZipArchiveStreamEntry",
   "name" : "ZipArchiveStreamEntry",
   "record_kind" : "class",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 32,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive_stream_entry.h",
   "unique_id" : "_ZTS21ZipArchiveStreamEntry",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI21ZipArchiveStreamEntry"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntry4ReadEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntry6VerifyEv"
    },
    {
     "mangled_component_name" : "_ZN21ZipArchiveStreamEntry4InitERK8ZipEntry"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "method",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "mod_time",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "unix_mode",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "has_data_descriptor",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "crc32",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "compressed_length",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "uncompressed_length",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "offset",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "ZipEntry",
   "name" : "ZipEntry",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 40,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h",
   "unique_id" : "_ZTS8ZipEntry"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "name_length",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "ZipString",
   "name" : "ZipString",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h",
   "unique_id" : "_ZTS9ZipString"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "file_",
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "seekable_",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "current_offset_",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "state_",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "files_",
     "field_offset" : 256,
     "referenced_type" : "type-23"
    },
    {
     "access" : "private",
     "field_name" : "current_file_entry_",
     "field_offset" : 448,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "z_stream_",
     "field_offset" : 896,
     "referenced_type" : "type-26"
    },
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 1024,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "ZipWriter",
   "name" : "ZipWriter",
   "record_kind" : "class",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 152,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_writer.h",
   "unique_id" : "_ZTS9ZipWriter"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "path",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "compression_method",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "crc32",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "compressed_size",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "uncompressed_size",
     "field_offset" : 288,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "last_mod_time",
     "field_offset" : 320,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "last_mod_date",
     "field_offset" : 336,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "padding_length",
     "field_offset" : 352,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "local_file_header_offset",
     "field_offset" : 384,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "ZipWriter::FileEntry",
   "name" : "ZipWriter::FileEntry",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 56,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_writer.h",
   "unique_id" : "_ZTSN9ZipWriter9FileEntryE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, char *>",
   "name" : "android::base::EagerEvaluator<char *, char *>",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-88", "type-88" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcS2_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, const char *>",
   "name" : "android::base::EagerEvaluator<char *, const char *>",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-88", "type-84" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcPKcEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, char *>",
   "name" : "android::base::EagerEvaluator<const char *, char *>",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-84", "type-88" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcPcEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, const char *>",
   "name" : "android::base::EagerEvaluator<const char *, const char *>",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-84", "type-84" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcS3_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "referenced_type" : "type-104",
   "self_type" : "type-104",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-105", "type-105" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaS3_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-105", "type-110" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaPaEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-2", "type-2" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhS3_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-2", "type-51" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhPhEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<int, int>",
   "name" : "android::base::EagerEvaluator<int, int>",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-22", "type-22" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIiiEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-110", "type-105" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaPKaEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-110", "type-110" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaS2_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "referenced_type" : "type-100",
   "self_type" : "type-100",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-51", "type-2" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhPKhEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-51", "type-51" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhS2_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned long, unsigned long>",
   "name" : "android::base::EagerEvaluator<unsigned long, unsigned long>",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 16,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-6", "type-6" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorImmEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "android::base::ErrnoRestorer",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base13ErrnoRestorerE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "android::base::LogMessage",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "type-116",
   "self_type" : "type-116",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogMessageE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::base::LogdLogger",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogdLoggerE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "base_",
     "referenced_type" : "type-88"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::base::MappedFile",
   "name" : "android::base::MappedFile",
   "record_kind" : "class",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 24,
   "source_file" : "/system/core/base/include/android-base/mapped_file.h",
   "unique_id" : "_ZTSN7android4base10MappedFileE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::base::ScopedLogSeverity",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base17ScopedLogSeverityE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "zip_archive::Reader",
   "name" : "zip_archive::Reader",
   "record_kind" : "class",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 8,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h",
   "unique_id" : "_ZTSN11zip_archive6ReaderE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11zip_archive6ReaderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11zip_archive6Reader12ReadAtOffsetEPhmj"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11zip_archive6ReaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11zip_archive6ReaderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "zip_archive::Writer",
   "name" : "zip_archive::Writer",
   "record_kind" : "class",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 8,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_archive.h",
   "unique_id" : "_ZTSN11zip_archive6WriterE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11zip_archive6WriterE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11zip_archive6Writer6AppendEPhm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11zip_archive6WriterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11zip_archive6WriterD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "ZipWriter &&",
   "name" : "ZipWriter &&",
   "referenced_type" : "type-18",
   "self_type" : "type-30",
   "size" : 8,
   "source_file" : "/system/core/libziparchive/include/ziparchive/zip_writer.h"
  }
 ]
}
