{
 "array_types" :
 [
  {
   "linker_set_key" : "__sFILE []",
   "name" : "__sFILE []",
   "referenced_type" : "type-330",
   "self_type" : "type-332",
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdio.h"
  },
  {
   "linker_set_key" : "char *[]",
   "name" : "char *[]",
   "referenced_type" : "type-15",
   "self_type" : "type-302",
   "source_file" : "/out/soong/ndk/sysroot/usr/include/time.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [120]",
   "name" : "char [120]",
   "referenced_type" : "type-7",
   "self_type" : "type-297",
   "size" : 120,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [126]",
   "name" : "char [126]",
   "referenced_type" : "type-7",
   "self_type" : "type-39",
   "size" : 126,
   "source_file" : "/bionic/libc/kernel/uapi/linux/socket.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [14]",
   "name" : "char [14]",
   "referenced_type" : "type-7",
   "self_type" : "type-19",
   "size" : 14,
   "source_file" : "/bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [32]",
   "name" : "char [32]",
   "referenced_type" : "type-7",
   "self_type" : "type-291",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [4]",
   "name" : "char [4]",
   "referenced_type" : "type-7",
   "self_type" : "type-246",
   "size" : 4,

   "linker_set_key" : "const libunwind::Registers_arm64",
   "name" : "const libunwind::Registers_arm64",
   "referenced_type" : "type-104",
   "self_type" : "type-105",
   "size" : 528,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_mips_newabi",
   "name" : "const libunwind::Registers_mips_newabi",
   "referenced_type" : "type-134",
   "self_type" : "type-135",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_mips_o32",
   "name" : "const libunwind::Registers_mips_o32",
   "referenced_type" : "type-127",
   "self_type" : "type-128",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_or1k",
   "name" : "const libunwind::Registers_or1k",
   "referenced_type" : "type-122",
   "self_type" : "type-123",
   "size" : 136,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_ppc",
   "name" : "const libunwind::Registers_ppc",
   "referenced_type" : "type-85",
   "self_type" : "type-86",
   "size" : 936,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_ppc64",
   "name" : "const libunwind::Registers_ppc64",
   "referenced_type" : "type-98",
   "self_type" : "type-99",
   "size" : 1336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_sparc",
   "name" : "const libunwind::Registers_sparc",
   "referenced_type" : "type-139",
   "self_type" : "type-140",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_x86",
   "name" : "const libunwind::Registers_x86",
   "referenced_type" : "type-67",
   "self_type" : "type-68",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_x86_64",
   "name" : "const libunwind::Registers_x86_64",
   "referenced_type" : "type-77",
   "self_type" : "type-78",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::UnwindInfoSections",
   "name" : "const libunwind::UnwindInfoSections",
   "referenced_type" : "type-195",
   "self_type" : "type-319",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-4",
   "self_type" : "type-272",
   "size" : 1,
   "source_file" : "/frameworks/native/include/android/multinetwork.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-9",
   "self_type" : "type-385",
   "size" : 4,
   "source_file" : "/frameworks/base/native/android/net.c"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-11",
   "self_type" : "type-58",
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const void *const",
   "name" : "const void *const",
   "referenced_type" : "type-57",
   "self_type" : "type-56",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "sockaddr *const",
   "name" : "sockaddr *const",
   "referenced_type" : "type-16",
   "self_type" : "type-269",
   "size" : 4,
   "source_file" : "/bionic/libc/dns/include/resolv_netid.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-449",
   "self_type" : "type-451",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "type-443",
   "self_type" : "type-445",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "type-452",
   "self_type" : "type-454",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned int, const void *)",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "type-446",
   "self_type" : "type-448",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-10",
   "self_type" : "type-59",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dli_fname",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "dli_fbase",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "dli_sname",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "dli_saddr",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "Dl_info",
   "name" : "Dl_info",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/dlfcn.h",
   "unique_id" : "Dl_info"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf32_Chdr",
   "name" : "Elf32_Chdr",
   "referenced_type" : "type-167",
   "self_type" : "type-167",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Chdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf32_Lib",
   "name" : "Elf32_Lib",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS9Elf32_Lib"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 128,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 144,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "Elf32_Move",
   "name" : "Elf32_Move",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Move"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "Elf32_Syminfo",
   "name" : "Elf32_Syminfo",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Syminfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf32_Verdaux",
   "name" : "Elf32_Verdaux",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verdaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf32_Verdef",
   "name" : "Elf32_Verdef",
   "referenced_type" : "type-178",
   "self_type" : "type-178",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf32_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf32_Vernaux",
   "name" : "Elf32_Vernaux",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Vernaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf32_Verneed",
   "name" : "Elf32_Verneed",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verneed"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 32,
     "referenced_type" : "type-163"
    }
   ],
   "linker_set_key" : "Elf32_auxv_t",
   "name" : "Elf32_auxv_t",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf32_auxv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf32_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:49:3) at out/soong/ndk/sysroot/usr/include/elf.h:49:3",
   "name" : "Elf32_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:49:3) at out/soong/ndk/sysroot/usr/include/elf.h:49:3",
   "record_kind" : "union",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTSN12Elf32_auxv_tUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ch_reserved",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 128,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "Elf64_Chdr",
   "name" : "Elf64_Chdr",
   "referenced_type" : "type-168",
   "self_type" : "type-168",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Chdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 64,
     "referenced_type" : "type-147"
    }
   ],
   "linker_set_key" : "Elf64_Dyn",
   "name" : "Elf64_Dyn",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9Elf64_Dyn"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-73"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_Dyn::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3",
   "name" : "Elf64_Dyn::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3",
   "record_kind" : "union",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTSN9Elf64_DynUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf64_Lib",
   "name" : "Elf64_Lib",
   "referenced_type" : "type-170",
   "self_type" : "type-170",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS9Elf64_Lib"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 128,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 192,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 208,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "Elf64_Move",
   "name" : "Elf64_Move",
   "referenced_type" : "type-172",
   "self_type" : "type-172",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Move"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "Elf64_Syminfo",
   "name" : "Elf64_Syminfo",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Syminfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf64_Verdaux",
   "name" : "Elf64_Verdaux",
   "referenced_type" : "type-181",
   "self_type" : "type-181",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verdaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf64_Verdef",
   "name" : "Elf64_Verdef",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf64_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf64_Vernaux",
   "name" : "Elf64_Vernaux",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Vernaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Elf64_Verneed",
   "name" : "Elf64_Verneed",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verneed"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 64,
     "referenced_type" : "type-166"
    }
   ],
   "linker_set_key" : "Elf64_auxv_t",
   "name" : "Elf64_auxv_t",
   "referenced_type" : "type-165",
   "self_type" : "type-165",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf64_auxv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-73"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:56:3) at out/soong/ndk/sysroot/usr/include/elf.h:56:3",
   "name" : "Elf64_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:56:3) at out/soong/ndk/sysroot/usr/include/elf.h:56:3",
   "record_kind" : "union",
   "referenced_type" : "type-166",
   "self_type" : "type-166",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTSN12Elf64_auxv_tUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "exception_cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-374"
    },
    {
     "field_name" : "unwinder_cache",
     "field_offset" : 96,
     "referenced_type" : "type-377"
    },
    {
     "field_name" : "barrier_cache",
     "field_offset" : 256,
     "referenced_type" : "type-378"
    },
    {
     "field_name" : "cleanup_cache",
     "field_offset" : 448,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "pr_cache",
     "field_offset" : 576,
     "referenced_type" : "type-50"
    },
    {
     "field_offset" : 704,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "_Unwind_Control_Block",
   "name" : "_Unwind_Control_Block",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 88,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTS21_Unwind_Control_Block"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "exception_cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-391"
    },
    {
     "field_name" : "unwinder_cache",
     "field_offset" : 96,
     "referenced_type" : "type-393"
    },
    {
     "field_name" : "barrier_cache",
     "field_offset" : 256,
     "referenced_type" : "type-394"
    },
    {
     "field_name" : "cleanup_cache",
     "field_offset" : 448,
     "referenced_type" : "type-395"
    },
    {
     "field_name" : "pr_cache",
     "field_offset" : 576,
     "referenced_type" : "type-396"
    },
    {
     "field_offset" : 704,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "_Unwind_Control_Block",
   "name" : "_Unwind_Control_Block",
   "referenced_type" : "type-390",
   "self_type" : "type-390",
   "size" : 88,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved1",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved4",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved5",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "referenced_type" : "type-377",
   "self_type" : "type-377",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved1",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved4",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved5",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "referenced_type" : "type-393",
   "self_type" : "type-393",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sp",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "bitpattern",
     "field_offset" : 32,
     "referenced_type" : "type-379"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "referenced_type" : "type-378",
   "self_type" : "type-378",
   "size" : 24,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sp",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "bitpattern",
     "field_offset" : 32,
     "referenced_type" : "type-379"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "referenced_type" : "type-394",
   "self_type" : "type-394",
   "size" : 24,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitpattern",
     "referenced_type" : "type-29"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "referenced_type" : "type-395",
   "self_type" : "type-395",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitpattern",
     "referenced_type" : "type-29"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fnstart",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ehtp",
     "field_offset" : 32,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "additional",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fnstart",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ehtp",
     "field_offset" : 32,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "additional",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/posix_types.h",
   "unique_id" : "__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-258"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-257",
   "self_type" : "type-257",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-258"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-400",
   "self_type" : "type-400",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/posix_types.h",
   "unique_id" : "__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-258"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-436",
   "self_type" : "type-436",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "__kernel_fsid_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-222",
   "self_type" : "type-222",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-251"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-230"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3) at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3",
   "name" : "__kernel_sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3) at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3",
   "record_kind" : "union",
   "referenced_type" : "type-227",
   "self_type" : "type-227",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTSN18__kernel_sigactionUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "type-305"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "type-306"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "type-304",
   "self_type" : "type-304",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/pthread.h",
   "unique_id" : "__pthread_cleanup_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sample_validity",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "success_threshold",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "min_samples",
     "field_offset" : 24,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "max_samples",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "base_timeout_msec",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "__res_params",
   "name" : "__res_params",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 12,
   "source_file" : "/bionic/libc/dns/include/resolv_params.h",
   "unique_id" : "__res_params"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-331"
    }
   ],
   "linker_set_key" : "__sFILE",
   "name" : "__sFILE",
   "referenced_type" : "type-330",
   "self_type" : "type-330",
   "size" : 84,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/struct_file.h",
   "unique_id" : "__sFILE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "type-237"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-238"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-240"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-241"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-242"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-248"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-249"
    }
   ],
   "linker_set_key" : "__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "type-236",
   "self_type" : "type-236",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS10__sifields"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:38:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:38:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:38:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:38:3",
   "referenced_type" : "type-237",
   "self_type" : "type-237",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-239"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:42:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:42:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:42:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:42:3",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-239"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:48:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:48:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:48:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:48:3",
   "referenced_type" : "type-240",
   "self_type" : "type-240",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-213"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:53:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:53:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:53:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:53:3",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-10"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-243"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3",
   "referenced_type" : "type-242",
   "self_type" : "type-242",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-244"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-247"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5",
   "record_kind" : "union",
   "referenced_type" : "type-243",
   "self_type" : "type-243",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-246"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:73:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:73:7",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:73:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:73:7",
   "referenced_type" : "type-245",
   "self_type" : "type-245",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-246"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:78:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:78:7",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:78:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:78:7",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:84:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:84:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:84:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:84:3",
   "referenced_type" : "type-248",
   "self_type" : "type-248",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:88:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:88:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:88:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:88:3",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt5_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ai_flags",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ai_family",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ai_socktype",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ai_protocol",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ai_addrlen",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ai_canonname",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ai_addr",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "ai_next",
     "field_offset" : 224,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "addrinfo",
   "name" : "addrinfo",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 32,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "addrinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "app_netid",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "app_mark",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "dns_netid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "dns_mark",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "uid",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "qhook",
     "field_offset" : 192,
     "referenced_type" : "type-266"
    }
   ],
   "linker_set_key" : "android_net_context",
   "name" : "android_net_context",
   "referenced_type" : "type-265",
   "self_type" : "type-265",
   "size" : 28,
   "source_file" : "/bionic/libc/dns/include/resolv_netid.h",
   "unique_id" : "android_net_context"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "referenced_type" : "type-354",
   "self_type" : "type-354",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-113" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-355",
   "self_type" : "type-355",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "referenced_type" : "type-351",
   "self_type" : "type-351",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-352",
   "self_type" : "type-352",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<libunwind::Registers_mips_newabi>",
   "name" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<libunwind::Registers_mips_newabi>",
   "referenced_type" : "type-363",
   "self_type" : "type-363",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-134" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind21Registers_mips_newabiE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-364",
   "self_type" : "type-364",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind21Registers_mips_newabiE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "referenced_type" : "type-360",
   "self_type" : "type-360",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-127" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-361",
   "self_type" : "type-361",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "referenced_type" : "type-357",
   "self_type" : "type-357",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-122" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-358",
   "self_type" : "type-358",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "referenced_type" : "type-345",
   "self_type" : "type-345",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-85" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-346",
   "self_type" : "type-346",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<libunwind::Registers_ppc64>",
   "name" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<libunwind::Registers_ppc64>",
   "referenced_type" : "type-348",
   "self_type" : "type-348",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_ppc64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-349",
   "self_type" : "type-349",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_ppc64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_sparc, unw_context_t>::blk_count<libunwind::Registers_sparc>",
   "name" : "check_fit<Registers_sparc, unw_context_t>::blk_count<libunwind::Registers_sparc>",
   "referenced_type" : "type-366",
   "self_type" : "type-366",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-139" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_sparcE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_sparc, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_sparc, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-367",
   "self_type" : "type-367",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_sparcE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "referenced_type" : "type-339",
   "self_type" : "type-339",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-67" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-340",
   "self_type" : "type-340",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "referenced_type" : "type-342",
   "self_type" : "type-342",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-343",
   "self_type" : "type-343",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-318" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS4_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "referenced_type" : "type-370",
   "self_type" : "type-370",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS5_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "referenced_type" : "type-353",
   "self_type" : "type-353",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-113", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_armE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "referenced_type" : "type-350",
   "self_type" : "type-350",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-104", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_arm64E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_newabi, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_newabi, unw_context_t>",
   "referenced_type" : "type-362",
   "self_type" : "type-362",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-134", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind21Registers_mips_newabiE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "referenced_type" : "type-359",
   "self_type" : "type-359",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-127", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "referenced_type" : "type-356",
   "self_type" : "type-356",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-122", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind14Registers_or1kE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "referenced_type" : "type-344",
   "self_type" : "type-344",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-85", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_ppcE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_ppc64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_ppc64, unw_context_t>",
   "referenced_type" : "type-347",
   "self_type" : "type-347",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-98", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_ppc64E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_sparc, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_sparc, unw_context_t>",
   "referenced_type" : "type-365",
   "self_type" : "type-365",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-139", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_sparcE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-67", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_x86E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "referenced_type" : "type-341",
   "self_type" : "type-341",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-77", "type-90" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "name" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "referenced_type" : "type-368",
   "self_type" : "type-368",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-318", "type-71" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cmsg_len",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "cmsg_level",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "cmsg_type",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "cmsghdr",
   "name" : "cmsghdr",
   "referenced_type" : "type-432",
   "self_type" : "type-432",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "cmsghdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-216"
    }
   ],
   "linker_set_key" : "cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sched.h",
   "unique_id" : "cpu_set_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-334",
   "self_type" : "type-334",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-455",
   "self_type" : "type-455",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "addressSpace",
     "referenced_type" : "type-197"
    },
    {
     "field_name" : "sects",
     "field_offset" : 32,
     "referenced_type" : "type-201"
    },
    {
     "field_name" : "targetAddr",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "dl_iterate_cb_data",
   "name" : "dl_iterate_cb_data",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSZN9libunwind17LocalAddressSpace18findUnwindSectionsEjRNS_18UnwindInfoSectionsEE18dl_iterate_cb_data"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dlpi_addr",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "dlpi_name",
     "field_offset" : 32,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "dlpi_phdr",
     "field_offset" : 64,
     "referenced_type" : "type-189"
    },
    {
     "field_name" : "dlpi_phnum",
     "field_offset" : 96,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "dl_phdr_info",
   "name" : "dl_phdr_info",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "dl_phdr_info"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tbase",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "dbase",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "func",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "dwarf_eh_bases",
   "name" : "dwarf_eh_bases",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "dwarf_eh_bases"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 32,
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "dynamic",
   "name" : "dynamic",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS7dynamic"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "dynamic::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3",
   "name" : "dynamic::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3",
   "record_kind" : "union",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTSN7dynamicUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 320,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 336,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 352,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 368,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 384,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 400,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "elf32_hdr",
   "name" : "elf32_hdr",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 52,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "elf32_note",
   "name" : "elf32_note",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_note"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "elf32_phdr",
   "name" : "elf32_phdr",
   "referenced_type" : "type-156",
   "self_type" : "type-156",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_phdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "elf32_rel",
   "name" : "elf32_rel",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_rel"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf32_rela",
   "name" : "elf32_rela",
   "referenced_type" : "type-150",
   "self_type" : "type-150",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_rela"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "elf32_shdr",
   "name" : "elf32_shdr",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_shdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 104,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 112,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "elf32_sym",
   "name" : "elf32_sym",
   "referenced_type" : "type-152",
   "self_type" : "type-152",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_sym"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 256,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 320,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 384,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 416,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 432,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 448,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 464,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 480,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 496,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "elf64_hdr",
   "name" : "elf64_hdr",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "elf64_note",
   "name" : "elf64_note",
   "referenced_type" : "type-161",
   "self_type" : "type-161",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_note"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 128,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 192,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 256,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 320,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 384,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "elf64_phdr",
   "name" : "elf64_phdr",
   "referenced_type" : "type-157",
   "self_type" : "type-157",
   "size" : 56,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_phdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "elf64_rel",
   "name" : "elf64_rel",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_rel"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 128,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "elf64_rela",
   "name" : "elf64_rela",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_rela"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 128,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 192,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 256,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 320,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 352,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 384,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 448,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "elf64_shdr",
   "name" : "elf64_shdr",
   "referenced_type" : "type-159",
   "self_type" : "type-159",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_shdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 40,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 48,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 128,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "elf64_sym",
   "name" : "elf64_sym",
   "referenced_type" : "type-153",
   "self_type" : "type-153",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_sym"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "f_owner_ex",
   "name" : "f_owner_ex",
   "referenced_type" : "type-423",
   "self_type" : "type-423",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "f_owner_ex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-244"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-244"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 64,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "flock",
   "name" : "flock",
   "referenced_type" : "type-424",
   "self_type" : "type-424",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "flock"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-244"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-244"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "flock64",
   "name" : "flock64",
   "referenced_type" : "type-426",
   "self_type" : "type-426",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "flock64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gf_interface",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "gf_group",
     "field_offset" : 32,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "gf_fmode",
     "field_offset" : 1056,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "gf_numsrc",
     "field_offset" : 1088,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "gf_slist",
     "field_offset" : 1120,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "group_filter",
   "name" : "group_filter",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 268,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "group_filter"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gr_interface",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "gr_group",
     "field_offset" : 32,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "group_req",
   "name" : "group_req",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 132,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "group_req"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gsr_interface",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "gsr_group",
     "field_offset" : 32,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "gsr_source",
     "field_offset" : 1056,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "group_source_req",
   "name" : "group_source_req",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 260,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "group_source_req"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h_name",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "h_aliases",
     "field_offset" : 32,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "h_addrtype",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "h_length",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "h_addr_list",
     "field_offset" : 128,
     "referenced_type" : "type-435"
    }
   ],
   "linker_set_key" : "hostent",
   "name" : "hostent",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 20,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "hostent"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/inttypes.h",
   "unique_id" : "imaxdiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/inttypes.h",
   "unique_id" : "_ZTS9imaxdiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "in6_u",
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "in6_addr",
   "name" : "in6_addr",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "in6_addr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "u6_addr8",
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "u6_addr16",
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "u6_addr32",
     "referenced_type" : "type-29"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "in6_addr::(anonymous union at bionic/libc/kernel/uapi/linux/in6.h:25:3) at bionic/libc/kernel/uapi/linux/in6.h:25:3",
   "name" : "in6_addr::(anonymous union at bionic/libc/kernel/uapi/linux/in6.h:25:3) at bionic/libc/kernel/uapi/linux/in6.h:25:3",
   "record_kind" : "union",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "in6_addr::(anonymous union at bionic/libc/kernel/uapi/linux/in6.h:25:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flr_dst",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "flr_label",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "flr_action",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "flr_share",
     "field_offset" : 168,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "flr_flags",
     "field_offset" : 176,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "flr_expires",
     "field_offset" : 192,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "flr_linger",
     "field_offset" : 208,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "__flr_pad",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "in6_flowlabel_req",
   "name" : "in6_flowlabel_req",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "in6_flowlabel_req"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifr6_addr",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "ifr6_prefixlen",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ifr6_ifindex",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "in6_ifreq",
   "name" : "in6_ifreq",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "in6_ifreq"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipi6_addr",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "ipi6_ifindex",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "in6_pktinfo",
   "name" : "in6_pktinfo",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "in6_pktinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_addr",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "in_addr",
   "name" : "in_addr",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/in_addr.h",
   "unique_id" : "in_addr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipi_ifindex",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ipi_spec_dst",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "ipi_addr",
     "field_offset" : 64,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "in_pktinfo",
   "name" : "in_pktinfo",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "in_pktinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "iovec",
   "name" : "iovec",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/uio.h",
   "unique_id" : "iovec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ip6m_addr",
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "ip6m_mtu",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "ip6_mtuinfo",
   "name" : "ip6_mtuinfo",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "ip6_mtuinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "imr_interface",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "ip_mreq",
   "name" : "ip_mreq",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "ip_mreq"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "imr_interface",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "imr_sourceaddr",
     "field_offset" : 64,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "ip_mreq_source",
   "name" : "ip_mreq_source",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 12,
   "source_file" : "/bionic/libc/include/bits/ip_mreq_source.h",
   "unique_id" : "ip_mreq_source"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "imr_address",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "imr_ifindex",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "ip_mreqn",
   "name" : "ip_mreqn",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "ip_mreqn"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imsf_multiaddr",
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "imsf_interface",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "imsf_fmode",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "imsf_numsrc",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "imsf_slist",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "ip_msfilter",
   "name" : "ip_msfilter",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 20,
   "source_file" : "/bionic/libc/include/bits/ip_msfilter.h",
   "unique_id" : "ip_msfilter"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "length",
     "field_offset" : 8,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "addr",
     "field_offset" : 16,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "ipv6_destopt_hao",
   "name" : "ipv6_destopt_hao",
   "referenced_type" : "type-175",
   "self_type" : "type-175",
   "size" : 18,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "ipv6_destopt_hao"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipv6mr_multiaddr",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "ipv6mr_ifindex",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "ipv6_mreq",
   "name" : "ipv6_mreq",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "ipv6_mreq"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nexthdr",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "hdrlen",
     "field_offset" : 8,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "ipv6_opt_hdr",
   "name" : "ipv6_opt_hdr",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 2,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "ipv6_opt_hdr"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nexthdr",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "hdrlen",
     "field_offset" : 8,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "type",
     "field_offset" : 16,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "segments_left",
     "field_offset" : 24,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "ipv6_rt_hdr",
   "name" : "ipv6_rt_hdr",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "ipv6_rt_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "priority",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "version",
     "field_offset" : 4,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "flow_lbl",
     "field_offset" : 8,
     "referenced_type" : "type-186"
    },
    {
     "field_name" : "payload_len",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "nexthdr",
     "field_offset" : 48,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "hop_limit",
     "field_offset" : 56,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "saddr",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "daddr",
     "field_offset" : 192,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "ipv6hdr",
   "name" : "ipv6hdr",
   "referenced_type" : "type-185",
   "self_type" : "type-185",
   "size" : 40,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "ipv6hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-212"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-212"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-219",
   "self_type" : "type-219",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-217"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-217"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-220",
   "self_type" : "type-220",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-335",
   "self_type" : "type-335",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "libunwind::AbstractUnwindCursor",
   "name" : "libunwind::AbstractUnwindCursor",
   "record_kind" : "class",
   "referenced_type" : "type-314",
   "self_type" : "type-314",
   "size" : 4,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind20AbstractUnwindCursorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind20AbstractUnwindCursorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "libunwind::EHABIIndexEntry",
   "name" : "libunwind::EHABIIndexEntry",
   "referenced_type" : "type-321",
   "self_type" : "type-321",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind15EHABIIndexEntryE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_i",
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-197"
    },
    {
     "access" : "private",
     "field_name" : "_sects",
     "field_offset" : 64,
     "referenced_type" : "type-323"
    }
   ],
   "linker_set_key" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "name" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "referenced_type" : "type-322",
   "self_type" : "type-322",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-196" ],
   "unique_id" : "_ZTSN9libunwind20EHABISectionIteratorINS_17LocalAddressSpaceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "libunwind::LocalAddressSpace",
   "name" : "libunwind::LocalAddressSpace",
   "record_kind" : "class",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind17LocalAddressSpaceE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_lock",
     "referenced_type" : "type-311"
    }
   ],
   "linker_set_key" : "libunwind::RWMutex",
   "name" : "libunwind::RWMutex",
   "record_kind" : "class",
   "referenced_type" : "type-310",
   "self_type" : "type-310",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/src/RWMutex.hpp",
   "unique_id" : "_ZTSN9libunwind7RWMutexE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-107"
    },
    {
     "access" : "private",
     "field_name" : "_use_X_for_vfp_save",
     "field_offset" : 512,
     "referenced_type" : "type-114"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d0_d15",
     "field_offset" : 520,
     "referenced_type" : "type-114"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d16_d31",
     "field_offset" : 528,
     "referenced_type" : "type-114"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d0_d15_pad",
     "field_offset" : 576,
     "referenced_type" : "type-110"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d16_d31",
     "field_offset" : 1664,
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm",
   "name" : "libunwind::Registers_arm",
   "record_kind" : "class",
   "referenced_type" : "type-113",
   "self_type" : "type-113",
   "size" : 336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_armE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-101"
    },
    {
     "access" : "private",
     "field_name" : "_vectorHalfRegisters",
     "field_offset" : 2176,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64",
   "name" : "libunwind::Registers_arm64",
   "record_kind" : "class",
   "referenced_type" : "type-104",
   "self_type" : "type-104",
   "size" : 528,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__x",
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "__fp",
     "field_offset" : 1856,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1920,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 1984,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__ra_sign_state",
     "field_offset" : 2112,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64::GPRs",
   "name" : "libunwind::Registers_arm64::GPRs",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 272,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm644GPRsE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 416,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 448,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 480,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm::GPRs",
   "name" : "libunwind::Registers_arm::GPRs",
   "referenced_type" : "type-107",
   "self_type" : "type-107",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_arm4GPRsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-130"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_newabi",
   "name" : "libunwind::Registers_mips_newabi",
   "record_kind" : "class",
   "referenced_type" : "type-134",
   "self_type" : "type-134",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind21Registers_mips_newabiE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 2112,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 2176,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_newabi::mips_newabi_thread_state_t",
   "name" : "libunwind::Registers_mips_newabi::mips_newabi_thread_state_t",
   "referenced_type" : "type-130",
   "self_type" : "type-130",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind21Registers_mips_newabi26mips_newabi_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-125"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32",
   "name" : "libunwind::Registers_mips_o32",
   "record_kind" : "class",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o32E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-119"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 1024,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 1056,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 1088,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "name" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o3223mips_o32_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k",
   "name" : "libunwind::Registers_or1k",
   "record_kind" : "class",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 136,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1kE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-119"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 1024,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__epcr",
     "field_offset" : 1056,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "name" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "referenced_type" : "type-118",
   "self_type" : "type-118",
   "size" : 136,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1k19or1k_thread_state_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-80"
    },
    {
     "access" : "private",
     "field_name" : "_floatRegisters",
     "field_offset" : 1280,
     "referenced_type" : "type-81"
    },
    {
     "access" : "private",
     "field_name" : "_vectorRegisters",
     "field_offset" : 3392,
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc",
   "name" : "libunwind::Registers_ppc",
   "record_kind" : "class",
   "referenced_type" : "type-85",
   "self_type" : "type-85",
   "size" : 936,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppcE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-93"
    },
    {
     "access" : "private",
     "field_name" : "_vectorScalarRegisters",
     "field_offset" : 2496,
     "referenced_type" : "type-96"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64",
   "name" : "libunwind::Registers_ppc64",
   "record_kind" : "class",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 1336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__srr0",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__srr1",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r0",
     "field_offset" : 128,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r1",
     "field_offset" : 192,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r2",
     "field_offset" : 256,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r3",
     "field_offset" : 320,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r4",
     "field_offset" : 384,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r5",
     "field_offset" : 448,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r6",
     "field_offset" : 512,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r7",
     "field_offset" : 576,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 640,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 704,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 768,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 832,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 896,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 960,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 1024,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 1088,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r16",
     "field_offset" : 1152,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r17",
     "field_offset" : 1216,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r18",
     "field_offset" : 1280,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r19",
     "field_offset" : 1344,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r20",
     "field_offset" : 1408,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r21",
     "field_offset" : 1472,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r22",
     "field_offset" : 1536,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r23",
     "field_offset" : 1600,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r24",
     "field_offset" : 1664,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r25",
     "field_offset" : 1728,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r26",
     "field_offset" : 1792,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r27",
     "field_offset" : 1856,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r28",
     "field_offset" : 1920,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r29",
     "field_offset" : 1984,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r30",
     "field_offset" : 2048,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r31",
     "field_offset" : 2112,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__cr",
     "field_offset" : 2176,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__xer",
     "field_offset" : 2240,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 2304,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__ctr",
     "field_offset" : 2368,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__vrsave",
     "field_offset" : 2432,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64::ppc64_thread_state_t",
   "name" : "libunwind::Registers_ppc64::ppc64_thread_state_t",
   "referenced_type" : "type-93",
   "self_type" : "type-93",
   "size" : 312,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc6420ppc64_thread_state_tE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "asfloat",
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "v",
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64::ppc64_vsr_t",
   "name" : "libunwind::Registers_ppc64::ppc64_vsr_t",
   "record_kind" : "union",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc6411ppc64_vsr_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-74"
    },
    {
     "field_name" : "v2",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64::ppc64_vsr_t::asfloat_s",
   "name" : "libunwind::Registers_ppc64::ppc64_vsr_t::asfloat_s",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc6411ppc64_vsr_t9asfloat_sE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__fpregs",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "__fpscr_pad",
     "field_offset" : 2048,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__fpscr",
     "field_offset" : 2080,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_float_state_t",
   "name" : "libunwind::Registers_ppc::ppc_float_state_t",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 264,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc17ppc_float_state_tE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__srr0",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__srr1",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r0",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r1",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r2",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r3",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r4",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r5",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r6",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r7",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 320,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 352,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 384,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 416,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 448,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 480,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 512,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 544,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r16",
     "field_offset" : 576,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r17",
     "field_offset" : 608,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r18",
     "field_offset" : 640,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r19",
     "field_offset" : 672,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r20",
     "field_offset" : 704,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r21",
     "field_offset" : 736,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r22",
     "field_offset" : 768,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r23",
     "field_offset" : 800,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r24",
     "field_offset" : 832,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r25",
     "field_offset" : 864,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r26",
     "field_offset" : 896,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r27",
     "field_offset" : 928,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r28",
     "field_offset" : 960,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r29",
     "field_offset" : 992,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r30",
     "field_offset" : 1024,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__r31",
     "field_offset" : 1056,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__cr",
     "field_offset" : 1088,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__xer",
     "field_offset" : 1120,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1152,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__ctr",
     "field_offset" : 1184,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__mq",
     "field_offset" : 1216,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__vrsave",
     "field_offset" : 1248,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "name" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 160,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc18ppc_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-137"
    }
   ],
   "linker_set_key" : "libunwind::Registers_sparc",
   "name" : "libunwind::Registers_sparc",
   "record_kind" : "class",
   "referenced_type" : "type-139",
   "self_type" : "type-139",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_sparcE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__regs",
     "referenced_type" : "type-119"
    }
   ],
   "linker_set_key" : "libunwind::Registers_sparc::sparc_thread_state_t",
   "name" : "libunwind::Registers_sparc::sparc_thread_state_t",
   "referenced_type" : "type-137",
   "self_type" : "type-137",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_sparc20sparc_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86",
   "name" : "libunwind::Registers_x86",
   "record_kind" : "class",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x86E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__eax",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__ebx",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__ecx",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__edx",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__edi",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__esi",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__ebp",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__esp",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__ss",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__eflags",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__eip",
     "field_offset" : 320,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 352,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__ds",
     "field_offset" : 384,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__es",
     "field_offset" : 416,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 448,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 480,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86::GPRs",
   "name" : "libunwind::Registers_x86::GPRs",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x864GPRsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-75"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64",
   "name" : "libunwind::Registers_x86_64",
   "record_kind" : "class",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__rax",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__rbx",
     "field_offset" : 64,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__rcx",
     "field_offset" : 128,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__rdx",
     "field_offset" : 192,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__rdi",
     "field_offset" : 256,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__rsi",
     "field_offset" : 320,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__rbp",
     "field_offset" : 384,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__rsp",
     "field_offset" : 448,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 512,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 576,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 640,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 704,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 768,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 832,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 896,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 960,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__rip",
     "field_offset" : 1024,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__rflags",
     "field_offset" : 1088,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 1152,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 1216,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 1280,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64::GPRs",
   "name" : "libunwind::Registers_x86_64::GPRs",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_644GPRsE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-314"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-316"
    },
    {
     "access" : "private",
     "field_name" : "_registers",
     "field_offset" : 64,
     "referenced_type" : "type-113"
    },
    {
     "access" : "private",
     "field_name" : "_info",
     "field_offset" : 2752,
     "referenced_type" : "type-174"
    },
    {
     "access" : "private",
     "field_name" : "_unwindInfoMissing",
     "field_offset" : 3072,
     "referenced_type" : "type-114"
    },
    {
     "access" : "private",
     "field_name" : "_isSignalFrame",
     "field_offset" : 3080,
     "referenced_type" : "type-114"
    }
   ],
   "linker_set_key" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "name" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "record_kind" : "class",
   "referenced_type" : "type-318",
   "self_type" : "type-318",
   "size" : 392,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-196", "type-113" ],
   "unique_id" : "_ZTSN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arm_section",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "arm_section_length",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "libunwind::UnwindInfoSections",
   "name" : "libunwind::UnwindInfoSections",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind18UnwindInfoSectionsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vec",
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "libunwind::v128",
   "name" : "libunwind::v128",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind4v128E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_onoff",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_linger",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "linger",
   "name" : "linger",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "linger"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_addr",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "l_name",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "l_ld",
     "field_offset" : 64,
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "l_next",
     "field_offset" : 96,
     "referenced_type" : "type-193"
    },
    {
     "field_name" : "l_prev",
     "field_offset" : 128,
     "referenced_type" : "type-193"
    }
   ],
   "linker_set_key" : "link_map",
   "name" : "link_map",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "link_map"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-336",
   "self_type" : "type-336",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-457",
   "self_type" : "type-457",
   "size" : 16,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-442",
   "self_type" : "type-442",
   "size" : 40,
   "source_file" : "/bionic/libc/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_hdr",
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "msg_len",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "mmsghdr",
   "name" : "mmsghdr",
   "referenced_type" : "type-431",
   "self_type" : "type-431",
   "size" : 32,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "mmsghdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_name",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "msg_namelen",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "msg_iov",
     "field_offset" : 64,
     "referenced_type" : "type-430"
    },
    {
     "field_name" : "msg_iovlen",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "msg_control",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "msg_controllen",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "msg_flags",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "msghdr",
   "name" : "msghdr",
   "referenced_type" : "type-429",
   "self_type" : "type-429",
   "size" : 28,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "msghdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_name",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "n_aliases",
     "field_offset" : 32,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "n_addrtype",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "n_net",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "netent",
   "name" : "netent",
   "referenced_type" : "type-437",
   "self_type" : "type-437",
   "size" : 16,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "netent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p_name",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "p_aliases",
     "field_offset" : 32,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "p_proto",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "protoent",
   "name" : "protoent",
   "referenced_type" : "type-439",
   "self_type" : "type-439",
   "size" : 12,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "protoent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-288",
   "self_type" : "type-288",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-402",
   "self_type" : "type-402",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 24,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-208"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-207",
   "self_type" : "type-207",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-309"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-308",
   "self_type" : "type-308",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-309"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-397",
   "self_type" : "type-397",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-309"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-309"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-329",
   "self_type" : "type-329",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-309"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-404",
   "self_type" : "type-404",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-309"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-406",
   "self_type" : "type-406",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-312"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-311",
   "self_type" : "type-311",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-312"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-405",
   "self_type" : "type-405",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-312"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-412",
   "self_type" : "type-412",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-258"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-418",
   "self_type" : "type-418",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_version",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_map",
     "field_offset" : 32,
     "referenced_type" : "type-193"
    },
    {
     "field_name" : "r_brk",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "r_state",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "r_ldbase",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "r_debug",
   "name" : "r_debug",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "r_debug"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rt_hdr",
     "referenced_type" : "type-120"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "addr",
     "field_offset" : 64,
     "referenced_type" : "type-143"
    }
   ],
   "linker_set_key" : "rt0_hdr",
   "name" : "rt0_hdr",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "rt0_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rt_hdr",
     "referenced_type" : "type-120"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "addr",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "rt2_hdr",
   "name" : "rt2_hdr",
   "referenced_type" : "type-164",
   "self_type" : "type-164",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "rt2_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "sched_param",
   "name" : "sched_param",
   "referenced_type" : "type-214",
   "self_type" : "type-214",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sched.h",
   "unique_id" : "sched_param"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_name",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "s_aliases",
     "field_offset" : 32,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "s_port",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "s_proto",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "servent",
   "name" : "servent",
   "referenced_type" : "type-438",
   "self_type" : "type-438",
   "size" : 16,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "servent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-278"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-251"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-277",
   "self_type" : "type-277",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-280"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-251"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-275"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-279",
   "self_type" : "type-279",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-230"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-280",
   "self_type" : "type-280",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-230"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-278",
   "self_type" : "type-278",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-225",
   "self_type" : "type-225",
   "size" : 84,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-239"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "type-260"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-259",
   "self_type" : "type-259",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-261"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-262"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:226:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:226:3",
   "name" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:226:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:226:3",
   "record_kind" : "union",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 52,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-263"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:226:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:229:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:229:5",
   "name" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:226:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:229:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:229:5",
   "referenced_type" : "type-262",
   "self_type" : "type-262",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-234"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-233",
   "self_type" : "type-233",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-235"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "type-250"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:102:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:102:3",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:102:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:102:3",
   "record_kind" : "union",
   "referenced_type" : "type-234",
   "self_type" : "type-234",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "type-236"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:102:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:103:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:103:5 <Spelling=out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:95:19>",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:102:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:103:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:103:5 <Spelling=out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:95:19>",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-276"
    }
   ],
   "linker_set_key" : "sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "type-275",
   "self_type" : "type-275",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS10sigset64_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-239",
   "self_type" : "type-239",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "sa_family",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "sa_data",
     "field_offset" : 16,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "sockaddr",
   "name" : "sockaddr",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 16,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "sockaddr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sin_family",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "sin_port",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "sin_addr",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 64,
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "sockaddr_in",
   "name" : "sockaddr_in",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "sockaddr_in"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sin6_family",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "sin6_port",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "sin6_flowinfo",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sin6_addr",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "sin6_scope_id",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "sockaddr_in6",
   "name" : "sockaddr_in6",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 28,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "sockaddr_in6"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_family",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "__data",
     "field_offset" : 16,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "sockaddr_storage",
   "name" : "sockaddr_storage",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/socket.h",
   "unique_id" : "sockaddr_storage"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "timespec",
   "name" : "timespec",
   "referenced_type" : "type-212",
   "self_type" : "type-212",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/timespec.h",
   "unique_id" : "_ZTS8timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "timeval",
   "name" : "timeval",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS7timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "timezone",
   "name" : "timezone",
   "referenced_type" : "type-218",
   "self_type" : "type-218",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS8timezone"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "tm",
   "name" : "tm",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 44,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/time.h",
   "unique_id" : "tm"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-294"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-256"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "type-225"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "type-295"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "type-298"
    }
   ],
   "linker_set_key" : "ucontext",
   "name" : "ucontext",
   "referenced_type" : "type-293",
   "self_type" : "type-293",
   "size" : 744,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h",
   "unique_id" : "ucontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "type-275"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3",
   "name" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3",
   "record_kind" : "union",
   "referenced_type" : "type-295",
   "self_type" : "type-295",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5",
   "name" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "uid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "gid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "ucred",
   "name" : "ucred",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "ucred"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "unw_context_t",
   "name" : "unw_context_t",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 1336,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "unw_context_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "unw_context_t",
   "name" : "unw_context_t",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 1336,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS13unw_context_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "unw_cursor_t",
   "name" : "unw_cursor_t",
   "referenced_type" : "type-408",
   "self_type" : "type-408",
   "size" : 1432,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "unw_cursor_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "unw_cursor_t",
   "name" : "unw_cursor_t",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 1432,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS12unw_cursor_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_ip",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "end_ip",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "lsda",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "handler",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "gp",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "unwind_info_size",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "unwind_info",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "extra",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "unw_proc_info_t",
   "name" : "unw_proc_info_t",
   "referenced_type" : "type-174",
   "self_type" : "type-174",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS15unw_proc_info_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_ip",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "end_ip",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "lsda",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "handler",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "gp",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "unwind_info_size",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "unwind_info",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "extra",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "unw_proc_info_t",
   "name" : "unw_proc_info_t",
   "referenced_type" : "type-409",
   "self_type" : "type-409",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "unw_proc_info_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "entryPageOffset",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "entryCount",
     "field_offset" : 48,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "encodingsPageOffset",
     "field_offset" : 64,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "encodingsCount",
     "field_offset" : 80,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "unwind_info_compressed_second_level_page_header",
   "name" : "unwind_info_compressed_second_level_page_header",
   "referenced_type" : "type-209",
   "self_type" : "type-209",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS47unwind_info_compressed_second_level_page_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "unwind_info_regular_second_level_entry",
   "name" : "unwind_info_regular_second_level_entry",
   "referenced_type" : "type-205",
   "self_type" : "type-205",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS38unwind_info_regular_second_level_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "entryPageOffset",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "entryCount",
     "field_offset" : 48,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "unwind_info_regular_second_level_page_header",
   "name" : "unwind_info_regular_second_level_page_header",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS44unwind_info_regular_second_level_page_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "commonEncodingsArraySectionOffset",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "commonEncodingsArrayCount",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "personalityArraySectionOffset",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "personalityArrayCount",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "indexSectionOffset",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "indexCount",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "unwind_info_section_header",
   "name" : "unwind_info_section_header",
   "referenced_type" : "type-202",
   "self_type" : "type-202",
   "size" : 28,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS26unwind_info_section_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "secondLevelPagesSectionOffset",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "lsdaIndexArraySectionOffset",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "unwind_info_section_header_index_entry",
   "name" : "unwind_info_section_header_index_entry",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS38unwind_info_section_header_index_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "lsdaOffset",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "unwind_info_section_header_lsda_index_entry",
   "name" : "unwind_info_section_header_lsda_index_entry",
   "referenced_type" : "type-204",
   "self_type" : "type-204",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS43unwind_info_section_header_lsda_index_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "type-290"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "type-291"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "type-208"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "type-281"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "type-292"
    }
   ],
   "linker_set_key" : "user",
   "name" : "user",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 296,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-282"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "type-281",
   "self_type" : "type-281",
   "size" : 116,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_fpregs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "user_fpregs::fp_reg",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "type-283",
   "self_type" : "type-283",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_fpregs::fp_reg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "type-285"
    }
   ],
   "linker_set_key" : "user_regs",
   "name" : "user_regs",
   "referenced_type" : "type-284",
   "self_type" : "type-284",
   "size" : 72,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_regs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "type-286",
   "self_type" : "type-286",
   "size" : 264,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_vfp"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "type-287",
   "self_type" : "type-287",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_vfp_exc"
  }
 ],
 "rvalue_reference_types" : []
}
