{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-118",
   "self_type" : "type-117",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-687",
   "self_type" : "type-913",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-27",
   "self_type" : "type-527",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [32]",
   "name" : "unsigned char [32]",
   "referenced_type" : "type-114",
   "self_type" : "type-669",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-114",
   "self_type" : "type-113",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [8]",
   "name" : "unsigned int [8]",
   "referenced_type" : "type-2",
   "self_type" : "type-906",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,

   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-884",
   "self_type" : "type-883",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-114",
   "self_type" : "type-763",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-305",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-3",
   "self_type" : "type-64",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-116",
   "self_type" : "type-702",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-5",
   "self_type" : "type-792",
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-44",
   "self_type" : "type-436",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-27",
   "self_type" : "type-321",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-435"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-317"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-316",
   "self_type" : "type-316",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-311", "type-263" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-616"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-615",
   "self_type" : "type-615",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-617" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-613"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-612",
   "self_type" : "type-612",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-614" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-302"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-924"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-923",
   "self_type" : "type-923",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-615"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-618"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-930"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-929",
   "self_type" : "type-929",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-933"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-932",
   "self_type" : "type-932",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-933"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-935",
   "self_type" : "type-935",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-715",
   "self_type" : "type-715",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-710",
   "self_type" : "type-710",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTag",
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "android::ScopedTrace",
   "name" : "android::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "type-937",
   "self_type" : "type-937",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Trace.h",
   "unique_id" : "_ZTSN7android11ScopedTraceE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-318"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "type-317",
   "self_type" : "type-317",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-319" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-304"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-318",
   "self_type" : "type-318",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-312"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-311",
   "self_type" : "type-311",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-320",
   "self_type" : "type-320",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-9"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "type-433"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-301"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "type-434"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "type-436"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "type-436"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "type-430"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-432",
   "self_type" : "type-432",
   "size" : 44,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-304"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-306" ],
   "unique_id" : "_ZTSN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-305"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-305"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-304",
   "self_type" : "type-304",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-612"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-8"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 32,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 64,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 96,
     "referenced_type" : "type-28"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::hardware::BHwBinder",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 28,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware9BHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-9"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 96,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwRefBase",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware11BpHwRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-38"
    },
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_0::IBroadcastRadio>",
   "name" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_0::IBroadcastRadio>",
   "record_kind" : "class",
   "referenced_type" : "type-828",
   "self_type" : "type-828",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_015IBroadcastRadio8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio13getPropertiesENSt3__18functionIFvNS2_6ResultERKNS2_10PropertiesEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio9openTunerERKNS2_10BandConfigEbRKNS_2spINS2_14ITunerCallbackEEENSt3__18functionIFvNS2_6ResultERKNS7_INS2_6ITunerEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-14"
    },
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_0::IBroadcastRadioFactory>",
   "name" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_0::IBroadcastRadioFactory>",
   "record_kind" : "class",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory13connectModuleENS2_5ClassENSt3__18functionIFvNS2_6ResultERKNS_2spINS2_15IBroadcastRadioEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-179"
    },
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_0::ITuner>",
   "name" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_0::ITuner>",
   "record_kind" : "class",
   "referenced_type" : "type-826",
   "self_type" : "type-826",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-179" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_06ITuner8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner16setConfigurationERKNS2_10BandConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner16getConfigurationENSt3__18functionIFvNS2_6ResultERKNS2_10BandConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner4scanENS2_9DirectionEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner4stepENS2_9DirectionEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner4tuneEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner6cancelEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner21getProgramInformationENSt3__18functionIFvNS2_6ResultERKNS2_11ProgramInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-207"
    },
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_0::ITunerCallback>",
   "name" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_0::ITunerCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-827",
   "self_type" : "type-827",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-207" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_014ITunerCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback15hardwareFailureEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback12configChangeENS2_6ResultERKNS2_10BandConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback12tuneCompleteENS2_6ResultERKNS2_11ProgramInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback8afSwitchERKNS2_11ProgramInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback18antennaStateChangeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback19trafficAnnouncementEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback21emergencyAnnouncementEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback11newMetadataEjjRKNS0_8hidl_vecINS2_8MetaDataEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-37"
    },
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_1::IBroadcastRadio>",
   "name" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_1::IBroadcastRadio>",
   "record_kind" : "class",
   "referenced_type" : "type-174",
   "self_type" : "type-174",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_115IBroadcastRadio8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio13getPropertiesENSt3__18functionIFvNS1_4V1_06ResultERKNS6_10PropertiesEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio9openTunerERKNS1_4V1_010BandConfigEbRKNS_2spINS4_14ITunerCallbackEEENSt3__18functionIFvNS4_6ResultERKNS8_INS4_6ITunerEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio17getProperties_1_1ENSt3__18functionIFvRKNS2_10PropertiesEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio8getImageEiNSt3__18functionIFvRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_1::IBroadcastRadioFactory>",
   "name" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_1::IBroadcastRadioFactory>",
   "record_kind" : "class",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory13connectModuleENS1_4V1_05ClassENSt3__18functionIFvNS4_6ResultERKNS_2spINS4_15IBroadcastRadioEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-178"
    },
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_1::ITuner>",
   "name" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_1::ITuner>",
   "record_kind" : "class",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-178" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_16ITuner8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner16setConfigurationERKNS1_4V1_010BandConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner16getConfigurationENSt3__18functionIFvNS1_4V1_06ResultERKNS6_10BandConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner4scanENS1_4V1_09DirectionEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner4stepENS1_4V1_09DirectionEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner4tuneEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner6cancelEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner21getProgramInformationENSt3__18functionIFvNS1_4V1_06ResultERKNS6_11ProgramInfoEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner21tuneByProgramSelectorERKNS2_15ProgramSelectorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner18cancelAnnouncementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner25getProgramInformation_1_1ENSt3__18functionIFvNS1_4V1_06ResultERKNS2_11ProgramInfoEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner19startBackgroundScanEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner14getProgramListERKNS0_8hidl_vecINS2_14VendorKeyValueEEENSt3__18functionIFvNS2_17ProgramListResultERKNS4_INS2_11ProgramInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner15setAnalogForcedEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner14isAnalogForcedENSt3__18functionIFvNS1_4V1_06ResultEbEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-355"
    },
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_1::ITunerCallback>",
   "name" : "android::hardware::BpInterface<android::hardware::broadcastradio::V1_1::ITunerCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-364",
   "self_type" : "type-364",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-355" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_114ITunerCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback15hardwareFailureEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback12configChangeENS1_4V1_06ResultERKNS4_10BandConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback12tuneCompleteENS1_4V1_06ResultERKNS4_11ProgramInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback8afSwitchERKNS1_4V1_011ProgramInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback18antennaStateChangeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback19trafficAnnouncementEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback21emergencyAnnouncementEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback11newMetadataEjjRKNS0_8hidl_vecINS1_4V1_08MetaDataEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback16tuneComplete_1_1ENS1_4V1_06ResultERKNS2_15ProgramSelectorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback23backgroundScanAvailableEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback22backgroundScanCompleteENS2_17ProgramListResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback18programListChangedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback25currentProgramInfoChangedERKNS2_11ProgramInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-15"
    },
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "name" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-825",
   "self_type" : "type-825",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-847"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "record_kind" : "class",
   "referenced_type" : "type-846",
   "self_type" : "type-846",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-573", "type-849" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEENS0_7details9SchedPrioEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-856"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-857"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-855",
   "self_type" : "type-855",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-573", "type-44" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEEbEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-861"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-862"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "name" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-860",
   "self_type" : "type-860",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-249", "type-24" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-878"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-879"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-877",
   "self_type" : "type-877",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-880", "type-881" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS_4hidl4base4V1_05IBaseEEEPvEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-867"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-868"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-866",
   "self_type" : "type-866",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-869", "type-870" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS0_7IBinderEEEPvEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-724",
   "self_type" : "type-724",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-719"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-731",
   "self_type" : "type-731",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder::DeathRecipient",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-255",
   "self_type" : "type-255",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::hardware::IInterface",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "unique_id" : "_ZTSN7android8hardware10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "type-736"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "type-773"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "name" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "type-799",
   "self_type" : "type-799",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "type-118" ],
   "unique_id" : "_ZTSN7android8hardware12MQDescriptorIcLNS0_8MQFlavorE1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 32,
     "referenced_type" : "type-831"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 128,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 160,
     "referenced_type" : "type-147"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 288,
     "referenced_type" : "type-157"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 448,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 456,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 464,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 480,
     "referenced_type" : "type-832"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 512,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-830",
   "self_type" : "type-830",
   "size" : 68,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel::BufferInfo",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "type-836",
   "self_type" : "type-836",
   "size" : 20,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6Parcel10BufferInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-9"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 32,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 96,
     "referenced_type" : "type-298"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 128,
     "referenced_type" : "type-299"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 224,
     "referenced_type" : "type-300"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 288,
     "referenced_type" : "type-301"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 320,
     "referenced_type" : "type-303"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 480,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 512,
     "referenced_type" : "type-307"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 544,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 576,
     "referenced_type" : "type-316"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 736,
     "referenced_type" : "type-320"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 768,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 776,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 800,
     "referenced_type" : "type-321"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 832,
     "referenced_type" : "type-305"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 864,
     "referenced_type" : "type-322"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "type-297",
   "self_type" : "type-297",
   "size" : 120,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessStateE",
   "vtable_components" :
   [
    {
     "component_value" : 112,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -112,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -112,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "refs",
     "field_offset" : 32,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState::handle_entry",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessState12handle_entryE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::broadcastradio::V1_0::Result>",
   "name" : "android::hardware::Return<android::hardware::broadcastradio::V1_0::Result>",
   "record_kind" : "class",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_14broadcastradio4V1_06ResultEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-211"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::hardware::broadcastradio::V1_1::ProgramListResult>",
   "name" : "android::hardware::Return<android::hardware::broadcastradio::V1_1::ProgramListResult>",
   "record_kind" : "class",
   "referenced_type" : "type-210",
   "self_type" : "type-210",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-211" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS0_14broadcastradio4V1_117ProgramListResultEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::broadcastradio::V1_1::IBroadcastRadio> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::broadcastradio::V1_1::IBroadcastRadio> >",
   "record_kind" : "class",
   "referenced_type" : "type-593",
   "self_type" : "type-593",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-35" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_14broadcastradio4V1_115IBroadcastRadioEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-1058"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::broadcastradio::V1_1::IBroadcastRadioFactory> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::broadcastradio::V1_1::IBroadcastRadioFactory> >",
   "record_kind" : "class",
   "referenced_type" : "type-1079",
   "self_type" : "type-1079",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1058" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-176"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::broadcastradio::V1_1::ITuner> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::broadcastradio::V1_1::ITuner> >",
   "record_kind" : "class",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-176" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_14broadcastradio4V1_16ITunerEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-353"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::broadcastradio::V1_1::ITunerCallback> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::broadcastradio::V1_1::ITunerCallback> >",
   "record_kind" : "class",
   "referenced_type" : "type-370",
   "self_type" : "type-370",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-353" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_14broadcastradio4V1_114ITunerCallbackEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 168,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "android::hardware::Return<bool>",
   "name" : "android::hardware::Return<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIbEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-606",
   "self_type" : "type-606",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-200"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "stereo",
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::AmBandConfig",
   "name" : "android::hardware::broadcastradio::V1_0::AmBandConfig",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 1,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_012AmBandConfigE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "antennaConnected",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "lowerLimit",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "upperLimit",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "spacings",
     "field_offset" : 128,
     "referenced_type" : "type-387"
    },
    {
     "field_name" : "ext",
     "field_offset" : 256,
     "referenced_type" : "type-557"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BandConfig",
   "name" : "android::hardware::broadcastradio::V1_0::BandConfig",
   "referenced_type" : "type-555",
   "self_type" : "type-555",
   "size" : 48,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_010BandConfigE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fm",
     "referenced_type" : "type-558"
    },
    {
     "field_name" : "am",
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BandConfig::Ext",
   "name" : "android::hardware::broadcastradio::V1_0::BandConfig::Ext",
   "record_kind" : "union",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_010BandConfig3ExtE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-514"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BnHwBroadcastRadio",
   "name" : "android::hardware::broadcastradio::V1_0::BnHwBroadcastRadio",
   "referenced_type" : "type-1027",
   "self_type" : "type-1027",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/BnHwBroadcastRadio.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BnHwBroadcastRadio10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_018BnHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BnHwBroadcastRadioFactory",
   "name" : "android::hardware::broadcastradio::V1_0::BnHwBroadcastRadioFactory",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/BnHwBroadcastRadioFactory.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactory10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_025BnHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-228"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BnHwTuner",
   "name" : "android::hardware::broadcastradio::V1_0::BnHwTuner",
   "referenced_type" : "type-1013",
   "self_type" : "type-1013",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/BnHwTuner.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_09BnHwTunerE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_09BnHwTunerE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BnHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BnHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BnHwTuner10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_09BnHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_09BnHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_09BnHwTunerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_09BnHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_09BnHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_09BnHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-205"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BnHwTunerCallback",
   "name" : "android::hardware::broadcastradio::V1_0::BnHwTunerCallback",
   "referenced_type" : "type-1020",
   "self_type" : "type-1020",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/BnHwTunerCallback.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_017BnHwTunerCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_017BnHwTunerCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BnHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BnHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BnHwTunerCallback10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_017BnHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_017BnHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_017BnHwTunerCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_017BnHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_017BnHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_017BnHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-828"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-1030"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-1031"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BpHwBroadcastRadio",
   "name" : "android::hardware::broadcastradio::V1_0::BpHwBroadcastRadio",
   "referenced_type" : "type-1029",
   "self_type" : "type-1029",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/BpHwBroadcastRadio.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio13getPropertiesENSt3__18functionIFvNS2_6ResultERKNS2_10PropertiesEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadio9openTunerERKNS2_10BandConfigEbRKNS_2spINS2_14ITunerCallbackEEENSt3__18functionIFvNS2_6ResultERKNS7_INS2_6ITunerEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_015IBroadcastRadioEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_018BpHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-13"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-99"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-100"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BpHwBroadcastRadioFactory",
   "name" : "android::hardware::broadcastradio::V1_0::BpHwBroadcastRadioFactory",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/BpHwBroadcastRadioFactory.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactory13connectModuleENS2_5ClassENSt3__18functionIFvNS2_6ResultERKNS_2spINS2_15IBroadcastRadioEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_022IBroadcastRadioFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_025BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-826"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-1016"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-1017"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BpHwTuner",
   "name" : "android::hardware::broadcastradio::V1_0::BpHwTuner",
   "referenced_type" : "type-1015",
   "self_type" : "type-1015",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/BpHwTuner.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_09BpHwTunerE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_09BpHwTunerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_09BpHwTuner8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner16setConfigurationERKNS2_10BandConfigE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner16getConfigurationENSt3__18functionIFvNS2_6ResultERKNS2_10BandConfigEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner4scanENS2_9DirectionEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner4stepENS2_9DirectionEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner4tuneEjj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner6cancelEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_09BpHwTuner21getProgramInformationENSt3__18functionIFvNS2_6ResultERKNS2_11ProgramInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_09BpHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_09BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_09BpHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_06ITunerEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_09BpHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_09BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_09BpHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_09BpHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_09BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_09BpHwTunerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_09BpHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_09BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_09BpHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-827"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-1023"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-1024"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::BpHwTunerCallback",
   "name" : "android::hardware::broadcastradio::V1_0::BpHwTunerCallback",
   "referenced_type" : "type-1022",
   "self_type" : "type-1022",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/BpHwTunerCallback.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_017BpHwTunerCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_017BpHwTunerCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_017BpHwTunerCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback15hardwareFailureEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback12configChangeENS2_6ResultERKNS2_10BandConfigE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback12tuneCompleteENS2_6ResultERKNS2_11ProgramInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback8afSwitchERKNS2_11ProgramInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback18antennaStateChangeEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback19trafficAnnouncementEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback21emergencyAnnouncementEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_017BpHwTunerCallback11newMetadataEjjRKNS0_8hidl_vecINS2_8MetaDataEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_017BpHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_014ITunerCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_017BpHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_017BpHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_017BpHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_017BpHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "deemphasis",
     "referenced_type" : "type-559"
    },
    {
     "field_name" : "stereo",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "rds",
     "field_offset" : 64,
     "referenced_type" : "type-560"
    },
    {
     "field_name" : "ta",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "af",
     "field_offset" : 104,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "ea",
     "field_offset" : 112,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::FmBandConfig",
   "name" : "android::hardware::broadcastradio::V1_0::FmBandConfig",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_012FmBandConfigE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::IBroadcastRadio",
   "name" : "android::hardware::broadcastradio::V1_0::IBroadcastRadio",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/IBroadcastRadio.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_015IBroadcastRadioE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_015IBroadcastRadioE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_015IBroadcastRadio8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadioD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio13getPropertiesENSt3__18functionIFvNS2_6ResultERKNS2_10PropertiesEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_015IBroadcastRadio9openTunerERKNS2_10BandConfigEbRKNS_2spINS2_14ITunerCallbackEEENSt3__18functionIFvNS2_6ResultERKNS7_INS2_6ITunerEEEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_015IBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_015IBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_015IBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::IBroadcastRadioFactory",
   "name" : "android::hardware::broadcastradio::V1_0::IBroadcastRadioFactory",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/IBroadcastRadioFactory.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactoryE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactoryE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactory13connectModuleENS2_5ClassENSt3__18functionIFvNS2_6ResultERKNS_2spINS2_15IBroadcastRadioEEEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_022IBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_022IBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_022IBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::ITuner",
   "name" : "android::hardware::broadcastradio::V1_0::ITuner",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/ITuner.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_06ITunerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_06ITunerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_06ITuner8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITunerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner16setConfigurationERKNS2_10BandConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner16getConfigurationENSt3__18functionIFvNS2_6ResultERKNS2_10BandConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner4scanENS2_9DirectionEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner4stepENS2_9DirectionEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner4tuneEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner6cancelEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_06ITuner21getProgramInformationENSt3__18functionIFvNS2_6ResultERKNS2_11ProgramInfoEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_06ITunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_06ITunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_06ITunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::ITunerCallback",
   "name" : "android::hardware::broadcastradio::V1_0::ITunerCallback",
   "referenced_type" : "type-207",
   "self_type" : "type-207",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/ITunerCallback.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_014ITunerCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_014ITunerCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_014ITunerCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback15hardwareFailureEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback12configChangeENS2_6ResultERKNS2_10BandConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback12tuneCompleteENS2_6ResultERKNS2_11ProgramInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback8afSwitchERKNS2_11ProgramInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback18antennaStateChangeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback19trafficAnnouncementEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback21emergencyAnnouncementEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_014ITunerCallback11newMetadataEjjRKNS0_8hidl_vecINS2_8MetaDataEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_014ITunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_014ITunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_014ITunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "key",
     "field_offset" : 32,
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "intValue",
     "field_offset" : 64,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "clockValue",
     "field_offset" : 128,
     "referenced_type" : "type-138"
    },
    {
     "field_name" : "stringValue",
     "field_offset" : 256,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "rawValue",
     "field_offset" : 384,
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::MetaData",
   "name" : "android::hardware::broadcastradio::V1_0::MetaData",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 64,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_08MetaDataE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "utcSecondsSinceEpoch",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "timezoneOffsetInMinutes",
     "field_offset" : 64,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::MetaDataClock",
   "name" : "android::hardware::broadcastradio::V1_0::MetaDataClock",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_013MetaDataClockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "channel",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "subChannel",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tuned",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "stereo",
     "field_offset" : 72,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "digital",
     "field_offset" : 80,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "signalStrength",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "metadata",
     "field_offset" : 128,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::ProgramInfo",
   "name" : "android::hardware::broadcastradio::V1_0::ProgramInfo",
   "referenced_type" : "type-130",
   "self_type" : "type-130",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_011ProgramInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "classId",
     "referenced_type" : "type-550"
    },
    {
     "field_name" : "implementor",
     "field_offset" : 64,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "product",
     "field_offset" : 192,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "version",
     "field_offset" : 320,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "serial",
     "field_offset" : 448,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "numTuners",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numAudioSources",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "supportsCapture",
     "field_offset" : 640,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "bands",
     "field_offset" : 704,
     "referenced_type" : "type-551"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_0::Properties",
   "name" : "android::hardware::broadcastradio::V1_0::Properties",
   "referenced_type" : "type-549",
   "self_type" : "type-549",
   "size" : 104,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.0/android.hardware.broadcastradio@1.0_genc++_headers/gen/android/hardware/broadcastradio/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_010PropertiesE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BnHwBroadcastRadio",
   "name" : "android::hardware::broadcastradio::V1_1::BnHwBroadcastRadio",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BnHwBroadcastRadio.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BnHwBroadcastRadio10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_118BnHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-1058"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BnHwBroadcastRadioFactory",
   "name" : "android::hardware::broadcastradio::V1_1::BnHwBroadcastRadioFactory",
   "referenced_type" : "type-1062",
   "self_type" : "type-1062",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BnHwBroadcastRadioFactory.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactory10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_125BnHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-176"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BnHwTuner",
   "name" : "android::hardware::broadcastradio::V1_1::BnHwTuner",
   "referenced_type" : "type-181",
   "self_type" : "type-181",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BnHwTuner.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_19BnHwTunerE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_19BnHwTunerE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BnHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BnHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BnHwTuner10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_19BnHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_19BnHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_19BnHwTunerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_19BnHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_19BnHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_19BnHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-353"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BnHwTunerCallback",
   "name" : "android::hardware::broadcastradio::V1_1::BnHwTunerCallback",
   "referenced_type" : "type-357",
   "self_type" : "type-357",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BnHwTunerCallback.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_117BnHwTunerCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_117BnHwTunerCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BnHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BnHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BnHwTunerCallback10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_117BnHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_117BnHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware14broadcastradio4V1_117BnHwTunerCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_117BnHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_117BnHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_117BnHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-174"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-172"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-173"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BpHwBroadcastRadio",
   "name" : "android::hardware::broadcastradio::V1_1::BpHwBroadcastRadio",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BpHwBroadcastRadio.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio13getPropertiesENSt3__18functionIFvNS1_4V1_06ResultERKNS6_10PropertiesEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio9openTunerERKNS1_4V1_010BandConfigEbRKNS_2spINS4_14ITunerCallbackEEENSt3__18functionIFvNS4_6ResultERKNS8_INS4_6ITunerEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio17getProperties_1_1ENSt3__18functionIFvRKNS2_10PropertiesEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadio8getImageEiNSt3__18functionIFvRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_115IBroadcastRadioEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_118BpHwBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-30"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-107"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BpHwBroadcastRadioFactory",
   "name" : "android::hardware::broadcastradio::V1_1::BpHwBroadcastRadioFactory",
   "referenced_type" : "type-105",
   "self_type" : "type-105",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BpHwBroadcastRadioFactory.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactory13connectModuleENS1_4V1_05ClassENSt3__18functionIFvNS4_6ResultERKNS_2spINS4_15IBroadcastRadioEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_122IBroadcastRadioFactoryEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_125BpHwBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-188"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-186"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-187"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BpHwTuner",
   "name" : "android::hardware::broadcastradio::V1_1::BpHwTuner",
   "referenced_type" : "type-185",
   "self_type" : "type-185",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BpHwTuner.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_19BpHwTunerE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_19BpHwTunerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_19BpHwTuner8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner16setConfigurationERKNS1_4V1_010BandConfigE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner16getConfigurationENSt3__18functionIFvNS1_4V1_06ResultERKNS6_10BandConfigEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner4scanENS1_4V1_09DirectionEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner4stepENS1_4V1_09DirectionEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner4tuneEjj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner6cancelEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner21getProgramInformationENSt3__18functionIFvNS1_4V1_06ResultERKNS6_11ProgramInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner21tuneByProgramSelectorERKNS2_15ProgramSelectorE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner18cancelAnnouncementEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner25getProgramInformation_1_1ENSt3__18functionIFvNS1_4V1_06ResultERKNS2_11ProgramInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner19startBackgroundScanEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner14getProgramListERKNS0_8hidl_vecINS2_14VendorKeyValueEEENSt3__18functionIFvNS2_17ProgramListResultERKNS4_INS2_11ProgramInfoEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner15setAnalogForcedEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_19BpHwTuner14isAnalogForcedENSt3__18functionIFvNS1_4V1_06ResultEbEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_19BpHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_19BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_19BpHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_16ITunerEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_19BpHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_19BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_19BpHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_19BpHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_19BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_19BpHwTunerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_19BpHwTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_19BpHwTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_19BpHwTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-364"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-362"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-363"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BpHwTunerCallback",
   "name" : "android::hardware::broadcastradio::V1_1::BpHwTunerCallback",
   "referenced_type" : "type-361",
   "self_type" : "type-361",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BpHwTunerCallback.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_117BpHwTunerCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_117BpHwTunerCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_117BpHwTunerCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback15hardwareFailureEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback12configChangeENS1_4V1_06ResultERKNS4_10BandConfigE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback12tuneCompleteENS1_4V1_06ResultERKNS4_11ProgramInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback8afSwitchERKNS1_4V1_011ProgramInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback18antennaStateChangeEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback19trafficAnnouncementEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback21emergencyAnnouncementEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback11newMetadataEjjRKNS0_8hidl_vecINS1_4V1_08MetaDataEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback16tuneComplete_1_1ENS1_4V1_06ResultERKNS2_15ProgramSelectorE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback23backgroundScanAvailableEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback22backgroundScanCompleteENS2_17ProgramListResultE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback18programListChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_117BpHwTunerCallback25currentProgramInfoChangedERKNS2_11ProgramInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_117BpHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_14broadcastradio4V1_114ITunerCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_117BpHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_117BpHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_117BpHwTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_117BpHwTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-37"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BsBroadcastRadio",
   "name" : "android::hardware::broadcastradio::V1_1::BsBroadcastRadio",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BsBroadcastRadio.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_116BsBroadcastRadioE",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_116BsBroadcastRadioE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_115IBroadcastRadio8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio13getPropertiesENSt3__18functionIFvNS1_4V1_06ResultERKNS6_10PropertiesEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio9openTunerERKNS1_4V1_010BandConfigEbRKNS_2spINS4_14ITunerCallbackEEENSt3__18functionIFvNS4_6ResultERKNS8_INS4_6ITunerEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio17getProperties_1_1ENSt3__18functionIFvRKNS2_10PropertiesEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_116BsBroadcastRadio8getImageEiNSt3__18functionIFvRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_116BsBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_116BsBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_116BsBroadcastRadioD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_116BsBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_116BsBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_116BsBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-31"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "type-1057"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BsBroadcastRadioFactory",
   "name" : "android::hardware::broadcastradio::V1_1::BsBroadcastRadioFactory",
   "referenced_type" : "type-1064",
   "self_type" : "type-1064",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BsBroadcastRadioFactory.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryE",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactory13connectModuleENS1_4V1_05ClassENSt3__18functionIFvNS4_6ResultERKNS_2spINS4_15IBroadcastRadioEEEEEE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_123BsBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-178"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "type-175"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BsTuner",
   "name" : "android::hardware::broadcastradio::V1_1::BsTuner",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BsTuner.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_17BsTunerE",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_17BsTunerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_16ITuner8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner16setConfigurationERKNS1_4V1_010BandConfigE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner16getConfigurationENSt3__18functionIFvNS1_4V1_06ResultERKNS6_10BandConfigEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner4scanENS1_4V1_09DirectionEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner4stepENS1_4V1_09DirectionEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner4tuneEjj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner6cancelEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner21getProgramInformationENSt3__18functionIFvNS1_4V1_06ResultERKNS6_11ProgramInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner21tuneByProgramSelectorERKNS2_15ProgramSelectorE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner18cancelAnnouncementEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner25getProgramInformation_1_1ENSt3__18functionIFvNS1_4V1_06ResultERKNS2_11ProgramInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner19startBackgroundScanEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner14getProgramListERKNS0_8hidl_vecINS2_14VendorKeyValueEEENSt3__18functionIFvNS2_17ProgramListResultERKNS4_INS2_11ProgramInfoEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner15setAnalogForcedEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_17BsTuner14isAnalogForcedENSt3__18functionIFvNS1_4V1_06ResultEbEEE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_17BsTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_17BsTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_17BsTunerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_17BsTunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_17BsTunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_17BsTunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-355"
    },
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "type-352"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::BsTunerCallback",
   "name" : "android::hardware::broadcastradio::V1_1::BsTunerCallback",
   "referenced_type" : "type-359",
   "self_type" : "type-359",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/BsTunerCallback.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_115BsTunerCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_115BsTunerCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_114ITunerCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback15hardwareFailureEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback12configChangeENS1_4V1_06ResultERKNS4_10BandConfigE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback12tuneCompleteENS1_4V1_06ResultERKNS4_11ProgramInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback8afSwitchERKNS1_4V1_011ProgramInfoE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback18antennaStateChangeEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback19trafficAnnouncementEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback21emergencyAnnouncementEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback11newMetadataEjjRKNS0_8hidl_vecINS1_4V1_08MetaDataEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback16tuneComplete_1_1ENS1_4V1_06ResultERKNS2_15ProgramSelectorE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback23backgroundScanAvailableEb"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback22backgroundScanCompleteENS2_17ProgramListResultE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback18programListChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115BsTunerCallback25currentProgramInfoChangedERKNS2_11ProgramInfoE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_115BsTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_115BsTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware14broadcastradio4V1_115BsTunerCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_115BsTunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_115BsTunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_115BsTunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::IBroadcastRadio",
   "name" : "android::hardware::broadcastradio::V1_1::IBroadcastRadio",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/IBroadcastRadio.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_115IBroadcastRadioE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_115IBroadcastRadioE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_115IBroadcastRadio8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadioD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio13getPropertiesENSt3__18functionIFvNS1_4V1_06ResultERKNS6_10PropertiesEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio9openTunerERKNS1_4V1_010BandConfigEbRKNS_2spINS4_14ITunerCallbackEEENSt3__18functionIFvNS4_6ResultERKNS8_INS4_6ITunerEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio17getProperties_1_1ENSt3__18functionIFvRKNS2_10PropertiesEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_115IBroadcastRadio8getImageEiNSt3__18functionIFvRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_115IBroadcastRadioE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_115IBroadcastRadioD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_115IBroadcastRadioD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::IBroadcastRadioFactory",
   "name" : "android::hardware::broadcastradio::V1_1::IBroadcastRadioFactory",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/IBroadcastRadioFactory.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactoryE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactoryE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactory13connectModuleENS1_4V1_05ClassENSt3__18functionIFvNS4_6ResultERKNS_2spINS4_15IBroadcastRadioEEEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_122IBroadcastRadioFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_122IBroadcastRadioFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_122IBroadcastRadioFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-179"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::ITuner",
   "name" : "android::hardware::broadcastradio::V1_1::ITuner",
   "referenced_type" : "type-178",
   "self_type" : "type-178",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/ITuner.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_16ITunerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_16ITunerE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_16ITuner8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITunerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner16setConfigurationERKNS1_4V1_010BandConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner16getConfigurationENSt3__18functionIFvNS1_4V1_06ResultERKNS6_10BandConfigEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner4scanENS1_4V1_09DirectionEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner4stepENS1_4V1_09DirectionEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner4tuneEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner6cancelEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner21getProgramInformationENSt3__18functionIFvNS1_4V1_06ResultERKNS6_11ProgramInfoEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner21tuneByProgramSelectorERKNS2_15ProgramSelectorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner18cancelAnnouncementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner25getProgramInformation_1_1ENSt3__18functionIFvNS1_4V1_06ResultERKNS2_11ProgramInfoEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner19startBackgroundScanEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner14getProgramListERKNS0_8hidl_vecINS2_14VendorKeyValueEEENSt3__18functionIFvNS2_17ProgramListResultERKNS4_INS2_11ProgramInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner15setAnalogForcedEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_16ITuner14isAnalogForcedENSt3__18functionIFvNS1_4V1_06ResultEbEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_16ITunerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_16ITunerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_16ITunerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-207"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::ITunerCallback",
   "name" : "android::hardware::broadcastradio::V1_1::ITunerCallback",
   "referenced_type" : "type-355",
   "self_type" : "type-355",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/ITunerCallback.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_114ITunerCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_114ITunerCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware14broadcastradio4V1_114ITunerCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback15hardwareFailureEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback12configChangeENS1_4V1_06ResultERKNS4_10BandConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback12tuneCompleteENS1_4V1_06ResultERKNS4_11ProgramInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback8afSwitchERKNS1_4V1_011ProgramInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback18antennaStateChangeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback19trafficAnnouncementEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback21emergencyAnnouncementEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback11newMetadataEjjRKNS0_8hidl_vecINS1_4V1_08MetaDataEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback16tuneComplete_1_1ENS1_4V1_06ResultERKNS2_15ProgramSelectorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback23backgroundScanAvailableEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback22backgroundScanCompleteENS2_17ProgramListResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback18programListChangedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware14broadcastradio4V1_114ITunerCallback25currentProgramInfoChangedERKNS2_11ProgramInfoE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware14broadcastradio4V1_114ITunerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_114ITunerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware14broadcastradio4V1_114ITunerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::ProgramIdentifier",
   "name" : "android::hardware::broadcastradio::V1_1::ProgramIdentifier",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_117ProgramIdentifierE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "selector",
     "field_offset" : 256,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "flags",
     "field_offset" : 704,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "vendorInfo",
     "field_offset" : 768,
     "referenced_type" : "type-158"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::ProgramInfo",
   "name" : "android::hardware::broadcastradio::V1_1::ProgramInfo",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 112,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_111ProgramInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "programType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "primaryId",
     "field_offset" : 64,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "secondaryIds",
     "field_offset" : 192,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "vendorIds",
     "field_offset" : 320,
     "referenced_type" : "type-154"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::ProgramSelector",
   "name" : "android::hardware::broadcastradio::V1_1::ProgramSelector",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/broadcastradio/1.1/android.hardware.broadcastradio@1.1_genc++_headers/gen/android/hardware/broadcastradio/1.1/types.h",
   "unique_id" : "_ZTSN7android8hardware14broadcastradio4V1_115ProgramSelectorE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "type-549"
    },
    {
     "field_name" : "supportsBackgroundScanning",
     "field_offset" : 832,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "supportedProgramTypes",
     "field_offset" : 896,
     "referenced_type" : "type-387"
    },
    {
     "field_name" : "supportedIdentifierTypes",
     "field_offset" : 1024,
     "referenced_type" : "type-387"
    },
    {
     "field_name" : "vendorInfo",
     "field_offset" : 1152,
     "referenced_type" : "type-158"
    }
   ],
   "linker_set_key" : "android::hardware::broadcastradio::V1_1::Properties",
   "name" : "android::hardware::broadcastradio::V1_1::Properties",
