{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-106",
   "self_type" : "type-267",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float [14]",
   "name" : "float [14]",
   "referenced_type" : "type-184",
   "self_type" : "type-204",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float [15]",
   "name" : "float [15]",
   "referenced_type" : "type-184",
   "self_type" : "type-193",
   "size" : 60,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float [16]",
   "name" : "float [16]",
   "referenced_type" : "type-184",
   "self_type" : "type-206",
   "size" : 64,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-184",
   "self_type" : "type-736",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-43",
   "self_type" : "type-394",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [14]",
   "name" : "int [14]",
   "referenced_type" : "type-43",

   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-860",
   "self_type" : "type-859",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-197",
   "self_type" : "type-473",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-32",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-13",
   "self_type" : "type-485",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-266",
   "self_type" : "type-477",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-31",
   "self_type" : "type-607",
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-47",
   "self_type" : "type-150",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-43",
   "self_type" : "type-107",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-149"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-55", "type-61" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-390"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-391" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-382"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-381",
   "self_type" : "type-381",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-383" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-745",
   "self_type" : "type-745",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-389"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-392"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-751"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-750",
   "self_type" : "type-750",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-754"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-753",
   "self_type" : "type-753",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-754"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-498",
   "self_type" : "type-498",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-491",
   "self_type" : "type-491",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTag",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::ScopedTrace",
   "name" : "android::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Trace.h",
   "unique_id" : "_ZTSN7android11ScopedTraceE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-92" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-91",
   "self_type" : "type-91",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-104"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-7"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "type-147"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "type-148"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "type-150"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "type-150"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "type-144"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 44,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-381"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-383",
   "self_type" : "type-383",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-232"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BnHwDirectReportChannel",
   "name" : "android::frameworks::sensorservice::V1_0::BnHwDirectReportChannel",
   "referenced_type" : "type-595",
   "self_type" : "type-595",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BnHwDirectReportChannel.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BnHwDirectReportChannel10onTransactEjRKNS_8hardware6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_023BnHwDirectReportChannelD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BnHwEventQueue",
   "name" : "android::frameworks::sensorservice::V1_0::BnHwEventQueue",
   "referenced_type" : "type-871",
   "self_type" : "type-871",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BnHwEventQueue.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_014BnHwEventQueueE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014BnHwEventQueueE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BnHwEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BnHwEventQueueD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BnHwEventQueue10onTransactEjRKNS_8hardware6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014BnHwEventQueueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android10frameworks13sensorservice4V1_014BnHwEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android10frameworks13sensorservice4V1_014BnHwEventQueueD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014BnHwEventQueueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_014BnHwEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_014BnHwEventQueueD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BnHwEventQueueCallback",
   "name" : "android::frameworks::sensorservice::V1_0::BnHwEventQueueCallback",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BnHwEventQueueCallback.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BnHwEventQueueCallback10onTransactEjRKNS_8hardware6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_022BnHwEventQueueCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-216"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BnHwSensorManager",
   "name" : "android::frameworks::sensorservice::V1_0::BnHwSensorManager",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BnHwSensorManager.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_017BnHwSensorManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_017BnHwSensorManagerE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BnHwSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BnHwSensorManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BnHwSensorManager10onTransactEjRKNS_8hardware6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_017BnHwSensorManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android10frameworks13sensorservice4V1_017BnHwSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android10frameworks13sensorservice4V1_017BnHwSensorManagerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_017BnHwSensorManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_017BnHwSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_017BnHwSensorManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-649"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-848"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-849"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BpHwDirectReportChannel",
   "name" : "android::frameworks::sensorservice::V1_0::BpHwDirectReportChannel",
   "referenced_type" : "type-847",
   "self_type" : "type-847",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BpHwDirectReportChannel.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannel9configureEiNS_8hardware7sensors4V1_09RateLevelENSt3__18functionIFviNS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_023BpHwDirectReportChannelD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-878"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-876"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-877"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BpHwEventQueue",
   "name" : "android::frameworks::sensorservice::V1_0::BpHwEventQueue",
   "referenced_type" : "type-875",
   "self_type" : "type-875",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BpHwEventQueue.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_014BpHwEventQueueE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014BpHwEventQueueE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_014BpHwEventQueue8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueueD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue12enableSensorEiix"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014BpHwEventQueue13disableSensorEi"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014BpHwEventQueueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_014BpHwEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_014BpHwEventQueueD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014BpHwEventQueueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android10frameworks13sensorservice4V1_014BpHwEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android10frameworks13sensorservice4V1_014BpHwEventQueueD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014BpHwEventQueueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android10frameworks13sensorservice4V1_014BpHwEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android10frameworks13sensorservice4V1_014BpHwEventQueueD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014BpHwEventQueueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_014BpHwEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_014BpHwEventQueueD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-70"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BpHwEventQueueCallback",
   "name" : "android::frameworks::sensorservice::V1_0::BpHwEventQueueCallback",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BpHwEventQueueCallback.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallback7onEventERKNS_8hardware7sensors4V1_05EventE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_022BpHwEventQueueCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-228"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-226"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-227"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BpHwSensorManager",
   "name" : "android::frameworks::sensorservice::V1_0::BpHwSensorManager",
   "referenced_type" : "type-225",
   "self_type" : "type-225",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BpHwSensorManager.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_017BpHwSensorManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_017BpHwSensorManagerE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_017BpHwSensorManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager13getSensorListENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_7sensors4V1_010SensorInfoEEENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager16getDefaultSensorENS_8hardware7sensors4V1_010SensorTypeENSt3__18functionIFvRKNS6_10SensorInfoENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager25createAshmemDirectChannelERKNS_8hardware11hidl_memoryEyNSt3__18functionIFvRKNS_2spINS2_20IDirectReportChannelEEENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager26createGrallocDirectChannelERKNS_8hardware11hidl_handleEyNSt3__18functionIFvRKNS_2spINS2_20IDirectReportChannelEEENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_017BpHwSensorManager16createEventQueueERKNS_2spINS2_19IEventQueueCallbackEEENSt3__18functionIFvRKNS4_INS2_11IEventQueueEEENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_017BpHwSensorManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_017BpHwSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_017BpHwSensorManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_017BpHwSensorManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android10frameworks13sensorservice4V1_017BpHwSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android10frameworks13sensorservice4V1_017BpHwSensorManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_017BpHwSensorManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android10frameworks13sensorservice4V1_017BpHwSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android10frameworks13sensorservice4V1_017BpHwSensorManagerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_017BpHwSensorManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_017BpHwSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_017BpHwSensorManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-234"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "type-238"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BsDirectReportChannel",
   "name" : "android::frameworks::sensorservice::V1_0::BsDirectReportChannel",
   "referenced_type" : "type-812",
   "self_type" : "type-812",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BsDirectReportChannel.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_021BsDirectReportChannelE",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_021BsDirectReportChannelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_020IDirectReportChannel8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannelD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_021BsDirectReportChannel9configureEiNS_8hardware7sensors4V1_09RateLevelENSt3__18functionIFviNS2_6ResultEEEE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_021BsDirectReportChannelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_021BsDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_021BsDirectReportChannelD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_021BsDirectReportChannelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_021BsDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_021BsDirectReportChannelD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-27"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BsEventQueue",
   "name" : "android::frameworks::sensorservice::V1_0::BsEventQueue",
   "referenced_type" : "type-873",
   "self_type" : "type-873",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BsEventQueue.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_012BsEventQueueE",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_012BsEventQueueE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_011IEventQueue8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueueD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue12enableSensorEiix"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_012BsEventQueue13disableSensorEi"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_012BsEventQueueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_012BsEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_012BsEventQueueD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_012BsEventQueueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_012BsEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_012BsEventQueueD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "type-63"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BsEventQueueCallback",
   "name" : "android::frameworks::sensorservice::V1_0::BsEventQueueCallback",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BsEventQueueCallback.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_020BsEventQueueCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_020BsEventQueueCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_019IEventQueueCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020BsEventQueueCallback7onEventERKNS_8hardware7sensors4V1_05EventE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_020BsEventQueueCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_020BsEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_020BsEventQueueCallbackD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_020BsEventQueueCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_020BsEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_020BsEventQueueCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-218"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "type-222"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::BsSensorManager",
   "name" : "android::frameworks::sensorservice::V1_0::BsSensorManager",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 68,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/BsSensorManager.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_015BsSensorManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_015BsSensorManagerE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_014ISensorManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager13getSensorListENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_7sensors4V1_010SensorInfoEEENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager16getDefaultSensorENS_8hardware7sensors4V1_010SensorTypeENSt3__18functionIFvRKNS6_10SensorInfoENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager25createAshmemDirectChannelERKNS_8hardware11hidl_memoryEyNSt3__18functionIFvRKNS_2spINS2_20IDirectReportChannelEEENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager26createGrallocDirectChannelERKNS_8hardware11hidl_handleEyNSt3__18functionIFvRKNS_2spINS2_20IDirectReportChannelEEENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_015BsSensorManager16createEventQueueERKNS_2spINS2_19IEventQueueCallbackEEENSt3__18functionIFvRKNS4_INS2_11IEventQueueEEENS2_6ResultEEEE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_015BsSensorManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_015BsSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10frameworks13sensorservice4V1_015BsSensorManagerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_015BsSensorManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_015BsSensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_015BsSensorManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::IDirectReportChannel",
   "name" : "android::frameworks::sensorservice::V1_0::IDirectReportChannel",
   "referenced_type" : "type-234",
   "self_type" : "type-234",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/IDirectReportChannel.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_020IDirectReportChannelE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_020IDirectReportChannelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_020IDirectReportChannel8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannelD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel9configureEiNS_8hardware7sensors4V1_09RateLevelENSt3__18functionIFviNS2_6ResultEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_020IDirectReportChannelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_020IDirectReportChannelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_020IDirectReportChannelD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::IEventQueue",
   "name" : "android::frameworks::sensorservice::V1_0::IEventQueue",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/IEventQueue.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_011IEventQueueE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_011IEventQueueE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_011IEventQueue8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueueD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue12enableSensorEiix"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue13disableSensorEi"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_011IEventQueueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_011IEventQueueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_011IEventQueueD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::IEventQueueCallback",
   "name" : "android::frameworks::sensorservice::V1_0::IEventQueueCallback",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/IEventQueueCallback.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_019IEventQueueCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_019IEventQueueCallbackE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_019IEventQueueCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback7onEventERKNS_8hardware7sensors4V1_05EventE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_019IEventQueueCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_019IEventQueueCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_019IEventQueueCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::frameworks::sensorservice::V1_0::ISensorManager",
   "name" : "android::frameworks::sensorservice::V1_0::ISensorManager",
   "referenced_type" : "type-218",
   "self_type" : "type-218",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/frameworks/hardware/interfaces/sensorservice/1.0/android.frameworks.sensorservice@1.0_genc++_headers/gen/android/frameworks/sensorservice/1.0/ISensorManager.h",
   "unique_id" : "_ZTSN7android10frameworks13sensorservice4V1_014ISensorManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014ISensorManagerE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_014ISensorManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager13getSensorListENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_7sensors4V1_010SensorInfoEEENS2_6ResultEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager16getDefaultSensorENS_8hardware7sensors4V1_010SensorTypeENSt3__18functionIFvRKNS6_10SensorInfoENS2_6ResultEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager25createAshmemDirectChannelERKNS_8hardware11hidl_memoryEyNSt3__18functionIFvRKNS_2spINS2_20IDirectReportChannelEEENS2_6ResultEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager26createGrallocDirectChannelERKNS_8hardware11hidl_handleEyNSt3__18functionIFvRKNS_2spINS2_20IDirectReportChannelEEENS2_6ResultEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager16createEventQueueERKNS_2spINS2_19IEventQueueCallbackEEENSt3__18functionIFvRKNS4_INS2_11IEventQueueEEENS2_6ResultEEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10frameworks13sensorservice4V1_014ISensorManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_014ISensorManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10frameworks13sensorservice4V1_014ISensorManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-35"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 64,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "android::hardware::BHwBinder",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 28,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware9BHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-7"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 32,
     "referenced_type" : "type-73"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 96,
     "referenced_type" : "type-74"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwRefBase",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware11BpHwRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-234"
    },
    {
     "referenced_type" : "type-71"
    },
    {
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::frameworks::sensorservice::V1_0::IDirectReportChannel>",
   "name" : "android::hardware::BpInterface<android::frameworks::sensorservice::V1_0::IDirectReportChannel>",
   "record_kind" : "class",
   "referenced_type" : "type-649",
   "self_type" : "type-649",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-234" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_020IDirectReportChannel8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_020IDirectReportChannel9configureEiNS_8hardware7sensors4V1_09RateLevelENSt3__18functionIFviNS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_020IDirectReportChannelEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-27"
    },
    {
     "referenced_type" : "type-71"
    },
    {
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::frameworks::sensorservice::V1_0::IEventQueue>",
   "name" : "android::hardware::BpInterface<android::frameworks::sensorservice::V1_0::IEventQueue>",
   "record_kind" : "class",
   "referenced_type" : "type-878",
   "self_type" : "type-878",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_011IEventQueue8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue12enableSensorEiix"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_011IEventQueue13disableSensorEi"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_011IEventQueueEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    },
    {
     "referenced_type" : "type-71"
    },
    {
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::frameworks::sensorservice::V1_0::IEventQueueCallback>",
   "name" : "android::hardware::BpInterface<android::frameworks::sensorservice::V1_0::IEventQueueCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_019IEventQueueCallback8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_019IEventQueueCallback7onEventERKNS_8hardware7sensors4V1_05EventE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-218"
    },
    {
     "referenced_type" : "type-71"
    },
    {
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::frameworks::sensorservice::V1_0::ISensorManager>",
   "name" : "android::hardware::BpInterface<android::frameworks::sensorservice::V1_0::ISensorManager>",
   "record_kind" : "class",
   "referenced_type" : "type-228",
   "self_type" : "type-228",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-218" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android10frameworks13sensorservice4V1_014ISensorManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager13getSensorListENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_7sensors4V1_010SensorInfoEEENS2_6ResultEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager16getDefaultSensorENS_8hardware7sensors4V1_010SensorTypeENSt3__18functionIFvRKNS6_10SensorInfoENS2_6ResultEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager25createAshmemDirectChannelERKNS_8hardware11hidl_memoryEyNSt3__18functionIFvRKNS_2spINS2_20IDirectReportChannelEEENS2_6ResultEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager26createGrallocDirectChannelERKNS_8hardware11hidl_handleEyNSt3__18functionIFvRKNS_2spINS2_20IDirectReportChannelEEENS2_6ResultEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10frameworks13sensorservice4V1_014ISensorManager16createEventQueueERKNS_2spINS2_19IEventQueueCallbackEEENSt3__18functionIFvRKNS4_INS2_11IEventQueueEEENS2_6ResultEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_10frameworks13sensorservice4V1_014ISensorManagerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    },
    {
     "referenced_type" : "type-71"
    },
    {
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "name" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-647",
   "self_type" : "type-647",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-668"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-669"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "record_kind" : "class",
   "referenced_type" : "type-667",
   "self_type" : "type-667",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-14", "type-670" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEENS0_7details9SchedPrioEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-676"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-677"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-675",
   "self_type" : "type-675",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-14", "type-47" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEEbEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-681"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-682"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "name" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-680",
   "self_type" : "type-680",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-683", "type-524" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-700"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-701"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-699",
   "self_type" : "type-699",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-702", "type-703" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS_4hidl4base4V1_05IBaseEEEPvEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-689"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-690"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-688",
   "self_type" : "type-688",
   "size" : 16,
   "source_file" : "/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-691", "type-692" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS0_7IBinderEEEPvEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-523",
   "self_type" : "type-523",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-507"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-515",
   "self_type" : "type-515",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder::DeathRecipient",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::hardware::IInterface",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "unique_id" : "_ZTSN7android8hardware10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "type-519"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "type-622"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "name" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android8hardware12MQDescriptorIcLNS0_8MQFlavorE1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 32,
     "referenced_type" : "type-651"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 128,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 160,
     "referenced_type" : "type-652"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 288,
     "referenced_type" : "type-653"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 448,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 456,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 464,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 480,
     "referenced_type" : "type-654"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 512,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 68,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel::BufferInfo",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "type-658",
   "self_type" : "type-658",
   "size" : 20,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6Parcel10BufferInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-7"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 96,
     "referenced_type" : "type-113"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 128,
     "referenced_type" : "type-114"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 224,
     "referenced_type" : "type-115"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 288,
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 320,
     "referenced_type" : "type-28"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 480,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 512,
     "referenced_type" : "type-51"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 544,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 576,
     "referenced_type" : "type-89"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 736,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 768,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 776,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 800,
     "referenced_type" : "type-107"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 832,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 864,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 120,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessStateE",
   "vtable_components" :
   [
    {
     "component_value" : 112,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -112,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -112,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "refs",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState::handle_entry",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessState12handle_entryE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-81"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-774"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::frameworks::sensorservice::V1_0::Result>",
   "name" : "android::hardware::Return<android::frameworks::sensorservice::V1_0::Result>",
   "record_kind" : "class",
   "referenced_type" : "type-885",
   "self_type" : "type-885",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-774" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_10frameworks13sensorservice4V1_06ResultEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-81"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-232"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::frameworks::sensorservice::V1_0::IDirectReportChannel> >",
   "name" : "android::hardware::Return<android::sp<android::frameworks::sensorservice::V1_0::IDirectReportChannel> >",
   "record_kind" : "class",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-232" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS_10frameworks13sensorservice4V1_020IDirectReportChannelEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-81"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::frameworks::sensorservice::V1_0::IEventQueue> >",
   "name" : "android::hardware::Return<android::sp<android::frameworks::sensorservice::V1_0::IEventQueue> >",
   "record_kind" : "class",
   "referenced_type" : "type-891",
   "self_type" : "type-891",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS_10frameworks13sensorservice4V1_011IEventQueueEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-81"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::frameworks::sensorservice::V1_0::IEventQueueCallback> >",
   "name" : "android::hardware::Return<android::sp<android::frameworks::sensorservice::V1_0::IEventQueueCallback> >",
   "record_kind" : "class",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-81"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-216"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::frameworks::sensorservice::V1_0::ISensorManager> >",
   "name" : "android::hardware::Return<android::sp<android::frameworks::sensorservice::V1_0::ISensorManager> >",
   "record_kind" : "class",
   "referenced_type" : "type-248",
   "self_type" : "type-248",
   "size" : 28,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-216" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS_10frameworks13sensorservice4V1_014ISensorManagerEEEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-81"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 168,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::Return<bool>",
   "name" : "android::hardware::Return<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-297",
   "self_type" : "type-297",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-47" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIbEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-374",
   "self_type" : "type-374",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 20,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 32,
     "referenced_type" : "type-46"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 128,
     "referenced_type" : "type-47"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 160,
     "referenced_type" : "type-48"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 256,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-45",
   "self_type" : "type-45",
   "size" : 44,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_policy",
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "prio",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "android::hardware::details::SchedPrio",
   "name" : "android::hardware::details::SchedPrio",
   "referenced_type" : "type-670",
   "self_type" : "type-670",
   "size" : 8,
   "source_file" : "/system/libhidl/transport/include/hidl/Static.h",
   "unique_id" : "_ZTSN7android8hardware7details9SchedPrioE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mQueue",
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "android::hardware::details::TaskRunner",
   "name" : "android::hardware::details::TaskRunner",
   "record_kind" : "class",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/TaskRunner.h",
   "unique_id" : "_ZTSN7android8hardware7details10TaskRunnerE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-469",
   "self_type" : "type-469",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-479",
   "self_type" : "type-479",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-571"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<float, 14>",
   "name" : "android::hardware::details::const_accessor<float, 14>",
   "referenced_type" : "type-570",
   "self_type" : "type-570",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIfLj14EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-571"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<float, 15>",
   "name" : "android::hardware::details::const_accessor<float, 15>",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIfLj15EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-571"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<float, 16>",
   "name" : "android::hardware::details::const_accessor<float, 16>",
   "referenced_type" : "type-579",
   "self_type" : "type-579",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIfLj16EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-565"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<int, 14>",
   "name" : "android::hardware::details::const_accessor<int, 14>",
   "referenced_type" : "type-564",
   "self_type" : "type-564",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIiLj14EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBase",
     "referenced_type" : "type-560"
    }
   ],
   "linker_set_key" : "android::hardware::details::const_accessor<unsigned char, 16>",
   "name" : "android::hardware::details::const_accessor<unsigned char, 16>",
   "referenced_type" : "type-559",
   "self_type" : "type-559",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android8hardware7details14const_accessorIhLj16EJEEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-522"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-521",
   "self_type" : "type-521",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-282"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<SensorInfo>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<SensorInfo>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-281",
   "self_type" : "type-281",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_7sensors4V1_010SensorInfoEEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-521"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-520",
   "self_type" : "type-520",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-523" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-535"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<unsigned char, 32> >",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<unsigned char, 32> >",
   "referenced_type" : "type-534",
   "self_type" : "type-534",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-537" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-527"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-281"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::sensors::V1_0::SensorInfo>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::sensors::V1_0::SensorInfo>",
   "referenced_type" : "type-280",
   "self_type" : "type-280",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-283" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_7sensors4V1_010SensorInfoEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-552"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<char>",
   "name" : "android::hardware::details::hidl_pointer<char>",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIcEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-418"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-552",
   "self_type" : "type-552",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIcEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-286"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-285",
   "self_type" : "type-285",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-105" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-286",
   "self_type" : "type-286",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-501"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-500",
   "self_type" : "type-500",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-503" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-502"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-501",
   "self_type" : "type-501",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_array<unsigned char, 32> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_array<unsigned char, 32> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-535",
   "self_type" : "type-535",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEUt_E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_string>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_string>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<int>",
   "name" : "android::hardware::details::hidl_pointer<int>",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIiEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-546"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-545",
   "self_type" : "type-545",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIiEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-623"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "type-622",
   "self_type" : "type-622",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-393" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-392"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-623",
   "self_type" : "type-623",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-458",
   "self_type" : "type-458",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-82"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 160,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<float, 14>",
   "name" : "android::hardware::details::std_array<float, 14>",
   "referenced_type" : "type-555",
   "self_type" : "type-555",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIfLj14EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<float, 15>",
   "name" : "android::hardware::details::std_array<float, 15>",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIfLj15EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<float, 16>",
   "name" : "android::hardware::details::std_array<float, 16>",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIfLj16EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<int, 14>",
   "name" : "android::hardware::details::std_array<int, 14>",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIiLj14EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned char, 16>",
   "name" : "android::hardware::details::std_array<unsigned char, 16>",
   "referenced_type" : "type-553",
   "self_type" : "type-553",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIhLj16EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned char, 32>",
   "name" : "android::hardware::details::std_array<unsigned char, 32>",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIhLj32EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<float, 14>",
   "name" : "android::hardware::hidl_array<float, 14>",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIfLj14EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-193"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<float, 15>",
   "name" : "android::hardware::hidl_array<float, 15>",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 60,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIfLj15EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-206"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<float, 16>",
   "name" : "android::hardware::hidl_array<float, 16>",
   "referenced_type" : "type-205",
   "self_type" : "type-205",
   "size" : 64,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIfLj16EJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-202"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<int, 14>",
   "name" : "android::hardware::hidl_array<int, 14>",
   "referenced_type" : "type-201",
   "self_type" : "type-201",
   "size" : 56,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIiLj14EJEEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-196"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned char, 16>",
   "name" : "android::hardware::hidl_array<unsigned char, 16>",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIhLj16EJEEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-538"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned char, 32>",
   "name" : "android::hardware::hidl_array<unsigned char, 32>",
   "referenced_type" : "type-537",
   "self_type" : "type-537",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIhLj32EJEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRecipient",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mCookie",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mBase",
     "field_offset" : 160,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_binder_death_recipient",
   "name" : "android::hardware::hidl_binder_death_recipient",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 36,
   "source_file" : "/system/libhidl/transport/include/hidl/HidlBinderSupport.h",
   "unique_id" : "_ZTSN7android8hardware27hidl_binder_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 28,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware27hidl_binder_death_recipientE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipient10binderDiedERKNS_2wpINS0_7IBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware27hidl_binder_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware27hidl_binder_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware27hidl_binder_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_death_recipient",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 12,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware20hidl_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-500"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_handle",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "type-499",
   "self_type" : "type-499",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_handleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-499"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "type-284"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_memory",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "type-507",
   "self_type" : "type-507",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_memoryE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-285"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_string",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "type-284",
   "self_type" : "type-284",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_stringE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-520"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-519",
   "self_type" : "type-519",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-523" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-534"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_array<unsigned char, 32> >",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_array<unsigned char, 32> >",
   "referenced_type" : "type-533",
   "self_type" : "type-533",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-537" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-526"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_string>",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_string>",
   "referenced_type" : "type-525",
   "self_type" : "type-525",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-284" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_11hidl_stringEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-280"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::sensors::V1_0::SensorInfo>",
   "name" : "android::hardware::hidl_vec<android::hardware::sensors::V1_0::SensorInfo>",
   "referenced_type" : "type-279",
   "self_type" : "type-279",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-283" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_7sensors4V1_010SensorInfoEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-551"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<char>",
   "name" : "android::hardware::hidl_vec<char>",
   "referenced_type" : "type-550",
   "self_type" : "type-550",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIcEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-544"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<int>",
   "name" : "android::hardware::hidl_vec<int>",
   "referenced_type" : "type-543",
   "self_type" : "type-543",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIiEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "type-266"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "type-266"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_version",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware12hidl_versionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-199"
    },
    {
     "field_name" : "serial",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "u",
     "field_offset" : 64,
     "referenced_type" : "type-200"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::AdditionalInfo",
   "name" : "android::hardware::sensors::V1_0::AdditionalInfo",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 64,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_014AdditionalInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data_int32",
     "referenced_type" : "type-201"
    },
    {
     "field_name" : "data_float",
     "referenced_type" : "type-203"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::AdditionalInfo::Payload",
   "name" : "android::hardware::sensors::V1_0::AdditionalInfo::Payload",
   "record_kind" : "union",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_014AdditionalInfo7PayloadE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "connected",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "sensorHandle",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "uuid",
     "field_offset" : 64,
     "referenced_type" : "type-195"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::DynamicSensorInfo",
   "name" : "android::hardware::sensors::V1_0::DynamicSensorInfo",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_017DynamicSensorInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "sensorHandle",
     "field_offset" : 64,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "sensorType",
     "field_offset" : 96,
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "u",
     "field_offset" : 128,
     "referenced_type" : "type-182"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::Event",
   "name" : "android::hardware::sensors::V1_0::Event",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_05EventE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vec3",
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "vec4",
     "referenced_type" : "type-187"
    },
    {
     "field_name" : "uncal",
     "referenced_type" : "type-188"
    },
    {
     "field_name" : "meta",
     "referenced_type" : "type-189"
    },
    {
     "field_name" : "scalar",
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "stepCount",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "heartRate",
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "pose6DOF",
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "dynamic",
     "referenced_type" : "type-194"
    },
    {
     "field_name" : "additional",
     "referenced_type" : "type-198"
    },
    {
     "field_name" : "data",
     "referenced_type" : "type-205"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::EventPayload",
   "name" : "android::hardware::sensors::V1_0::EventPayload",
   "record_kind" : "union",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 64,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_012EventPayloadE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bpm",
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "status",
     "field_offset" : 32,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::HeartRate",
   "name" : "android::hardware::sensors::V1_0::HeartRate",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_09HeartRateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "what",
     "referenced_type" : "type-190"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::MetaData",
   "name" : "android::hardware::sensors::V1_0::MetaData",
   "referenced_type" : "type-189",
   "self_type" : "type-189",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_08MetaDataE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sensorHandle",
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "vendor",
     "field_offset" : 192,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "version",
     "field_offset" : 320,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "type",
     "field_offset" : 352,
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "typeAsString",
     "field_offset" : 384,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "maxRange",
     "field_offset" : 512,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "resolution",
     "field_offset" : 544,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "power",
     "field_offset" : 576,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "minDelay",
     "field_offset" : 608,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "fifoReservedEventCount",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fifoMaxEventCount",
     "field_offset" : 672,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "requiredPermission",
     "field_offset" : 704,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "maxDelay",
     "field_offset" : 832,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "flags",
     "field_offset" : 864,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::SensorInfo",
   "name" : "android::hardware::sensors::V1_0::SensorInfo",
   "referenced_type" : "type-283",
   "self_type" : "type-283",
   "size" : 112,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_010SensorInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-787"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "type-789"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "memoryHandle",
     "field_offset" : 128,
     "referenced_type" : "type-499"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::SharedMemInfo",
   "name" : "android::hardware::sensors::V1_0::SharedMemInfo",
   "referenced_type" : "type-792",
   "self_type" : "type-792",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_013SharedMemInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "x_bias",
     "field_offset" : 96,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "y_bias",
     "field_offset" : 128,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "z_bias",
     "field_offset" : 160,
     "referenced_type" : "type-184"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::Uncal",
   "name" : "android::hardware::sensors::V1_0::Uncal",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_05UncalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "status",
     "field_offset" : 96,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::Vec3",
   "name" : "android::hardware::sensors::V1_0::Vec3",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_04Vec3E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "w",
     "field_offset" : 96,
     "referenced_type" : "type-184"
    }
   ],
   "linker_set_key" : "android::hardware::sensors::V1_0::Vec4",
   "name" : "android::hardware::sensors::V1_0::Vec4",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/hardware/interfaces/sensors/1.0/android.hardware.sensors@1.0_genc++_headers/gen/android/hardware/sensors/1.0/types.h",
   "unique_id" : "_ZTSN7android8hardware7sensors4V1_04Vec4E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 512,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::BnHwBase",
   "name" : "android::hidl::base::V1_0::BnHwBase",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 76,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/BnHwBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_08BnHwBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 68,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBase10onTransactEjRKNS_8hardware6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -68,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -68,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-647"
    },
    {
     "referenced_type" : "type-45"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-842"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-843"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::BpHwBase",
   "name" : "android::hidl::base::V1_0::BpHwBase",
   "referenced_type" : "type-841",
   "self_type" : "type-841",
   "size" : 92,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/BpHwBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_08BpHwBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_08BpHwBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "type-628"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::DebugInfo",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_09DebugInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::IBase",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_05IBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceManager",
   "name" : "android::hidl::manager::V1_0::IServiceManager",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_015IServiceManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_015IServiceManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager3getERKNS_8hardware11hidl_stringES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager3addERKNS_8hardware11hidl_stringERKNS_2spINS0_4base4V1_05IBaseEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getTransportERKNS_8hardware11hidl_stringES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager4listENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager15listByInterfaceERKNS_8hardware11hidl_stringENSt3__18functionIFvRKNS4_8hidl_vecIS5_EEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager24registerForNotificationsERKNS_8hardware11hidl_stringES7_RKNS_2spINS2_20IServiceNotificationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager9debugDumpENSt3__18functionIFvRKNS_8hardware8hidl_vecINS3_17InstanceDebugInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager25registerPassthroughClientERKNS_8hardware11hidl_stringES7_"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_015IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_015IServiceManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interfaceName",
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "instanceName",
     "field_offset" : 128,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "pid",
     "field_offset" : 256,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "clientPids",
     "field_offset" : 320,
     "referenced_type" : "type-543"
    },
    {
     "field_name" : "arch",
     "field_offset" : 448,
     "referenced_type" : "type-628"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo",
   "name" : "android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo",
   "referenced_type" : "type-765",
   "self_type" : "type-765",
   "size" : 64,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_015IServiceManager17InstanceDebugInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceNotification",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "type-214",
   "self_type" : "type-214",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_020IServiceNotificationE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "android::sp<android::Thread>",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-146" ],
   "unique_id" : "_ZTSN7android2spINS_6ThreadEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-233"
    }
   ],
   "linker_set_key" : "android::sp<android::frameworks::sensorservice::V1_0::IDirectReportChannel>",
   "name" : "android::sp<android::frameworks::sensorservice::V1_0::IDirectReportChannel>",
   "record_kind" : "class",
   "referenced_type" : "type-232",
   "self_type" : "type-232",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-234" ],
   "unique_id" : "_ZTSN7android2spINS_10frameworks13sensorservice4V1_020IDirectReportChannelEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::sp<android::frameworks::sensorservice::V1_0::IEventQueue>",
   "name" : "android::sp<android::frameworks::sensorservice::V1_0::IEventQueue>",
   "record_kind" : "class",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android2spINS_10frameworks13sensorservice4V1_011IEventQueueEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "android::sp<android::frameworks::sensorservice::V1_0::IEventQueueCallback>",
   "name" : "android::sp<android::frameworks::sensorservice::V1_0::IEventQueueCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSN7android2spINS_10frameworks13sensorservice4V1_019IEventQueueCallbackEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-217"
    }
   ],
   "linker_set_key" : "android::sp<android::frameworks::sensorservice::V1_0::ISensorManager>",
   "name" : "android::sp<android::frameworks::sensorservice::V1_0::ISensorManager>",
   "record_kind" : "class",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-218" ],
   "unique_id" : "_ZTSN7android2spINS_10frameworks13sensorservice4V1_014ISensorManagerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-257"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::BHwBinder>",
   "name" : "android::sp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-42" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-868"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "name" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-898",
   "self_type" : "type-898",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IBinder>",
   "name" : "android::sp<android::hardware::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-35" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware7IBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-915"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IInterface>",
   "name" : "android::sp<android::hardware::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "type-914",
   "self_type" : "type-914",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware10IInterfaceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::ProcessState>",
   "name" : "android::sp<android::hardware::ProcessState>",
   "record_kind" : "class",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-112" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware12ProcessStateEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-241"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_binder_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_binder_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-240",
   "self_type" : "type-240",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware27hidl_binder_death_recipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-482",
   "self_type" : "type-482",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::base::V1_0::IBase>",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl4base4V1_05IBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-121"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::manager::V1_0::IServiceManager>",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceManager>",
   "record_kind" : "class",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-122" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl7manager4V1_015IServiceManagerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "type-212",
   "self_type" : "type-212",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-214" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-410",
   "self_type" : "type-410",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-47" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-414",
   "self_type" : "type-414",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-466",
   "self_type" : "type-466",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-464" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-461",
   "self_type" : "type-461",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-432",
   "self_type" : "type-432",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-451",
   "self_type" : "type-451",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-115" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-441",
   "self_type" : "type-441",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-439" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-424",
   "self_type" : "type-424",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-422" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-436",
   "self_type" : "type-436",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-455",
   "self_type" : "type-455",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-446",
   "self_type" : "type-446",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-444" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-266" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-405",
   "self_type" : "type-405",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-408",
   "self_type" : "type-408",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-47" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-412",
   "self_type" : "type-412",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-463",
   "self_type" : "type-463",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-464" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-457",
   "self_type" : "type-457",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-430",
   "self_type" : "type-430",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-115" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-438",
   "self_type" : "type-438",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-439" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-421",
   "self_type" : "type-421",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-422" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-416",
   "self_type" : "type-416",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-453",
   "self_type" : "type-453",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-443",
   "self_type" : "type-443",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-444" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-426",
   "self_type" : "type-426",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-266" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-409",
   "self_type" : "type-409",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-47" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-465",
   "self_type" : "type-465",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-464" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-459",
   "self_type" : "type-459",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-431",
   "self_type" : "type-431",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-449",
   "self_type" : "type-449",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-115" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-440",
   "self_type" : "type-440",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-439" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-423",
   "self_type" : "type-423",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-422" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-417",
   "self_type" : "type-417",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-435",
   "self_type" : "type-435",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-454",
   "self_type" : "type-454",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-445",
   "self_type" : "type-445",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-444" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-266" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-404",
   "self_type" : "type-404",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String16>",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "template_args" : [ "type-55" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String8>",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "type-639",
   "self_type" : "type-639",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-47" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-415",
   "self_type" : "type-415",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-467",
   "self_type" : "type-467",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-464" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-184" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-452",
   "self_type" : "type-452",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-115" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-442",
   "self_type" : "type-442",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-439" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-422" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-420",
   "self_type" : "type-420",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-437",
   "self_type" : "type-437",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-447",
   "self_type" : "type-447",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-444" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-429",
   "self_type" : "type-429",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-266" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-406",
   "self_type" : "type-406",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-257"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::BHwBinder>",
   "name" : "android::wp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-42" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-868"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "name" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-867",
   "self_type" : "type-867",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::hidl_death_recipient>",
   "name" : "android::wp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::wp<android::hidl::base::V1_0::IBase>",
   "name" : "android::wp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android2wpINS_4hidl4base4V1_05IBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-184"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-739",
   "self_type" : "type-739",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-728"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-736"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-735",
   "self_type" : "type-735",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-732"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-734"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-733",
   "self_type" : "type-733",
   "size" : 12,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-652"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "type-730"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-731",
   "self_type" : "type-731",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-737"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-737"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-737"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-737"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-184"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-738",
   "self_type" : "type-738",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-184"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-737",
   "self_type" : "type-737",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "type-728"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-727",
   "self_type" : "type-727",
   "size" : 56,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-263"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-262",
   "self_type" : "type-262",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-265"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-265"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-268"
    },
    {
