{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "long",
   "name" : "long",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "long long",
   "name" : "long long",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "linker_set_key" : "short",
   "name" : "short",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 2
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned int",
   "name" : "unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 4
  },
  {
   "linker_set_key" : "void",
   "name" : "void",
   "referenced_type" : "type-46",
   "self_type" : "type-46"
  }
 ],
 "elf_functions" :
 [
  {
   "name" : "Curl_HMAC_final"
  },
  {
   "name" : "Curl_HMAC_init"
  },
  {
   "name" : "Curl_HMAC_update"
  },
  {
   "name" : "Curl_MD5_final"
  },
  {

   "name" : "fd_set *",
   "referenced_type" : "type-1785",
   "self_type" : "type-1784",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "fd_set *",
   "name" : "fd_set *",
   "referenced_type" : "type-2034",
   "self_type" : "type-2033",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "fd_set *",
   "name" : "fd_set *",
   "referenced_type" : "type-2315",
   "self_type" : "type-2314",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "fd_set *",
   "name" : "fd_set *",
   "referenced_type" : "type-2581",
   "self_type" : "type-2580",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "fd_set *",
   "name" : "fd_set *",
   "referenced_type" : "type-2875",
   "self_type" : "type-2874",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "fd_set *",
   "name" : "fd_set *",
   "referenced_type" : "type-3183",
   "self_type" : "type-3182",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "fd_set *",
   "name" : "fd_set *",
   "referenced_type" : "type-3507",
   "self_type" : "type-3506",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "fd_set *",
   "name" : "fd_set *",
   "referenced_type" : "type-980",
   "self_type" : "type-979",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int (*)(void *, long long, int)",
   "name" : "int (*)(void *, long long, int)",
   "referenced_type" : "type-967",
   "self_type" : "type-968",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int *",
   "name" : "int *",
   "referenced_type" : "type-6",
   "self_type" : "type-167",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "long *",
   "name" : "long *",
   "referenced_type" : "type-3",
   "self_type" : "type-983",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int (*)(char *, unsigned int, unsigned int, void *)",
   "name" : "unsigned int (*)(char *, unsigned int, unsigned int, void *)",
   "referenced_type" : "type-964",
   "self_type" : "type-966",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int (*)(void *, const char *, unsigned int)",
   "name" : "unsigned int (*)(void *, const char *, unsigned int)",
   "referenced_type" : "type-173",
   "self_type" : "type-174",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int *",
   "name" : "unsigned int *",
   "referenced_type" : "type-2",
   "self_type" : "type-162",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/easy.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void (*)(void *)",
   "name" : "void (*)(void *)",
   "referenced_type" : "type-151",
   "self_type" : "type-152",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-46",
   "self_type" : "type-45",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *(*)(unsigned int)",
   "name" : "void *(*)(unsigned int)",
   "referenced_type" : "type-148",
   "self_type" : "type-150",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *(*)(unsigned int, unsigned int)",
   "name" : "void *(*)(unsigned int, unsigned int)",
   "referenced_type" : "type-158",
   "self_type" : "type-159",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *(*)(void *, unsigned int)",
   "name" : "void *(*)(void *, unsigned int)",
   "referenced_type" : "type-153",
   "self_type" : "type-154",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-11",
   "self_type" : "type-39",
   "size" : 1,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const char *const",
   "name" : "const char *const",
   "referenced_type" : "type-38",
   "self_type" : "type-75",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const curl_ssl_backend",
   "name" : "const curl_ssl_backend",
   "referenced_type" : "type-61",
   "self_type" : "type-3351",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const long",
   "name" : "const long",
   "referenced_type" : "type-3",
   "self_type" : "type-996",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/curl.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-46",
   "self_type" : "type-163",
   "source_file" : "/external/curl/include/curl/easy.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "easy_handle",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "CURLMsg",
   "name" : "CURLMsg",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 12,
   "source_file" : "/external/curl/include/curl/multi.h",
   "unique_id" : "CURLMsg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "whatever",
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "result",
     "referenced_type" : "type-32"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "CURLMsg::(anonymous union at external/curl/include/curl/multi.h:98:3) at external/curl/include/curl/multi.h:98:3",
   "name" : "CURLMsg::(anonymous union at external/curl/include/curl/multi.h:98:3) at external/curl/include/curl/multi.h:98:3",
   "record_kind" : "union",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 4,
   "source_file" : "/external/curl/include/curl/multi.h",
   "unique_id" : "CURLMsg::(anonymous union at external/curl/include/curl/multi.h:98:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_of_certs",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "certinfo",
     "field_offset" : 32,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "curl_certinfo",
   "name" : "curl_certinfo",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_certinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "filename",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "filetype",
     "field_offset" : 32,
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "time",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "perm",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "gid",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "size",
     "field_offset" : 192,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "hardlinks",
     "field_offset" : 256,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "strings",
     "field_offset" : 288,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "flags",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "b_data",
     "field_offset" : 480,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "b_size",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "b_used",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "curl_fileinfo",
   "name" : "curl_fileinfo",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 72,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_fileinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "time",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "perm",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "user",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "group",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "target",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "curl_fileinfo::(anonymous struct at external/curl/include/curl/curl.h:300:3) at external/curl/include/curl/curl.h:300:3",
   "name" : "curl_fileinfo::(anonymous struct at external/curl/include/curl/curl.h:300:3) at external/curl/include/curl/curl.h:300:3",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 20,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_fileinfo::(anonymous struct at external/curl/include/curl/curl.h:300:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "option",
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "curl_forms",
   "name" : "curl_forms",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_forms"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "namelength",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "contents",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "contentslength",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 160,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "bufferlength",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "contenttype",
     "field_offset" : 224,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "contentheader",
     "field_offset" : 256,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "more",
     "field_offset" : 288,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "flags",
     "field_offset" : 320,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "showfilename",
     "field_offset" : 352,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "userp",
     "field_offset" : 384,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "contentlen",
     "field_offset" : 416,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "curl_httppost",
   "name" : "curl_httppost",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 60,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_httppost"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "keytype",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "curl_khkey",
   "name" : "curl_khkey",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 12,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_khkey"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "next",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "curl_slist",
   "name" : "curl_slist",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_slist"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "family",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "socktype",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "protocol",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "addrlen",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "addr",
     "field_offset" : 128,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "curl_sockaddr",
   "name" : "curl_sockaddr",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 32,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_sockaddr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "curl_ssl_backend",
   "name" : "curl_ssl_backend",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_ssl_backend"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "backend",
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "internals",
     "field_offset" : 32,
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "curl_tlssessioninfo",
   "name" : "curl_tlssessioninfo",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_tlssessioninfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "age",
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "version_num",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "host",
     "field_offset" : 96,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "features",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "ssl_version",
     "field_offset" : 160,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "ssl_version_num",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "libz_version",
     "field_offset" : 224,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "protocols",
     "field_offset" : 256,
     "referenced_type" : "type-74"
    },
    {
     "field_name" : "ares",
     "field_offset" : 288,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "ares_num",
     "field_offset" : 320,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "libidn",
     "field_offset" : 352,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "iconv_ver_num",
     "field_offset" : 384,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "libssh_version",
     "field_offset" : 416,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "brotli_ver_num",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "brotli_version",
     "field_offset" : 480,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "curl_version_info_data",
   "name" : "curl_version_info_data",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 64,
   "source_file" : "/external/curl/include/curl/curl.h",
   "unique_id" : "curl_version_info_data"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "events",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "revents",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "curl_waitfd",
   "name" : "curl_waitfd",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 8,
   "source_file" : "/external/curl/include/curl/multi.h",
   "unique_id" : "curl_waitfd"
  }
 ],
 "rvalue_reference_types" : []
}
