{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "AHardwareBuffer_Plane [4]",
   "name" : "AHardwareBuffer_Plane [4]",
   "referenced_type" : "type-2167",
   "self_type" : "type-2169",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_fpreg [8]",
   "name" : "_fpreg [8]",
   "referenced_type" : "type-2227",
   "self_type" : "type-2234",
   "size" : 80,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_fpxreg [8]",
   "name" : "_fpxreg [8]",
   "referenced_type" : "type-2229",
   "self_type" : "type-2235",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_libc_fpreg [8]",
   "name" : "_libc_fpreg [8]",
   "referenced_type" : "type-2310",
   "self_type" : "type-2312",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_xmmreg [8]",
   "name" : "_xmmreg [8]",
   "referenced_type" : "type-2231",
   "self_type" : "type-2236",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::renderscript::Allocation::Hal::DrvState::LodState [16]",

   "linker_set_key" : "unsigned long long const __attribute__((ext_vector_type(3)))",
   "name" : "unsigned long long const __attribute__((ext_vector_type(3)))",
   "referenced_type" : "type-911",
   "self_type" : "type-910",
   "size" : 32,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp"
  },
  {
   "alignment" : 32,
   "is_const" : true,
   "linker_set_key" : "unsigned long long const __attribute__((ext_vector_type(4)))",
   "name" : "unsigned long long const __attribute__((ext_vector_type(4)))",
   "referenced_type" : "type-4739",
   "self_type" : "type-4738",
   "size" : 32,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp"
  },
  {
   "alignment" : 32,
   "is_const" : true,
   "linker_set_key" : "unsigned long long const __attribute__((ext_vector_type(4)))",
   "name" : "unsigned long long const __attribute__((ext_vector_type(4)))",
   "referenced_type" : "type-917",
   "self_type" : "type-916",
   "size" : 32,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "unsigned short const __attribute__((ext_vector_type(2)))",
   "name" : "unsigned short const __attribute__((ext_vector_type(2)))",
   "referenced_type" : "type-4665",
   "self_type" : "type-4664",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "unsigned short const __attribute__((ext_vector_type(2)))",
   "name" : "unsigned short const __attribute__((ext_vector_type(2)))",
   "referenced_type" : "type-835",
   "self_type" : "type-834",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "unsigned short const __attribute__((ext_vector_type(3)))",
   "name" : "unsigned short const __attribute__((ext_vector_type(3)))",
   "referenced_type" : "type-4670",
   "self_type" : "type-4669",
   "size" : 8,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "unsigned short const __attribute__((ext_vector_type(3)))",
   "name" : "unsigned short const __attribute__((ext_vector_type(3)))",
   "referenced_type" : "type-841",
   "self_type" : "type-840",
   "size" : 8,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "unsigned short const __attribute__((ext_vector_type(4)))",
   "name" : "unsigned short const __attribute__((ext_vector_type(4)))",
   "referenced_type" : "type-4675",
   "self_type" : "type-4674",
   "size" : 8,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "unsigned short const __attribute__((ext_vector_type(4)))",
   "name" : "unsigned short const __attribute__((ext_vector_type(4)))",
   "referenced_type" : "type-846",
   "self_type" : "type-845",
   "size" : 8,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void (*const)(void *)",
   "name" : "void (*const)(void *)",
   "referenced_type" : "type-49",
   "self_type" : "type-1889",
   "size" : 4,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-2204",
   "self_type" : "type-2206",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *(*const)(const void *)",
   "name" : "void *(*const)(const void *)",
   "referenced_type" : "type-1887",
   "self_type" : "type-1886",
   "size" : 4,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "type-2198",
   "self_type" : "type-2200",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "type-2207",
   "self_type" : "type-2209",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned int, const void *)",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "type-2201",
   "self_type" : "type-2203",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-7",
   "self_type" : "type-794",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/string.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile std::atomic_flag",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "type-1317",
   "self_type" : "type-1319",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "type-498"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "referenced_type" : "type-2166",
   "self_type" : "type-2166",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Desc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "referenced_type" : "type-2167",
   "self_type" : "type-2167",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "planes",
     "field_offset" : 32,
     "referenced_type" : "type-2169"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "referenced_type" : "type-2168",
   "self_type" : "type-2168",
   "size" : 52,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Planes"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-2134"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "minSwapInterval",
     "field_offset" : 288,
     "referenced_type" : "type-748"
    },
    {
     "field_name" : "maxSwapInterval",
     "field_offset" : 320,
     "referenced_type" : "type-748"
    },
    {
     "field_name" : "xdpi",
     "field_offset" : 352,
     "referenced_type" : "type-943"
    },
    {
     "field_name" : "ydpi",
     "field_offset" : 384,
     "referenced_type" : "type-943"
    },
    {
     "field_name" : "oem",
     "field_offset" : 416,
     "referenced_type" : "type-1969"
    },
    {
     "field_name" : "setSwapInterval",
     "field_offset" : 544,
     "referenced_type" : "type-3218"
    },
    {
     "field_name" : "dequeueBuffer_DEPRECATED",
     "field_offset" : 576,
     "referenced_type" : "type-3221"
    },
    {
     "field_name" : "lockBuffer_DEPRECATED",
     "field_offset" : 608,
     "referenced_type" : "type-3224"
    },
    {
     "field_name" : "queueBuffer_DEPRECATED",
     "field_offset" : 640,
     "referenced_type" : "type-3224"
    },
    {
     "field_name" : "query",
     "field_offset" : 672,
     "referenced_type" : "type-3226"
    },
    {
     "field_name" : "perform",
     "field_offset" : 704,
     "referenced_type" : "type-3231"
    },
    {
     "field_name" : "cancelBuffer_DEPRECATED",
     "field_offset" : 736,
     "referenced_type" : "type-3224"
    },
    {
     "field_name" : "dequeueBuffer",
     "field_offset" : 768,
     "referenced_type" : "type-3233"
    },
    {
     "field_name" : "queueBuffer",
     "field_offset" : 800,
     "referenced_type" : "type-3235"
    },
    {
     "field_name" : "cancelBuffer",
     "field_offset" : 832,
     "referenced_type" : "type-3235"
    }
   ],
   "linker_set_key" : "ANativeWindow",
   "name" : "ANativeWindow",
   "referenced_type" : "type-3217",
   "self_type" : "type-3217",
   "size" : 108,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h",
   "unique_id" : "ANativeWindow"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-2134"
    },
    {
     "field_name" : "width",
     "field_offset" : 256,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "height",
     "field_offset" : 288,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "stride",
     "field_offset" : 320,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "format",
     "field_offset" : 352,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 384,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 416,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 448,
     "referenced_type" : "type-2139"
    },
    {
     "field_name" : "handle",
     "field_offset" : 480,
     "referenced_type" : "type-2140"
    },
    {
     "field_name" : "usage",
     "field_offset" : 512,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 576,
     "referenced_type" : "type-2144"
    }
   ],
   "linker_set_key" : "ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "type-2133",
   "self_type" : "type-2133",
   "size" : 96,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "ANativeWindowBuffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "bits",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 160,
     "referenced_type" : "type-2173"
    }
   ],
   "linker_set_key" : "ANativeWindow_Buffer",
   "name" : "ANativeWindow_Buffer",
   "referenced_type" : "type-2172",
   "self_type" : "type-2172",
   "size" : 44,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/native_window.h",
   "unique_id" : "ANativeWindow_Buffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "ARect",
   "name" : "ARect",
   "referenced_type" : "type-2163",
   "self_type" : "type-2163",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h",
   "unique_id" : "ARect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "textureID",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "bufferID",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "renderTargetID",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "glTarget",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "glType",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "glFormat",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "wndBuffer",
     "field_offset" : 192,
     "referenced_type" : "type-2132"
    },
    {
     "field_name" : "useUserProvidedPtr",
     "field_offset" : 224,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "uploadDeferred",
     "field_offset" : 232,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "readBackFBO",
     "field_offset" : 256,
     "referenced_type" : "type-2145"
    },
    {
     "field_name" : "wnd",
     "field_offset" : 288,
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "wndSurface",
     "field_offset" : 320,
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "DrvAllocation",
   "name" : "DrvAllocation",
   "referenced_type" : "type-2131",
   "self_type" : "type-2131",
   "size" : 44,
   "source_file" : "/frameworks/rs/driver/rsdAllocation.h",
   "unique_id" : "_ZTS13DrvAllocation"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "blendSrc",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "blendDst",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "blendEnable",
     "field_offset" : 64,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "depthFunc",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "depthTestEnable",
     "field_offset" : 128,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "DrvProgramStore",
   "name" : "DrvProgramStore",
   "referenced_type" : "type-535",
   "self_type" : "type-535",
   "size" : 20,
   "source_file" : "/frameworks/rs/driver/rsdProgramStore.cpp",
   "unique_id" : "_ZTS15DrvProgramStore"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pData",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "iWidth",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "iHeight",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "iStride",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "EGLClientPixmapHI",
   "name" : "EGLClientPixmapHI",
   "referenced_type" : "type-3271",
   "self_type" : "type-3271",
   "size" : 16,
   "source_file" : "/frameworks/native/opengl/include/EGL/eglext.h",
   "unique_id" : "EGLClientPixmapHI"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "func",
     "referenced_type" : "type-2342"
    },
    {
     "field_name" : "transA",
     "field_offset" : 32,
     "referenced_type" : "type-2304"
    },
    {
     "field_name" : "transB",
     "field_offset" : 64,
     "referenced_type" : "type-2304"
    },
    {
     "field_name" : "uplo",
     "field_offset" : 96,
     "referenced_type" : "type-2316"
    },
    {
     "field_name" : "diag",
     "field_offset" : 128,
     "referenced_type" : "type-2326"
    },
    {
     "field_name" : "side",
     "field_offset" : 160,
     "referenced_type" : "type-2336"
    },
    {
     "field_name" : "M",
     "field_offset" : 192,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "N",
     "field_offset" : 224,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "K",
     "field_offset" : 256,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 288,
     "referenced_type" : "type-2371"
    },
    {
     "field_name" : "beta",
     "field_offset" : 416,
     "referenced_type" : "type-2371"
    },
    {
     "field_name" : "incX",
     "field_offset" : 544,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "incY",
     "field_offset" : 576,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "KL",
     "field_offset" : 608,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "KU",
     "field_offset" : 640,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "a_offset",
     "field_offset" : 672,
     "referenced_type" : "type-143"
    },
    {
     "field_name" : "b_offset",
     "field_offset" : 680,
     "referenced_type" : "type-143"
    },
    {
     "field_name" : "c_offset",
     "field_offset" : 704,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "c_mult_int",
     "field_offset" : 736,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "RsBlasCall",
   "name" : "RsBlasCall",
   "referenced_type" : "type-2377",
   "self_type" : "type-2377",
   "size" : 96,
   "source_file" : "/frameworks/rs/rsDefines.h",
   "unique_id" : "RsBlasCall"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "c",
     "referenced_type" : "type-2347"
    },
    {
     "field_name" : "d",
     "referenced_type" : "type-687"
    },
    {
     "field_name" : "z",
     "referenced_type" : "type-2354"
    }
   ],
   "linker_set_key" : "RsBlasScalar",
   "name" : "RsBlasScalar",
   "record_kind" : "union",
   "referenced_type" : "type-2371",
   "self_type" : "type-2371",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsDefines.h",
   "unique_id" : "RsBlasScalar"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-687"
    },
    {
     "field_name" : "i",
     "field_offset" : 64,
     "referenced_type" : "type-687"
    }
   ],
   "linker_set_key" : "RsDoubleComplex",
   "name" : "RsDoubleComplex",
   "referenced_type" : "type-2354",
   "self_type" : "type-2354",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsDefines.h",
   "unique_id" : "RsDoubleComplex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "classID",
     "referenced_type" : "type-2645"
    },
    {
     "field_name" : "objectName",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "RsFileIndexEntry",
   "name" : "RsFileIndexEntry",
   "referenced_type" : "type-2677",
   "self_type" : "type-2677",
   "size" : 8,
   "source_file" : "/frameworks/rs/rsInternalDefines.h",
   "unique_id" : "RsFileIndexEntry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "i",
     "field_offset" : 32,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "RsFloatComplex",
   "name" : "RsFloatComplex",
   "referenced_type" : "type-2347",
   "self_type" : "type-2347",
   "size" : 8,
   "source_file" : "/frameworks/rs/rsDefines.h",
   "unique_id" : "RsFloatComplex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "strategy",
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "xStart",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "xEnd",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "yStart",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "yEnd",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "zStart",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "zEnd",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "arrayStart",
     "field_offset" : 224,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "arrayEnd",
     "field_offset" : 256,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array2Start",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array2End",
     "field_offset" : 320,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array3Start",
     "field_offset" : 352,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array3End",
     "field_offset" : 384,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array4Start",
     "field_offset" : 416,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array4End",
     "field_offset" : 448,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "RsScriptCall",
   "name" : "RsScriptCall",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 60,
   "source_file" : "/frameworks/rs/rsDefines.h",
   "unique_id" : "RsScriptCall"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "colorMin",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "colorPref",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "alphaMin",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "alphaPref",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "depthMin",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "depthPref",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "stencilMin",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "stencilPref",
     "field_offset" : 224,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "samplesMin",
     "field_offset" : 256,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "samplesPref",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "samplesQ",
     "field_offset" : 320,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "RsSurfaceConfig",
   "name" : "RsSurfaceConfig",
   "referenced_type" : "type-388",
   "self_type" : "type-388",
   "size" : 44,
   "source_file" : "/frameworks/rs/rsInternalDefines.h",
   "unique_id" : "RsSurfaceConfig"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "e",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "dimX",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "dimY",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "dimZ",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mipmaps",
     "field_offset" : 128,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "faces",
     "field_offset" : 136,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "yuv",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array0",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array1",
     "field_offset" : 224,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array2",
     "field_offset" : 256,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "array3",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "RsTypeCreateParams",
   "name" : "RsTypeCreateParams",
   "referenced_type" : "type-2006",
   "self_type" : "type-2006",
   "size" : 40,
   "source_file" : "/frameworks/rs/rsInternalDefines.h",
   "unique_id" : "RsTypeCreateParams"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFBOId",
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mColorTargets",
     "field_offset" : 32,
     "referenced_type" : "type-2147"
    },
    {
     "access" : "protected",
     "field_name" : "mColorTargetsCount",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mDepthTarget",
     "field_offset" : 96,
     "referenced_type" : "type-2148"
    },
    {
     "access" : "protected",
     "field_name" : "mWidth",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mHeight",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mDirty",
     "field_offset" : 192,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "RsdFrameBufferObj",
   "name" : "RsdFrameBufferObj",
   "record_kind" : "class",
   "referenced_type" : "type-2146",
   "self_type" : "type-2146",
   "size" : 28,
   "source_file" : "/frameworks/rs/driver/rsdFrameBufferObj.h",
   "unique_id" : "_ZTS17RsdFrameBufferObj"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "egl",
     "referenced_type" : "type-2152"
    },
    {
     "field_name" : "gl",
     "field_offset" : 256,
     "referenced_type" : "type-2153"
    },
    {
     "field_name" : "wndSurface",
     "field_offset" : 736,
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "currentWndSurface",
     "field_offset" : 768,
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "shaderCache",
     "field_offset" : 800,
     "referenced_type" : "type-2154"
    },
    {
     "field_name" : "vertexArrayState",
     "field_offset" : 832,
     "referenced_type" : "type-2156"
    },
    {
     "field_name" : "currentFrameBuffer",
     "field_offset" : 864,
     "referenced_type" : "type-2145"
    }
   ],
   "linker_set_key" : "RsdGLRec",
   "name" : "RsdGLRec",
   "referenced_type" : "type-2151",
   "self_type" : "type-2151",
   "size" : 112,
   "source_file" : "/frameworks/rs/driver/rsdGL.h",
   "unique_id" : "_ZTS8RsdGLRec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numConfigs",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "majorVersion",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "minorVersion",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "config",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "context",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "surface",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "surfaceDefault",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "display",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "RsdGLRec::(anonymous struct at /frameworks/rs/driver/rsdGL.h:30:5) at /frameworks/rs/driver/rsdGL.h:30:5",
   "name" : "RsdGLRec::(anonymous struct at /frameworks/rs/driver/rsdGL.h:30:5) at /frameworks/rs/driver/rsdGL.h:30:5",
   "referenced_type" : "type-2152",
   "self_type" : "type-2152",
   "size" : 32,
   "source_file" : "/frameworks/rs/driver/rsdGL.h",
   "unique_id" : "_ZTSN8RsdGLRecUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vendor",
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "renderer",
     "field_offset" : 32,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "version",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "extensions",
     "field_offset" : 96,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "majorVersion",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "minorVersion",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "maxVaryingVectors",
     "field_offset" : 192,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "maxTextureImageUnits",
     "field_offset" : 224,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "maxFragmentTextureImageUnits",
     "field_offset" : 256,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "maxFragmentUniformVectors",
     "field_offset" : 288,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "maxVertexAttribs",
     "field_offset" : 320,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "maxVertexUniformVectors",
     "field_offset" : 352,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "maxVertexTextureUnits",
     "field_offset" : 384,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "OES_texture_npot",
     "field_offset" : 416,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "IMG_texture_npot",
     "field_offset" : 424,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "NV_texture_npot_2D_mipmap",
     "field_offset" : 432,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "EXT_texture_max_aniso",
     "field_offset" : 448,
     "referenced_type" : "type-108"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "RsdGLRec::(anonymous struct at /frameworks/rs/driver/rsdGL.h:41:5) at /frameworks/rs/driver/rsdGL.h:41:5",
   "name" : "RsdGLRec::(anonymous struct at /frameworks/rs/driver/rsdGL.h:41:5) at /frameworks/rs/driver/rsdGL.h:41:5",
   "referenced_type" : "type-2153",
   "self_type" : "type-2153",
   "size" : 60,
   "source_file" : "/frameworks/rs/driver/rsdGL.h",
   "unique_id" : "_ZTSN8RsdGLRecUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version_major",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "version_minor",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mHasGraphics",
     "field_offset" : 64,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mTlsStruct",
     "field_offset" : 96,
     "referenced_type" : "type-2158"
    },
    {
     "field_name" : "mCpuRef",
     "field_offset" : 160,
     "referenced_type" : "type-2160"
    },
    {
     "field_name" : "gl",
     "field_offset" : 192,
     "referenced_type" : "type-2151"
    }
   ],
   "linker_set_key" : "RsdHalRec",
   "name" : "RsdHalRec",
   "referenced_type" : "type-2159",
   "self_type" : "type-2159",
   "size" : 136,
   "source_file" : "/frameworks/rs/driver/rsdCore.h",
   "unique_id" : "_ZTS9RsdHalRec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRSMesh",
     "referenced_type" : "type-3502"
    },
    {
     "access" : "protected",
     "field_name" : "mGLPrimitives",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "access" : "protected",
     "field_name" : "mAttribs",
     "field_offset" : 64,
     "referenced_type" : "type-3522"
    },
    {
     "access" : "protected",
     "field_name" : "mAttribAllocationIndex",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "access" : "protected",
     "field_name" : "mAttribCount",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "RsdMeshObj",
   "name" : "RsdMeshObj",
   "record_kind" : "class",
   "referenced_type" : "type-3521",
   "self_type" : "type-3521",
   "size" : 20,
   "source_file" : "/frameworks/rs/driver/rsdMeshObj.h",
   "unique_id" : "_ZTS10RsdMeshObj"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRSProgram",
     "field_offset" : 32,
     "referenced_type" : "type-90"
    },
    {
     "access" : "protected",
     "field_name" : "mIsValid",
     "field_offset" : 64,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mDirty",
     "field_offset" : 72,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mShader",
     "field_offset" : 96,
     "referenced_type" : "type-1297"
    },
    {
     "access" : "protected",
     "field_name" : "mUserShader",
     "field_offset" : 192,
     "referenced_type" : "type-1297"
    },
    {
     "access" : "protected",
     "field_name" : "mType",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mTextureCount",
     "field_offset" : 320,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mCurrentState",
     "field_offset" : 352,
     "referenced_type" : "type-3673"
    },
    {
     "access" : "protected",
     "field_name" : "mAttribCount",
     "field_offset" : 384,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mUniformCount",
     "field_offset" : 416,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mAttribNames",
     "field_offset" : 448,
     "referenced_type" : "type-1956"
    },
    {
     "access" : "protected",
     "field_name" : "mUniformNames",
     "field_offset" : 480,
     "referenced_type" : "type-1956"
    },
    {
     "access" : "protected",
     "field_name" : "mUniformArraySizes",
     "field_offset" : 512,
     "referenced_type" : "type-19"
    },
    {
     "access" : "protected",
     "field_name" : "mTextureNames",
     "field_offset" : 544,
     "referenced_type" : "type-3708"
    },
    {
     "access" : "protected",
     "field_name" : "mStateBasedShaders",
     "field_offset" : 640,
     "referenced_type" : "type-3714"
    },
    {
     "access" : "protected",
     "field_name" : "mTextureUniformIndexStart",
     "field_offset" : 736,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "RsdShader",
   "name" : "RsdShader",
   "record_kind" : "class",
   "referenced_type" : "type-3834",
   "self_type" : "type-3834",
   "size" : 96,
   "source_file" : "/frameworks/rs/driver/rsdShader.h",
   "unique_id" : "_ZTS9RsdShader",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI9RsdShader"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9RsdShaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9RsdShaderD0Ev"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mShaderID",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mTextureTargets",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "RsdShader::StateBasedKey",
   "name" : "RsdShader::StateBasedKey",
   "record_kind" : "class",
   "referenced_type" : "type-3674",
   "self_type" : "type-3674",
   "size" : 8,
   "source_file" : "/frameworks/rs/driver/rsdShader.h",
   "unique_id" : "_ZTSN9RsdShader13StateBasedKeyE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFragmentDirty",
     "field_offset" : 32,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mVertexDirty",
     "field_offset" : 40,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mVertex",
     "field_offset" : 64,
     "referenced_type" : "type-3315"
    },
    {
     "access" : "protected",
     "field_name" : "mFragment",
     "field_offset" : 96,
     "referenced_type" : "type-3315"
    },
    {
     "access" : "protected",
     "field_name" : "mEntries",
     "field_offset" : 128,
     "referenced_type" : "type-3208"
    },
    {
     "access" : "protected",
     "field_name" : "mCurrent",
     "field_offset" : 224,
     "referenced_type" : "type-3167"
    }
   ],
   "linker_set_key" : "RsdShaderCache",
   "name" : "RsdShaderCache",
   "record_kind" : "class",
   "referenced_type" : "type-3314",
   "self_type" : "type-3314",
   "size" : 32,
   "source_file" : "/frameworks/rs/driver/rsdShaderCache.h",
   "unique_id" : "_ZTS14RsdShaderCache",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI14RsdShaderCache"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN14RsdShaderCacheD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN14RsdShaderCacheD0Ev"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "slot",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "RsdShaderCache::AttrData",
   "name" : "RsdShaderCache::AttrData",
   "referenced_type" : "type-3170",
   "self_type" : "type-3170",
   "size" : 8,
   "source_file" : "/frameworks/rs/driver/rsdShaderCache.h",
   "unique_id" : "_ZTSN14RsdShaderCache8AttrDataE"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vtx",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "frag",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "program",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "vtxAttrCount",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "vtxAttrs",
     "field_offset" : 128,
     "referenced_type" : "type-3169"
    },
    {
     "field_name" : "vtxUniforms",
     "field_offset" : 160,
     "referenced_type" : "type-3171"
    },
    {
     "field_name" : "fragUniforms",
     "field_offset" : 192,
     "referenced_type" : "type-3171"
    },
    {
     "field_name" : "fragUniformIsSTO",
     "field_offset" : 224,
     "referenced_type" : "type-3173"
    }
   ],
   "linker_set_key" : "RsdShaderCache::ProgramEntry",
   "name" : "RsdShaderCache::ProgramEntry",
   "referenced_type" : "type-3168",
   "self_type" : "type-3168",
   "size" : 32,
   "source_file" : "/frameworks/rs/driver/rsdShaderCache.h",
   "unique_id" : "_ZTSN14RsdShaderCache12ProgramEntryE"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "slot",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "arraySize",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "RsdShaderCache::UniformData",
   "name" : "RsdShaderCache::UniformData",
   "referenced_type" : "type-3172",
   "self_type" : "type-3172",
   "size" : 8,
   "source_file" : "/frameworks/rs/driver/rsdShaderCache.h",
   "unique_id" : "_ZTSN14RsdShaderCache11UniformDataE"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-588"
    },
    {
     "field_name" : "nameLength",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "writtenLength",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "arraySize",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "type",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "RsdShaderCache::UniformQueryData",
   "name" : "RsdShaderCache::UniformQueryData",
   "referenced_type" : "type-3353",
   "self_type" : "type-3353",
   "size" : 20,
   "source_file" : "/frameworks/rs/driver/rsdShaderCache.h",
   "unique_id" : "_ZTSN14RsdShaderCache16UniformQueryDataE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mActiveBuffer",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mActivePointer",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    },
    {
     "access" : "protected",
     "field_name" : "mCount",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mAttribs",
     "field_offset" : 128,
     "referenced_type" : "type-3356"
    }
   ],
   "linker_set_key" : "RsdVertexArray",
   "name" : "RsdVertexArray",
   "record_kind" : "class",
   "referenced_type" : "type-3355",
   "self_type" : "type-3355",
   "size" : 20,
   "source_file" : "/frameworks/rs/driver/rsdVertexArray.h",
   "unique_id" : "_ZTS14RsdVertexArray",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI14RsdVertexArray"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN14RsdVertexArrayD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN14RsdVertexArrayD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 32,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "type",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "stride",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "normalized",
     "field_offset" : 192,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "name",
     "field_offset" : 224,
     "referenced_type" : "type-1297"
    }
   ],
   "linker_set_key" : "RsdVertexArray::Attrib",
   "name" : "RsdVertexArray::Attrib",
   "record_kind" : "class",
   "referenced_type" : "type-3358",
   "self_type" : "type-3358",
   "size" : 40,
   "source_file" : "/frameworks/rs/driver/rsdVertexArray.h",
   "unique_id" : "_ZTSN14RsdVertexArray6AttribE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mAttrsEnabled",
     "referenced_type" : "type-3173"
    },
    {
     "field_name" : "mAttrsEnabledSize",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "RsdVertexArrayState",
   "name" : "RsdVertexArrayState",
   "record_kind" : "class",
   "referenced_type" : "type-3318",
   "self_type" : "type-3318",
   "size" : 8,
   "source_file" : "/frameworks/rs/driver/rsdVertexArray.h",
   "unique_id" : "_ZTS19RsdVertexArrayState"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mContext",
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "mScript",
     "field_offset" : 32,
     "referenced_type" : "type-146"
    }
   ],
   "linker_set_key" : "ScriptTLSStructRec",
   "name" : "ScriptTLSStructRec",
   "referenced_type" : "type-2158",
   "self_type" : "type-2158",
   "size" : 8,
   "source_file" : "/frameworks/rs/driver/rsdCore.h",
   "unique_id" : "_ZTS18ScriptTLSStructRec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2283"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-2282",
   "self_type" : "type-2282",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-478"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-2532",
   "self_type" : "type-2532",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-2221"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-2221"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-2222",
   "self_type" : "type-2222",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-488"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-2224",
   "self_type" : "type-2224",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-2257"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-2280"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-2256",
   "self_type" : "type-2256",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-2258"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-2260"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3) at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3) at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3",
   "record_kind" : "union",
   "referenced_type" : "type-2257",
   "self_type" : "type-2257",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTSN18__kernel_sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-2221",
   "self_type" : "type-2221",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "type-2328"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "type-2327",
   "self_type" : "type-2327",
   "size" : 12,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/pthread.h",
   "unique_id" : "__pthread_cleanup_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "type-2267"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-2268"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-2270"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-2271"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-2272"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-2277"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-2278"
    }
   ],
   "linker_set_key" : "__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "type-2266",
   "self_type" : "type-2266",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS10__sifields"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "referenced_type" : "type-2267",
   "self_type" : "type-2267",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-2269"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "referenced_type" : "type-2268",
   "self_type" : "type-2268",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-2269"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "referenced_type" : "type-2270",
   "self_type" : "type-2270",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-488"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "referenced_type" : "type-2271",
   "self_type" : "type-2271",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-7"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-2273"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "referenced_type" : "type-2272",
   "self_type" : "type-2272",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-561"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-2274"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-2276"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "record_kind" : "union",
   "referenced_type" : "type-2273",
   "self_type" : "type-2273",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-2275"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "referenced_type" : "type-2274",
   "self_type" : "type-2274",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-2275"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "referenced_type" : "type-2276",
   "self_type" : "type-2276",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "referenced_type" : "type-2277",
   "self_type" : "type-2277",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "referenced_type" : "type-2278",
   "self_type" : "type-2278",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt5_E"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-2228"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-563"
    }
   ],
   "linker_set_key" : "_fpreg",
   "name" : "_fpreg",
   "referenced_type" : "type-2227",
   "self_type" : "type-2227",
   "size" : 10,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS6_fpreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cw",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "sw",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "ipoff",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "cssel",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "dataoff",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "datasel",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "_st",
     "field_offset" : 224,
     "referenced_type" : "type-2234"
    },
    {
     "field_name" : "status",
     "field_offset" : 864,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "magic",
     "field_offset" : 880,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "_fxsr_env",
     "field_offset" : 896,
     "referenced_type" : "type-2173"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 1088,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 1120,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "_fxsr_st",
     "field_offset" : 1152,
     "referenced_type" : "type-2235"
    },
    {
     "field_name" : "_xmm",
     "field_offset" : 2176,
     "referenced_type" : "type-2236"
    },
    {
     "field_offset" : 3200,
     "referenced_type" : "type-2237"
    },
    {
     "field_offset" : 4608,
     "referenced_type" : "type-2239"
    }
   ],
   "linker_set_key" : "_fpstate_32",
   "name" : "_fpstate_32",
   "referenced_type" : "type-2233",
   "self_type" : "type-2233",
   "size" : 624,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_fpstate_32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding1",
     "referenced_type" : "type-2238"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "type-2238"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "record_kind" : "union",
   "referenced_type" : "type-2237",
   "self_type" : "type-2237",
   "size" : 176,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_32Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding2",
     "referenced_type" : "type-2240"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-2225"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "record_kind" : "union",
   "referenced_type" : "type-2239",
   "self_type" : "type-2239",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_32Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "twd",
     "field_offset" : 32,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "rip",
     "field_offset" : 64,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "rdp",
     "field_offset" : 128,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mxcsr_mask",
     "field_offset" : 224,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 256,
     "referenced_type" : "type-2242"
    },
    {
     "field_name" : "xmm_space",
     "field_offset" : 1280,
     "referenced_type" : "type-2243"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 3328,
     "referenced_type" : "type-2240"
    },
    {
     "field_offset" : 3712,
     "referenced_type" : "type-2244"
    }
   ],
   "linker_set_key" : "_fpstate_64",
   "name" : "_fpstate_64",
   "referenced_type" : "type-2241",
   "self_type" : "type-2241",
   "size" : 512,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_fpstate_64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved3",
     "referenced_type" : "type-2240"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-2225"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "name" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "record_kind" : "union",
   "referenced_type" : "type-2244",
   "self_type" : "type-2244",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic1",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "extended_size",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "xfeatures",
     "field_offset" : 64,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "xstate_size",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "padding",
     "field_offset" : 160,
     "referenced_type" : "type-2226"
    }
   ],
   "linker_set_key" : "_fpx_sw_bytes",
   "name" : "_fpx_sw_bytes",
   "referenced_type" : "type-2225",
   "self_type" : "type-2225",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13_fpx_sw_bytes"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-2228"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "padding",
     "field_offset" : 80,
     "referenced_type" : "type-2230"
    }
   ],
   "linker_set_key" : "_fpxreg",
   "name" : "_fpxreg",
   "referenced_type" : "type-2229",
   "self_type" : "type-2229",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_fpxreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "xfeatures",
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-2246"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 192,
     "referenced_type" : "type-2247"
    }
   ],
   "linker_set_key" : "_header",
   "name" : "_header",
   "referenced_type" : "type-2245",
   "self_type" : "type-2245",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_header"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-2228"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-563"
    }
   ],
   "linker_set_key" : "_libc_fpreg",
   "name" : "_libc_fpreg",
   "referenced_type" : "type-2310",
   "self_type" : "type-2310",
   "size" : 10,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "_libc_fpreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cw",
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "sw",
     "field_offset" : 32,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "ipoff",
     "field_offset" : 96,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "cssel",
     "field_offset" : 128,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "dataoff",
     "field_offset" : 160,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "datasel",
     "field_offset" : 192,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "_st",
     "field_offset" : 224,
     "referenced_type" : "type-2312"
    },
    {
     "field_name" : "status",
     "field_offset" : 864,
     "referenced_type" : "type-568"
    }
   ],
   "linker_set_key" : "_libc_fpstate",
   "name" : "_libc_fpstate",
   "referenced_type" : "type-2311",
   "self_type" : "type-2311",
   "size" : 112,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "_libc_fpstate"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "element",
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "_xmmreg",
   "name" : "_xmmreg",
   "referenced_type" : "type-2231",
   "self_type" : "type-2231",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_xmmreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpstate",
     "referenced_type" : "type-2233"
    },
    {
     "field_name" : "xstate_hdr",
     "field_offset" : 4992,
     "referenced_type" : "type-2245"
    },
    {
     "field_name" : "ymmh",
     "field_offset" : 5504,
     "referenced_type" : "type-2248"
    }
   ],
   "linker_set_key" : "_xstate",
   "name" : "_xstate",
   "referenced_type" : "type-2249",
   "self_type" : "type-2249",
   "size" : 944,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_xstate"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ymmh_space",
     "referenced_type" : "type-2243"
    }
   ],
   "linker_set_key" : "_ymmh_state",
   "name" : "_ymmh_state",
   "referenced_type" : "type-2248",
   "self_type" : "type-2248",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_ymmh_state"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-445"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDefault",
     "field_offset" : 160,
     "referenced_type" : "type-443"
    }
   ],
   "linker_set_key" : "android::DefaultKeyedVector<unsigned int, android::renderscript::Font::CachedGlyphInfo *>",
   "name" : "android::DefaultKeyedVector<unsigned int, android::renderscript::Font::CachedGlyphInfo *>",
   "record_kind" : "class",
   "referenced_type" : "type-442",
   "self_type" : "type-442",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-16", "type-443" ],
   "unique_id" : "_ZTSN7android18DefaultKeyedVectorIjPNS_12renderscript4Font15CachedGlyphInfoEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-446"
    }
   ],
   "linker_set_key" : "android::KeyedVector<unsigned int, android::renderscript::Font::CachedGlyphInfo *>",
   "name" : "android::KeyedVector<unsigned int, android::renderscript::Font::CachedGlyphInfo *>",
   "record_kind" : "class",
   "referenced_type" : "type-445",
   "self_type" : "type-445",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-16", "type-443" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIjPNS_12renderscript4Font15CachedGlyphInfoEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-447"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<unsigned int, android::renderscript::Font::CachedGlyphInfo *> >",
   "name" : "android::SortedVector<android::key_value_pair_t<unsigned int, android::renderscript::Font::CachedGlyphInfo *> >",
   "record_kind" : "class",
   "referenced_type" : "type-446",
   "self_type" : "type-446",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-449" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjPNS_12renderscript4Font15CachedGlyphInfoEEEE10do_compareEPKvS9_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-448"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-447",
   "self_type" : "type-447",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-172"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 256,
     "referenced_type" : "type-74"
    },
    {
     "access" : "protected",
     "field_name" : "mToDirtyList",
     "field_offset" : 3840,
     "referenced_type" : "type-87"
    },
    {
     "access" : "protected",
     "field_name" : "mType",
     "field_offset" : 3936,
     "referenced_type" : "type-97"
    },
    {
     "access" : "protected",
     "field_name" : "mGrallocConsumer",
     "field_offset" : 3968,
     "referenced_type" : "type-98"
    },
    {
     "access" : "protected",
     "field_name" : "mBufferQueueInited",
     "field_offset" : 4000,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mCurrentIdx",
     "field_offset" : 4032,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Allocation",
   "name" : "android::renderscript::Allocation",
   "record_kind" : "class",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 508,
   "source_file" : "/frameworks/rs/rsAllocation.h",
   "unique_id" : "_ZTSN7android12renderscript10AllocationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript10AllocationE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10Allocation12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10Allocation8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10Allocation9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10Allocation10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10Allocation21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript10AllocationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript10AllocationD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "state",
     "field_offset" : 32,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "drvState",
     "field_offset" : 704,
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "android::renderscript::Allocation::Hal",
   "name" : "android::renderscript::Allocation::Hal",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 448,
   "source_file" : "/frameworks/rs/rsAllocation.h",
   "unique_id" : "_ZTSN7android12renderscript10Allocation3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lod",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "faceOffset",
     "field_offset" : 2560,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "lodCount",
     "field_offset" : 2592,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "faceCount",
     "field_offset" : 2624,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "yuv",
     "field_offset" : 2656,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "grallocFlags",
     "field_offset" : 2720,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "dimArray",
     "field_offset" : 2752,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "android::renderscript::Allocation::Hal::DrvState",
   "name" : "android::renderscript::Allocation::Hal::DrvState",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 360,
   "source_file" : "/frameworks/rs/rsAllocation.h",
   "unique_id" : "_ZTSN7android12renderscript10Allocation3Hal8DrvStateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mallocPtr",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "stride",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "dimX",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "dimY",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "dimZ",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Allocation::Hal::DrvState::LodState",
   "name" : "android::renderscript::Allocation::Hal::DrvState::LodState",
   "referenced_type" : "type-85",
   "self_type" : "type-85",
   "size" : 20,
   "source_file" : "/frameworks/rs/rsAllocation.h",
   "unique_id" : "_ZTSN7android12renderscript10Allocation3Hal8DrvState8LodStateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shift",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "step",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Allocation::Hal::DrvState::YuvState",
   "name" : "android::renderscript::Allocation::Hal::DrvState::YuvState",
   "referenced_type" : "type-86",
   "self_type" : "type-86",
   "size" : 8,
   "source_file" : "/frameworks/rs/rsAllocation.h",
   "unique_id" : "_ZTSN7android12renderscript10Allocation3Hal8DrvState8YuvStateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "usageFlags",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mipmapControl",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "yuv",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "elementSizeBytes",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "hasMipmaps",
     "field_offset" : 160,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "hasFaces",
     "field_offset" : 168,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "hasReferences",
     "field_offset" : 176,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "userProvidedPtr",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "surfaceTextureID",
     "field_offset" : 224,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "nativeBuffer",
     "field_offset" : 256,
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "baseAlloc",
     "field_offset" : 352,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "originX",
     "field_offset" : 384,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "originY",
     "field_offset" : 416,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "originZ",
     "field_offset" : 448,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "originLOD",
     "field_offset" : 480,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "originFace",
     "field_offset" : 512,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "originArray",
     "field_offset" : 544,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "android::renderscript::Allocation::Hal::State",
   "name" : "android::renderscript::Allocation::Hal::State",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 84,
   "source_file" : "/frameworks/rs/rsAllocation.h",
   "unique_id" : "_ZTSN7android12renderscript10Allocation3Hal5StateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mType",
     "referenced_type" : "type-15"
    },
    {
     "access" : "protected",
     "field_name" : "mKind",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    },
    {
     "access" : "protected",
     "field_name" : "mNormalized",
     "field_offset" : 64,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mVectorSize",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mBits",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mBitsUnpadded",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mTypeBits",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mIsFloat",
     "field_offset" : 224,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mIsSigned",
     "field_offset" : 232,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mIsPixel",
     "field_offset" : 240,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::Component",
   "name" : "android::renderscript::Component",
   "record_kind" : "class",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 32,
   "source_file" : "/frameworks/rs/rsComponent.h",
   "unique_id" : "_ZTSN7android12renderscript9ComponentE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mHal",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "mUserSurfaceConfig",
     "field_offset" : 2816,
     "referenced_type" : "type-388"
    },
    {
     "field_name" : "mStateElement",
     "field_offset" : 3168,
     "referenced_type" : "type-389"
    },
    {
     "field_name" : "mStateType",
     "field_offset" : 3264,
     "referenced_type" : "type-396"
    },
    {
     "field_name" : "mStateSampler",
     "field_offset" : 3360,
     "referenced_type" : "type-403"
    },
    {
     "field_name" : "mFBOCache",
     "field_offset" : 3968,
     "referenced_type" : "type-291"
    },
    {
     "field_name" : "mStateFragment",
     "field_offset" : 4192,
     "referenced_type" : "type-411"
    },
    {
     "field_name" : "mStateFragmentStore",
     "field_offset" : 4384,
     "referenced_type" : "type-419"
    },
    {
     "field_name" : "mStateRaster",
     "field_offset" : 4544,
     "referenced_type" : "type-427"
    },
    {
     "field_name" : "mStateVertex",
     "field_offset" : 4704,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "mStateFont",
     "field_offset" : 4800,
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "mIO",
     "field_offset" : 5952,
     "referenced_type" : "type-475"
    },
    {
     "field_name" : "props",
     "field_offset" : 22848,
     "referenced_type" : "type-480"
    },
    {
     "field_name" : "watchdog",
     "field_offset" : 23008,
     "referenced_type" : "type-481"
    },
    {
     "field_name" : "mObjHead",
     "field_offset" : 23136,
     "referenced_type" : "type-482"
    },
    {
     "field_name" : "mDev",
     "field_offset" : 23168,
     "referenced_type" : "type-484"
    },
    {
     "access" : "protected",
     "field_name" : "mTargetSdkVersion",
     "field_offset" : 23200,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mDPI",
     "field_offset" : 23232,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mWidth",
     "field_offset" : 23264,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mHeight",
     "field_offset" : 23296,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mThreadPriority",
     "field_offset" : 23328,
     "referenced_type" : "type-36"
    },
    {
     "access" : "protected",
     "field_name" : "mIsGraphicsContext",
     "field_offset" : 23360,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mForceRSoV",
     "field_offset" : 23368,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mForceCpu",
     "field_offset" : 23376,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mContextType",
     "field_offset" : 23392,
     "referenced_type" : "type-486"
    },
    {
     "access" : "protected",
     "field_name" : "mOptLevel",
     "field_offset" : 23424,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mRunning",
     "field_offset" : 23456,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mExit",
     "field_offset" : 23464,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mPaused",
     "field_offset" : 23472,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mFatalErrorOccured",
     "field_offset" : 23480,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mError",
     "field_offset" : 23488,
     "referenced_type" : "type-487"
    },
    {
     "access" : "protected",
     "field_name" : "mThreadId",
     "field_offset" : 23520,
     "referenced_type" : "type-488"
    },
    {
     "access" : "protected",
     "field_name" : "mNativeThreadId",
     "field_offset" : 23552,
     "referenced_type" : "type-36"
    },
    {
     "access" : "protected",
     "field_name" : "mRootScript",
     "field_offset" : 23584,
     "referenced_type" : "type-489"
    },
    {
     "access" : "protected",
     "field_name" : "mFragment",
     "field_offset" : 23616,
     "referenced_type" : "type-122"
    },
    {
     "access" : "protected",
     "field_name" : "mVertex",
     "field_offset" : 23648,
     "referenced_type" : "type-65"
    },
    {
     "access" : "protected",
     "field_name" : "mFragmentStore",
     "field_offset" : 23680,
     "referenced_type" : "type-132"
    },
    {
     "access" : "protected",
     "field_name" : "mRaster",
     "field_offset" : 23712,
     "referenced_type" : "type-126"
    },
    {
     "access" : "protected",
     "field_name" : "mFont",
     "field_offset" : 23744,
     "referenced_type" : "type-437"
    },
    {
     "access" : "private",
     "field_name" : "mSynchronous",
     "field_offset" : 23776,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mHasSurface",
     "field_offset" : 23784,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mIsContextLite",
     "field_offset" : 23792,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mDriverName",
     "field_offset" : 23808,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mVendorDriverName",
     "field_offset" : 23840,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mNames",
     "field_offset" : 23872,
     "referenced_type" : "type-490"
    },
    {
     "access" : "private",
     "field_name" : "mSyncFd",
     "field_offset" : 23968,
     "referenced_type" : "type-36"
    },
    {
     "access" : "private",
     "field_name" : "mTimers",
     "field_offset" : 24000,
     "referenced_type" : "type-497"
    },
    {
     "access" : "private",
     "field_name" : "mTimerActive",
     "field_offset" : 24256,
     "referenced_type" : "type-499"
    },
    {
     "access" : "private",
     "field_name" : "mTimeLast",
     "field_offset" : 24288,
     "referenced_type" : "type-498"
    },
    {
     "access" : "private",
     "field_name" : "mTimeFrame",
     "field_offset" : 24352,
     "referenced_type" : "type-498"
    },
    {
     "access" : "private",
     "field_name" : "mTimeLastFrame",
     "field_offset" : 24416,
     "referenced_type" : "type-498"
    },
    {
     "access" : "private",
     "field_name" : "mTimeMSLastFrame",
     "field_offset" : 24480,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mTimeMSLastScript",
     "field_offset" : 24512,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mTimeMSLastSwap",
     "field_offset" : 24544,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mAverageFPSFrameCount",
     "field_offset" : 24576,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "mAverageFPSStartTime",
     "field_offset" : 24608,
     "referenced_type" : "type-498"
    },
    {
     "access" : "private",
     "field_name" : "mAverageFPS",
     "field_offset" : 24672,
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "hasSetCacheDir",
     "field_offset" : 24704,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "mCacheDir",
     "field_offset" : 24712,
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "android::renderscript::Context",
   "name" : "android::renderscript::Context",
   "record_kind" : "class",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 7192,
   "source_file" : "/frameworks/rs/rsContext.h",
   "unique_id" : "_ZTSN7android12renderscript7ContextE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mLogTimes",
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mLogScripts",
     "field_offset" : 8,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mLogShaders",
     "field_offset" : 16,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mLogShadersAttr",
     "field_offset" : 24,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mLogShadersUniforms",
     "field_offset" : 32,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mLogVisual",
     "field_offset" : 40,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mLogReduce",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mDebugReduceSplitAccum",
     "field_offset" : 96,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mDebugMaxThreads",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::Context::(anonymous struct at frameworks/rs/rsContext.h:213:5) at frameworks/rs/rsContext.h:213:5",
   "name" : "android::renderscript::Context::(anonymous struct at frameworks/rs/rsContext.h:213:5) at frameworks/rs/rsContext.h:213:5",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 20,
   "source_file" : "/frameworks/rs/rsContext.h",
   "unique_id" : "_ZTSN7android12renderscript7ContextUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "inRoot",
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "command",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "file",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "line",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::Context::(anonymous struct at frameworks/rs/rsContext.h:225:13) at frameworks/rs/rsContext.h:225:13",
   "name" : "android::renderscript::Context::(anonymous struct at frameworks/rs/rsContext.h:225:13) at frameworks/rs/rsContext.h:225:13",
   "referenced_type" : "type-481",
   "self_type" : "type-481",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsContext.h",
   "unique_id" : "_ZTSN7android12renderscript7ContextUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "funcs",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "flags",
     "field_offset" : 2784,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Context::Hal",
   "name" : "android::renderscript::Context::Hal",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 352,
   "source_file" : "/frameworks/rs/rsContext.h",
   "unique_id" : "_ZTSN7android12renderscript7Context3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFragment",
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "mVertex",
     "field_offset" : 32,
     "referenced_type" : "type-65"
    },
    {
     "access" : "private",
     "field_name" : "mStore",
     "field_offset" : 64,
     "referenced_type" : "type-132"
    },
    {
     "access" : "private",
     "field_name" : "mRaster",
     "field_offset" : 96,
     "referenced_type" : "type-126"
    },
    {
     "access" : "private",
     "field_name" : "mFont",
     "field_offset" : 128,
     "referenced_type" : "type-437"
    },
    {
     "access" : "private",
     "field_name" : "mRsc",
     "field_offset" : 160,
     "referenced_type" : "type-30"
    }
   ],
   "linker_set_key" : "android::renderscript::Context::PushState",
   "name" : "android::renderscript::Context::PushState",
   "record_kind" : "class",
   "referenced_type" : "type-2119",
   "self_type" : "type-2119",
   "size" : 24,
   "source_file" : "/frameworks/rs/rsContext.h",
   "unique_id" : "_ZTSN7android12renderscript7Context9PushStateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mForceSW",
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mContexts",
     "field_offset" : 32,
     "referenced_type" : "type-3203"
    }
   ],
   "linker_set_key" : "android::renderscript::Device",
   "name" : "android::renderscript::Device",
   "record_kind" : "class",
   "referenced_type" : "type-3348",
   "self_type" : "type-3348",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsDevice.h",
   "unique_id" : "_ZTSN7android12renderscript6DeviceE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 256,
     "referenced_type" : "type-13"
    },
    {
     "access" : "protected",
     "field_name" : "mFields",
     "field_offset" : 608,
     "referenced_type" : "type-24"
    },
    {
     "access" : "protected",
     "field_name" : "mFieldCount",
     "field_offset" : 640,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mHasReference",
     "field_offset" : 672,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mComponent",
     "field_offset" : 704,
     "referenced_type" : "type-28"
    },
    {
     "access" : "protected",
     "field_name" : "mBitsUnpadded",
     "field_offset" : 960,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mBits",
     "field_offset" : 992,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Element",
   "name" : "android::renderscript::Element",
   "record_kind" : "class",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 128,
   "source_file" : "/frameworks/rs/rsElement.h",
   "unique_id" : "_ZTSN7android12renderscript7ElementE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript7ElementE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Element10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7ElementD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7ElementD0Ev"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "e",
     "field_offset" : 32,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "offsetBits",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "offsetBitsUnpadded",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "arraySize",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Element::ElementField_t",
   "name" : "android::renderscript::Element::ElementField_t",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 20,
   "source_file" : "/frameworks/rs/rsElement.h",
   "unique_id" : "_ZTSN7android12renderscript7Element14ElementField_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "state",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::renderscript::Element::Hal",
   "name" : "android::renderscript::Element::Hal",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 44,
   "source_file" : "/frameworks/rs/rsElement.h",
   "unique_id" : "_ZTSN7android12renderscript7Element3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dataType",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "dataKind",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "vectorSize",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "elementSizeBytes",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "fields",
     "field_offset" : 128,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "fieldArraySizes",
     "field_offset" : 160,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "fieldNames",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "fieldNameLengths",
     "field_offset" : 224,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "fieldOffsetBytes",
     "field_offset" : 256,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "fieldsCount",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Element::Hal::State",
   "name" : "android::renderscript::Element::Hal::State",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 40,
   "source_file" : "/frameworks/rs/rsElement.h",
   "unique_id" : "_ZTSN7android12renderscript7Element3Hal5StateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mElements",
     "referenced_type" : "type-390"
    }
   ],
   "linker_set_key" : "android::renderscript::ElementState",
   "name" : "android::renderscript::ElementState",
   "record_kind" : "class",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 12,
   "source_file" : "/frameworks/rs/rsElement.h",
   "unique_id" : "_ZTSN7android12renderscript12ElementStateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mHal",
     "referenced_type" : "type-292"
    },
    {
     "access" : "protected",
     "field_name" : "mColorTargets",
     "field_offset" : 128,
     "referenced_type" : "type-113"
    },
    {
     "access" : "protected",
     "field_name" : "mDepthTarget",
     "field_offset" : 160,
     "referenced_type" : "type-114"
    },
    {
     "access" : "protected",
     "field_name" : "mDirty",
     "field_offset" : 192,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::FBOCache",
   "name" : "android::renderscript::FBOCache",
   "record_kind" : "class",
   "referenced_type" : "type-291",
   "self_type" : "type-291",
   "size" : 28,
   "source_file" : "/frameworks/rs/rsFBOCache.h",
   "unique_id" : "_ZTSN7android12renderscript8FBOCacheE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "state",
     "field_offset" : 32,
     "referenced_type" : "type-293"
    }
   ],
   "linker_set_key" : "android::renderscript::FBOCache::Hal",
   "name" : "android::renderscript::FBOCache::Hal",
   "referenced_type" : "type-292",
   "self_type" : "type-292",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsFBOCache.h",
   "unique_id" : "_ZTSN7android12renderscript8FBOCache3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "colorTargets",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "colorTargetsCount",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "depthTarget",
     "field_offset" : 64,
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "android::renderscript::FBOCache::Hal::State",
   "name" : "android::renderscript::FBOCache::Hal::State",
   "referenced_type" : "type-293",
   "self_type" : "type-293",
   "size" : 12,
   "source_file" : "/frameworks/rs/rsFBOCache.h",
   "unique_id" : "_ZTSN7android12renderscript8FBOCache3Hal5StateE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::renderscript::Fifo",
   "name" : "android::renderscript::Fifo",
   "record_kind" : "class",
   "referenced_type" : "type-1971",
   "self_type" : "type-1971",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsFifo.h",
   "unique_id" : "_ZTSN7android12renderscript4FifoE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript4FifoE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4FifoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4FifoD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript4Fifo10writeAsyncEPKvjb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript4Fifo15writeWaitReturnEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript4Fifo4readEPvjby"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript4Fifo10readReturnEPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript4Fifo5flushEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "sv",
     "field_offset" : 32,
     "referenced_type" : "type-478"
    },
    {
     "access" : "protected",
     "field_name" : "mShutdown",
     "field_offset" : 96,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::FifoSocket",
   "name" : "android::renderscript::FifoSocket",
   "record_kind" : "class",
   "referenced_type" : "type-477",
   "self_type" : "type-477",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsFifoSocket.h",
   "unique_id" : "_ZTSN7android12renderscript10FifoSocketE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript10FifoSocketE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript10FifoSocketD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript10FifoSocketD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFontName",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    },
    {
     "access" : "protected",
     "field_name" : "mFontSize",
     "field_offset" : 288,
     "referenced_type" : "type-108"
    },
    {
     "access" : "protected",
     "field_name" : "mDpi",
     "field_offset" : 320,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mFace",
     "field_offset" : 352,
     "referenced_type" : "type-440"
    },
    {
     "access" : "protected",
     "field_name" : "mInitialized",
     "field_offset" : 384,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mHasKerning",
     "field_offset" : 392,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mCachedGlyphs",
     "field_offset" : 416,
     "referenced_type" : "type-442"
    }
   ],
   "linker_set_key" : "android::renderscript::Font",
   "name" : "android::renderscript::Font",
   "record_kind" : "class",
   "referenced_type" : "type-439",
   "self_type" : "type-439",
   "size" : 76,
   "source_file" : "/frameworks/rs/rsFont.h",
   "unique_id" : "_ZTSN7android12renderscript4FontE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript4FontE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Font9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Font10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Font10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4FontD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4FontD0Ev"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mIsValid",
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mBitmapMinX",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mBitmapMinY",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mBitmapWidth",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mBitmapHeight",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mBitmapMinU",
     "field_offset" : 160,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "mBitmapMinV",
     "field_offset" : 192,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "mBitmapMaxU",
     "field_offset" : 224,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "mBitmapMaxV",
     "field_offset" : 256,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "mGlyphIndex",
     "field_offset" : 288,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "mAdvanceX",
     "field_offset" : 320,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "mAdvanceY",
     "field_offset" : 352,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "mBitmapLeft",
     "field_offset" : 384,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "mBitmapTop",
     "field_offset" : 416,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android::renderscript::Font::CachedGlyphInfo",
   "name" : "android::renderscript::Font::CachedGlyphInfo",
   "referenced_type" : "type-444",
   "self_type" : "type-444",
   "size" : 56,
   "source_file" : "/frameworks/rs/rsFont.h",
   "unique_id" : "_ZTSN7android12renderscript4Font15CachedGlyphInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android::renderscript::Font::Rect",
   "name" : "android::renderscript::Font::Rect",
   "referenced_type" : "type-2110",
   "self_type" : "type-2110",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsFont.h",
   "unique_id" : "_ZTSN7android12renderscript4Font4RectE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mDefault",
     "referenced_type" : "type-437"
    },
    {
     "access" : "protected",
     "field_name" : "mSurfaceWidth",
     "field_offset" : 32,
     "referenced_type" : "type-108"
    },
    {
     "access" : "protected",
     "field_name" : "mSurfaceHeight",
     "field_offset" : 64,
     "referenced_type" : "type-108"
    },
    {
     "access" : "protected",
     "field_name" : "mCacheLines",
     "field_offset" : 96,
     "referenced_type" : "type-450"
    },
    {
     "access" : "protected",
     "field_name" : "mLatinPrecache",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    },
    {
     "access" : "protected",
     "field_name" : "mRSC",
     "field_offset" : 224,
     "referenced_type" : "type-30"
    },
    {
     "access" : "protected",
     "field_name" : "mConstants",
     "field_offset" : 256,
     "referenced_type" : "type-459"
    },
    {
     "access" : "protected",
     "field_name" : "mConstantsDirty",
     "field_offset" : 416,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mBlackGamma",
     "field_offset" : 448,
     "referenced_type" : "type-108"
    },
    {
     "access" : "protected",
     "field_name" : "mWhiteGamma",
     "field_offset" : 480,
     "referenced_type" : "type-108"
    },
    {
     "access" : "protected",
     "field_name" : "mBlackThreshold",
     "field_offset" : 512,
     "referenced_type" : "type-108"
    },
    {
     "access" : "protected",
     "field_name" : "mWhiteThreshold",
     "field_offset" : 544,
     "referenced_type" : "type-108"
    },
    {
     "access" : "protected",
     "field_name" : "mLibrary",
     "field_offset" : 576,
     "referenced_type" : "type-460"
    },
    {
     "access" : "protected",
     "field_name" : "mActiveFonts",
     "field_offset" : 608,
     "referenced_type" : "type-462"
    },
    {
     "access" : "protected",
     "field_name" : "mFontShaderFConstant",
     "field_offset" : 704,
     "referenced_type" : "type-114"
    },
    {
     "access" : "protected",
     "field_name" : "mFontShaderF",
     "field_offset" : 736,
     "referenced_type" : "type-122"
    },
    {
     "access" : "protected",
     "field_name" : "mFontSampler",
     "field_offset" : 768,
     "referenced_type" : "type-116"
    },
    {
     "access" : "protected",
     "field_name" : "mFontProgramStore",
     "field_offset" : 800,
     "referenced_type" : "type-132"
    },
    {
     "access" : "protected",
     "field_name" : "mTextTexture",
     "field_offset" : 832,
     "referenced_type" : "type-114"
    },
    {
     "access" : "protected",
     "field_name" : "mCacheBuffer",
     "field_offset" : 864,
     "referenced_type" : "type-469"
    },
    {
     "access" : "protected",
     "field_name" : "mCacheWidth",
     "field_offset" : 896,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mCacheHeight",
     "field_offset" : 928,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mTextMeshPtr",
     "field_offset" : 960,
     "referenced_type" : "type-470"
    },
    {
     "access" : "protected",
     "field_name" : "mCurrentQuadIndex",
     "field_offset" : 992,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mMaxNumberOfQuads",
     "field_offset" : 1024,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mMesh",
     "field_offset" : 1056,
     "referenced_type" : "type-471"
    },
    {
     "access" : "protected",
     "field_name" : "mInitialized",
     "field_offset" : 1088,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::FontState",
   "name" : "android::renderscript::FontState",
   "record_kind" : "class",
   "referenced_type" : "type-436",
   "self_type" : "type-436",
   "size" : 140,
   "source_file" : "/frameworks/rs/rsFont.h",
   "unique_id" : "_ZTSN7android12renderscript9FontStateE"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mFontColor",
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "mGamma",
     "field_offset" : 128,
     "referenced_type" : "type-108"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::FontState::(anonymous struct at frameworks/rs/rsFont.h:189:5) at frameworks/rs/rsFont.h:189:5",
   "name" : "android::renderscript::FontState::(anonymous struct at frameworks/rs/rsFont.h:189:5) at frameworks/rs/rsFont.h:189:5",
   "referenced_type" : "type-459",
   "self_type" : "type-459",
   "size" : 20,
   "source_file" : "/frameworks/rs/rsFont.h",
   "unique_id" : "_ZTSN7android12renderscript9FontStateUt_E"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mMaxHeight",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mMaxWidth",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mCurrentRow",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mCurrentCol",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mDirty",
     "field_offset" : 128,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::FontState::CacheTextureLine",
   "name" : "android::renderscript::FontState::CacheTextureLine",
   "referenced_type" : "type-454",
   "self_type" : "type-454",
   "size" : 20,
   "source_file" : "/frameworks/rs/rsFont.h",
   "unique_id" : "_ZTSN7android12renderscript9FontState16CacheTextureLineE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mScript",
     "field_offset" : 256,
     "referenced_type" : "type-146"
    },
    {
     "field_name" : "mSlot",
     "field_offset" : 288,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android::renderscript::IDBase",
   "name" : "android::renderscript::IDBase",
   "record_kind" : "class",
   "referenced_type" : "type-328",
   "self_type" : "type-328",
   "size" : 40,
   "source_file" : "/frameworks/rs/rsScript.h",
   "unique_id" : "_ZTSN7android12renderscript6IDBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript6IDBaseE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript6IDBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript6IDBase10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript6IDBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript6IDBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mData",
     "referenced_type" : "type-141"
    },
    {
     "access" : "protected",
     "field_name" : "mPos",
     "field_offset" : 32,
     "referenced_type" : "type-498"
    },
    {
     "access" : "protected",
     "field_name" : "mUse64",
     "field_offset" : 96,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::IStream",
   "name" : "android::renderscript::IStream",
   "record_kind" : "class",
   "referenced_type" : "type-1977",
   "self_type" : "type-1977",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsStream.h",
   "unique_id" : "_ZTSN7android12renderscript7IStreamE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-727"
    }
   ],
   "linker_set_key" : "android::renderscript::Matrix2x2",
   "name" : "android::renderscript::Matrix2x2",
   "referenced_type" : "type-726",
   "self_type" : "type-726",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsMatrix2x2.h",
   "unique_id" : "_ZTSN7android12renderscript9Matrix2x2E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-719"
    }
   ],
   "linker_set_key" : "android::renderscript::Matrix3x3",
   "name" : "android::renderscript::Matrix3x3",
   "referenced_type" : "type-718",
   "self_type" : "type-718",
   "size" : 36,
   "source_file" : "/frameworks/rs/rsMatrix3x3.h",
   "unique_id" : "_ZTSN7android12renderscript9Matrix3x3E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-708"
    }
   ],
   "linker_set_key" : "android::renderscript::Matrix4x4",
   "name" : "android::renderscript::Matrix4x4",
   "referenced_type" : "type-707",
   "self_type" : "type-707",
   "size" : 64,
   "source_file" : "/frameworks/rs/rsMatrix4x4.h",
   "unique_id" : "_ZTSN7android12renderscript9Matrix4x4E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 256,
     "referenced_type" : "type-3487"
    },
    {
     "field_name" : "mBBoxMin",
     "field_offset" : 480,
     "referenced_type" : "type-3490"
    },
    {
     "field_name" : "mBBoxMax",
     "field_offset" : 576,
     "referenced_type" : "type-3490"
    },
    {
     "access" : "protected",
     "field_name" : "mVertexBuffers",
     "field_offset" : 672,
     "referenced_type" : "type-113"
    },
    {
     "access" : "protected",
     "field_name" : "mIndexBuffers",
     "field_offset" : 704,
     "referenced_type" : "type-113"
    },
    {
     "access" : "protected",
     "field_name" : "mInitialized",
     "field_offset" : 736,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::Mesh",
   "name" : "android::renderscript::Mesh",
   "record_kind" : "class",
   "referenced_type" : "type-3486",
   "self_type" : "type-3486",
   "size" : 96,
   "source_file" : "/frameworks/rs/rsMesh.h",
   "unique_id" : "_ZTSN7android12renderscript4MeshE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript4MeshE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Mesh9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Mesh10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4MeshD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4MeshD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "state",
     "field_offset" : 32,
     "referenced_type" : "type-3488"
    }
   ],
   "linker_set_key" : "android::renderscript::Mesh::Hal",
   "name" : "android::renderscript::Mesh::Hal",
   "referenced_type" : "type-3487",
   "self_type" : "type-3487",
   "size" : 28,
   "source_file" : "/frameworks/rs/rsMesh.h",
   "unique_id" : "_ZTSN7android12renderscript4Mesh3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vertexBuffers",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "vertexBuffersCount",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "indexBuffers",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "indexBuffersCount",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "primitives",
     "field_offset" : 128,
     "referenced_type" : "type-3489"
    },
    {
     "field_name" : "primitivesCount",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Mesh::Hal::State",
   "name" : "android::renderscript::Mesh::Hal::State",
   "referenced_type" : "type-3488",
   "self_type" : "type-3488",
   "size" : 24,
   "source_file" : "/frameworks/rs/rsMesh.h",
   "unique_id" : "_ZTSN7android12renderscript4Mesh3Hal5StateE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::renderscript::MeshContext",
   "name" : "android::renderscript::MeshContext",
   "record_kind" : "class",
   "referenced_type" : "type-3516",
   "self_type" : "type-3516",
   "size" : 1,
   "source_file" : "/frameworks/rs/rsMesh.h",
   "unique_id" : "_ZTSN7android12renderscript11MeshContextE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mMutex",
     "referenced_type" : "type-1303"
    }
   ],
   "linker_set_key" : "android::renderscript::Mutex",
   "name" : "android::renderscript::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-2149",
   "self_type" : "type-2149",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsMutex.h",
   "unique_id" : "_ZTSN7android12renderscript5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mData",
     "referenced_type" : "type-469"
    },
    {
     "access" : "protected",
     "field_name" : "mLength",
     "field_offset" : 32,
     "referenced_type" : "type-498"
    },
    {
     "access" : "protected",
     "field_name" : "mPos",
     "field_offset" : 96,
     "referenced_type" : "type-498"
    },
    {
     "access" : "protected",
     "field_name" : "mUse64",
     "field_offset" : 160,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::OStream",
   "name" : "android::renderscript::OStream",
   "record_kind" : "class",
   "referenced_type" : "type-1981",
   "self_type" : "type-1981",
   "size" : 24,
   "source_file" : "/frameworks/rs/rsStream.h",
   "unique_id" : "_ZTSN7android12renderscript7OStreamE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRSC",
     "field_offset" : 32,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mSysRefCount",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    },
    {
     "access" : "private",
     "field_name" : "mUserRefCount",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "access" : "private",
     "field_name" : "mPrev",
     "field_offset" : 160,
     "referenced_type" : "type-482"
    },
    {
     "access" : "private",
     "field_name" : "mNext",
     "field_offset" : 192,
     "referenced_type" : "type-482"
    },
    {
     "access" : "private",
     "field_name" : "mDH",
     "field_offset" : 224,
     "referenced_type" : "type-501"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBase",
   "name" : "android::renderscript::ObjectBase",
   "record_kind" : "class",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 32,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "unique_id" : "_ZTSN7android12renderscript10ObjectBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript10ObjectBaseE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::Allocation>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::Allocation>",
   "record_kind" : "class",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-73" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_10AllocationEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-438"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::Font>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::Font>",
   "record_kind" : "class",
   "referenced_type" : "type-437",
   "self_type" : "type-437",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-439" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_4FontEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-472"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::Mesh>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::Mesh>",
   "record_kind" : "class",
   "referenced_type" : "type-471",
   "self_type" : "type-471",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_4MeshEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-123"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::ProgramFragment>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::ProgramFragment>",
   "record_kind" : "class",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-124" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_15ProgramFragmentEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-127"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::ProgramRaster>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::ProgramRaster>",
   "record_kind" : "class",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-128" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_13ProgramRasterEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-133"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::ProgramStore>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::ProgramStore>",
   "record_kind" : "class",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-134" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_12ProgramStoreEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-66"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::ProgramVertex>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::ProgramVertex>",
   "record_kind" : "class",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-67" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_13ProgramVertexEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::Sampler>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::Sampler>",
   "record_kind" : "class",
   "referenced_type" : "type-116",
   "self_type" : "type-116",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_7SamplerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-146"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::Script>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::Script>",
   "record_kind" : "class",
   "referenced_type" : "type-489",
   "self_type" : "type-489",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-56" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_6ScriptEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<android::renderscript::Type>",
   "name" : "android::renderscript::ObjectBaseRef<android::renderscript::Type>",
   "record_kind" : "class",
   "referenced_type" : "type-118",
   "self_type" : "type-118",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefINS0_4TypeEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<const android::renderscript::Element>",
   "name" : "android::renderscript::ObjectBaseRef<const android::renderscript::Element>",
   "record_kind" : "class",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefIKNS0_7ElementEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-254"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<const android::renderscript::ProgramVertex>",
   "name" : "android::renderscript::ObjectBaseRef<const android::renderscript::ProgramVertex>",
   "record_kind" : "class",
   "referenced_type" : "type-677",
   "self_type" : "type-677",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-255" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefIKNS0_13ProgramVertexEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-330"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<const android::renderscript::ScriptFieldID>",
   "name" : "android::renderscript::ObjectBaseRef<const android::renderscript::ScriptFieldID>",
   "record_kind" : "class",
   "referenced_type" : "type-329",
   "self_type" : "type-329",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-331" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefIKNS0_13ScriptFieldIDEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-325"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<const android::renderscript::ScriptKernelID>",
   "name" : "android::renderscript::ObjectBaseRef<const android::renderscript::ScriptKernelID>",
   "record_kind" : "class",
   "referenced_type" : "type-324",
   "self_type" : "type-324",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-326" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefIKNS0_14ScriptKernelIDEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mRef",
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "android::renderscript::ObjectBaseRef<const android::renderscript::Type>",
   "name" : "android::renderscript::ObjectBaseRef<const android::renderscript::Type>",
   "record_kind" : "class",
   "referenced_type" : "type-97",
   "self_type" : "type-97",
   "size" : 4,
   "source_file" : "/frameworks/rs/rsObjectBase.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android12renderscript13ObjectBaseRefIKNS0_4TypeEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-121"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 288,
     "referenced_type" : "type-69"
    },
    {
     "access" : "protected",
     "field_name" : "mTextures",
     "field_offset" : 640,
     "referenced_type" : "type-113"
    },
    {
     "access" : "protected",
     "field_name" : "mSamplers",
     "field_offset" : 672,
     "referenced_type" : "type-115"
    },
    {
     "access" : "protected",
     "field_name" : "mConstants",
     "field_offset" : 704,
     "referenced_type" : "type-113"
    },
    {
     "access" : "protected",
     "field_name" : "mConstantTypes",
     "field_offset" : 736,
     "referenced_type" : "type-117"
    },
    {
     "access" : "protected",
     "field_name" : "mInputElements",
     "field_offset" : 768,
     "referenced_type" : "type-119"
    },
    {
     "access" : "protected",
     "field_name" : "mIsInternal",
     "field_offset" : 800,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mUserShader",
     "field_offset" : 832,
     "referenced_type" : "type-21"
    },
    {
     "access" : "protected",
     "field_name" : "mUserShaderLen",
     "field_offset" : 864,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Program",
   "name" : "android::renderscript::Program",
   "record_kind" : "class",
   "referenced_type" : "type-68",
   "self_type" : "type-68",
   "size" : 112,
   "source_file" : "/frameworks/rs/rsProgram.h",
   "unique_id" : "_ZTSN7android12renderscript7ProgramE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript7ProgramE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript7Program12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7ProgramD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7ProgramD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "state",
     "field_offset" : 32,
     "referenced_type" : "type-70"
    }
   ],
   "linker_set_key" : "android::renderscript::Program::Hal",
   "name" : "android::renderscript::Program::Hal",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 44,
   "source_file" : "/frameworks/rs/rsProgram.h",
   "unique_id" : "_ZTSN7android12renderscript7Program3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "textures",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "textureTargets",
     "field_offset" : 32,
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "texturesCount",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "samplers",
     "field_offset" : 96,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "samplersCount",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "constants",
     "field_offset" : 160,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "constantTypes",
     "field_offset" : 192,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "constantsCount",
     "field_offset" : 224,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "inputElements",
     "field_offset" : 256,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "inputElementsCount",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Program::Hal::State",
   "name" : "android::renderscript::Program::Hal::State",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 40,
   "source_file" : "/frameworks/rs/rsProgram.h",
   "unique_id" : "_ZTSN7android12renderscript7Program3Hal5StateE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mDirty",
     "field_offset" : 256,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramBase",
   "name" : "android::renderscript::ProgramBase",
   "record_kind" : "class",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 36,
   "source_file" : "/frameworks/rs/rsProgramBase.h",
   "unique_id" : "_ZTSN7android12renderscript11ProgramBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript11ProgramBaseE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript11ProgramBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript11ProgramBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-68"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mConstantColor",
     "field_offset" : 896,
     "referenced_type" : "type-125"
    },
    {
     "access" : "protected",
     "field_name" : "mTextureUniformIndexStart",
     "field_offset" : 1024,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramFragment",
   "name" : "android::renderscript::ProgramFragment",
   "record_kind" : "class",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 132,
   "source_file" : "/frameworks/rs/rsProgramFragment.h",
   "unique_id" : "_ZTSN7android12renderscript15ProgramFragmentE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript15ProgramFragmentE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript7Program12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript15ProgramFragment9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript15ProgramFragment10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15ProgramFragmentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15ProgramFragmentD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript15ProgramFragment5setupEPNS0_7ContextEPNS0_20ProgramFragmentStateE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPF",
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "mDefault",
     "field_offset" : 32,
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "mPrograms",
     "field_offset" : 64,
     "referenced_type" : "type-412"
    },
    {
     "field_name" : "mLast",
     "field_offset" : 160,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramFragmentState",
   "name" : "android::renderscript::ProgramFragmentState",
   "record_kind" : "class",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 24,
   "source_file" : "/frameworks/rs/rsProgramFragment.h",
   "unique_id" : "_ZTSN7android12renderscript20ProgramFragmentStateE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-121"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 288,
     "referenced_type" : "type-129"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramRaster",
   "name" : "android::renderscript::ProgramRaster",
   "record_kind" : "class",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 48,
   "source_file" : "/frameworks/rs/rsProgramRaster.h",
   "unique_id" : "_ZTSN7android12renderscript13ProgramRasterE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript13ProgramRasterE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript13ProgramRaster9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript13ProgramRaster10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript13ProgramRaster10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript13ProgramRasterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript13ProgramRasterD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript13ProgramRaster5setupEPKNS0_7ContextEPNS0_18ProgramRasterStateE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "state",
     "field_offset" : 32,
     "referenced_type" : "type-130"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramRaster::Hal",
   "name" : "android::renderscript::ProgramRaster::Hal",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 12,
   "source_file" : "/frameworks/rs/rsProgramRaster.h",
   "unique_id" : "_ZTSN7android12renderscript13ProgramRaster3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pointSprite",
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "cull",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramRaster::Hal::State",
   "name" : "android::renderscript::ProgramRaster::Hal::State",
   "referenced_type" : "type-130",
   "self_type" : "type-130",
   "size" : 8,
   "source_file" : "/frameworks/rs/rsProgramRaster.h",
   "unique_id" : "_ZTSN7android12renderscript13ProgramRaster3Hal5StateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mDefault",
     "referenced_type" : "type-126"
    },
    {
     "field_name" : "mLast",
     "field_offset" : 32,
     "referenced_type" : "type-126"
    },
    {
     "field_name" : "mRasterPrograms",
     "field_offset" : 64,
     "referenced_type" : "type-428"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramRasterState",
   "name" : "android::renderscript::ProgramRasterState",
   "record_kind" : "class",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 20,
   "source_file" : "/frameworks/rs/rsProgramRaster.h",
   "unique_id" : "_ZTSN7android12renderscript18ProgramRasterStateE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-121"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 288,
     "referenced_type" : "type-135"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramStore",
   "name" : "android::renderscript::ProgramStore",
   "record_kind" : "class",
   "referenced_type" : "type-134",
   "self_type" : "type-134",
   "size" : 64,
   "source_file" : "/frameworks/rs/rsProgramStore.h",
   "unique_id" : "_ZTSN7android12renderscript12ProgramStoreE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript12ProgramStoreE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript12ProgramStore9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript12ProgramStore10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript12ProgramStore10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript12ProgramStoreD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript12ProgramStoreD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript12ProgramStore5setupEPKNS0_7ContextEPNS0_17ProgramStoreStateE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "state",
     "field_offset" : 32,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramStore::Hal",
   "name" : "android::renderscript::ProgramStore::Hal",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 28,
   "source_file" : "/frameworks/rs/rsProgramStore.h",
   "unique_id" : "_ZTSN7android12renderscript12ProgramStore3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ditherEnable",
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "colorRWriteEnable",
     "field_offset" : 8,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "colorGWriteEnable",
     "field_offset" : 16,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "colorBWriteEnable",
     "field_offset" : 24,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "colorAWriteEnable",
     "field_offset" : 32,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "blendSrc",
     "field_offset" : 64,
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "blendDst",
     "field_offset" : 96,
     "referenced_type" : "type-138"
    },
    {
     "field_name" : "depthWriteEnable",
     "field_offset" : 128,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "depthFunc",
     "field_offset" : 160,
     "referenced_type" : "type-139"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramStore::Hal::State",
   "name" : "android::renderscript::ProgramStore::Hal::State",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 24,
   "source_file" : "/frameworks/rs/rsProgramStore.h",
   "unique_id" : "_ZTSN7android12renderscript12ProgramStore3Hal5StateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mDefault",
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "mLast",
     "field_offset" : 32,
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "mStorePrograms",
     "field_offset" : 64,
     "referenced_type" : "type-420"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramStoreState",
   "name" : "android::renderscript::ProgramStoreState",
   "record_kind" : "class",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 20,
   "source_file" : "/frameworks/rs/rsProgramStore.h",
   "unique_id" : "_ZTSN7android12renderscript17ProgramStoreStateE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramVertex",
   "name" : "android::renderscript::ProgramVertex",
   "record_kind" : "class",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 112,
   "source_file" : "/frameworks/rs/rsProgramVertex.h",
   "unique_id" : "_ZTSN7android12renderscript13ProgramVertexE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript13ProgramVertexE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript7Program12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript13ProgramVertex9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript13ProgramVertex10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript13ProgramVertexD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript13ProgramVertexD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript13ProgramVertex5setupEPNS0_7ContextEPNS0_18ProgramVertexStateE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mDefault",
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "mLast",
     "field_offset" : 32,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "mDefaultAlloc",
     "field_offset" : 64,
     "referenced_type" : "type-114"
    }
   ],
   "linker_set_key" : "android::renderscript::ProgramVertexState",
   "name" : "android::renderscript::ProgramVertexState",
   "record_kind" : "class",
   "referenced_type" : "type-435",
   "self_type" : "type-435",
   "size" : 12,
   "source_file" : "/frameworks/rs/rsProgramVertex.h",
   "unique_id" : "_ZTSN7android12renderscript18ProgramVertexStateE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::renderscript::RsdCpuReference",
   "name" : "android::renderscript::RsdCpuReference",
   "record_kind" : "class",
   "referenced_type" : "type-2120",
   "self_type" : "type-2120",
   "size" : 4,
   "source_file" : "/frameworks/rs/cpu_ref/rsd_cpu.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdCpuReferenceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript15RsdCpuReferenceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReferenceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReferenceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference11setPriorityEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference12createScriptEPKNS0_7ScriptCEPKcS6_PKhjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference15createIntrinsicEPKNS0_6ScriptE19RsScriptIntrinsicIDPNS0_7ElementE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference17createScriptGroupEPKNS0_15ScriptGroupBaseE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference11getInKernelEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference18setEmbedGlobalInfoEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript15RsdCpuReference18getEmbedGlobalInfoEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference30setEmbedGlobalInfoSkipConstantEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript15RsdCpuReference30getEmbedGlobalInfoSkipConstantEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::renderscript::RsdCpuReference::CpuScript",
   "name" : "android::renderscript::RsdCpuReference::CpuScript",
   "record_kind" : "class",
   "referenced_type" : "type-2122",
   "self_type" : "type-2122",
   "size" : 4,
   "source_file" : "/frameworks/rs/cpu_ref/rsd_cpu.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdCpuReference9CpuScriptE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript15RsdCpuReference9CpuScriptE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript14populateScriptEPNS0_6ScriptE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript14invokeFunctionEjPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript10invokeRootEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript13invokeForEachEjPPKNS0_10AllocationEjPS3_PKvjPK12RsScriptCall"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript12invokeReduceEjPPKNS0_10AllocationEjPS3_PK12RsScriptCall"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript10invokeInitEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript18invokeFreeChildrenEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript12setGlobalVarEjPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript12getGlobalVarEjPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript24setGlobalVarWithElemDimsEjPKvjPKNS0_7ElementEPKjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript13setGlobalBindEjPNS0_10AllocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScript12setGlobalObjEjPNS0_10ObjectBaseE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript15RsdCpuReference9CpuScript23getAllocationForPointerEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript15RsdCpuReference9CpuScript16getGlobalEntriesEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript15RsdCpuReference9CpuScript13getGlobalNameEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript15RsdCpuReference9CpuScript16getGlobalAddressEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript15RsdCpuReference9CpuScript13getGlobalSizeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript15RsdCpuReference9CpuScript19getGlobalPropertiesEi"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScriptD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference9CpuScriptD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2124"
    }
   ],
   "linker_set_key" : "android::renderscript::RsdCpuReference::CpuScriptGroup",
   "name" : "android::renderscript::RsdCpuReference::CpuScriptGroup",
   "record_kind" : "class",
   "referenced_type" : "type-2126",
   "self_type" : "type-2126",
   "size" : 4,
   "source_file" : "/frameworks/rs/cpu_ref/rsd_cpu.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdCpuReference14CpuScriptGroupE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript15RsdCpuReference14CpuScriptGroupE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference18CpuScriptGroupBase7executeEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference14CpuScriptGroupD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference14CpuScriptGroupD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference14CpuScriptGroup8setInputEPKNS0_14ScriptKernelIDEPNS0_10AllocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference14CpuScriptGroup9setOutputEPKNS0_14ScriptKernelIDEPNS0_10AllocationE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2124"
    }
   ],
   "linker_set_key" : "android::renderscript::RsdCpuReference::CpuScriptGroup2",
   "name" : "android::renderscript::RsdCpuReference::CpuScriptGroup2",
   "record_kind" : "class",
   "referenced_type" : "type-2128",
   "self_type" : "type-2128",
   "size" : 4,
   "source_file" : "/frameworks/rs/cpu_ref/rsd_cpu.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdCpuReference15CpuScriptGroup2E",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript15RsdCpuReference15CpuScriptGroup2E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference18CpuScriptGroupBase7executeEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference15CpuScriptGroup2D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference15CpuScriptGroup2D0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::renderscript::RsdCpuReference::CpuScriptGroupBase",
   "name" : "android::renderscript::RsdCpuReference::CpuScriptGroupBase",
   "record_kind" : "class",
   "referenced_type" : "type-2124",
   "self_type" : "type-2124",
   "size" : 4,
   "source_file" : "/frameworks/rs/cpu_ref/rsd_cpu.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdCpuReference18CpuScriptGroupBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript15RsdCpuReference18CpuScriptGroupBaseE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference18CpuScriptGroupBase7executeEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference18CpuScriptGroupBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15RsdCpuReference18CpuScriptGroupBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "threadable",
     "field_offset" : 64,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::RsdCpuReference::CpuSymbol",
   "name" : "android::renderscript::RsdCpuReference::CpuSymbol",
   "referenced_type" : "type-1027",
   "self_type" : "type-1027",
   "size" : 12,
   "source_file" : "/frameworks/rs/cpu_ref/rsd_cpu.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdCpuReference9CpuSymbolE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rsc",
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "sc",
     "field_offset" : 32,
     "referenced_type" : "type-2016"
    }
   ],
   "linker_set_key" : "android::renderscript::RsdCpuReference::CpuTls",
   "name" : "android::renderscript::RsdCpuReference::CpuTls",
   "referenced_type" : "type-2121",
   "self_type" : "type-2121",
   "size" : 8,
   "source_file" : "/frameworks/rs/cpu_ref/rsd_cpu.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdCpuReference6CpuTlsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "initGraphics",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "shutdownGraphics",
     "field_offset" : 32,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "setSurface",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "swap",
     "field_offset" : 96,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "shutdownDriver",
     "field_offset" : 128,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "setPriority",
     "field_offset" : 160,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "allocRuntimeMem",
     "field_offset" : 192,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "freeRuntimeMem",
     "field_offset" : 224,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "script",
     "field_offset" : 256,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "allocation",
     "field_offset" : 768,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "store",
     "field_offset" : 1664,
     "referenced_type" : "type-237"
    },
    {
     "field_name" : "raster",
     "field_offset" : 1760,
     "referenced_type" : "type-244"
    },
    {
     "field_name" : "vertex",
     "field_offset" : 1856,
     "referenced_type" : "type-251"
    },
    {
     "field_name" : "fragment",
     "field_offset" : 1952,
     "referenced_type" : "type-258"
    },
    {
     "field_name" : "mesh",
     "field_offset" : 2048,
     "referenced_type" : "type-265"
    },
    {
     "field_name" : "sampler",
     "field_offset" : 2144,
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "framebuffer",
     "field_offset" : 2240,
     "referenced_type" : "type-286"
    },
    {
     "field_name" : "scriptgroup",
     "field_offset" : 2336,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "type",
     "field_offset" : 2528,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "element",
     "field_offset" : 2624,
     "referenced_type" : "type-379"
    },
    {
     "field_name" : "finish",
     "field_offset" : 2720,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "android::renderscript::RsdHalFunctions",
   "name" : "android::renderscript::RsdHalFunctions",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 344,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-52"
    },
    {
     "field_name" : "initIntrinsic",
     "field_offset" : 32,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "invokeFunction",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "invokeRoot",
     "field_offset" : 96,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "invokeForEach",
     "field_offset" : 128,
     "referenced_type" : "type-154"
    },
    {
     "field_name" : "invokeReduce",
     "field_offset" : 160,
     "referenced_type" : "type-160"
    },
    {
     "field_name" : "invokeInit",
     "field_offset" : 192,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "invokeFreeChildren",
     "field_offset" : 224,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "setGlobalVar",
     "field_offset" : 256,
     "referenced_type" : "type-165"
    },
    {
     "field_name" : "getGlobalVar",
     "field_offset" : 288,
     "referenced_type" : "type-165"
    },
    {
     "field_name" : "setGlobalVarWithElemDims",
     "field_offset" : 320,
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "setGlobalBind",
     "field_offset" : 352,
     "referenced_type" : "type-173"
    },
    {
     "field_name" : "setGlobalObj",
     "field_offset" : 384,
     "referenced_type" : "type-175"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 416,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "invokeForEachMulti",
     "field_offset" : 448,
     "referenced_type" : "type-178"
    },
    {
     "field_name" : "updateCachedObject",
     "field_offset" : 480,
     "referenced_type" : "type-180"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:153:5) at frameworks/rs/rs_hal.h:153:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:153:5) at frameworks/rs/rs_hal.h:153:5",
   "referenced_type" : "type-51",
   "self_type" : "type-51",
   "size" : 64,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "initOem",
     "field_offset" : 32,
     "referenced_type" : "type-187"
    },
    {
     "field_name" : "initAdapter",
     "field_offset" : 64,
     "referenced_type" : "type-189"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 96,
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "grallocBits",
     "field_offset" : 128,
     "referenced_type" : "type-193"
    },
    {
     "field_name" : "resize",
     "field_offset" : 160,
     "referenced_type" : "type-195"
    },
    {
     "field_name" : "syncAll",
     "field_offset" : 192,
     "referenced_type" : "type-197"
    },
    {
     "field_name" : "markDirty",
     "field_offset" : 224,
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "setSurface",
     "field_offset" : 256,
     "referenced_type" : "type-202"
    },
    {
     "field_name" : "ioSend",
     "field_offset" : 288,
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "ioReceive",
     "field_offset" : 320,
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "data1D",
     "field_offset" : 352,
     "referenced_type" : "type-206"
    },
    {
     "field_name" : "data2D",
     "field_offset" : 384,
     "referenced_type" : "type-208"
    },
    {
     "field_name" : "data3D",
     "field_offset" : 416,
     "referenced_type" : "type-211"
    },
    {
     "field_name" : "read1D",
     "field_offset" : 448,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "read2D",
     "field_offset" : 480,
     "referenced_type" : "type-215"
    },
    {
     "field_name" : "read3D",
     "field_offset" : 512,
     "referenced_type" : "type-217"
    },
    {
     "field_name" : "lock1D",
     "field_offset" : 544,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "unlock1D",
     "field_offset" : 576,
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "allocData1D",
     "field_offset" : 608,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "allocData2D",
     "field_offset" : 640,
     "referenced_type" : "type-223"
    },
    {
     "field_name" : "allocData3D",
     "field_offset" : 672,
     "referenced_type" : "type-225"
    },
    {
     "field_name" : "elementData",
     "field_offset" : 704,
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "elementRead",
     "field_offset" : 736,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "generateMipmaps",
     "field_offset" : 768,
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "updateCachedObject",
     "field_offset" : 800,
     "referenced_type" : "type-231"
    },
    {
     "field_name" : "adapterOffset",
     "field_offset" : 832,
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "getPointer",
     "field_offset" : 864,
     "referenced_type" : "type-235"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:220:5) at frameworks/rs/rs_hal.h:220:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:220:5) at frameworks/rs/rs_hal.h:220:5",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 112,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-238"
    },
    {
     "field_name" : "setActive",
     "field_offset" : 32,
     "referenced_type" : "type-242"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 64,
     "referenced_type" : "type-242"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:316:5) at frameworks/rs/rs_hal.h:316:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:316:5) at frameworks/rs/rs_hal.h:316:5",
   "referenced_type" : "type-237",
   "self_type" : "type-237",
   "size" : 12,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "setActive",
     "field_offset" : 32,
     "referenced_type" : "type-249"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 64,
     "referenced_type" : "type-249"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:322:5) at frameworks/rs/rs_hal.h:322:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:322:5) at frameworks/rs/rs_hal.h:322:5",
   "referenced_type" : "type-244",
   "self_type" : "type-244",
   "size" : 12,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-252"
    },
    {
     "field_name" : "setActive",
     "field_offset" : 32,
     "referenced_type" : "type-256"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 64,
     "referenced_type" : "type-256"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:328:5) at frameworks/rs/rs_hal.h:328:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:328:5) at frameworks/rs/rs_hal.h:328:5",
   "referenced_type" : "type-251",
   "self_type" : "type-251",
   "size" : 12,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-259"
    },
    {
     "field_name" : "setActive",
     "field_offset" : 32,
     "referenced_type" : "type-263"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 64,
     "referenced_type" : "type-263"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:337:5) at frameworks/rs/rs_hal.h:337:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:337:5) at frameworks/rs/rs_hal.h:337:5",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 12,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-266"
    },
    {
     "field_name" : "draw",
     "field_offset" : 32,
     "referenced_type" : "type-271"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 64,
     "referenced_type" : "type-273"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:346:5) at frameworks/rs/rs_hal.h:346:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:346:5) at frameworks/rs/rs_hal.h:346:5",
   "referenced_type" : "type-265",
   "self_type" : "type-265",
   "size" : 12,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt5_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-276"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 32,
     "referenced_type" : "type-280"
    },
    {
     "field_name" : "updateCachedObject",
     "field_offset" : 64,
     "referenced_type" : "type-282"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:352:5) at frameworks/rs/rs_hal.h:352:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:352:5) at frameworks/rs/rs_hal.h:352:5",
   "referenced_type" : "type-275",
   "self_type" : "type-275",
   "size" : 12,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt6_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "setActive",
     "field_offset" : 32,
     "referenced_type" : "type-294"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 64,
     "referenced_type" : "type-294"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:358:5) at frameworks/rs/rs_hal.h:358:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:358:5) at frameworks/rs/rs_hal.h:358:5",
   "referenced_type" : "type-286",
   "self_type" : "type-286",
   "size" : 12,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt7_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "setInput",
     "field_offset" : 32,
     "referenced_type" : "type-303"
    },
    {
     "field_name" : "setOutput",
     "field_offset" : 64,
     "referenced_type" : "type-303"
    },
    {
     "field_name" : "execute",
     "field_offset" : 96,
     "referenced_type" : "type-362"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 128,
     "referenced_type" : "type-362"
    },
    {
     "field_name" : "updateCachedObject",
     "field_offset" : 160,
     "referenced_type" : "type-366"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:364:5) at frameworks/rs/rs_hal.h:364:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:364:5) at frameworks/rs/rs_hal.h:364:5",
   "referenced_type" : "type-296",
   "self_type" : "type-296",
   "size" : 24,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt8_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 32,
     "referenced_type" : "type-373"
    },
    {
     "field_name" : "updateCachedObject",
     "field_offset" : 64,
     "referenced_type" : "type-375"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:375:5) at frameworks/rs/rs_hal.h:375:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:375:5) at frameworks/rs/rs_hal.h:375:5",
   "referenced_type" : "type-370",
   "self_type" : "type-370",
   "size" : 12,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt9_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-380"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 32,
     "referenced_type" : "type-382"
    },
    {
     "field_name" : "updateCachedObject",
     "field_offset" : 64,
     "referenced_type" : "type-384"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:381:5) at frameworks/rs/rs_hal.h:381:5",
   "name" : "android::renderscript::RsdHalFunctions::(anonymous struct at frameworks/rs/rs_hal.h:381:5) at frameworks/rs/rs_hal.h:381:5",
   "referenced_type" : "type-379",
   "self_type" : "type-379",
   "size" : 12,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15RsdHalFunctionsUt10_E"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 256,
     "referenced_type" : "type-105"
    },
    {
     "access" : "protected",
     "field_name" : "mBoundSlot",
     "field_offset" : 480,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android::renderscript::Sampler",
   "name" : "android::renderscript::Sampler",
   "record_kind" : "class",
   "referenced_type" : "type-104",
   "self_type" : "type-104",
   "size" : 64,
   "source_file" : "/frameworks/rs/rsSampler.h",
   "unique_id" : "_ZTSN7android12renderscript7SamplerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript7SamplerE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Sampler9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Sampler10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7Sampler10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7SamplerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7SamplerD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "state",
     "field_offset" : 32,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "android::renderscript::Sampler::Hal",
   "name" : "android::renderscript::Sampler::Hal",
   "referenced_type" : "type-105",
   "self_type" : "type-105",
   "size" : 28,
   "source_file" : "/frameworks/rs/rsSampler.h",
   "unique_id" : "_ZTSN7android12renderscript7Sampler3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magFilter",
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "minFilter",
     "field_offset" : 32,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "wrapS",
     "field_offset" : 64,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "wrapT",
     "field_offset" : 96,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "wrapR",
     "field_offset" : 128,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "aniso",
     "field_offset" : 160,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "android::renderscript::Sampler::Hal::State",
   "name" : "android::renderscript::Sampler::Hal::State",
   "referenced_type" : "type-106",
   "self_type" : "type-106",
   "size" : 24,
   "source_file" : "/frameworks/rs/rsSampler.h",
   "unique_id" : "_ZTSN7android12renderscript7Sampler3Hal5StateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mSamplers",
     "referenced_type" : "type-404"
    },
    {
     "field_name" : "mAllSamplers",
     "field_offset" : 512,
     "referenced_type" : "type-405"
    }
   ],
   "linker_set_key" : "android::renderscript::SamplerState",
   "name" : "android::renderscript::SamplerState",
   "record_kind" : "class",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 76,
   "source_file" : "/frameworks/rs/rsSampler.h",
   "unique_id" : "_ZTSN7android12renderscript12SamplerStateE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 256,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "mEnviroment",
     "field_offset" : 640,
     "referenced_type" : "type-64"
    },
    {
     "access" : "protected",
     "field_name" : "mInitialized",
     "field_offset" : 896,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mHasObjectSlots",
     "field_offset" : 904,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mApiLevel",
     "field_offset" : 928,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mSlots",
     "field_offset" : 960,
     "referenced_type" : "type-113"
    },
    {
     "access" : "protected",
     "field_name" : "mTypes",
     "field_offset" : 992,
     "referenced_type" : "type-140"
    }
   ],
   "linker_set_key" : "android::renderscript::Script",
   "name" : "android::renderscript::Script",
   "record_kind" : "class",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 128,
   "source_file" : "/frameworks/rs/rsScript.h",
   "unique_id" : "_ZTSN7android12renderscript6ScriptE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript6ScriptE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript6Script12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript6Script21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript6ScriptD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript6ScriptD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript6Script10runForEachEPNS0_7ContextEjPPKNS0_10AllocationEjPS4_PKvjPK12RsScriptCall"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript6Script9runReduceEPNS0_7ContextEjPPKNS0_10AllocationEjPS4_PK12RsScriptCall"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript6Script6InvokeEPNS0_7ContextEjPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript6Script11setupScriptEPNS0_7ContextE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript6Script3runEPNS0_7ContextE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript6Script11isIntrinsicEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mStartTimeMillis",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mLastDtTime",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mVertex",
     "field_offset" : 128,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "mFragment",
     "field_offset" : 160,
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "mRaster",
     "field_offset" : 192,
     "referenced_type" : "type-126"
    },
    {
     "field_name" : "mFragmentStore",
     "field_offset" : 224,
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "android::renderscript::Script::Enviroment_t",
   "name" : "android::renderscript::Script::Enviroment_t",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 32,
   "source_file" : "/frameworks/rs/rsScript.h",
   "unique_id" : "_ZTSN7android12renderscript6Script12Enviroment_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "info",
     "field_offset" : 32,
     "referenced_type" : "type-58"
    }
   ],
   "linker_set_key" : "android::renderscript::Script::Hal",
   "name" : "android::renderscript::Script::Hal",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 48,
   "source_file" : "/frameworks/rs/rsScript.h",
   "unique_id" : "_ZTSN7android12renderscript6Script3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mVersionMajor",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "mVersionMinor",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "exportedVariableCount",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "exportedForEachCount",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "exportedReduceCount",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "exportedFunctionCount",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "exportedPragmaCount",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "exportedPragmaKeyList",
     "field_offset" : 224,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "exportedPragmaValueList",
     "field_offset" : 256,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "exportedForeachFuncList",
     "field_offset" : 288,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "root",
     "field_offset" : 320,
     "referenced_type" : "type-62"
    }
   ],
   "linker_set_key" : "android::renderscript::Script::Hal::DriverInfo",
   "name" : "android::renderscript::Script::Hal::DriverInfo",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 44,
   "source_file" : "/frameworks/rs/rsScript.h",
   "unique_id" : "_ZTSN7android12renderscript6Script3Hal10DriverInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptC",
   "name" : "android::renderscript::ScriptC",
   "record_kind" : "class",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 128,
   "source_file" : "/frameworks/rs/rsScriptC.h",
   "unique_id" : "_ZTSN7android12renderscript7ScriptCE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript7ScriptCE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript6Script12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7ScriptC9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript7ScriptC10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript6Script21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7ScriptCD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript7ScriptCD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript7ScriptC10runForEachEPNS0_7ContextEjPPKNS0_10AllocationEjPS4_PKvjPK12RsScriptCall"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript7ScriptC9runReduceEPNS0_7ContextEjPPKNS0_10AllocationEjPS4_PK12RsScriptCall"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript7ScriptC6InvokeEPNS0_7ContextEjPKvj"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript7ScriptC11setupScriptEPNS0_7ContextE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript7ScriptC3runEPNS0_7ContextE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript6Script11isIntrinsicEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-328"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptFieldID",
   "name" : "android::renderscript::ScriptFieldID",
   "record_kind" : "class",
   "referenced_type" : "type-332",
   "self_type" : "type-332",
   "size" : 40,
   "source_file" : "/frameworks/rs/rsScript.h",
   "unique_id" : "_ZTSN7android12renderscript13ScriptFieldIDE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript13ScriptFieldIDE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript6IDBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript13ScriptFieldID10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript13ScriptFieldIDD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript13ScriptFieldIDD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-300"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mKernels",
     "field_offset" : 320,
     "referenced_type" : "type-308"
    },
    {
     "field_name" : "mLinks",
     "field_offset" : 416,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "mNodes",
     "field_offset" : 512,
     "referenced_type" : "type-337"
    },
    {
     "field_name" : "mInputs",
     "field_offset" : 608,
     "referenced_type" : "type-353"
    },
    {
     "field_name" : "mOutputs",
     "field_offset" : 704,
     "referenced_type" : "type-353"
    },
    {
     "access" : "protected",
     "field_name" : "mInitialized",
     "field_offset" : 800,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptGroup",
   "name" : "android::renderscript::ScriptGroup",
   "record_kind" : "class",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 104,
   "source_file" : "/frameworks/rs/rsScriptGroup.h",
   "unique_id" : "_ZTSN7android12renderscript11ScriptGroupE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript11ScriptGroupE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript15ScriptGroupBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript15ScriptGroupBase10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript11ScriptGroupD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript11ScriptGroupD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript11ScriptGroup7executeEPNS0_7ContextE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript11ScriptGroup13getApiVersionEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mKernel",
     "referenced_type" : "type-325"
    },
    {
     "field_name" : "mAlloc",
     "field_offset" : 32,
     "referenced_type" : "type-114"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptGroup::IO",
   "name" : "android::renderscript::ScriptGroup::IO",
   "record_kind" : "class",
   "referenced_type" : "type-357",
   "self_type" : "type-357",
   "size" : 8,
   "source_file" : "/frameworks/rs/rsScriptGroup.h",
   "unique_id" : "_ZTSN7android12renderscript11ScriptGroup2IOE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mSource",
     "referenced_type" : "type-324"
    },
    {
     "field_name" : "mDstKernel",
     "field_offset" : 32,
     "referenced_type" : "type-324"
    },
    {
     "field_name" : "mDstField",
     "field_offset" : 64,
     "referenced_type" : "type-329"
    },
    {
     "field_name" : "mType",
     "field_offset" : 96,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "mAlloc",
     "field_offset" : 128,
     "referenced_type" : "type-114"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptGroup::Link",
   "name" : "android::renderscript::ScriptGroup::Link",
   "record_kind" : "class",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 20,
   "source_file" : "/frameworks/rs/rsScriptGroup.h",
   "unique_id" : "_ZTSN7android12renderscript11ScriptGroup4LinkE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mKernels",
     "referenced_type" : "type-342"
    },
    {
     "field_name" : "mOutputs",
     "field_offset" : 96,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "mInputs",
     "field_offset" : 192,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "mSeen",
     "field_offset" : 288,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mOrder",
     "field_offset" : 320,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "mScript",
     "field_offset" : 352,
     "referenced_type" : "type-146"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptGroup::Node",
   "name" : "android::renderscript::ScriptGroup::Node",
   "record_kind" : "class",
   "referenced_type" : "type-341",
   "self_type" : "type-341",
   "size" : 48,
   "source_file" : "/frameworks/rs/rsScriptGroup.h",
   "unique_id" : "_ZTSN7android12renderscript11ScriptGroup4NodeE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 256,
     "referenced_type" : "type-301"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptGroupBase",
   "name" : "android::renderscript::ScriptGroupBase",
   "record_kind" : "class",
   "referenced_type" : "type-300",
   "self_type" : "type-300",
   "size" : 40,
   "source_file" : "/frameworks/rs/rsScriptGroupBase.h",
   "unique_id" : "_ZTSN7android12renderscript15ScriptGroupBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript15ScriptGroupBaseE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript15ScriptGroupBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript15ScriptGroupBase10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15ScriptGroupBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript15ScriptGroupBaseD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12renderscript15ScriptGroupBase7executeEPNS0_7ContextE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android12renderscript15ScriptGroupBase13getApiVersionEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "info",
     "field_offset" : 32,
     "referenced_type" : "type-302"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptGroupBase::Hal",
   "name" : "android::renderscript::ScriptGroupBase::Hal",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 8,
   "source_file" : "/frameworks/rs/rsScriptGroupBase.h",
   "unique_id" : "_ZTSN7android12renderscript15ScriptGroupBase3HalE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::renderscript::ScriptGroupBase::Hal::DriverInfo",
   "name" : "android::renderscript::ScriptGroupBase::Hal::DriverInfo",
   "referenced_type" : "type-302",
   "self_type" : "type-302",
   "size" : 1,
   "source_file" : "/frameworks/rs/rsScriptGroupBase.h",
   "unique_id" : "_ZTSN7android12renderscript15ScriptGroupBase3Hal10DriverInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-328"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptInvokeID",
   "name" : "android::renderscript::ScriptInvokeID",
   "record_kind" : "class",
   "referenced_type" : "type-2012",
   "self_type" : "type-2012",
   "size" : 40,
   "source_file" : "/frameworks/rs/rsScript.h",
   "unique_id" : "_ZTSN7android12renderscript14ScriptInvokeIDE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript14ScriptInvokeIDE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript6IDBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript14ScriptInvokeID10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript14ScriptInvokeIDD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript14ScriptInvokeIDD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-328"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHasKernelInput",
     "field_offset" : 320,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "mHasKernelOutput",
     "field_offset" : 328,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::ScriptKernelID",
   "name" : "android::renderscript::ScriptKernelID",
   "record_kind" : "class",
   "referenced_type" : "type-327",
   "self_type" : "type-327",
   "size" : 44,
   "source_file" : "/frameworks/rs/rsScript.h",
   "unique_id" : "_ZTSN7android12renderscript14ScriptKernelIDE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript14ScriptKernelIDE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript6IDBase9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript14ScriptKernelID10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript10ObjectBase10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript14ScriptKernelIDD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript14ScriptKernelIDD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSet",
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mMutex",
     "field_offset" : 32,
     "referenced_type" : "type-1303"
    },
    {
     "access" : "protected",
     "field_name" : "mCondition",
     "field_offset" : 64,
     "referenced_type" : "type-1130"
    }
   ],
   "linker_set_key" : "android::renderscript::Signal",
   "name" : "android::renderscript::Signal",
   "record_kind" : "class",
   "referenced_type" : "type-2150",
   "self_type" : "type-2150",
   "size" : 12,
   "source_file" : "/frameworks/rs/rsSignal.h",
   "unique_id" : "_ZTSN7android12renderscript6SignalE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mLastClientHeader",
     "referenced_type" : "type-476"
    },
    {
     "access" : "protected",
     "field_name" : "mRunning",
     "field_offset" : 96,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mMaxInlineSize",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mToClient",
     "field_offset" : 160,
     "referenced_type" : "type-477"
    },
    {
     "access" : "protected",
     "field_name" : "mToCore",
     "field_offset" : 288,
     "referenced_type" : "type-477"
    },
    {
     "access" : "protected",
     "field_name" : "mToCoreRet",
     "field_offset" : 416,
     "referenced_type" : "type-36"
    },
    {
     "access" : "protected",
     "field_name" : "mSendLen",
     "field_offset" : 448,
     "referenced_type" : "type-16"
    },
    {
     "access" : "protected",
     "field_name" : "mSendBuffer",
     "field_offset" : 512,
     "referenced_type" : "type-479"
    }
   ],
   "linker_set_key" : "android::renderscript::ThreadIO",
   "name" : "android::renderscript::ThreadIO",
   "record_kind" : "class",
   "referenced_type" : "type-475",
   "self_type" : "type-475",
   "size" : 2112,
   "source_file" : "/frameworks/rs/rsThreadIO.h",
   "unique_id" : "_ZTSN7android12renderscript8ThreadIOE"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cmdID",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "userID",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::ThreadIO::ClientCmdHeaderRec",
   "name" : "android::renderscript::ThreadIO::ClientCmdHeaderRec",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 12,
   "source_file" : "/frameworks/rs/rsThreadIO.h",
   "unique_id" : "_ZTSN7android12renderscript8ThreadIO18ClientCmdHeaderRecE"
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cmdID",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::ThreadIO::CoreCmdHeaderRec",
   "name" : "android::renderscript::ThreadIO::CoreCmdHeaderRec",
   "referenced_type" : "type-1974",
   "self_type" : "type-1974",
   "size" : 8,
   "source_file" : "/frameworks/rs/rsThreadIO.h",
   "unique_id" : "_ZTSN7android12renderscript8ThreadIO16CoreCmdHeaderRecE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-29"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mHal",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "mDimLOD",
     "field_offset" : 672,
     "referenced_type" : "type-27"
    },
    {
     "access" : "protected",
     "field_name" : "mElement",
     "field_offset" : 704,
     "referenced_type" : "type-26"
    },
    {
     "access" : "protected",
     "field_name" : "mCellCount",
     "field_offset" : 736,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android::renderscript::Type",
   "name" : "android::renderscript::Type",
   "record_kind" : "class",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 96,
   "source_file" : "/frameworks/rs/rsType.h",
   "unique_id" : "_ZTSN7android12renderscript4TypeE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12renderscript4TypeE"
    },
    {
     "mangled_component_name" : "_ZN7android12renderscript10ObjectBase12freeChildrenEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type8dumpLOGVEPKc"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type9serializeEPNS0_7ContextEPNS0_7OStreamE"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type10getClassIdEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type21callUpdateCacheObjectEPKNS0_7ContextEPv"
    },
    {
     "mangled_component_name" : "_ZNK7android12renderscript4Type10preDestroyEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4TypeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12renderscript4TypeD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "drv",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "state",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::renderscript::Type::Hal",
   "name" : "android::renderscript::Type::Hal",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 52,
   "source_file" : "/frameworks/rs/rsType.h",
   "unique_id" : "_ZTSN7android12renderscript4Type3HalE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "element",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "dimX",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "dimY",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "dimZ",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "lodDimX",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "lodDimY",
     "field_offset" : 160,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "lodDimZ",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "arrays",
     "field_offset" : 224,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "lodCount",
     "field_offset" : 256,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "dimYuv",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "arrayCount",
     "field_offset" : 320,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "faces",
     "field_offset" : 352,
     "referenced_type" : "type-27"
    }
   ],
   "linker_set_key" : "android::renderscript::Type::Hal::State",
   "name" : "android::renderscript::Type::Hal::State",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 48,
   "source_file" : "/frameworks/rs/rsType.h",
   "unique_id" : "_ZTSN7android12renderscript4Type3Hal5StateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mTypes",
     "referenced_type" : "type-397"
    }
   ],
   "linker_set_key" : "android::renderscript::TypeState",
   "name" : "android::renderscript::TypeState",
   "record_kind" : "class",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 12,
   "source_file" : "/frameworks/rs/rsType.h",
   "unique_id" : "_ZTSN7android12renderscript9TypeStateE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_allocation",
   "name" : "android::renderscript::rs_allocation",
   "referenced_type" : "type-234",
   "self_type" : "type-234",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript13rs_allocationE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_element",
   "name" : "android::renderscript::rs_element",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript10rs_elementE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-747"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_font",
   "name" : "android::renderscript::rs_font",
   "referenced_type" : "type-3631",
   "self_type" : "type-3631",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript7rs_fontE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-747"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_mesh",
   "name" : "android::renderscript::rs_mesh",
   "referenced_type" : "type-3484",
   "self_type" : "type-3484",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript7rs_meshE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-482"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_object_base",
   "name" : "android::renderscript::rs_object_base",
   "referenced_type" : "type-2740",
   "self_type" : "type-2740",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript14rs_object_baseE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-747"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_program_fragment",
   "name" : "android::renderscript::rs_program_fragment",
   "referenced_type" : "type-3558",
   "self_type" : "type-3558",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript19rs_program_fragmentE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-747"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_program_raster",
   "name" : "android::renderscript::rs_program_raster",
   "referenced_type" : "type-3582",
   "self_type" : "type-3582",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript17rs_program_rasterE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-747"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_program_store",
   "name" : "android::renderscript::rs_program_store",
   "referenced_type" : "type-3605",
   "self_type" : "type-3605",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript16rs_program_storeE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-747"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_program_vertex",
   "name" : "android::renderscript::rs_program_vertex",
   "referenced_type" : "type-3569",
   "self_type" : "type-3569",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript17rs_program_vertexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-278"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_sampler",
   "name" : "android::renderscript::rs_sampler",
   "referenced_type" : "type-285",
   "self_type" : "type-285",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript10rs_samplerE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-167"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_script",
   "name" : "android::renderscript::rs_script",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript9rs_scriptE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-305"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_script_group",
   "name" : "android::renderscript::rs_script_group",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript15rs_script_groupE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "android::renderscript::rs_type",
   "name" : "android::renderscript::rs_type",
   "referenced_type" : "type-378",
   "self_type" : "type-378",
   "size" : 4,
   "source_file" : "/frameworks/rs/rs_hal.h",
   "unique_id" : "_ZTSN7android12renderscript7rs_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-2046",
   "self_type" : "type-2046",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-2050",
   "self_type" : "type-2050",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-23" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-2094",
   "self_type" : "type-2094",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-2090",
   "self_type" : "type-2090",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-108" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-2066",
   "self_type" : "type-2066",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-2082",
   "self_type" : "type-2082",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-2074",
   "self_type" : "type-2074",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-488" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-2058",
   "self_type" : "type-2058",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-561" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-2054",
   "self_type" : "type-2054",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-143" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-2070",
   "self_type" : "type-2070",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-2086",
   "self_type" : "type-2086",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-498" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-2078",
   "self_type" : "type-2078",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-2062",
   "self_type" : "type-2062",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-563" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-2042",
   "self_type" : "type-2042",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-2044",
   "self_type" : "type-2044",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-2048",
   "self_type" : "type-2048",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-23" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-2092",
   "self_type" : "type-2092",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-2088",
   "self_type" : "type-2088",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-108" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-2064",
   "self_type" : "type-2064",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-2080",
   "self_type" : "type-2080",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-2072",
   "self_type" : "type-2072",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-488" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-2056",
   "self_type" : "type-2056",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-561" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-2052",
   "self_type" : "type-2052",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-143" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-2068",
   "self_type" : "type-2068",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-2084",
   "self_type" : "type-2084",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-498" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-2076",
   "self_type" : "type-2076",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-2060",
   "self_type" : "type-2060",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-563" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-2040",
   "self_type" : "type-2040",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-2045",
   "self_type" : "type-2045",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-2049",
   "self_type" : "type-2049",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-23" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-2093",
   "self_type" : "type-2093",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-2089",
   "self_type" : "type-2089",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-108" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-2065",
   "self_type" : "type-2065",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-2081",
   "self_type" : "type-2081",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-2073",
   "self_type" : "type-2073",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-488" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-2057",
   "self_type" : "type-2057",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-561" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-2053",
   "self_type" : "type-2053",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-143" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-2069",
   "self_type" : "type-2069",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-2085",
   "self_type" : "type-2085",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-498" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-2077",
   "self_type" : "type-2077",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-2061",
   "self_type" : "type-2061",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-563" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-2041",
   "self_type" : "type-2041",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-2047",
   "self_type" : "type-2047",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-2051",
   "self_type" : "type-2051",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-23" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-2095",
   "self_type" : "type-2095",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-2091",
   "self_type" : "type-2091",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-108" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-2067",
   "self_type" : "type-2067",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-2083",
   "self_type" : "type-2083",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-2075",
   "self_type" : "type-2075",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-488" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-2059",
   "self_type" : "type-2059",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-561" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-2055",
   "self_type" : "type-2055",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-143" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-2071",
   "self_type" : "type-2071",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-2087",
   "self_type" : "type-2087",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-498" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-2079",
   "self_type" : "type-2079",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-2063",
   "self_type" : "type-2063",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-563" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-2043",
   "self_type" : "type-2043",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-3401",
   "self_type" : "type-3401",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-3377"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-3391"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-3390",
   "self_type" : "type-3390",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-3384"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-3388"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-3387",
   "self_type" : "type-3387",
   "size" : 12,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-469"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "type-3379"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-3381",
   "self_type" : "type-3381",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 64,
     "referenced_type" : "type-2135"
    },
    {
     "field_name" : "incRef",
     "field_offset" : 192,
     "referenced_type" : "type-2136"
    },
    {
     "field_name" : "decRef",
     "field_offset" : 224,
     "referenced_type" : "type-2136"
    }
   ],
   "linker_set_key" : "android_native_base_t",
   "name" : "android_native_base_t",
   "referenced_type" : "type-2134",
   "self_type" : "type-2134",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "android_native_base_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android_native_rect_t",
   "name" : "android_native_rect_t",
   "referenced_type" : "type-2187",
   "self_type" : "type-2187",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "android_native_rect_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-3393"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-3393"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-3393"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-3393"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-3394",
   "self_type" : "type-3394",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-3393",
   "self_type" : "type-3393",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "type-3377"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-3376",
   "self_type" : "type-3376",
   "size" : 56,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-2216"
    }
   ],
   "linker_set_key" : "cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "type-2215",
   "self_type" : "type-2215",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/sched.h",
   "unique_id" : "cpu_set_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-2210",
   "self_type" : "type-2210",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "f_owner_ex",
   "name" : "f_owner_ex",
   "referenced_type" : "type-2019",
   "self_type" : "type-2019",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "_ZTS10f_owner_ex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2283"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-2323",
   "self_type" : "type-2323",
   "size" : 128,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-561"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-561"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 64,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "flock",
   "name" : "flock",
   "referenced_type" : "type-2020",
   "self_type" : "type-2020",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "_ZTS5flock"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-561"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-561"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 160,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "flock64",
   "name" : "flock64",
   "referenced_type" : "type-2021",
   "self_type" : "type-2021",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "_ZTS7flock64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-2161",
   "self_type" : "type-2161",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/inttypes.h",
   "unique_id" : "_ZTS9imaxdiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "iovec",
   "name" : "iovec",
   "referenced_type" : "type-2026",
   "self_type" : "type-2026",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/uio.h",
   "unique_id" : "_ZTS5iovec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-2213"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-2213"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-2219",
   "self_type" : "type-2219",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-2217"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-2217"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-2220",
   "self_type" : "type-2220",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-488"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-2211",
   "self_type" : "type-2211",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-2212",
   "self_type" : "type-2212",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-2034"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-2033",
   "self_type" : "type-2033",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-2035"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-2032"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-2032"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-2031"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-2030"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-2028"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-2034",
   "self_type" : "type-2034",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-2027",
   "self_type" : "type-2027",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-2029"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-2028",
   "self_type" : "type-2028",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-2029"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-2030",
   "self_type" : "type-2030",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-2029"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-2031",
   "self_type" : "type-2031",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-2029"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-2032",
   "self_type" : "type-2032",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-2197",
   "self_type" : "type-2197",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-3548",
   "self_type" : "type-3548",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/__stddef_max_align_t.h",
   "unique_id" : "max_align_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-1235"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-1234",
   "self_type" : "type-1234",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gregs",
     "referenced_type" : "type-2314"
    },
    {
     "field_name" : "fpregs",
     "field_offset" : 608,
     "referenced_type" : "type-2315"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 640,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 672,
     "referenced_type" : "type-568"
    }
   ],
   "linker_set_key" : "mcontext_t",
   "name" : "mcontext_t",
   "referenced_type" : "type-2313",
   "self_type" : "type-2313",
   "size" : 88,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "mcontext_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-2143"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-2142",
   "self_type" : "type-2142",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-2918",
   "self_type" : "type-2918",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2309"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-3996",
   "self_type" : "type-3996",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS17pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1131"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-1130",
   "self_type" : "type-1130",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1131"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-1303",
   "self_type" : "type-1303",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1406"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-1405",
   "self_type" : "type-1405",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-478"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-1609",
   "self_type" : "type-1609",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS18pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rlim_cur",
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "rlim_max",
     "field_offset" : 32,
     "referenced_type" : "type-568"
    }
   ],
   "linker_set_key" : "rlimit",
   "name" : "rlimit",
   "referenced_type" : "type-2928",
   "self_type" : "type-2928",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/resource.h",
   "unique_id" : "_ZTS6rlimit"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rlim_cur",
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "rlim_max",
     "field_offset" : 64,
     "referenced_type" : "type-498"
    }
   ],
   "linker_set_key" : "rlimit64",
   "name" : "rlimit64",
   "referenced_type" : "type-2929",
   "self_type" : "type-2929",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/resource.h",
   "unique_id" : "_ZTS8rlimit64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_allocation",
   "name" : "rs_allocation",
   "referenced_type" : "type-750",
   "self_type" : "type-750",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS13rs_allocation"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "rs_allocation_usage_type",
   "name" : "rs_allocation_usage_type",
   "referenced_type" : "type-764",
   "self_type" : "type-764",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS24rs_allocation_usage_type"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_element",
   "name" : "rs_element",
   "referenced_type" : "type-745",
   "self_type" : "type-745",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS10rs_element"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_font",
   "name" : "rs_font",
   "referenced_type" : "type-759",
   "self_type" : "type-759",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS7rs_font"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "type-125"
    }
   ],
   "linker_set_key" : "rs_matrix2x2",
   "name" : "rs_matrix2x2",
   "referenced_type" : "type-727",
   "self_type" : "type-727",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsDefines.h",
   "unique_id" : "rs_matrix2x2"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "type-720"
    }
   ],
   "linker_set_key" : "rs_matrix3x3",
   "name" : "rs_matrix3x3",
   "referenced_type" : "type-719",
   "self_type" : "type-719",
   "size" : 36,
   "source_file" : "/frameworks/rs/rsDefines.h",
   "unique_id" : "rs_matrix3x3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "type-709"
    }
   ],
   "linker_set_key" : "rs_matrix4x4",
   "name" : "rs_matrix4x4",
   "referenced_type" : "type-708",
   "self_type" : "type-708",
   "size" : 64,
   "source_file" : "/frameworks/rs/rsDefines.h",
   "unique_id" : "rs_matrix4x4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_mesh",
   "name" : "rs_mesh",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS7rs_mesh"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_program_fragment",
   "name" : "rs_program_fragment",
   "referenced_type" : "type-754",
   "self_type" : "type-754",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS19rs_program_fragment"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_program_raster",
   "name" : "rs_program_raster",
   "referenced_type" : "type-757",
   "self_type" : "type-757",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS17rs_program_raster"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_program_store",
   "name" : "rs_program_store",
   "referenced_type" : "type-755",
   "self_type" : "type-755",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS16rs_program_store"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_program_vertex",
   "name" : "rs_program_vertex",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS17rs_program_vertex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_sampler",
   "name" : "rs_sampler",
   "referenced_type" : "type-751",
   "self_type" : "type-751",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS10rs_sampler"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_script",
   "name" : "rs_script",
   "referenced_type" : "type-752",
   "self_type" : "type-752",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS9rs_script"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_script_call",
   "name" : "rs_script_call",
   "referenced_type" : "type-753",
   "self_type" : "type-753",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS14rs_script_call"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "rs_tm",
   "name" : "rs_tm",
   "referenced_type" : "type-765",
   "self_type" : "type-765",
   "size" : 36,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS5rs_tm"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p",
     "referenced_type" : "type-746"
    }
   ],
   "linker_set_key" : "rs_type",
   "name" : "rs_type",
   "referenced_type" : "type-749",
   "self_type" : "type-749",
   "size" : 4,
   "source_file" : "/frameworks/rs/driver/rsdRuntimeStubs.cpp",
   "unique_id" : "_ZTS7rs_type"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "type-709"
    }
   ],
   "linker_set_key" : "rsc_Matrix",
   "name" : "rsc_Matrix",
   "referenced_type" : "type-1975",
   "self_type" : "type-1975",
   "size" : 64,
   "source_file" : "/frameworks/rs/rsEnv.h",
   "unique_id" : "_ZTS10rsc_Matrix"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "type-125"
    }
   ],
   "linker_set_key" : "rsc_Vector4",
   "name" : "rsc_Vector4",
   "referenced_type" : "type-1976",
   "self_type" : "type-1976",
   "size" : 16,
   "source_file" : "/frameworks/rs/rsEnv.h",
   "unique_id" : "_ZTS11rsc_Vector4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ru_utime",
     "referenced_type" : "type-2217"
    },
    {
     "field_name" : "ru_stime",
     "field_offset" : 64,
     "referenced_type" : "type-2217"
    },
    {
     "field_name" : "ru_maxrss",
     "field_offset" : 128,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_ixrss",
     "field_offset" : 160,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_idrss",
     "field_offset" : 192,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_isrss",
     "field_offset" : 224,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_minflt",
     "field_offset" : 256,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_majflt",
     "field_offset" : 288,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_nswap",
     "field_offset" : 320,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_inblock",
     "field_offset" : 352,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_oublock",
     "field_offset" : 384,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_msgsnd",
     "field_offset" : 416,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_msgrcv",
     "field_offset" : 448,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_nsignals",
     "field_offset" : 480,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_nvcsw",
     "field_offset" : 512,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "ru_nivcsw",
     "field_offset" : 544,
     "referenced_type" : "type-488"
    }
   ],
   "linker_set_key" : "rusage",
   "name" : "rusage",
   "referenced_type" : "type-2927",
   "self_type" : "type-2927",
   "size" : 72,
   "source_file" : "/bionic/libc/kernel/uapi/linux/resource.h",
   "unique_id" : "_ZTS6rusage"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "sched_param",
   "name" : "sched_param",
   "referenced_type" : "type-2214",
   "self_type" : "type-2214",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/sched.h",
   "unique_id" : "sched_param"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-2295"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-2280"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-2294",
   "self_type" : "type-2294",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-2297"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-2280"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-2291"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-2296",
   "self_type" : "type-2296",
   "size" : 20,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-2258"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-2260"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h:116:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h:116:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-2297",
   "self_type" : "type-2297",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-2258"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-2260"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h:105:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h:105:3) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-2295",
   "self_type" : "type-2295",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-2284",
   "self_type" : "type-2284",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gs",
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "__gsh",
     "field_offset" : 16,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "fs",
     "field_offset" : 32,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "__fsh",
     "field_offset" : 48,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "es",
     "field_offset" : 64,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "__esh",
     "field_offset" : 80,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "ds",
     "field_offset" : 96,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "__dsh",
     "field_offset" : 112,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "edi",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "esi",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "ebp",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "esp",
     "field_offset" : 224,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "ebx",
     "field_offset" : 256,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "edx",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "ecx",
     "field_offset" : 320,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "eax",
     "field_offset" : 352,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 384,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "err",
     "field_offset" : 416,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "eip",
     "field_offset" : 448,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "cs",
     "field_offset" : 480,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "__csh",
     "field_offset" : 496,
