{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [2]",
   "name" : "ASN1_TEMPLATE_st [2]",
   "referenced_type" : "type-1617",
   "self_type" : "type-1616",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/wrapped_key.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [2]",
   "name" : "ASN1_TEMPLATE_st [2]",
   "referenced_type" : "type-4685",
   "self_type" : "type-4684",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/wrapped_key.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",
   "referenced_type" : "type-1087",
   "self_type" : "type-1086",
   "size" : 720,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",
   "referenced_type" : "type-1305",
   "self_type" : "type-1304",
   "size" : 720,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",
   "referenced_type" : "type-1565",
   "self_type" : "type-1564",
   "size" : 720,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",

   "name" : "engine_st *const",
   "referenced_type" : "type-3815",
   "self_type" : "type-3817",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster0_engine.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "engine_st *const",
   "name" : "engine_st *const",
   "referenced_type" : "type-417",
   "self_type" : "type-419",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster0_engine.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "engine_st *const",
   "name" : "engine_st *const",
   "referenced_type" : "type-4202",
   "self_type" : "type-4201",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster0_engine.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "engine_st *const",
   "name" : "engine_st *const",
   "referenced_type" : "type-4524",
   "self_type" : "type-4526",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster0_engine.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "engine_st *const",
   "name" : "engine_st *const",
   "referenced_type" : "type-604",
   "self_type" : "type-603",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster0_engine.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "engine_st *const",
   "name" : "engine_st *const",
   "referenced_type" : "type-635",
   "self_type" : "type-637",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster0_engine.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_algorithm_t const[4]",
   "name" : "keymaster_algorithm_t const[4]",
   "referenced_type" : "type-1235",
   "self_type" : "type-1234",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_algorithm_t const[4]",
   "name" : "keymaster_algorithm_t const[4]",
   "referenced_type" : "type-1470",
   "self_type" : "type-1469",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_algorithm_t const[4]",
   "name" : "keymaster_algorithm_t const[4]",
   "referenced_type" : "type-4367",
   "self_type" : "type-4366",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_algorithm_t const[4]",
   "name" : "keymaster_algorithm_t const[4]",
   "referenced_type" : "type-4565",
   "self_type" : "type-4564",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_digest_t const[7]",
   "name" : "keymaster_digest_t const[7]",
   "referenced_type" : "type-252",
   "self_type" : "type-251",
   "size" : 28,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_digest_t const[7]",
   "name" : "keymaster_digest_t const[7]",
   "referenced_type" : "type-2710",
   "self_type" : "type-2709",
   "size" : 28,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_digest_t const[7]",
   "name" : "keymaster_digest_t const[7]",
   "referenced_type" : "type-3440",
   "self_type" : "type-3439",
   "size" : 28,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_digest_t const[7]",
   "name" : "keymaster_digest_t const[7]",
   "referenced_type" : "type-4125",
   "self_type" : "type-4124",
   "size" : 28,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_digest_t const[7]",
   "name" : "keymaster_digest_t const[7]",
   "referenced_type" : "type-967",
   "self_type" : "type-966",
   "size" : 28,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_padding_t const[3]",
   "name" : "keymaster_padding_t const[3]",
   "referenced_type" : "type-4131",
   "self_type" : "type-4130",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_padding_t const[3]",
   "name" : "keymaster_padding_t const[3]",
   "referenced_type" : "type-971",
   "self_type" : "type-970",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::ASN1_STRING_Delete",
   "name" : "keymaster::ASN1_STRING_Delete",
   "referenced_type" : "type-1635",
   "self_type" : "type-1635",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster18ASN1_STRING_DeleteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::ASN1_TYPE_Delete",
   "name" : "keymaster::ASN1_TYPE_Delete",
   "referenced_type" : "type-1643",
   "self_type" : "type-1643",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster16ASN1_TYPE_DeleteE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 64,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "keymaster::AbortOperationRequest",
   "name" : "keymaster::AbortOperationRequest",
   "referenced_type" : "type-1974",
   "self_type" : "type-1974",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21AbortOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21AbortOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21AbortOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21AbortOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "linker_set_key" : "keymaster::AbortOperationResponse",
   "name" : "keymaster::AbortOperationResponse",
   "referenced_type" : "type-1978",
   "self_type" : "type-1978",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22AbortOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22AbortOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22AbortOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22AbortOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "random_data",
     "field_offset" : 64,
     "referenced_type" : "type-190"
    }
   ],
   "linker_set_key" : "keymaster::AddEntropyRequest",
   "name" : "keymaster::AddEntropyRequest",
   "referenced_type" : "type-1983",
   "self_type" : "type-1983",
   "size" : 28,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17AddEntropyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17AddEntropyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AddEntropyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AddEntropyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "linker_set_key" : "keymaster::AddEntropyResponse",
   "name" : "keymaster::AddEntropyResponse",
   "referenced_type" : "type-1985",
   "self_type" : "type-1985",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18AddEntropyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18AddEntropyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18AddEntropyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18AddEntropyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1383"
    }
   ],
   "linker_set_key" : "keymaster::AesKey",
   "name" : "keymaster::AesKey",
   "record_kind" : "class",
   "referenced_type" : "type-1392",
   "self_type" : "type-1392",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/aes_key.h",
   "unique_id" : "_ZTSN9keymaster6AesKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6AesKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6AesKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6AesKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1376"
    }
   ],
   "linker_set_key" : "keymaster::AesKeyFactory",
   "name" : "keymaster::AesKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1388",
   "self_type" : "type-1388",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/aes_key.h",
   "unique_id" : "_ZTSN9keymaster13AesKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13AesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AesKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory18key_size_supportedEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory14key_size_bytesEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory13key_size_bitsEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13AesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster13AesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster13AesKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 32,
     "referenced_type" : "type-1674"
    },
    {
     "access" : "private",
     "field_name" : "operation_table_",
     "field_offset" : 64,
     "referenced_type" : "type-1677"
    }
   ],
   "linker_set_key" : "keymaster::AndroidKeymaster",
   "name" : "keymaster::AndroidKeymaster",
   "record_kind" : "class",
   "referenced_type" : "type-1673",
   "self_type" : "type-1673",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster.h",
   "unique_id" : "_ZTSN9keymaster16AndroidKeymasterE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AndroidKeymasterE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AndroidKeymasterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AndroidKeymasterD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_",
     "referenced_type" : "type-2046"
    },
    {
     "access" : "private",
     "field_name" : "end_",
     "field_offset" : 32,
     "referenced_type" : "type-2046"
    }
   ],
   "linker_set_key" : "keymaster::ArrayWrapper<keymaster::HmacSharingParameters>",
   "name" : "keymaster::ArrayWrapper<keymaster::HmacSharingParameters>",
   "record_kind" : "class",
   "referenced_type" : "type-4919",
   "self_type" : "type-4919",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-959" ],
   "unique_id" : "_ZTSN9keymaster12ArrayWrapperINS_21HmacSharingParametersEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_",
     "referenced_type" : "type-1669"
    },
    {
     "access" : "private",
     "field_name" : "end_",
     "field_offset" : 32,
     "referenced_type" : "type-1669"
    }
   ],
   "linker_set_key" : "keymaster::ArrayWrapper<keymaster_blob_t>",
   "name" : "keymaster::ArrayWrapper<keymaster_blob_t>",
   "record_kind" : "class",
   "referenced_type" : "type-1668",
   "self_type" : "type-1668",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-1671" ],
   "unique_id" : "_ZTSN9keymaster12ArrayWrapperI16keymaster_blob_tEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "keymaster::AsymmetricKey",
   "name" : "keymaster::AsymmetricKey",
   "record_kind" : "class",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/asymmetric_key.h",
   "unique_id" : "_ZTSN9keymaster13AsymmetricKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13AsymmetricKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AsymmetricKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AsymmetricKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster13AsymmetricKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "keymaster::AsymmetricKeyFactory",
   "name" : "keymaster::AsymmetricKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/asymmetric_key_factory.h",
   "unique_id" : "_ZTSN9keymaster20AsymmetricKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20AsymmetricKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20AsymmetricKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20AsymmetricKeyFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory18keymaster_key_typeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory12evp_key_typeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-2025"
    },
    {
     "field_name" : "attest_params",
     "field_offset" : 128,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::AttestKeyRequest",
   "name" : "keymaster::AttestKeyRequest",
   "referenced_type" : "type-2024",
   "self_type" : "type-2024",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16AttestKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AttestKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AttestKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AttestKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "certificate_chain",
     "field_offset" : 96,
     "referenced_type" : "type-2028"
    }
   ],
   "linker_set_key" : "keymaster::AttestKeyResponse",
   "name" : "keymaster::AttestKeyResponse",
   "referenced_type" : "type-2027",
   "self_type" : "type-2027",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17AttestKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17AttestKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AttestKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AttestKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::AttestationRecordContext",
   "name" : "keymaster::AttestationRecordContext",
   "record_kind" : "class",
   "referenced_type" : "type-1368",
   "self_type" : "type-1368",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster24AttestationRecordContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24AttestationRecordContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24AttestationRecordContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24AttestationRecordContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GetSecurityLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext22VerifyAndCopyDeviceIdsERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GenerateUniqueIdEyRK16keymaster_blob_tbPNS_6BufferE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext21GetVerifiedBootParamsEP16keymaster_blob_tP25keymaster_verified_boot_tPb"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "hw_enforced_",
     "referenced_type" : "type-1110"
    },
    {
     "access" : "private",
     "field_name" : "sw_enforced_",
     "field_offset" : 32,
     "referenced_type" : "type-1110"
    }
   ],
   "linker_set_key" : "keymaster::AuthProxy",
   "name" : "keymaster::AuthProxy",
   "record_kind" : "class",
   "referenced_type" : "type-1864",
   "self_type" : "type-1864",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster9AuthProxyE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pos_",
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "auth_set1_",
     "field_offset" : 32,
     "referenced_type" : "type-1327"
    },
    {
     "access" : "private",
     "field_name" : "auth_set2_",
     "field_offset" : 64,
     "referenced_type" : "type-1327"
    }
   ],
   "linker_set_key" : "keymaster::AuthProxyIterator",
   "name" : "keymaster::AuthProxyIterator",
   "record_kind" : "class",
   "referenced_type" : "type-1570",
   "self_type" : "type-1570",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster17AuthProxyIteratorE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-125"
    },
    {
     "referenced_type" : "type-126"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "elems_",
     "field_offset" : 96,
     "referenced_type" : "type-118"
    },
    {
     "access" : "private",
     "field_name" : "elems_size_",
     "field_offset" : 128,
     "referenced_type" : "type-121"
    },
    {
     "access" : "private",
     "field_name" : "elems_capacity_",
     "field_offset" : 160,
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_",
     "field_offset" : 192,
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_size_",
     "field_offset" : 224,
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_capacity_",
     "field_offset" : 256,
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "error_",
     "field_offset" : 288,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "keymaster::AuthorizationSet",
   "name" : "keymaster::AuthorizationSet",
   "record_kind" : "class",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster16AuthorizationSetE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AuthorizationSetE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSetD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSetD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AuthorizationSet14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AuthorizationSet9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSet11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "set",
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::AuthorizationSetBuilder",
   "name" : "keymaster::AuthorizationSetBuilder",
   "record_kind" : "class",
   "referenced_type" : "type-1373",
   "self_type" : "type-1373",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster23AuthorizationSetBuilderE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "purpose",
     "field_offset" : 64,
     "referenced_type" : "type-1959"
    },
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-1960"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 160,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::BeginOperationRequest",
   "name" : "keymaster::BeginOperationRequest",
   "referenced_type" : "type-1958",
   "self_type" : "type-1958",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21BeginOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21BeginOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21BeginOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21BeginOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 96,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 160,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::BeginOperationResponse",
   "name" : "keymaster::BeginOperationResponse",
   "referenced_type" : "type-1963",
   "self_type" : "type-1963",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22BeginOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22BeginOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22BeginOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22BeginOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-125"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 32,
     "referenced_type" : "type-191"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 64,
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "read_position_",
     "field_offset" : 96,
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "write_position_",
     "field_offset" : 128,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::Buffer",
   "name" : "keymaster::Buffer",
   "record_kind" : "class",
   "referenced_type" : "type-190",
   "self_type" : "type-190",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h",
   "unique_id" : "_ZTSN9keymaster6BufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6BufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6BufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6BufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6Buffer14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6Buffer9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster6Buffer11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::CertificateChainDelete",
   "name" : "keymaster::CertificateChainDelete",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster22CertificateChainDeleteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Characteristics_Delete",
   "name" : "keymaster::Characteristics_Delete",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster22Characteristics_DeleteE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params_array",
     "field_offset" : 64,
     "referenced_type" : "type-2047"
    }
   ],
   "linker_set_key" : "keymaster::ComputeSharedHmacRequest",
   "name" : "keymaster::ComputeSharedHmacRequest",
   "referenced_type" : "type-2055",
   "self_type" : "type-2055",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24ComputeSharedHmacRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24ComputeSharedHmacRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ComputeSharedHmacRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ComputeSharedHmacRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "sharing_check",
     "field_offset" : 96,
     "referenced_type" : "type-872"
    }
   ],
   "linker_set_key" : "keymaster::ComputeSharedHmacResponse",
   "name" : "keymaster::ComputeSharedHmacResponse",
   "referenced_type" : "type-975",
   "self_type" : "type-975",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster25ComputeSharedHmacResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25ComputeSharedHmacResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25ComputeSharedHmacResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25ComputeSharedHmacResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "os_version",
     "field_offset" : 64,
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "os_patchlevel",
     "field_offset" : 96,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::ConfigureRequest",
   "name" : "keymaster::ConfigureRequest",
   "referenced_type" : "type-2037",
   "self_type" : "type-2037",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ConfigureRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ConfigureRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ConfigureRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ConfigureRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "linker_set_key" : "keymaster::ConfigureResponse",
   "name" : "keymaster::ConfigureResponse",
   "referenced_type" : "type-2042",
   "self_type" : "type-2042",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ConfigureResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ConfigureResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ConfigureResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ConfigureResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::AndroidKeymaster>",
   "name" : "keymaster::DefaultDelete<keymaster::AndroidKeymaster>",
   "referenced_type" : "type-1672",
   "self_type" : "type-1672",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1673" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_16AndroidKeymasterEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::Key>",
   "name" : "keymaster::DefaultDelete<keymaster::Key>",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-161" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_3KeyEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::Operation>",
   "name" : "keymaster::DefaultDelete<keymaster::Operation>",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-175" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_9OperationEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_algorithm_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_algorithm_t []>",
   "referenced_type" : "type-863",
   "self_type" : "type-863",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-864" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_21keymaster_algorithm_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_blob_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_blob_t []>",
   "referenced_type" : "type-4909",
   "self_type" : "type-4909",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-4910" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_16keymaster_blob_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_block_mode_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_block_mode_t []>",
   "referenced_type" : "type-1103",
   "self_type" : "type-1103",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1104" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_22keymaster_block_mode_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_digest_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_digest_t []>",
   "referenced_type" : "type-1525",
   "self_type" : "type-1525",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1526" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_key_format_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_key_format_t []>",
   "referenced_type" : "type-1838",
   "self_type" : "type-1838",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1839" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_22keymaster_key_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_padding_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_padding_t []>",
   "referenced_type" : "type-1336",
   "self_type" : "type-1336",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1337" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<unsigned char []>",
   "name" : "keymaster::DefaultDelete<unsigned char []>",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_hEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "linker_set_key" : "keymaster::DeleteAllKeysRequest",
   "name" : "keymaster::DeleteAllKeysRequest",
   "referenced_type" : "type-2011",
   "self_type" : "type-2011",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster20DeleteAllKeysRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20DeleteAllKeysRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20DeleteAllKeysRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20DeleteAllKeysRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "linker_set_key" : "keymaster::DeleteAllKeysResponse",
   "name" : "keymaster::DeleteAllKeysResponse",
   "referenced_type" : "type-2015",
   "self_type" : "type-2015",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21DeleteAllKeysResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21DeleteAllKeysResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21DeleteAllKeysResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21DeleteAllKeysResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-2005"
    }
   ],
   "linker_set_key" : "keymaster::DeleteKeyRequest",
   "name" : "keymaster::DeleteKeyRequest",
   "referenced_type" : "type-2004",
   "self_type" : "type-2004",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16DeleteKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16DeleteKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16DeleteKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16DeleteKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "linker_set_key" : "keymaster::DeleteKeyResponse",
   "name" : "keymaster::DeleteKeyResponse",
   "referenced_type" : "type-2007",
   "self_type" : "type-2007",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17DeleteKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17DeleteKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17DeleteKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17DeleteKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-160"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ec_key_",
     "field_offset" : 768,
     "referenced_type" : "type-154"
    }
   ],
   "linker_set_key" : "keymaster::EcKey",
   "name" : "keymaster::EcKey",
   "record_kind" : "class",
   "referenced_type" : "type-153",
   "self_type" : "type-153",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ec_key.h",
   "unique_id" : "_ZTSN9keymaster5EcKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster5EcKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster5EcKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster5EcKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster5EcKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "mangled_component_name" : "_ZN9keymaster5EcKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-140"
    },
    {
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::EcKeyFactory",
   "name" : "keymaster::EcKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-139",
   "self_type" : "type-139",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ec_key_factory.h",
   "unique_id" : "_ZTSN9keymaster12EcKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12EcKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12EcKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12EcKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12EcKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster12EcKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster12EcKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-153"
    }
   ],
   "linker_set_key" : "keymaster::EcKeymaster0Key",
   "name" : "keymaster::EcKeymaster0Key",
   "record_kind" : "class",
   "referenced_type" : "type-1866",
   "self_type" : "type-1866",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/ec_keymaster0_key.h",
   "unique_id" : "_ZTSN9keymaster15EcKeymaster0KeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster15EcKeymaster0KeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster15EcKeymaster0KeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster15EcKeymaster0KeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster5EcKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "mangled_component_name" : "_ZN9keymaster5EcKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-139"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "engine_",
     "field_offset" : 96,
     "referenced_type" : "type-597"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaKeymaster0KeyFactory",
   "name" : "keymaster::EcdsaKeymaster0KeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1860",
   "self_type" : "type-1860",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/ec_keymaster0_key.h",
   "unique_id" : "_ZTSN9keymaster25EcdsaKeymaster0KeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25EcdsaKeymaster0KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25EcdsaKeymaster0KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25EcdsaKeymaster0KeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaKeymaster0KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaKeymaster0KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaKeymaster0KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25EcdsaKeymaster0KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster25EcdsaKeymaster0KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster25EcdsaKeymaster0KeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-153"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaKeymaster1Key",
   "name" : "keymaster::EcdsaKeymaster1Key",
   "record_kind" : "class",
   "referenced_type" : "type-152",
   "self_type" : "type-152",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/ec_keymaster1_key.h",
   "unique_id" : "_ZTSN9keymaster18EcdsaKeymaster1KeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18EcdsaKeymaster1KeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18EcdsaKeymaster1KeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18EcdsaKeymaster1KeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster5EcKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "mangled_component_name" : "_ZN9keymaster5EcKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-139"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "engine_",
     "field_offset" : 96,
     "referenced_type" : "type-134"
    },
    {
     "access" : "private",
     "field_name" : "sign_factory_",
     "field_offset" : 128,
     "referenced_type" : "type-137"
    },
    {
     "access" : "private",
     "field_name" : "verify_factory_",
     "field_offset" : 160,
     "referenced_type" : "type-138"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaKeymaster1KeyFactory",
   "name" : "keymaster::EcdsaKeymaster1KeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/ec_keymaster1_key.h",
   "unique_id" : "_ZTSN9keymaster25EcdsaKeymaster1KeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25EcdsaKeymaster1KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25EcdsaKeymaster1KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25EcdsaKeymaster1KeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaKeymaster1KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaKeymaster1KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaKeymaster1KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaKeymaster1KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25EcdsaKeymaster1KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster25EcdsaKeymaster1KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster25EcdsaKeymaster1KeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-175"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "digest_",
     "field_offset" : 832,
     "referenced_type" : "type-183"
    },
    {
     "access" : "protected",
     "field_name" : "digest_algorithm_",
     "field_offset" : 864,
     "referenced_type" : "type-184"
    },
    {
     "access" : "protected",
     "field_name" : "ecdsa_key_",
     "field_offset" : 896,
     "referenced_type" : "type-187"
    },
    {
     "access" : "protected",
     "field_name" : "digest_ctx_",
     "field_offset" : 928,
     "referenced_type" : "type-189"
    },
    {
     "access" : "protected",
     "field_name" : "data_",
     "field_offset" : 1056,
     "referenced_type" : "type-190"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaOperation",
   "name" : "keymaster::EcdsaOperation",
   "record_kind" : "class",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 152,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster14EcdsaOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster14EcdsaOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperation5AbortEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaOperationFactory",
   "name" : "keymaster::EcdsaOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster21EcdsaOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21EcdsaOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21EcdsaOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21EcdsaOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory7purposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-182"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaSignOperation",
   "name" : "keymaster::EcdsaSignOperation",
   "record_kind" : "class",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 152,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster18EcdsaSignOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18EcdsaSignOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18EcdsaSignOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperation5AbortEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaSignOperationFactory",
   "name" : "keymaster::EcdsaSignOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-201",
   "self_type" : "type-201",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster25EcdsaSignOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25EcdsaSignOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25EcdsaSignOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25EcdsaSignOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaSignOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25EcdsaSignOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-182"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaVerifyOperation",
   "name" : "keymaster::EcdsaVerifyOperation",
   "record_kind" : "class",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 152,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster20EcdsaVerifyOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20EcdsaVerifyOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20EcdsaVerifyOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster14EcdsaOperation5AbortEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-198"
    }
   ],
   "linker_set_key" : "keymaster::EcdsaVerifyOperationFactory",
   "name" : "keymaster::EcdsaVerifyOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-205",
   "self_type" : "type-205",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ecdsa_operation.h",
   "unique_id" : "_ZTSN9keymaster27EcdsaVerifyOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27EcdsaVerifyOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27EcdsaVerifyOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27EcdsaVerifyOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21EcdsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27EcdsaVerifyOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27EcdsaVerifyOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buf_",
     "referenced_type" : "type-123"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::Eraser",
   "name" : "keymaster::Eraser",
   "record_kind" : "class",
   "referenced_type" : "type-2144",
   "self_type" : "type-2144",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster6EraserE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx_",
     "referenced_type" : "type-1539"
    }
   ],
   "linker_set_key" : "keymaster::EvpMdCtxCleaner",
   "name" : "keymaster::EvpMdCtxCleaner",
   "record_kind" : "class",
   "referenced_type" : "type-1538",
   "self_type" : "type-1538",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "unique_id" : "_ZTSN9keymaster15EvpMdCtxCleanerE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "additional_params",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "key_format",
     "field_offset" : 384,
     "referenced_type" : "type-1997"
    },
    {
     "field_name" : "key_blob",
     "field_offset" : 416,
     "referenced_type" : "type-1998"
    }
   ],
   "linker_set_key" : "keymaster::ExportKeyRequest",
   "name" : "keymaster::ExportKeyRequest",
   "referenced_type" : "type-1996",
   "self_type" : "type-1996",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ExportKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ExportKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ExportKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ExportKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_data",
     "field_offset" : 96,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "key_data_length",
     "field_offset" : 128,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::ExportKeyResponse",
   "name" : "keymaster::ExportKeyResponse",
   "referenced_type" : "type-2000",
   "self_type" : "type-2000",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ExportKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ExportKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ExportKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ExportKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 64,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "input",
     "field_offset" : 128,
     "referenced_type" : "type-190"
    },
    {
     "field_name" : "signature",
     "field_offset" : 288,
     "referenced_type" : "type-190"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 448,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::FinishOperationRequest",
   "name" : "keymaster::FinishOperationRequest",
   "referenced_type" : "type-1969",
   "self_type" : "type-1969",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22FinishOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22FinishOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22FinishOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22FinishOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "output",
     "field_offset" : 96,
     "referenced_type" : "type-190"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 256,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::FinishOperationResponse",
   "name" : "keymaster::FinishOperationResponse",
   "referenced_type" : "type-1972",
   "self_type" : "type-1972",
   "size" : 72,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23FinishOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23FinishOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23FinishOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23FinishOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_description",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::GenerateKeyRequest",
   "name" : "keymaster::GenerateKeyRequest",
   "referenced_type" : "type-1944",
   "self_type" : "type-1944",
   "size" : 48,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18GenerateKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18GenerateKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GenerateKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GenerateKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-1949"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 160,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 480,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::GenerateKeyResponse",
   "name" : "keymaster::GenerateKeyResponse",
   "referenced_type" : "type-1948",
   "self_type" : "type-1948",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster19GenerateKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19GenerateKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19GenerateKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19GenerateKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params",
     "field_offset" : 96,
     "referenced_type" : "type-959"
    }
   ],
   "linker_set_key" : "keymaster::GetHmacSharingParametersResponse",
   "name" : "keymaster::GetHmacSharingParametersResponse",
   "referenced_type" : "type-2050",
   "self_type" : "type-2050",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster32GetHmacSharingParametersResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster32GetHmacSharingParametersResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster32GetHmacSharingParametersResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster32GetHmacSharingParametersResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-1953"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 128,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::GetKeyCharacteristicsRequest",
   "name" : "keymaster::GetKeyCharacteristicsRequest",
   "referenced_type" : "type-1952",
   "self_type" : "type-1952",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster28GetKeyCharacteristicsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28GetKeyCharacteristicsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28GetKeyCharacteristicsRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28GetKeyCharacteristicsRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "enforced",
     "field_offset" : 96,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 416,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::GetKeyCharacteristicsResponse",
   "name" : "keymaster::GetKeyCharacteristicsResponse",
   "referenced_type" : "type-1956",
   "self_type" : "type-1956",
   "size" : 92,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29GetKeyCharacteristicsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29GetKeyCharacteristicsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29GetKeyCharacteristicsResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29GetKeyCharacteristicsResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "linker_set_key" : "keymaster::GetVersionRequest",
   "name" : "keymaster::GetVersionRequest",
   "referenced_type" : "type-1815",
   "self_type" : "type-1815",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17GetVersionRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17GetVersionRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17GetVersionRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17GetVersionRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "major_ver",
     "field_offset" : 96,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "minor_ver",
     "field_offset" : 104,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "subminor_ver",
     "field_offset" : 112,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "keymaster::GetVersionResponse",
   "name" : "keymaster::GetVersionResponse",
   "referenced_type" : "type-2022",
   "self_type" : "type-2022",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18GetVersionResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18GetVersionResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GetVersionResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GetVersionResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-125"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 32,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "user_id",
     "field_offset" : 96,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "authenticator_id",
     "field_offset" : 160,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "authenticator_type",
     "field_offset" : 224,
     "referenced_type" : "type-2067"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 256,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "mac",
     "field_offset" : 320,
     "referenced_type" : "type-872"
    }
   ],
   "linker_set_key" : "keymaster::HardwareAuthToken",
   "name" : "keymaster::HardwareAuthToken",
   "referenced_type" : "type-2066",
   "self_type" : "type-2066",
   "size" : 48,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17HardwareAuthTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17HardwareAuthTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17HardwareAuthToken14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17HardwareAuthToken9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthToken11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1383"
    }
   ],
   "linker_set_key" : "keymaster::HmacKey",
   "name" : "keymaster::HmacKey",
   "record_kind" : "class",
   "referenced_type" : "type-1403",
   "self_type" : "type-1403",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/hmac_key.h",
   "unique_id" : "_ZTSN9keymaster7HmacKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster7HmacKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster7HmacKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster7HmacKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1376"
    }
   ],
   "linker_set_key" : "keymaster::HmacKeyFactory",
   "name" : "keymaster::HmacKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1399",
   "self_type" : "type-1399",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/hmac_key.h",
   "unique_id" : "_ZTSN9keymaster14HmacKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster14HmacKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14HmacKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14HmacKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory18key_size_supportedEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory14key_size_bytesEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory13key_size_bitsEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster14HmacKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster14HmacKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster14HmacKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-125"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "seed",
     "field_offset" : 32,
     "referenced_type" : "type-872"
    },
    {
     "field_name" : "nonce",
     "field_offset" : 96,
     "referenced_type" : "type-960"
    }
   ],
   "linker_set_key" : "keymaster::HmacSharingParameters",
   "name" : "keymaster::HmacSharingParameters",
   "referenced_type" : "type-959",
   "self_type" : "type-959",
   "size" : 44,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21HmacSharingParametersE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21HmacSharingParametersE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParametersD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParametersD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21HmacSharingParameters14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21HmacSharingParameters9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParameters11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-125"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params_array",
     "field_offset" : 32,
     "referenced_type" : "type-2046"
    },
    {
     "field_name" : "num_params",
     "field_offset" : 64,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::HmacSharingParametersArray",
   "name" : "keymaster::HmacSharingParametersArray",
   "referenced_type" : "type-2047",
   "self_type" : "type-2047",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26HmacSharingParametersArrayE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26HmacSharingParametersArrayE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArrayD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArrayD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26HmacSharingParametersArray14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26HmacSharingParametersArray9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArray11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_description",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "key_format",
     "field_offset" : 384,
     "referenced_type" : "type-1990"
    },
    {
     "field_name" : "key_data",
     "field_offset" : 416,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "key_data_length",
     "field_offset" : 448,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::ImportKeyRequest",
   "name" : "keymaster::ImportKeyRequest",
   "referenced_type" : "type-1989",
   "self_type" : "type-1989",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ImportKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ImportKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ImportKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ImportKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-1994"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 160,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 480,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::ImportKeyResponse",
   "name" : "keymaster::ImportKeyResponse",
   "referenced_type" : "type-1993",
   "self_type" : "type-1993",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ImportKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ImportKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ImportKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ImportKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "wrapped_key",
     "field_offset" : 64,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "wrapping_key",
     "field_offset" : 128,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "masking_key",
     "field_offset" : 192,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 256,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "password_sid",
     "field_offset" : 576,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "biometric_sid",
     "field_offset" : 640,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "keymaster::ImportWrappedKeyRequest",
   "name" : "keymaster::ImportWrappedKeyRequest",
   "referenced_type" : "type-2061",
   "self_type" : "type-2061",
   "size" : 88,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23ImportWrappedKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23ImportWrappedKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23ImportWrappedKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23ImportWrappedKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 160,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 480,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::ImportWrappedKeyResponse",
   "name" : "keymaster::ImportWrappedKeyResponse",
   "referenced_type" : "type-2064",
   "self_type" : "type-2064",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24ImportWrappedKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24ImportWrappedKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ImportWrappedKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ImportWrappedKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "hw_enforced_",
     "field_offset" : 32,
     "referenced_type" : "type-117"
    },
    {
     "access" : "protected",
     "field_name" : "sw_enforced_",
     "field_offset" : 352,
     "referenced_type" : "type-117"
    },
    {
     "access" : "protected",
     "field_name" : "key_material_",
     "field_offset" : 672,
     "referenced_type" : "type-127"
    },
    {
     "access" : "protected",
     "field_name" : "key_factory_",
     "field_offset" : 736,
     "referenced_type" : "type-162"
    }
   ],
   "linker_set_key" : "keymaster::Key",
   "name" : "keymaster::Key",
   "record_kind" : "class",
   "referenced_type" : "type-161",
   "self_type" : "type-161",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/key.h",
   "unique_id" : "_ZTSN9keymaster3KeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster3KeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KeyD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster3Key22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::KeyFactory",
   "name" : "keymaster::KeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/key_factory.h",
   "unique_id" : "_ZTSN9keymaster10KeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster10KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster10KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster10KeyFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory22SupportedImportFormatsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory22SupportedExportFormatsEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "keymaster0_device_",
     "referenced_type" : "type-600"
    },
    {
     "access" : "private",
     "field_name" : "engine_",
     "field_offset" : 32,
     "referenced_type" : "type-603"
    },
    {
     "access" : "private",
     "field_name" : "rsa_index_",
     "field_offset" : 64,
     "referenced_type" : "type-109"
    },
    {
     "access" : "private",
     "field_name" : "ec_key_index_",
     "field_offset" : 96,
     "referenced_type" : "type-109"
    },
    {
     "access" : "private",
     "field_name" : "supports_ec_",
     "field_offset" : 128,
     "referenced_type" : "type-606"
    },
    {
     "access" : "private",
     "field_name" : "rsa_method_",
     "field_offset" : 160,
     "referenced_type" : "type-607"
    },
    {
     "access" : "private",
     "field_name" : "ecdsa_method_",
     "field_offset" : 512,
     "referenced_type" : "type-608"
    }
   ],
   "linker_set_key" : "keymaster::Keymaster0Engine",
   "name" : "keymaster::Keymaster0Engine",
   "record_kind" : "class",
   "referenced_type" : "type-599",
   "self_type" : "type-599",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster0_engine.h",
   "unique_id" : "_ZTSN9keymaster16Keymaster0EngineE"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "keymaster::Keymaster0Engine::Malloc_Delete",
   "name" : "keymaster::Keymaster0Engine::Malloc_Delete",
   "referenced_type" : "type-2104",
   "self_type" : "type-2104",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster0_engine.h",
   "unique_id" : "_ZTSN9keymaster16Keymaster0Engine13Malloc_DeleteE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-141"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "software_digest_factory_",
     "field_offset" : 32,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "passthrough_factory_",
     "field_offset" : 224,
     "referenced_type" : "type-1144"
    },
    {
     "access" : "private",
     "field_name" : "legacy_support_",
     "field_offset" : 320,
     "referenced_type" : "type-1159"
    }
   ],
   "linker_set_key" : "keymaster::Keymaster1ArbitrationFactory<keymaster::EcdsaKeymaster1KeyFactory>",
   "name" : "keymaster::Keymaster1ArbitrationFactory<keymaster::EcdsaKeymaster1KeyFactory>",
   "record_kind" : "class",
   "referenced_type" : "type-1165",
   "self_type" : "type-1165",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster1_legacy_support.h",
   "template_args" : [ "type-136" ],
   "unique_id" : "_ZTSN9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEE11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS3_SA_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEE9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS9_PS3_SD_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEE7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS7_SA_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISC_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEE19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEE22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_25EcdsaKeymaster1KeyFactoryEE22SupportedExportFormatsEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-141"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "software_digest_factory_",
     "field_offset" : 32,
     "referenced_type" : "type-793"
    },
    {
     "access" : "private",
     "field_name" : "passthrough_factory_",
     "field_offset" : 288,
     "referenced_type" : "type-1144"
    },
    {
     "access" : "private",
     "field_name" : "legacy_support_",
     "field_offset" : 384,
     "referenced_type" : "type-1159"
    }
   ],
   "linker_set_key" : "keymaster::Keymaster1ArbitrationFactory<keymaster::RsaKeymaster1KeyFactory>",
   "name" : "keymaster::Keymaster1ArbitrationFactory<keymaster::RsaKeymaster1KeyFactory>",
   "record_kind" : "class",
   "referenced_type" : "type-1168",
   "self_type" : "type-1168",
   "size" : 64,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster1_legacy_support.h",
   "template_args" : [ "type-793" ],
   "unique_id" : "_ZTSN9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEE11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS3_SA_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEE9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS9_PS3_SD_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEE7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS7_SA_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISC_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEE19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEE22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28Keymaster1ArbitrationFactoryINS_23RsaKeymaster1KeyFactoryEE22SupportedExportFormatsEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "keymaster1_device_",
     "referenced_type" : "type-102"
    },
    {
     "access" : "private",
     "field_name" : "engine_",
     "field_offset" : 32,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "rsa_index_",
     "field_offset" : 64,
     "referenced_type" : "type-108"
    },
    {
     "access" : "private",
     "field_name" : "ec_key_index_",
     "field_offset" : 96,
     "referenced_type" : "type-108"
    },
    {
     "access" : "private",
     "field_name" : "rsa_method_",
     "field_offset" : 128,
     "referenced_type" : "type-110"
    },
    {
     "access" : "private",
     "field_name" : "ecdsa_method_",
     "field_offset" : 480,
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "keymaster::Keymaster1Engine",
   "name" : "keymaster::Keymaster1Engine",
   "record_kind" : "class",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 92,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster1_engine.h",
   "unique_id" : "_ZTSN9keymaster16Keymaster1EngineE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "begin_params",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "finish_params",
     "field_offset" : 384,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "key_material",
     "field_offset" : 704,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "error",
     "field_offset" : 768,
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "expected_openssl_padding",
     "field_offset" : 800,
     "referenced_type" : "type-109"
    }
   ],
   "linker_set_key" : "keymaster::Keymaster1Engine::KeyData",
   "name" : "keymaster::Keymaster1Engine::KeyData",
   "referenced_type" : "type-115",
   "self_type" : "type-115",
   "size" : 104,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster1_engine.h",
   "unique_id" : "_ZTSN9keymaster16Keymaster1Engine7KeyDataE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "device_digests_",
     "referenced_type" : "type-1160"
    },
    {
     "access" : "private",
     "field_name" : "supports_all_",
     "field_offset" : 96,
     "referenced_type" : "type-606"
    }
   ],
   "linker_set_key" : "keymaster::Keymaster1LegacySupport",
   "name" : "keymaster::Keymaster1LegacySupport",
   "record_kind" : "class",
   "referenced_type" : "type-1159",
   "self_type" : "type-1159",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster1_legacy_support.h",
   "unique_id" : "_ZTSN9keymaster23Keymaster1LegacySupportE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::KeymasterContext",
   "name" : "keymaster::KeymasterContext",
   "record_kind" : "class",
   "referenced_type" : "type-1365",
   "self_type" : "type-1365",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_context.h",
   "unique_id" : "_ZTSN9keymaster16KeymasterContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16KeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterContextD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster16KeymasterContext16SetSystemVersionEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext16GetSystemVersionEPjS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext13GetKeyFactoryE21keymaster_algorithm_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext19GetOperationFactoryE21keymaster_algorithm_t19keymaster_purpose_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext22GetSupportedAlgorithmsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext14UpgradeKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPS3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext12ParseKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext9DeleteKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext13DeleteAllKeysEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext13AddRngEntropyEPKhj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster16KeymasterContext18enforcement_policyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext19GenerateAttestationERKNS_3KeyERKNS_16AuthorizationSetEPNS_9UniquePtrI22keymaster_cert_chain_tNS_22CertificateChainDeleteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext9UnwrapKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEES5_RKNS_16AuthorizationSetES5_PS6_P22keymaster_key_format_tPS3_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "access_time_map_",
     "field_offset" : 32,
     "referenced_type" : "type-1575"
    },
    {
     "access" : "private",
     "field_name" : "access_count_map_",
     "field_offset" : 64,
     "referenced_type" : "type-1577"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterEnforcement",
   "name" : "keymaster::KeymasterEnforcement",
   "record_kind" : "class",
   "referenced_type" : "type-1574",
   "self_type" : "type-1574",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_enforcement.h",
   "unique_id" : "_ZTSN9keymaster20KeymasterEnforcementE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20KeymasterEnforcementE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcementD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcementD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement21activation_date_validEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement22expiration_date_passedEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement20auth_token_timed_outERK15hw_auth_token_tj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement19get_current_time_msEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement13SecurityLevelEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement22ValidateTokenSignatureERK15hw_auth_token_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcement24GetHmacSharingParametersEPNS_21HmacSharingParametersE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcement17ComputeSharedHmacERKNS_26HmacSharingParametersArrayEPNS_14TKeymasterBlobI16keymaster_blob_tEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcement19VerifyAuthorizationERKNS_26VerifyAuthorizationRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement11CreateKeyIdERK20keymaster_key_blob_tPy"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::KeymasterEnforcementContext",
   "name" : "keymaster::KeymasterEnforcementContext",
   "record_kind" : "class",
   "referenced_type" : "type-2088",
   "self_type" : "type-2088",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_enforcement.h",
   "unique_id" : "_ZTSN9keymaster27KeymasterEnforcementContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27KeymasterEnforcementContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27KeymasterEnforcementContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27KeymasterEnforcementContextD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-125"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "message_version",
     "field_offset" : 32,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterMessage",
   "name" : "keymaster::KeymasterMessage",
   "referenced_type" : "type-978",
   "self_type" : "type-978",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16KeymasterMessageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16KeymasterMessageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterMessageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterMessageD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable14SerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable9SerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12Serializable11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::KeymasterPassthroughEngine",
   "name" : "keymaster::KeymasterPassthroughEngine",
   "record_kind" : "class",
   "referenced_type" : "type-1142",
   "self_type" : "type-1142",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster_passthrough_engine.h",
   "unique_id" : "_ZTSN9keymaster26KeymasterPassthroughEngineE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26KeymasterPassthroughEngineE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26KeymasterPassthroughEngineD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26KeymasterPassthroughEngineD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster26KeymasterPassthroughEngine11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster26KeymasterPassthroughEngine9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster26KeymasterPassthroughEngine9ExportKeyE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS2_I16keymaster_blob_tEESA_PS8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster26KeymasterPassthroughEngine9DeleteKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster26KeymasterPassthroughEngine13DeleteAllKeysEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster26KeymasterPassthroughEngine19GetOperationFactoryE19keymaster_purpose_t21keymaster_algorithm_t"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-161"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "additional_parameters_",
     "field_offset" : 768,
     "referenced_type" : "type-117"
    },
    {
     "access" : "protected",
     "field_name" : "engine_",
     "field_offset" : 1088,
     "referenced_type" : "type-1145"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterPassthroughKey",
   "name" : "keymaster::KeymasterPassthroughKey",
   "record_kind" : "class",
   "referenced_type" : "type-1152",
   "self_type" : "type-1152",
   "size" : 140,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster_passthrough_key.h",
   "unique_id" : "_ZTSN9keymaster23KeymasterPassthroughKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23KeymasterPassthroughKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23KeymasterPassthroughKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23KeymasterPassthroughKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23KeymasterPassthroughKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-141"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "engine_",
     "field_offset" : 32,
     "referenced_type" : "type-1145"
    },
    {
     "access" : "private",
     "field_name" : "algorithm_",
     "field_offset" : 64,
     "referenced_type" : "type-1147"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterPassthroughKeyFactory",
   "name" : "keymaster::KeymasterPassthroughKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1144",
   "self_type" : "type-1144",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/keymaster_passthrough_key.h",
   "unique_id" : "_ZTSN9keymaster30KeymasterPassthroughKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster30KeymasterPassthroughKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30KeymasterPassthroughKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30KeymasterPassthroughKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster30KeymasterPassthroughKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster30KeymasterPassthroughKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster30KeymasterPassthroughKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster30KeymasterPassthroughKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster30KeymasterPassthroughKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster30KeymasterPassthroughKeyFactory22SupportedExportFormatsEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "error",
     "field_offset" : 64,
     "referenced_type" : "type-977"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterResponse",
   "name" : "keymaster::KeymasterResponse",
   "referenced_type" : "type-976",
   "self_type" : "type-976",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17KeymasterResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17KeymasterResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse22NonErrorSerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse17NonErrorSerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::Logger",
   "name" : "keymaster::Logger",
   "record_kind" : "class",
   "referenced_type" : "type-1836",
   "self_type" : "type-1836",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/logger.h",
   "unique_id" : "_ZTSN9keymaster6LoggerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6LoggerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6LoggerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6LoggerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster6Logger7log_msgENS0_8LogLevelEPKcPc"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Malloc_Delete",
   "name" : "keymaster::Malloc_Delete",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster13Malloc_DeleteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<bignum_st, &BN_free>",
   "name" : "keymaster::OpenSslObjectDeleter<bignum_st, &BN_free>",
   "referenced_type" : "type-382",
   "self_type" : "type-382",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-383" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI9bignum_stXadL_Z7BN_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<ec_key_st, &EC_KEY_free>",
   "name" : "keymaster::OpenSslObjectDeleter<ec_key_st, &EC_KEY_free>",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-159" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI9ec_key_stXadL_Z11EC_KEY_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<engine_st, &ENGINE_free>",
   "name" : "keymaster::OpenSslObjectDeleter<engine_st, &ENGINE_free>",
   "referenced_type" : "type-96",
   "self_type" : "type-96",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-97" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI9engine_stXadL_Z11ENGINE_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<evp_pkey_st, &EVP_PKEY_free>",
   "name" : "keymaster::OpenSslObjectDeleter<evp_pkey_st, &EVP_PKEY_free>",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-308" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI11evp_pkey_stXadL_Z13EVP_PKEY_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<hmac_ctx_st, &HMAC_CTX_free>",
   "name" : "keymaster::OpenSslObjectDeleter<hmac_ctx_st, &HMAC_CTX_free>",
   "referenced_type" : "type-5000",
   "self_type" : "type-5000",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-5001" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI11hmac_ctx_stXadL_Z13HMAC_CTX_freeEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<rsa_st, &RSA_free>",
   "name" : "keymaster::OpenSslObjectDeleter<rsa_st, &RSA_free>",
   "referenced_type" : "type-379",
   "self_type" : "type-379",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-380" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI6rsa_stXadL_Z8RSA_freeEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "operation_handle_",
     "field_offset" : 32,
     "referenced_type" : "type-116"
    },
    {
     "access" : "private",
     "field_name" : "purpose_",
     "field_offset" : 96,
     "referenced_type" : "type-176"
    },
    {
     "access" : "private",
     "field_name" : "hw_enforced_",
     "field_offset" : 128,
     "referenced_type" : "type-117"
    },
    {
     "access" : "private",
     "field_name" : "sw_enforced_",
     "field_offset" : 448,
     "referenced_type" : "type-117"
    },
    {
     "access" : "private",
     "field_name" : "key_id_",
     "field_offset" : 768,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "keymaster::Operation",
   "name" : "keymaster::Operation",
   "record_kind" : "class",
   "referenced_type" : "type-175",
   "self_type" : "type-175",
   "size" : 104,
   "source_file" : "/system/keymaster/include/keymaster/operation.h",
   "unique_id" : "_ZTSN9keymaster9OperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster9OperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster9OperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster9OperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation5AbortEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::OperationFactory",
   "name" : "keymaster::OperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/operation.h",
   "unique_id" : "_ZTSN9keymaster16OperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16OperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16OperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16OperationFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory12registry_keyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory16SupportedDigestsEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "referenced_type" : "type-166"
    },
    {
     "field_name" : "purpose",
     "field_offset" : 32,
     "referenced_type" : "type-167"
    }
   ],
   "linker_set_key" : "keymaster::OperationFactory::KeyType",
   "name" : "keymaster::OperationFactory::KeyType",
   "referenced_type" : "type-165",
   "self_type" : "type-165",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/operation.h",
   "unique_id" : "_ZTSN9keymaster16OperationFactory7KeyTypeE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1365"
    },
    {
     "access" : "protected",
     "referenced_type" : "type-145"
    },
    {
     "access" : "private",
     "referenced_type" : "type-1368"
    },
    {
     "access" : "private",
     "referenced_type" : "type-1366"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "rsa_factory_",
     "field_offset" : 128,
     "referenced_type" : "type-1586"
    },
    {
     "access" : "protected",
     "field_name" : "ec_factory_",
     "field_offset" : 160,
     "referenced_type" : "type-1587"
    },
    {
     "access" : "protected",
     "field_name" : "aes_factory_",
     "field_offset" : 192,
     "referenced_type" : "type-1588"
    },
    {
     "access" : "protected",
     "field_name" : "tdes_factory_",
     "field_offset" : 224,
     "referenced_type" : "type-1589"
    },
    {
     "access" : "protected",
     "field_name" : "hmac_factory_",
     "field_offset" : 256,
     "referenced_type" : "type-1590"
    },
    {
     "access" : "protected",
     "field_name" : "os_version_",
     "field_offset" : 288,
     "referenced_type" : "type-122"
    },
    {
     "access" : "protected",
     "field_name" : "os_patchlevel_",
     "field_offset" : 320,
     "referenced_type" : "type-122"
    },
    {
     "access" : "protected",
     "field_name" : "soft_keymaster_enforcement_",
     "field_offset" : 352,
     "referenced_type" : "type-1573"
    }
   ],
   "linker_set_key" : "keymaster::PureSoftKeymasterContext",
   "name" : "keymaster::PureSoftKeymasterContext",
   "record_kind" : "class",
   "referenced_type" : "type-1585",
   "self_type" : "type-1585",
   "size" : 112,
   "source_file" : "/system/keymaster/include/keymaster/contexts/pure_soft_keymaster_context.h",
   "unique_id" : "_ZTSN9keymaster24PureSoftKeymasterContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24PureSoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24PureSoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24PureSoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24PureSoftKeymasterContext16SetSystemVersionEjj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext16GetSystemVersionEPjS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext13GetKeyFactoryE21keymaster_algorithm_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext19GetOperationFactoryE21keymaster_algorithm_t19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext22GetSupportedAlgorithmsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext14UpgradeKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPS3_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext12ParseKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext9DeleteKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext13DeleteAllKeysEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext13AddRngEntropyEPKhj"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24PureSoftKeymasterContext18enforcement_policyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext19GenerateAttestationERKNS_3KeyERKNS_16AuthorizationSetEPNS_9UniquePtrI22keymaster_cert_chain_tNS_22CertificateChainDeleteEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext9UnwrapKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEES5_RKNS_16AuthorizationSetES5_PS6_P22keymaster_key_format_tPS3_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext13CreateKeyBlobERKNS_16AuthorizationSetE22keymaster_key_origin_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24PureSoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster24PureSoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster24PureSoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_NK9keymaster24PureSoftKeymasterContext13CreateKeyBlobERKNS_16AuthorizationSetE22keymaster_key_origin_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24PureSoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster24PureSoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster24PureSoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GetSecurityLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext22VerifyAndCopyDeviceIdsERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GenerateUniqueIdEyRK16keymaster_blob_tbPNS_6BufferE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext21GetVerifiedBootParamsEP16keymaster_blob_tP25keymaster_verified_boot_tPb"
    },
    {
     "component_value" : -12,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24PureSoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn12_N9keymaster24PureSoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn12_N9keymaster24PureSoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftwareRandomSource14GenerateRandomEPhj"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::RandomSource",
   "name" : "keymaster::RandomSource",
   "record_kind" : "class",
   "referenced_type" : "type-1367",
   "self_type" : "type-1367",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/random_source.h",
   "unique_id" : "_ZTSN9keymaster12RandomSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12RandomSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RandomSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RandomSourceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12RandomSource14GenerateRandomEPhj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-807"
    }
   ],
   "linker_set_key" : "keymaster::RsaCryptOperation",
   "name" : "keymaster::RsaCryptOperation",
   "record_kind" : "class",
   "referenced_type" : "type-824",
   "self_type" : "type-824",
   "size" : 140,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster17RsaCryptOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17RsaCryptOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17RsaCryptOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-832"
    }
   ],
   "linker_set_key" : "keymaster::RsaCryptingOperationFactory",
   "name" : "keymaster::RsaCryptingOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-836",
   "self_type" : "type-836",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster27RsaCryptingOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27RsaCryptingOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27RsaCryptingOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27RsaCryptingOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-824"
    }
   ],
   "linker_set_key" : "keymaster::RsaDecryptOperation",
   "name" : "keymaster::RsaDecryptOperation",
   "record_kind" : "class",
   "referenced_type" : "type-830",
   "self_type" : "type-830",
   "size" : 140,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster19RsaDecryptOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19RsaDecryptOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaDecryptOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaDecryptOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "mangled_component_name" : "_ZN9keymaster19RsaDecryptOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17RsaCryptOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-836"
    }
   ],
   "linker_set_key" : "keymaster::RsaDecryptionOperationFactory",
   "name" : "keymaster::RsaDecryptionOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-848",
   "self_type" : "type-848",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster29RsaDecryptionOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29RsaDecryptionOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29RsaDecryptionOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29RsaDecryptionOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29RsaDecryptionOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29RsaDecryptionOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-807"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "digest_ctx_",
     "field_offset" : 1120,
     "referenced_type" : "type-817"
    }
   ],
   "linker_set_key" : "keymaster::RsaDigestingOperation",
   "name" : "keymaster::RsaDigestingOperation",
   "record_kind" : "class",
   "referenced_type" : "type-816",
   "self_type" : "type-816",
   "size" : 156,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster21RsaDigestingOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21RsaDigestingOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21RsaDigestingOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-832"
    }
   ],
   "linker_set_key" : "keymaster::RsaDigestingOperationFactory",
   "name" : "keymaster::RsaDigestingOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-835",
   "self_type" : "type-835",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster28RsaDigestingOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28RsaDigestingOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28RsaDigestingOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28RsaDigestingOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28RsaDigestingOperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-824"
    }
   ],
   "linker_set_key" : "keymaster::RsaEncryptOperation",
   "name" : "keymaster::RsaEncryptOperation",
   "record_kind" : "class",
   "referenced_type" : "type-828",
   "self_type" : "type-828",
   "size" : 140,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster19RsaEncryptOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19RsaEncryptOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaEncryptOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaEncryptOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "mangled_component_name" : "_ZN9keymaster19RsaEncryptOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17RsaCryptOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17RsaCryptOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-836"
    }
   ],
   "linker_set_key" : "keymaster::RsaEncryptionOperationFactory",
   "name" : "keymaster::RsaEncryptionOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-845",
   "self_type" : "type-845",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster29RsaEncryptionOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29RsaEncryptionOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29RsaEncryptionOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29RsaEncryptionOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29RsaEncryptionOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27RsaCryptingOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29RsaEncryptionOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-160"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "rsa_key_",
     "field_offset" : 768,
     "referenced_type" : "type-557"
    }
   ],
   "linker_set_key" : "keymaster::RsaKey",
   "name" : "keymaster::RsaKey",
   "record_kind" : "class",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_key.h",
   "unique_id" : "_ZTSN9keymaster6RsaKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6RsaKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6RsaKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6RsaKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6RsaKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "mangled_component_name" : "_ZN9keymaster6RsaKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::RsaKey::RSA_Delete",
   "name" : "keymaster::RsaKey::RSA_Delete",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_key.h",
   "unique_id" : "_ZTSN9keymaster6RsaKey10RSA_DeleteE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-140"
    },
    {
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::RsaKeyFactory",
   "name" : "keymaster::RsaKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-592",
   "self_type" : "type-592",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_key_factory.h",
   "unique_id" : "_ZTSN9keymaster13RsaKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13RsaKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13RsaKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13RsaKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13RsaKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster13RsaKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster13RsaKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "keymaster::RsaKeymaster0Key",
   "name" : "keymaster::RsaKeymaster0Key",
   "record_kind" : "class",
   "referenced_type" : "type-612",
   "self_type" : "type-612",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/rsa_keymaster0_key.h",
   "unique_id" : "_ZTSN9keymaster16RsaKeymaster0KeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16RsaKeymaster0KeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16RsaKeymaster0KeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16RsaKeymaster0KeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6RsaKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "mangled_component_name" : "_ZN9keymaster6RsaKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-592"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "engine_",
     "field_offset" : 96,
     "referenced_type" : "type-597"
    }
   ],
   "linker_set_key" : "keymaster::RsaKeymaster0KeyFactory",
   "name" : "keymaster::RsaKeymaster0KeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-596",
   "self_type" : "type-596",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/rsa_keymaster0_key.h",
   "unique_id" : "_ZTSN9keymaster23RsaKeymaster0KeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23RsaKeymaster0KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23RsaKeymaster0KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23RsaKeymaster0KeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23RsaKeymaster0KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23RsaKeymaster0KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23RsaKeymaster0KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23RsaKeymaster0KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster23RsaKeymaster0KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster23RsaKeymaster0KeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "keymaster::RsaKeymaster1Key",
   "name" : "keymaster::RsaKeymaster1Key",
   "record_kind" : "class",
   "referenced_type" : "type-805",
   "self_type" : "type-805",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/rsa_keymaster1_key.h",
   "unique_id" : "_ZTSN9keymaster16RsaKeymaster1KeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16RsaKeymaster1KeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16RsaKeymaster1KeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16RsaKeymaster1KeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6RsaKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "mangled_component_name" : "_ZN9keymaster6RsaKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-592"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "engine_",
     "field_offset" : 96,
     "referenced_type" : "type-134"
    },
    {
     "access" : "private",
     "field_name" : "sign_factory_",
     "field_offset" : 128,
     "referenced_type" : "type-794"
    },
    {
     "access" : "private",
     "field_name" : "decrypt_factory_",
     "field_offset" : 160,
     "referenced_type" : "type-795"
    },
    {
     "access" : "private",
     "field_name" : "verify_factory_",
     "field_offset" : 192,
     "referenced_type" : "type-796"
    },
    {
     "access" : "private",
     "field_name" : "encrypt_factory_",
     "field_offset" : 224,
     "referenced_type" : "type-797"
    }
   ],
   "linker_set_key" : "keymaster::RsaKeymaster1KeyFactory",
   "name" : "keymaster::RsaKeymaster1KeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-793",
   "self_type" : "type-793",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/legacy_support/rsa_keymaster1_key.h",
   "unique_id" : "_ZTSN9keymaster23RsaKeymaster1KeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23RsaKeymaster1KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23RsaKeymaster1KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23RsaKeymaster1KeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23RsaKeymaster1KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23RsaKeymaster1KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23RsaKeymaster1KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23RsaKeymaster1KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23RsaKeymaster1KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster23RsaKeymaster1KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster23RsaKeymaster1KeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-175"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "rsa_key_",
     "field_offset" : 832,
     "referenced_type" : "type-808"
    },
    {
     "access" : "protected",
     "field_name" : "padding_",
     "field_offset" : 864,
     "referenced_type" : "type-658"
    },
    {
     "access" : "protected",
     "field_name" : "data_",
     "field_offset" : 896,
     "referenced_type" : "type-190"
    },
    {
     "access" : "protected",
     "field_name" : "digest_",
     "field_offset" : 1056,
     "referenced_type" : "type-661"
    },
    {
     "access" : "protected",
     "field_name" : "digest_algorithm_",
     "field_offset" : 1088,
     "referenced_type" : "type-810"
    }
   ],
   "linker_set_key" : "keymaster::RsaOperation",
   "name" : "keymaster::RsaOperation",
   "record_kind" : "class",
   "referenced_type" : "type-807",
   "self_type" : "type-807",
   "size" : 140,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster12RsaOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12RsaOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RsaOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RsaOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12RsaOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12RsaOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "keymaster::RsaOperationFactory",
   "name" : "keymaster::RsaOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-832",
   "self_type" : "type-832",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster19RsaOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19RsaOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19RsaOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-816"
    }
   ],
   "linker_set_key" : "keymaster::RsaSignOperation",
   "name" : "keymaster::RsaSignOperation",
   "record_kind" : "class",
   "referenced_type" : "type-820",
   "self_type" : "type-820",
   "size" : 156,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster16RsaSignOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16RsaSignOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16RsaSignOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21RsaDigestingOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-835"
    }
   ],
   "linker_set_key" : "keymaster::RsaSigningOperationFactory",
   "name" : "keymaster::RsaSigningOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-837",
   "self_type" : "type-837",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster26RsaSigningOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26RsaSigningOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26RsaSigningOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26RsaSigningOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28RsaDigestingOperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26RsaSigningOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26RsaSigningOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-835"
    }
   ],
   "linker_set_key" : "keymaster::RsaVerificationOperationFactory",
   "name" : "keymaster::RsaVerificationOperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-842",
   "self_type" : "type-842",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster31RsaVerificationOperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster31RsaVerificationOperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster31RsaVerificationOperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster31RsaVerificationOperationFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory12registry_keyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28RsaDigestingOperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory16SupportedDigestsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster31RsaVerificationOperationFactory7purposeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19RsaOperationFactory18CreateRsaOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster31RsaVerificationOperationFactory20InstantiateOperationEONS_16AuthorizationSetES2_18keymaster_digest_t19keymaster_padding_tP11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-816"
    }
   ],
   "linker_set_key" : "keymaster::RsaVerifyOperation",
   "name" : "keymaster::RsaVerifyOperation",
   "record_kind" : "class",
   "referenced_type" : "type-822",
   "self_type" : "type-822",
   "size" : 156,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_operation.h",
   "unique_id" : "_ZTSN9keymaster18RsaVerifyOperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18RsaVerifyOperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18RsaVerifyOperation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "mangled_component_name" : "_ZN9keymaster12RsaOperation5AbortEv"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21RsaDigestingOperation17GetOpensslPaddingEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21RsaDigestingOperation14require_digestEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::Serializable",
   "name" : "keymaster::Serializable",
   "record_kind" : "class",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h",
   "unique_id" : "_ZTSN9keymaster12SerializableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12SerializableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SerializableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SerializableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable14SerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable9SerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12Serializable11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "blob_maker_",
     "field_offset" : 32,
     "referenced_type" : "type-143"
    }
   ],
   "linker_set_key" : "keymaster::SoftKeyFactoryMixin",
   "name" : "keymaster::SoftKeyFactoryMixin",
   "record_kind" : "class",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/soft_key_factory.h",
   "unique_id" : "_ZTSN9keymaster19SoftKeyFactoryMixinE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SoftKeyFactoryMixinE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeyFactoryMixinD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeyFactoryMixinD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1365"
    },
    {
     "access" : "private",
     "referenced_type" : "type-145"
    },
    {
     "access" : "private",
     "referenced_type" : "type-1366"
    },
    {
     "access" : "private",
     "referenced_type" : "type-1368"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "km0_engine_",
     "field_offset" : 128,
     "referenced_type" : "type-1355"
    },
    {
     "access" : "private",
     "field_name" : "km1_engine_",
     "field_offset" : 160,
     "referenced_type" : "type-1356"
    },
    {
     "access" : "private",
     "field_name" : "rsa_factory_",
     "field_offset" : 192,
     "referenced_type" : "type-1357"
    },
    {
     "access" : "private",
     "field_name" : "ec_factory_",
     "field_offset" : 224,
     "referenced_type" : "type-1358"
    },
    {
     "access" : "private",
     "field_name" : "aes_factory_",
     "field_offset" : 256,
     "referenced_type" : "type-1359"
    },
    {
     "access" : "private",
     "field_name" : "tdes_factory_",
     "field_offset" : 288,
     "referenced_type" : "type-1360"
    },
    {
     "access" : "private",
     "field_name" : "hmac_factory_",
     "field_offset" : 320,
     "referenced_type" : "type-1361"
    },
    {
     "access" : "private",
     "field_name" : "km1_dev_",
     "field_offset" : 352,
     "referenced_type" : "type-1362"
    },
    {
     "access" : "private",
     "field_name" : "root_of_trust_",
     "field_offset" : 384,
     "referenced_type" : "type-1364"
    },
    {
     "access" : "private",
     "field_name" : "os_version_",
     "field_offset" : 448,
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "os_patchlevel_",
     "field_offset" : 480,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::SoftKeymasterContext",
   "name" : "keymaster::SoftKeymasterContext",
   "record_kind" : "class",
   "referenced_type" : "type-1354",
   "self_type" : "type-1354",
   "size" : 64,
   "source_file" : "/system/keymaster/include/keymaster/contexts/soft_keymaster_context.h",
   "unique_id" : "_ZTSN9keymaster20SoftKeymasterContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20SoftKeymasterContext16SetSystemVersionEjj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext16GetSystemVersionEPjS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext13GetKeyFactoryE21keymaster_algorithm_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext19GetOperationFactoryE21keymaster_algorithm_t19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext22GetSupportedAlgorithmsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext14UpgradeKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPS3_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext12ParseKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext9DeleteKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext13DeleteAllKeysEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext13AddRngEntropyEPKhj"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20SoftKeymasterContext18enforcement_policyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext19GenerateAttestationERKNS_3KeyERKNS_16AuthorizationSetEPNS_9UniquePtrI22keymaster_cert_chain_tNS_22CertificateChainDeleteEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext9UnwrapKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEES5_RKNS_16AuthorizationSetES5_PS6_P22keymaster_key_format_tPS3_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftKeymasterContext13CreateKeyBlobERKNS_16AuthorizationSetE22keymaster_key_origin_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster20SoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster20SoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_NK9keymaster20SoftKeymasterContext13CreateKeyBlobERKNS_16AuthorizationSetE22keymaster_key_origin_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster20SoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster20SoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftwareRandomSource14GenerateRandomEPhj"
    },
    {
     "component_value" : -12,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn12_N9keymaster20SoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn12_N9keymaster20SoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GetSecurityLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext22VerifyAndCopyDeviceIdsERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GenerateUniqueIdEyRK16keymaster_blob_tbPNS_6BufferE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext21GetVerifiedBootParamsEP16keymaster_blob_tP25keymaster_verified_boot_tPb"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "km1_device_",
     "referenced_type" : "type-1798"
    },
    {
     "access" : "private",
     "field_name" : "km2_device_",
     "field_offset" : 1376,
     "referenced_type" : "type-1799"
    },
    {
     "access" : "private",
     "field_name" : "wrapped_km1_device_",
     "field_offset" : 2400,
     "referenced_type" : "type-1795"
    },
    {
     "access" : "private",
     "field_name" : "km1_device_digests_",
     "field_offset" : 2432,
     "referenced_type" : "type-1800"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 2528,
     "referenced_type" : "type-1801"
    },
    {
     "access" : "private",
     "field_name" : "impl_",
     "field_offset" : 2560,
     "referenced_type" : "type-1802"
    },
    {
     "access" : "private",
     "field_name" : "module_name_",
     "field_offset" : 2592,
     "referenced_type" : "type-1803"
    },
    {
     "access" : "private",
     "field_name" : "updated_module_",
     "field_offset" : 2688,
     "referenced_type" : "type-1804"
    },
    {
     "access" : "private",
     "field_name" : "configured_",
     "field_offset" : 3712,
     "referenced_type" : "type-606"
    },
    {
     "access" : "private",
     "field_name" : "supports_all_digests_",
     "field_offset" : 3720,
     "referenced_type" : "type-606"
    }
   ],
   "linker_set_key" : "keymaster::SoftKeymasterDevice",
   "name" : "keymaster::SoftKeymasterDevice",
   "record_kind" : "class",
   "referenced_type" : "type-1797",
   "self_type" : "type-1797",
   "size" : 468,
   "source_file" : "/system/keymaster/include/keymaster/soft_keymaster_device.h",
   "unique_id" : "_ZTSN9keymaster19SoftKeymasterDeviceE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1574"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "have_saved_params_",
     "field_offset" : 96,
     "referenced_type" : "type-606"
    },
    {
     "access" : "private",
     "field_name" : "saved_params_",
     "field_offset" : 128,
     "referenced_type" : "type-959"
    },
    {
     "access" : "private",
     "field_name" : "hmac_key_",
     "field_offset" : 480,
     "referenced_type" : "type-127"
    }
   ],
   "linker_set_key" : "keymaster::SoftKeymasterEnforcement",
   "name" : "keymaster::SoftKeymasterEnforcement",
   "record_kind" : "class",
   "referenced_type" : "type-1573",
   "self_type" : "type-1573",
   "size" : 68,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/soft_keymaster_enforcement.h",
   "unique_id" : "_ZTSN9keymaster24SoftKeymasterEnforcementE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24SoftKeymasterEnforcementE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcementD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcementD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement21activation_date_validEy"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement22expiration_date_passedEy"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement20auth_token_timed_outERK15hw_auth_token_tj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement19get_current_time_msEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement13SecurityLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement22ValidateTokenSignatureERK15hw_auth_token_t"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcement24GetHmacSharingParametersEPNS_21HmacSharingParametersE"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcement17ComputeSharedHmacERKNS_26HmacSharingParametersArrayEPNS_14TKeymasterBlobI16keymaster_blob_tEE"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcement19VerifyAuthorizationERKNS_26VerifyAuthorizationRequestE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement11CreateKeyIdERK20keymaster_key_blob_tPy"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1836"
    }
   ],
   "linker_set_key" : "keymaster::SoftKeymasterLogger",
   "name" : "keymaster::SoftKeymasterLogger",
   "record_kind" : "class",
   "referenced_type" : "type-1835",
   "self_type" : "type-1835",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/soft_keymaster_logger.h",
   "unique_id" : "_ZTSN9keymaster19SoftKeymasterLoggerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SoftKeymasterLoggerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeymasterLoggerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeymasterLoggerD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SoftKeymasterLogger7log_msgENS_6Logger8LogLevelEPKcPc"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::SoftwareKeyBlobMaker",
   "name" : "keymaster::SoftwareKeyBlobMaker",
   "record_kind" : "class",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/soft_key_factory.h",
   "unique_id" : "_ZTSN9keymaster20SoftwareKeyBlobMakerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftwareKeyBlobMakerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareKeyBlobMakerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareKeyBlobMakerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20SoftwareKeyBlobMaker13CreateKeyBlobERKNS_16AuthorizationSetE22keymaster_key_origin_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1367"
    }
   ],
   "linker_set_key" : "keymaster::SoftwareRandomSource",
   "name" : "keymaster::SoftwareRandomSource",
   "record_kind" : "class",
   "referenced_type" : "type-1366",
   "self_type" : "type-1366",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/software_random_source.h",
   "unique_id" : "_ZTSN9keymaster20SoftwareRandomSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftwareRandomSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareRandomSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareRandomSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftwareRandomSource14GenerateRandomEPhj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::StaticAssert<true>",
   "name" : "keymaster::StaticAssert<true>",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12StaticAssertILb1EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "linker_set_key" : "keymaster::SupportedAlgorithmsRequest",
   "name" : "keymaster::SupportedAlgorithmsRequest",
   "referenced_type" : "type-1871",
   "self_type" : "type-1871",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26SupportedAlgorithmsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26SupportedAlgorithmsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26SupportedAlgorithmsRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26SupportedAlgorithmsRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1901"
    }
   ],
   "linker_set_key" : "keymaster::SupportedAlgorithmsResponse",
   "name" : "keymaster::SupportedAlgorithmsResponse",
   "referenced_type" : "type-1932",
   "self_type" : "type-1932",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedAlgorithmsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedAlgorithmsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedAlgorithmsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedAlgorithmsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1887"
    }
   ],
   "linker_set_key" : "keymaster::SupportedBlockModesRequest",
   "name" : "keymaster::SupportedBlockModesRequest",
   "referenced_type" : "type-1893",
   "self_type" : "type-1893",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26SupportedBlockModesRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26SupportedBlockModesRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedBlockModesRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedBlockModesRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1906"
    }
   ],
   "linker_set_key" : "keymaster::SupportedBlockModesResponse",
   "name" : "keymaster::SupportedBlockModesResponse",
   "referenced_type" : "type-1934",
   "self_type" : "type-1934",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedBlockModesResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedBlockModesResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedBlockModesResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedBlockModesResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "field_offset" : 64,
     "referenced_type" : "type-1888"
    },
    {
     "field_name" : "purpose",
     "field_offset" : 96,
     "referenced_type" : "type-1889"
    }
   ],
   "linker_set_key" : "keymaster::SupportedByAlgorithmAndPurposeRequest",
   "name" : "keymaster::SupportedByAlgorithmAndPurposeRequest",
   "referenced_type" : "type-1887",
   "self_type" : "type-1887",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster37SupportedByAlgorithmAndPurposeRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster37SupportedByAlgorithmAndPurposeRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "field_offset" : 64,
     "referenced_type" : "type-1877"
    }
   ],
   "linker_set_key" : "keymaster::SupportedByAlgorithmRequest",
   "name" : "keymaster::SupportedByAlgorithmRequest",
   "referenced_type" : "type-1876",
   "self_type" : "type-1876",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedByAlgorithmRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedByAlgorithmRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1887"
    }
   ],
   "linker_set_key" : "keymaster::SupportedDigestsRequest",
   "name" : "keymaster::SupportedDigestsRequest",
   "referenced_type" : "type-1899",
   "self_type" : "type-1899",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23SupportedDigestsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23SupportedDigestsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23SupportedDigestsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23SupportedDigestsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1920"
    }
   ],
   "linker_set_key" : "keymaster::SupportedDigestsResponse",
   "name" : "keymaster::SupportedDigestsResponse",
   "referenced_type" : "type-1938",
   "self_type" : "type-1938",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24SupportedDigestsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24SupportedDigestsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SupportedDigestsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SupportedDigestsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1876"
    }
   ],
   "linker_set_key" : "keymaster::SupportedExportFormatsRequest",
   "name" : "keymaster::SupportedExportFormatsRequest",
   "referenced_type" : "type-1884",
   "self_type" : "type-1884",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedExportFormatsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedExportFormatsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedExportFormatsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedExportFormatsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1925"
    }
   ],
   "linker_set_key" : "keymaster::SupportedExportFormatsResponse",
   "name" : "keymaster::SupportedExportFormatsResponse",
   "referenced_type" : "type-1942",
   "self_type" : "type-1942",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster30SupportedExportFormatsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster30SupportedExportFormatsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedExportFormatsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedExportFormatsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1876"
    }
   ],
   "linker_set_key" : "keymaster::SupportedImportFormatsRequest",
   "name" : "keymaster::SupportedImportFormatsRequest",
   "referenced_type" : "type-1881",
   "self_type" : "type-1881",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedImportFormatsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedImportFormatsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedImportFormatsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedImportFormatsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1925"
    }
   ],
   "linker_set_key" : "keymaster::SupportedImportFormatsResponse",
   "name" : "keymaster::SupportedImportFormatsResponse",
   "referenced_type" : "type-1940",
   "self_type" : "type-1940",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster30SupportedImportFormatsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster30SupportedImportFormatsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedImportFormatsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedImportFormatsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1887"
    }
   ],
   "linker_set_key" : "keymaster::SupportedPaddingModesRequest",
   "name" : "keymaster::SupportedPaddingModesRequest",
   "referenced_type" : "type-1895",
   "self_type" : "type-1895",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster28SupportedPaddingModesRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28SupportedPaddingModesRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28SupportedPaddingModesRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28SupportedPaddingModesRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1914"
    }
   ],
   "linker_set_key" : "keymaster::SupportedPaddingModesResponse",
   "name" : "keymaster::SupportedPaddingModesResponse",
   "referenced_type" : "type-1936",
   "self_type" : "type-1936",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedPaddingModesResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedPaddingModesResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedPaddingModesResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedPaddingModesResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-1050"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_algorithm_t>",
   "name" : "keymaster::SupportedResponse<keymaster_algorithm_t>",
   "referenced_type" : "type-1901",
   "self_type" : "type-1901",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-1902" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI21keymaster_algorithm_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI21keymaster_algorithm_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-1310"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_block_mode_t>",
   "name" : "keymaster::SupportedResponse<keymaster_block_mode_t>",
   "referenced_type" : "type-1906",
   "self_type" : "type-1906",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-1907" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI22keymaster_block_mode_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI22keymaster_block_mode_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-1762"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_digest_t>",
   "name" : "keymaster::SupportedResponse<keymaster_digest_t>",
   "referenced_type" : "type-1920",
   "self_type" : "type-1920",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-1921" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI18keymaster_digest_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI18keymaster_digest_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-1911"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_key_format_t>",
   "name" : "keymaster::SupportedResponse<keymaster_key_format_t>",
   "referenced_type" : "type-1925",
   "self_type" : "type-1925",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-1926" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI22keymaster_key_format_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI22keymaster_key_format_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-1498"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_padding_t>",
   "name" : "keymaster::SupportedResponse<keymaster_padding_t>",
   "referenced_type" : "type-1914",
   "self_type" : "type-1914",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-1915" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI19keymaster_padding_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI19keymaster_padding_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "keymaster::SymmetricKey",
   "name" : "keymaster::SymmetricKey",
   "record_kind" : "class",
   "referenced_type" : "type-1383",
   "self_type" : "type-1383",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/symmetric_key.h",
   "unique_id" : "_ZTSN9keymaster12SymmetricKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12SymmetricKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SymmetricKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SymmetricKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-141"
    },
    {
     "referenced_type" : "type-142"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "random_source_",
     "field_offset" : 96,
     "referenced_type" : "type-1377"
    }
   ],
   "linker_set_key" : "keymaster::SymmetricKeyFactory",
   "name" : "keymaster::SymmetricKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1376",
   "self_type" : "type-1376",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/symmetric_key.h",
   "unique_id" : "_ZTSN9keymaster19SymmetricKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SymmetricKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SymmetricKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SymmetricKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory18key_size_supportedEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory14key_size_bytesEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory13key_size_bitsEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SymmetricKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster19SymmetricKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster19SymmetricKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-873"
    }
   ],
   "linker_set_key" : "keymaster::TKeymasterBlob<keymaster_blob_t>",
   "name" : "keymaster::TKeymasterBlob<keymaster_blob_t>",
   "referenced_type" : "type-872",
   "self_type" : "type-872",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-874" ],
   "unique_id" : "_ZTSN9keymaster14TKeymasterBlobI16keymaster_blob_tEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-128"
    }
   ],
   "linker_set_key" : "keymaster::TKeymasterBlob<keymaster_key_blob_t>",
   "name" : "keymaster::TKeymasterBlob<keymaster_key_blob_t>",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-129" ],
   "unique_id" : "_ZTSN9keymaster14TKeymasterBlobI20keymaster_key_blob_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BIGNUM>",
   "name" : "keymaster::TagValueType<KM_BIGNUM>",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn2147483648EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BOOL>",
   "name" : "keymaster::TagValueType<KM_BOOL>",
   "referenced_type" : "type-100",
   "self_type" : "type-100",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1879048192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BYTES>",
   "name" : "keymaster::TagValueType<KM_BYTES>",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn1879048192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_DATE>",
   "name" : "keymaster::TagValueType<KM_DATE>",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1610612736EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_INVALID>",
   "name" : "keymaster::TagValueType<KM_INVALID>",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_UINT>",
   "name" : "keymaster::TagValueType<KM_UINT>",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t805306368EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_UINT_REP>",
   "name" : "keymaster::TagValueType<KM_UINT_REP>",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1073741824EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_ULONG>",
   "name" : "keymaster::TagValueType<KM_ULONG>",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1342177280EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_ULONG_REP>",
   "name" : "keymaster::TagValueType<KM_ULONG_REP>",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn1610612736EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1383"
    }
   ],
   "linker_set_key" : "keymaster::TripleDesKey",
   "name" : "keymaster::TripleDesKey",
   "record_kind" : "class",
   "referenced_type" : "type-1410",
   "self_type" : "type-1410",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/triple_des_key.h",
   "unique_id" : "_ZTSN9keymaster12TripleDesKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12TripleDesKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12TripleDesKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12TripleDesKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1376"
    }
   ],
   "linker_set_key" : "keymaster::TripleDesKeyFactory",
   "name" : "keymaster::TripleDesKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1405",
   "self_type" : "type-1405",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/triple_des_key.h",
   "unique_id" : "_ZTSN9keymaster19TripleDesKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19TripleDesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19TripleDesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19TripleDesKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory18key_size_supportedEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory14key_size_bytesEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory13key_size_bitsEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19TripleDesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster19TripleDesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster19TripleDesKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t>",
   "record_kind" : "class",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-239" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435458E21keymaster_algorithm_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_EC_CURVE, keymaster_ec_curve_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_EC_CURVE, keymaster_ec_curve_t>",
   "record_kind" : "class",
   "referenced_type" : "type-1343",
   "self_type" : "type-1343",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-1344" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435466E20keymaster_ec_curve_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ORIGIN, keymaster_key_origin_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ORIGIN, keymaster_key_origin_t>",
   "record_kind" : "class",
   "referenced_type" : "type-1319",
   "self_type" : "type-1319",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-1320" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268436158E22keymaster_key_origin_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_USER_AUTH_TYPE, hw_authenticator_type_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_USER_AUTH_TYPE, hw_authenticator_type_t>",
   "record_kind" : "class",
   "referenced_type" : "type-1325",
   "self_type" : "type-1325",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-1326" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435960E23hw_authenticator_type_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_BLOCK_MODE, keymaster_block_mode_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_BLOCK_MODE, keymaster_block_mode_t>",
   "record_kind" : "class",
   "referenced_type" : "type-465",
   "self_type" : "type-465",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-466" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870916E22keymaster_block_mode_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_DIGEST, keymaster_digest_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_DIGEST, keymaster_digest_t>",
   "record_kind" : "class",
   "referenced_type" : "type-1722",
   "self_type" : "type-1722",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-1723" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870917E18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_KDF, keymaster_kdf_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_KDF, keymaster_kdf_t>",
   "record_kind" : "class",
   "referenced_type" : "type-1329",
   "self_type" : "type-1329",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-1330" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870921E15keymaster_kdf_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PADDING, keymaster_padding_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PADDING, keymaster_padding_t>",
   "record_kind" : "class",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870918E19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PURPOSE, keymaster_purpose_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PURPOSE, keymaster_purpose_t>",
   "record_kind" : "class",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-224" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870913E19keymaster_purpose_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALLOW_WHILE_ON_BODY>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALLOW_WHILE_ON_BODY>",
   "record_kind" : "class",
   "referenced_type" : "type-1115",
   "self_type" : "type-1115",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048698EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_APPLICATIONS>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_APPLICATIONS>",
   "record_kind" : "class",
   "referenced_type" : "type-1127",
   "self_type" : "type-1127",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048792EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_USERS>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_USERS>",
   "record_kind" : "class",
   "referenced_type" : "type-1711",
   "self_type" : "type-1711",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048692EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_CALLER_NONCE>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_CALLER_NONCE>",
   "record_kind" : "class",
   "referenced_type" : "type-1047",
   "self_type" : "type-1047",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048199EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_NO_AUTH_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_NO_AUTH_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-1108",
   "self_type" : "type-1108",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048695EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ROLLBACK_RESISTANT>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ROLLBACK_RESISTANT>",
   "record_kind" : "class",
   "referenced_type" : "type-1161",
   "self_type" : "type-1161",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048895EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_UNLOCKED_DEVICE_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_UNLOCKED_DEVICE_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-1121",
   "self_type" : "type-1121",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048701EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_DATA>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_DATA>",
   "record_kind" : "class",
   "referenced_type" : "type-497",
   "self_type" : "type-497",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047492EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-1141",
   "self_type" : "type-1141",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047591EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ASSOCIATED_DATA>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ASSOCIATED_DATA>",
   "record_kind" : "class",
   "referenced_type" : "type-1500",
   "self_type" : "type-1500",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_APPLICATION_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_APPLICATION_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-1188",
   "self_type" : "type-1188",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047483EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_CHALLENGE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_CHALLENGE>",
   "record_kind" : "class",
   "referenced_type" : "type-1713",
   "self_type" : "type-1713",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047484EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_BRAND>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_BRAND>",
   "record_kind" : "class",
   "referenced_type" : "type-1194",
   "self_type" : "type-1194",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047482EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_DEVICE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_DEVICE>",
   "record_kind" : "class",
   "referenced_type" : "type-1208",
   "self_type" : "type-1208",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047481EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_IMEI>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_IMEI>",
   "record_kind" : "class",
   "referenced_type" : "type-1252",
   "self_type" : "type-1252",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047478EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MANUFACTURER>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MANUFACTURER>",
   "record_kind" : "class",
   "referenced_type" : "type-1268",
   "self_type" : "type-1268",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047476EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MEID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MEID>",
   "record_kind" : "class",
   "referenced_type" : "type-1262",
   "self_type" : "type-1262",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047477EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MODEL>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MODEL>",
   "record_kind" : "class",
   "referenced_type" : "type-1272",
   "self_type" : "type-1272",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047475EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_PRODUCT>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_PRODUCT>",
   "record_kind" : "class",
   "referenced_type" : "type-1218",
   "self_type" : "type-1218",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047480EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_SERIAL>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_SERIAL>",
   "record_kind" : "class",
   "referenced_type" : "type-1240",
   "self_type" : "type-1240",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047479EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_NONCE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_NONCE>",
   "record_kind" : "class",
   "referenced_type" : "type-1502",
   "self_type" : "type-1502",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047191EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ROOT_OF_TRUST>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ROOT_OF_TRUST>",
   "record_kind" : "class",
   "referenced_type" : "type-1176",
   "self_type" : "type-1176",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047488EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_ACTIVE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_ACTIVE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-1088",
   "self_type" : "type-1088",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613136EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_CREATION_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_CREATION_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-1155",
   "self_type" : "type-1155",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613437EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_ORIGINATION_EXPIRE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_ORIGINATION_EXPIRE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-1100",
   "self_type" : "type-1100",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613137EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_USAGE_EXPIRE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_USAGE_EXPIRE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-1102",
   "self_type" : "type-1102",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613138EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_AUTH_TIMEOUT>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_AUTH_TIMEOUT>",
   "record_kind" : "class",
   "referenced_type" : "type-1111",
   "self_type" : "type-1111",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306873EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_KEY_SIZE>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_KEY_SIZE>",
   "record_kind" : "class",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306371EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAC_LENGTH>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAC_LENGTH>",
   "record_kind" : "class",
   "referenced_type" : "type-1494",
   "self_type" : "type-1494",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307371EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_MAC_LENGTH>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_MAC_LENGTH>",
   "record_kind" : "class",
   "referenced_type" : "type-1068",
   "self_type" : "type-1068",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306376EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_PATCHLEVEL>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_PATCHLEVEL>",
   "record_kind" : "class",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307074EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_VERSION>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_VERSION>",
   "record_kind" : "class",
   "referenced_type" : "type-204",
   "self_type" : "type-204",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307073EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_ULONG, KM_TAG_RSA_PUBLIC_EXPONENT>",
   "name" : "keymaster::TypedTag<KM_ULONG, KM_TAG_RSA_PUBLIC_EXPONENT>",
   "record_kind" : "class",
   "referenced_type" : "type-181",
   "self_type" : "type-181",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1342177280EL15keymaster_tag_t1342177480EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<ec_key_st, keymaster::OpenSslObjectDeleter<ec_key_st, &EC_KEY_free> >",
   "name" : "keymaster::UniquePtr<ec_key_st, keymaster::OpenSslObjectDeleter<ec_key_st, &EC_KEY_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-157", "type-158" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI9ec_key_stNS_20OpenSslObjectDeleterIS1_XadL_Z11EC_KEY_freeEEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-351"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<evp_pkey_st, keymaster::OpenSslObjectDeleter<evp_pkey_st, &EVP_PKEY_free> >",
   "name" : "keymaster::UniquePtr<evp_pkey_st, keymaster::OpenSslObjectDeleter<evp_pkey_st, &EVP_PKEY_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-350",
   "self_type" : "type-350",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-353", "type-307" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI11evp_pkey_stNS_20OpenSslObjectDeleterIS1_XadL_Z13EVP_PKEY_freeEEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-5003"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<hmac_ctx_st, keymaster::OpenSslObjectDeleter<hmac_ctx_st, &HMAC_CTX_free> >",
   "name" : "keymaster::UniquePtr<hmac_ctx_st, keymaster::OpenSslObjectDeleter<hmac_ctx_st, &HMAC_CTX_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-5002",
   "self_type" : "type-5002",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-5005", "type-5000" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI11hmac_ctx_stNS_20OpenSslObjectDeleterIS1_XadL_Z13HMAC_CTX_freeEEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1706"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::AndroidKeymaster, keymaster::DefaultDelete<keymaster::AndroidKeymaster> >",
   "name" : "keymaster::UniquePtr<keymaster::AndroidKeymaster, keymaster::DefaultDelete<keymaster::AndroidKeymaster> >",
   "record_kind" : "class",
   "referenced_type" : "type-1802",
   "self_type" : "type-1802",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1673", "type-1672" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_16AndroidKeymasterENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-773"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::Key, keymaster::DefaultDelete<keymaster::Key> >",
   "name" : "keymaster::UniquePtr<keymaster::Key, keymaster::DefaultDelete<keymaster::Key> >",
   "record_kind" : "class",
   "referenced_type" : "type-2093",
   "self_type" : "type-2093",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-161", "type-627" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_3KeyENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1675"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::KeymasterContext, keymaster::DefaultDelete<keymaster::KeymasterContext> >",
   "name" : "keymaster::UniquePtr<keymaster::KeymasterContext, keymaster::DefaultDelete<keymaster::KeymasterContext> >",
   "record_kind" : "class",
   "referenced_type" : "type-1674",
   "self_type" : "type-1674",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1365", "type-1676" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_16KeymasterContextENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-178"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::Operation, keymaster::DefaultDelete<keymaster::Operation> >",
   "name" : "keymaster::UniquePtr<keymaster::Operation, keymaster::DefaultDelete<keymaster::Operation> >",
   "record_kind" : "class",
   "referenced_type" : "type-346",
   "self_type" : "type-346",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-175", "type-226" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_9OperationENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1678"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::OperationTable, keymaster::DefaultDelete<keymaster::OperationTable> >",
   "name" : "keymaster::UniquePtr<keymaster::OperationTable, keymaster::DefaultDelete<keymaster::OperationTable> >",
   "record_kind" : "class",
   "referenced_type" : "type-1677",
   "self_type" : "type-1677",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1680", "type-1681" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_14OperationTableENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1050"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_algorithm_t [], keymaster::DefaultDelete<keymaster_algorithm_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_algorithm_t [], keymaster::DefaultDelete<keymaster_algorithm_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-2110",
   "self_type" : "type-2110",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-864", "type-863" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_21keymaster_algorithm_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-4920"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_blob_t [], keymaster::DefaultDelete<keymaster_blob_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_blob_t [], keymaster::DefaultDelete<keymaster_blob_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-5009",
   "self_type" : "type-5009",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-4910", "type-4909" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_16keymaster_blob_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1310"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_block_mode_t [], keymaster::DefaultDelete<keymaster_block_mode_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_block_mode_t [], keymaster::DefaultDelete<keymaster_block_mode_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-2116",
   "self_type" : "type-2116",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1104", "type-1103" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_22keymaster_block_mode_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1332"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_cert_chain_t, keymaster::CertificateChainDelete>",
   "name" : "keymaster::UniquePtr<keymaster_cert_chain_t, keymaster::CertificateChainDelete>",
   "record_kind" : "class",
   "referenced_type" : "type-1331",
   "self_type" : "type-1331",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1334", "type-66" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI22keymaster_cert_chain_tNS_22CertificateChainDeleteEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1762"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_digest_t [], keymaster::DefaultDelete<keymaster_digest_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_digest_t [], keymaster::DefaultDelete<keymaster_digest_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-2129",
   "self_type" : "type-2129",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1526", "type-1525" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_18keymaster_digest_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1911"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_key_format_t [], keymaster::DefaultDelete<keymaster_key_format_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_key_format_t [], keymaster::DefaultDelete<keymaster_key_format_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-2135",
   "self_type" : "type-2135",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1839", "type-1838" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_22keymaster_key_format_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-1498"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_padding_t [], keymaster::DefaultDelete<keymaster_padding_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_padding_t [], keymaster::DefaultDelete<keymaster_padding_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-2122",
   "self_type" : "type-2122",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-1337", "type-1336" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_19keymaster_padding_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-799"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<rsa_st, keymaster::OpenSslObjectDeleter<rsa_st, &RSA_free> >",
   "name" : "keymaster::UniquePtr<rsa_st, keymaster::OpenSslObjectDeleter<rsa_st, &RSA_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-851",
   "self_type" : "type-851",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-852", "type-379" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI6rsa_stNS_20OpenSslObjectDeleterIS1_XadL_Z8RSA_freeEEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<rsa_st, keymaster::RsaKey::RSA_Delete>",
   "name" : "keymaster::UniquePtr<rsa_st, keymaster::RsaKey::RSA_Delete>",
   "record_kind" : "class",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-560", "type-561" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI6rsa_stNS_6RsaKey10RSA_DeleteEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-123"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<unsigned char [], keymaster::DefaultDelete<unsigned char []> >",
   "name" : "keymaster::UniquePtr<unsigned char [], keymaster::DefaultDelete<unsigned char []> >",
   "record_kind" : "class",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-82", "type-81" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_hNS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 64,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "input",
     "field_offset" : 128,
     "referenced_type" : "type-190"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 288,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::UpdateOperationRequest",
   "name" : "keymaster::UpdateOperationRequest",
   "referenced_type" : "type-1965",
   "self_type" : "type-1965",
   "size" : 76,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22UpdateOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22UpdateOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22UpdateOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22UpdateOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "output",
     "field_offset" : 96,
     "referenced_type" : "type-190"
    },
    {
     "field_name" : "input_consumed",
     "field_offset" : 256,
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 288,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::UpdateOperationResponse",
   "name" : "keymaster::UpdateOperationResponse",
   "referenced_type" : "type-1967",
   "self_type" : "type-1967",
   "size" : 76,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23UpdateOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23UpdateOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23UpdateOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23UpdateOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-2032"
    },
    {
     "field_name" : "upgrade_params",
     "field_offset" : 128,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "keymaster::UpgradeKeyRequest",
   "name" : "keymaster::UpgradeKeyRequest",
   "referenced_type" : "type-2031",
   "self_type" : "type-2031",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17UpgradeKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17UpgradeKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17UpgradeKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17UpgradeKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "upgraded_key",
     "field_offset" : 96,
     "referenced_type" : "type-2035"
    }
   ],
   "linker_set_key" : "keymaster::UpgradeKeyResponse",
   "name" : "keymaster::UpgradeKeyResponse",
   "referenced_type" : "type-2034",
   "self_type" : "type-2034",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18UpgradeKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18UpgradeKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18UpgradeKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18UpgradeKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-125"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 32,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 96,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "parameters_verified",
     "field_offset" : 160,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "security_level",
     "field_offset" : 480,
     "referenced_type" : "type-2071"
    },
    {
     "field_name" : "mac",
     "field_offset" : 512,
     "referenced_type" : "type-872"
    }
   ],
   "linker_set_key" : "keymaster::VerificationToken",
   "name" : "keymaster::VerificationToken",
   "referenced_type" : "type-2070",
   "self_type" : "type-2070",
   "size" : 72,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17VerificationTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17VerificationTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17VerificationTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17VerificationTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17VerificationToken14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17VerificationToken9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17VerificationToken11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-978"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 64,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "parameters_to_verify",
     "field_offset" : 128,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "auth_token",
     "field_offset" : 448,
     "referenced_type" : "type-2066"
    }
   ],
   "linker_set_key" : "keymaster::VerifyAuthorizationRequest",
   "name" : "keymaster::VerifyAuthorizationRequest",
   "referenced_type" : "type-2076",
   "self_type" : "type-2076",
   "size" : 104,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26VerifyAuthorizationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26VerifyAuthorizationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26VerifyAuthorizationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26VerifyAuthorizationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "error",
     "field_offset" : 96,
     "referenced_type" : "type-2082"
    },
    {
     "field_name" : "token",
     "field_offset" : 128,
     "referenced_type" : "type-2070"
    }
   ],
   "linker_set_key" : "keymaster::VerifyAuthorizationResponse",
   "name" : "keymaster::VerifyAuthorizationResponse",
   "referenced_type" : "type-2081",
   "self_type" : "type-2081",
   "size" : 88,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27VerifyAuthorizationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27VerifyAuthorizationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27VerifyAuthorizationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27VerifyAuthorizationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Void",
   "name" : "keymaster::Void",
   "record_kind" : "class",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster4VoidE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "purpose",
     "referenced_type" : "type-1609"
    },
    {
     "field_name" : "algorithm",
     "field_offset" : 32,
     "referenced_type" : "type-1611"
    },
    {
     "field_name" : "key_size",
     "field_offset" : 64,
     "referenced_type" : "type-1611"
    },
    {
     "field_name" : "block_mode",
     "field_offset" : 96,
     "referenced_type" : "type-1609"
    },
    {
     "field_name" : "digest",
     "field_offset" : 128,
     "referenced_type" : "type-1609"
    },
    {
     "field_name" : "padding",
     "field_offset" : 160,
     "referenced_type" : "type-1609"
    },
    {
     "field_name" : "caller_nonce",
     "field_offset" : 192,
     "referenced_type" : "type-1613"
    },
    {
