{
 "array_types" :
 [
  {
   "alignment" : 2,
   "linker_set_key" : "short [16]",
   "name" : "short [16]",
   "referenced_type" : "type-14",
   "self_type" : "type-18",
   "size" : 32,
   "source_file" : "/external/libyuv/files/include/libyuv/row.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "signed char [32]",
   "name" : "signed char [32]",
   "referenced_type" : "type-11",
   "self_type" : "type-12",
   "size" : 32,
   "source_file" : "/external/libyuv/files/include/libyuv/row.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [256]",
   "name" : "unsigned int [256]",
   "referenced_type" : "type-1",
   "self_type" : "type-35",
   "size" : 1024,
   "source_file" : "/external/libyuv/files/include/libyuv/row.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "double",
   "name" : "double",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float",
   "name" : "float",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 4
  },
  {
   "alignment" : 2,
   "is_integral" : true,

   "linker_set_key" : "libyuv::SetJmpErrorMgr *",
   "name" : "libyuv::SetJmpErrorMgr *",
   "referenced_type" : "type-70",
   "self_type" : "type-69",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "libyuv::SetJmpErrorMgr *",
   "name" : "libyuv::SetJmpErrorMgr *",
   "referenced_type" : "type-82",
   "self_type" : "type-81",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "libyuv::SetJmpErrorMgr *",
   "name" : "libyuv::SetJmpErrorMgr *",
   "referenced_type" : "type-99",
   "self_type" : "type-98",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned char *",
   "name" : "unsigned char *",
   "referenced_type" : "type-6",
   "self_type" : "type-16",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/convert.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned char **",
   "name" : "unsigned char **",
   "referenced_type" : "type-16",
   "self_type" : "type-30",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned char ***",
   "name" : "unsigned char ***",
   "referenced_type" : "type-30",
   "self_type" : "type-29",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int *",
   "name" : "unsigned int *",
   "referenced_type" : "type-1",
   "self_type" : "type-41",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/cpu_id.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned short *",
   "name" : "unsigned short *",
   "referenced_type" : "type-44",
   "self_type" : "type-45",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/planar_functions.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void (*)(const unsigned char *, const unsigned char *, unsigned char *, int)",
   "name" : "void (*)(const unsigned char *, const unsigned char *, unsigned char *, int)",
   "referenced_type" : "type-52",
   "self_type" : "type-51",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/planar_functions.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void (*)(void *, const unsigned char *const *, const int *, int)",
   "name" : "void (*)(void *, const unsigned char *const *, const int *, int)",
   "referenced_type" : "type-243",
   "self_type" : "type-247",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-40",
   "self_type" : "type-244",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-38",
   "self_type" : "type-37",
   "size" : 1,
   "source_file" : "/external/libyuv/files/include/libyuv/cpu_id.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const float",
   "name" : "const float",
   "referenced_type" : "type-49",
   "self_type" : "type-48",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/planar_functions.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-3",
   "self_type" : "type-9",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/compare.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const libyuv::YuvConstants",
   "name" : "const libyuv::YuvConstants",
   "referenced_type" : "type-33",
   "self_type" : "type-32",
   "size" : 224,
   "source_file" : "/external/libyuv/files/include/libyuv/row.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const signed char",
   "name" : "const signed char",
   "referenced_type" : "type-11",
   "self_type" : "type-46",
   "size" : 1,
   "source_file" : "/external/libyuv/files/include/libyuv/planar_functions.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-6",
   "self_type" : "type-5",
   "size" : 1,
   "source_file" : "/external/libyuv/files/include/libyuv/compare.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned char *const",
   "name" : "const unsigned char *const",
   "referenced_type" : "type-7",
   "self_type" : "type-246",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-1",
   "self_type" : "type-34",
   "size" : 4,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-44",
   "self_type" : "type-43",
   "size" : 2,
   "source_file" : "/external/libyuv/files/include/libyuv/planar_functions.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "unsigned int const[256]",
   "name" : "unsigned int const[256]",
   "referenced_type" : "type-35",
   "self_type" : "type-36",
   "size" : 1024,
   "source_file" : "/external/libyuv/files/include/libyuv/row.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "libyuv::Buffer",
   "name" : "libyuv::Buffer",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 8,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h",
   "unique_id" : "_ZTSN6libyuv6BufferE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffers",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pos",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "libyuv::BufferVector",
   "name" : "libyuv::BufferVector",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 12,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h",
   "unique_id" : "_ZTSN6libyuv12BufferVectorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buf_",
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "buf_vec_",
     "field_offset" : 64,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "decompress_struct_",
     "field_offset" : 160,
     "referenced_type" : "type-23"
    },
    {
     "access" : "private",
     "field_name" : "source_mgr_",
     "field_offset" : 192,
     "referenced_type" : "type-25"
    },
    {
     "access" : "private",
     "field_name" : "error_mgr_",
     "field_offset" : 224,
     "referenced_type" : "type-27"
    },
    {
     "access" : "private",
     "field_name" : "has_scanline_padding_",
     "field_offset" : 256,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "num_outbufs_",
     "field_offset" : 288,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "scanlines_",
     "field_offset" : 320,
     "referenced_type" : "type-29"
    },
    {
     "access" : "private",
     "field_name" : "scanlines_sizes_",
     "field_offset" : 352,
     "referenced_type" : "type-31"
    },
    {
     "access" : "private",
     "field_name" : "databuf_",
     "field_offset" : 384,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "databuf_strides_",
     "field_offset" : 416,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "libyuv::MJpegDecoder",
   "name" : "libyuv::MJpegDecoder",
   "record_kind" : "class",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 56,
   "source_file" : "/external/libyuv/files/include/libyuv/mjpeg_decoder.h",
   "unique_id" : "_ZTSN6libyuv12MJpegDecoderE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "kUVToB",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "kUVToG",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "kUVToR",
     "field_offset" : 512,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "kUVBiasB",
     "field_offset" : 768,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "kUVBiasG",
     "field_offset" : 1024,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "kUVBiasR",
     "field_offset" : 1280,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "kYToRgb",
     "field_offset" : 1536,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "libyuv::YuvConstants",
   "name" : "libyuv::YuvConstants",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 224,
   "source_file" : "/external/libyuv/files/include/libyuv/row.h",
   "unique_id" : "libyuv::YuvConstants"
  }
 ],
 "rvalue_reference_types" : []
}
