{
 "array_types" :
 [
  {
   "alignment" : 2,
   "linker_set_key" : "_fpreg [8]",
   "name" : "_fpreg [8]",
   "referenced_type" : "type-362",
   "self_type" : "type-369",
   "size" : 80,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_fpxreg [8]",
   "name" : "_fpxreg [8]",
   "referenced_type" : "type-364",
   "self_type" : "type-371",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_libc_fpxreg [8]",
   "name" : "_libc_fpxreg [8]",
   "referenced_type" : "type-453",
   "self_type" : "type-456",
   "size" : 128,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_libc_xmmreg [16]",
   "name" : "_libc_xmmreg [16]",
   "referenced_type" : "type-454",
   "self_type" : "type-457",
   "size" : 256,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_xmmreg [8]",
   "name" : "_xmmreg [8]",
   "referenced_type" : "type-366",
   "self_type" : "type-372",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::hidl::base::V1_0::DebugInfo::Architecture [3]",

   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-60",
   "self_type" : "type-321",
   "size" : 4,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-12",
   "self_type" : "type-38",
   "size" : 8,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-152",
   "self_type" : "type-319",
   "size" : 8,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-144",
   "self_type" : "type-1800",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-25",
   "self_type" : "type-24",
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const void *const",
   "name" : "const void *const",
   "referenced_type" : "type-23",
   "self_type" : "type-26",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const wchar_t",
   "name" : "const wchar_t",
   "referenced_type" : "type-140",
   "self_type" : "type-1024",
   "size" : 4,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const wchar_t *const",
   "name" : "const wchar_t *const",
   "referenced_type" : "type-1050",
   "self_type" : "type-3010",
   "size" : 8,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "void (*const)(void *)",
   "name" : "void (*const)(void *)",
   "referenced_type" : "type-116",
   "self_type" : "type-962",
   "size" : 8,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-267",
   "self_type" : "type-269",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "void *(*const)(const void *)",
   "name" : "void *(*const)(const void *)",
   "referenced_type" : "type-960",
   "self_type" : "type-959",
   "size" : 8,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned long, const void *)",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "type-261",
   "self_type" : "type-263",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "type-271",
   "self_type" : "type-273",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned long, const void *)",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "type-264",
   "self_type" : "type-266",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-28",
   "self_type" : "type-27",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/string.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile std::atomic_flag",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "type-654",
   "self_type" : "type-656",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-469"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-3303",
   "self_type" : "type-3303",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-3305"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-3304",
   "self_type" : "type-3304",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-357"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-358",
   "self_type" : "type-358",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-359",
   "self_type" : "type-359",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-403"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "type-405"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-402",
   "self_type" : "type-402",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-357",
   "self_type" : "type-357",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "type-1381"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 64,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 128,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "type-1380",
   "self_type" : "type-1380",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/pthread.h",
   "unique_id" : "__pthread_cleanup_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "type-410"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-411"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-412"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-413"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-414"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-419"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-420"
    }
   ],
   "linker_set_key" : "__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "type-409",
   "self_type" : "type-409",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS10__sifields"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-60"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "referenced_type" : "type-410",
   "self_type" : "type-410",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-408"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "type-44"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-408"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "referenced_type" : "type-412",
   "self_type" : "type-412",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt1_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "type-148"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt2_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-28"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-415"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "referenced_type" : "type-414",
   "self_type" : "type-414",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-416"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-418"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "record_kind" : "union",
   "referenced_type" : "type-415",
   "self_type" : "type-415",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-417"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "type-28"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "referenced_type" : "type-416",
   "self_type" : "type-416",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-417"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "referenced_type" : "type-418",
   "self_type" : "type-418",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt4_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "type-60"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "referenced_type" : "type-420",
   "self_type" : "type-420",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt5_E"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-363"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "_fpreg",
   "name" : "_fpreg",
   "referenced_type" : "type-362",
   "self_type" : "type-362",
   "size" : 10,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS6_fpreg"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cw",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "sw",
     "field_offset" : 32,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "ipoff",
     "field_offset" : 96,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "cssel",
     "field_offset" : 128,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "dataoff",
     "field_offset" : 160,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "datasel",
     "field_offset" : 192,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "_st",
     "field_offset" : 224,
     "referenced_type" : "type-369"
    },
    {
     "field_name" : "status",
     "field_offset" : 864,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "magic",
     "field_offset" : 880,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "_fxsr_env",
     "field_offset" : 896,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 1088,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 1120,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "_fxsr_st",
     "field_offset" : 1152,
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "_xmm",
     "field_offset" : 2176,
     "referenced_type" : "type-372"
    },
    {
     "field_offset" : 3200,
     "referenced_type" : "type-373"
    },
    {
     "field_offset" : 4608,
     "referenced_type" : "type-375"
    }
   ],
   "linker_set_key" : "_fpstate_32",
   "name" : "_fpstate_32",
   "referenced_type" : "type-368",
   "self_type" : "type-368",
   "size" : 624,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_fpstate_32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding1",
     "referenced_type" : "type-374"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "type-374"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "record_kind" : "union",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 176,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_32Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "padding2",
     "referenced_type" : "type-376"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-360"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "record_kind" : "union",
   "referenced_type" : "type-375",
   "self_type" : "type-375",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_32Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "twd",
     "field_offset" : 32,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "rip",
     "field_offset" : 64,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rdp",
     "field_offset" : 128,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "mxcsr_mask",
     "field_offset" : 224,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 256,
     "referenced_type" : "type-382"
    },
    {
     "field_name" : "xmm_space",
     "field_offset" : 1280,
     "referenced_type" : "type-383"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 3328,
     "referenced_type" : "type-376"
    },
    {
     "field_offset" : 3712,
     "referenced_type" : "type-384"
    }
   ],
   "linker_set_key" : "_fpstate_64",
   "name" : "_fpstate_64",
   "referenced_type" : "type-381",
   "self_type" : "type-381",
   "size" : 512,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_fpstate_64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved3",
     "referenced_type" : "type-376"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-360"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "name" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "record_kind" : "union",
   "referenced_type" : "type-384",
   "self_type" : "type-384",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_64Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "magic1",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "extended_size",
     "field_offset" : 32,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "xfeatures",
     "field_offset" : 64,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "xstate_size",
     "field_offset" : 128,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "padding",
     "field_offset" : 160,
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "_fpx_sw_bytes",
   "name" : "_fpx_sw_bytes",
   "referenced_type" : "type-360",
   "self_type" : "type-360",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13_fpx_sw_bytes"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-363"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "padding",
     "field_offset" : 80,
     "referenced_type" : "type-365"
    }
   ],
   "linker_set_key" : "_fpxreg",
   "name" : "_fpxreg",
   "referenced_type" : "type-364",
   "self_type" : "type-364",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_fpxreg"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "xfeatures",
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-386"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 192,
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_header",
   "name" : "_header",
   "referenced_type" : "type-385",
   "self_type" : "type-385",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_header"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "ftw",
     "field_offset" : 32,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "rip",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "rdp",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "mxcr_mask",
     "field_offset" : 224,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "_st",
     "field_offset" : 256,
     "referenced_type" : "type-456"
    },
    {
     "field_name" : "_xmm",
     "field_offset" : 1280,
     "referenced_type" : "type-457"
    },
    {
     "field_name" : "padding",
     "field_offset" : 3328,
     "referenced_type" : "type-446"
    }
   ],
   "linker_set_key" : "_libc_fpstate",
   "name" : "_libc_fpstate",
   "referenced_type" : "type-455",
   "self_type" : "type-455",
   "size" : 512,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "_libc_fpstate"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-363"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "padding",
     "field_offset" : 80,
     "referenced_type" : "type-365"
    }
   ],
   "linker_set_key" : "_libc_fpxreg",
   "name" : "_libc_fpxreg",
   "referenced_type" : "type-453",
   "self_type" : "type-453",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "_libc_fpxreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "element",
     "referenced_type" : "type-367"
    }
   ],
   "linker_set_key" : "_libc_xmmreg",
   "name" : "_libc_xmmreg",
   "referenced_type" : "type-454",
   "self_type" : "type-454",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "_libc_xmmreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "element",
     "referenced_type" : "type-367"
    }
   ],
   "linker_set_key" : "_xmmreg",
   "name" : "_xmmreg",
   "referenced_type" : "type-366",
   "self_type" : "type-366",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_xmmreg"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpstate",
     "referenced_type" : "type-381"
    },
    {
     "field_name" : "xstate_hdr",
     "field_offset" : 4096,
     "referenced_type" : "type-385"
    },
    {
     "field_name" : "ymmh",
     "field_offset" : 4608,
     "referenced_type" : "type-393"
    }
   ],
   "linker_set_key" : "_xstate",
   "name" : "_xstate",
   "referenced_type" : "type-394",
   "self_type" : "type-394",
   "size" : 832,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_xstate"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ymmh_space",
     "referenced_type" : "type-383"
    }
   ],
   "linker_set_key" : "_ymmh_state",
   "name" : "_ymmh_state",
   "referenced_type" : "type-393",
   "self_type" : "type-393",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_ymmh_state"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-1720",
   "self_type" : "type-1720",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-1721" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1716",
   "self_type" : "type-1716",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-1717" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1720"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "type-1117"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-1721",
   "self_type" : "type-1721",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-1248"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-1247",
   "self_type" : "type-1247",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-1813",
   "self_type" : "type-1813",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-1818",
   "self_type" : "type-1818",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-1810",
   "self_type" : "type-1810",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1716"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-1717",
   "self_type" : "type-1717",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-1655"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-1247"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-1828",
   "self_type" : "type-1828",
   "size" : 64,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1679"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-1650"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hidl::memory::V1_0::IMemory> >",
   "name" : "android::hardware::Return<android::sp<android::hidl::memory::V1_0::IMemory> >",
   "record_kind" : "class",
   "referenced_type" : "type-1678",
   "self_type" : "type-1678",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-1650" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS_4hidl6memory4V1_07IMemoryEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1679"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::hardware::Return<unsigned long>",
   "name" : "android::hardware::Return<unsigned long>",
   "record_kind" : "class",
   "referenced_type" : "type-2695",
   "self_type" : "type-2695",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnImEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1679"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void *>",
   "name" : "android::hardware::Return<void *>",
   "record_kind" : "class",
   "referenced_type" : "type-2690",
   "self_type" : "type-2690",
   "size" : 48,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-28" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIPvEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1679"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-1688",
   "self_type" : "type-1688",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-502"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-1671",
   "self_type" : "type-1671",
   "size" : 32,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 64,
     "referenced_type" : "type-571"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 320,
     "referenced_type" : "type-502"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 512,
     "referenced_type" : "type-502"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-1120",
   "self_type" : "type-1120",
   "size" : 88,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-1108",
   "self_type" : "type-1108",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-1109",
   "self_type" : "type-1109",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-1110",
   "self_type" : "type-1110",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-585"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1112",
   "self_type" : "type-1112",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1112"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-1111",
   "self_type" : "type-1111",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1183"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-1182",
   "self_type" : "type-1182",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1183",
   "self_type" : "type-1183",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1658"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-1657",
   "self_type" : "type-1657",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-1128" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-1127"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1658",
   "self_type" : "type-1658",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1116"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "type-1115",
   "self_type" : "type-1115",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-1118" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-1117"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-1116",
   "self_type" : "type-1116",
   "size" : 8,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-1107",
   "self_type" : "type-1107",
   "size" : 1,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-1671"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-1679",
   "self_type" : "type-1679",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-1247"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_death_recipient",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "type-1246",
   "self_type" : "type-1246",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware20hidl_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEmRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-1657"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_handle",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "type-1656",
   "self_type" : "type-1656",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_handleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-1656"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "type-1181"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_memory",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "type-1655",
   "self_type" : "type-1655",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_memoryE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1182"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_string",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "type-1181",
   "self_type" : "type-1181",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_stringE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-1111"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-1832",
   "self_type" : "type-1832",
   "size" : 16,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-59" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "type-144"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_version",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "type-1833",
   "self_type" : "type-1833",
   "size" : 4,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware12hidl_versionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::DebugInfo",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "type-1846",
   "self_type" : "type-1846",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_09DebugInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-1247"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::IBase",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "type-1640",
   "self_type" : "type-1640",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_05IBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1640"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceNotification",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "type-1645",
   "self_type" : "type-1645",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_020IServiceNotificationE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1640"
    }
   ],
   "linker_set_key" : "android::hidl::memory::V1_0::IMapper",
   "name" : "android::hidl::memory::V1_0::IMapper",
   "referenced_type" : "type-1665",
   "self_type" : "type-1665",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/memory/1.0/android.hidl.memory@1.0_genc++_headers/gen/android/hidl/memory/1.0/IMapper.h",
   "unique_id" : "_ZTSN7android4hidl6memory4V1_07IMapperE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_07IMapperE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl6memory4V1_07IMapper8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapperD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper9mapMemoryERKNS_8hardware11hidl_memoryE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_07IMapperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl6memory4V1_07IMapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl6memory4V1_07IMapperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1640"
    }
   ],
   "linker_set_key" : "android::hidl::memory::V1_0::IMemory",
   "name" : "android::hidl::memory::V1_0::IMemory",
   "referenced_type" : "type-1652",
   "self_type" : "type-1652",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/system/libhidl/transport/memory/1.0/android.hidl.memory@1.0_genc++_headers/gen/android/hidl/memory/1.0/IMemory.h",
   "unique_id" : "_ZTSN7android4hidl6memory4V1_07IMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_07IMemoryE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl6memory4V1_07IMemory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory11updateRangeEmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory4readEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory9readRangeEmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory6commitEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory10getPointerEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory7getSizeEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_07IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl6memory4V1_07IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl6memory4V1_07IMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1665"
    }
   ],
   "linker_set_key" : "android::hidl::memory::V1_0::implementation::AshmemMapper",
   "name" : "android::hidl::memory::V1_0::implementation::AshmemMapper",
   "referenced_type" : "type-1863",
   "self_type" : "type-1863",
   "size" : 24,
   "source_file" : "/system/libhidl/transport/memory/1.0/default/AshmemMapper.h",
   "unique_id" : "_ZTSN7android4hidl6memory4V1_014implementation12AshmemMapperE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMapperE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl6memory4V1_07IMapper8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMapper13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMapperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMapper9mapMemoryERKNS_8hardware11hidl_memoryE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMapperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl6memory4V1_014implementation12AshmemMapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl6memory4V1_014implementation12AshmemMapperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1652"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMemory",
     "field_offset" : 64,
     "referenced_type" : "type-1655"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 384,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "android::hidl::memory::V1_0::implementation::AshmemMemory",
   "name" : "android::hidl::memory::V1_0::implementation::AshmemMemory",
   "referenced_type" : "type-1654",
   "self_type" : "type-1654",
   "size" : 72,
   "source_file" : "/system/libhidl/transport/memory/1.0/default/AshmemMemory.h",
   "unique_id" : "_ZTSN7android4hidl6memory4V1_014implementation12AshmemMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 56,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMemoryE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl6memory4V1_07IMemory8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_07IMemory13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory6updateEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory11updateRangeEmm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory4readEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory9readRangeEmm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory6commitEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory10getPointerEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl6memory4V1_014implementation12AshmemMemory7getSizeEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl6memory4V1_014implementation12AshmemMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl6memory4V1_014implementation12AshmemMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl6memory4V1_014implementation12AshmemMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1245"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-1635",
   "self_type" : "type-1635",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1246" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1639"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::base::V1_0::IBase>",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1638",
   "self_type" : "type-1638",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1640" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl4base4V1_05IBaseEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1644"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "type-1643",
   "self_type" : "type-1643",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1645" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1664"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::memory::V1_0::IMapper>",
   "name" : "android::sp<android::hidl::memory::V1_0::IMapper>",
   "record_kind" : "class",
   "referenced_type" : "type-1663",
   "self_type" : "type-1663",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1665" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl6memory4V1_07IMapperEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-1651"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::memory::V1_0::IMemory>",
   "name" : "android::sp<android::hidl::memory::V1_0::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "type-1650",
   "self_type" : "type-1650",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-1652" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl6memory4V1_07IMemoryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-1731",
   "self_type" : "type-1731",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-1735",
   "self_type" : "type-1735",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-1789",
   "self_type" : "type-1789",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-159" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-1785",
   "self_type" : "type-1785",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-157" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-1755",
   "self_type" : "type-1755",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-1774",
   "self_type" : "type-1774",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-1764",
   "self_type" : "type-1764",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-148" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-1745",
   "self_type" : "type-1745",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-1740",
   "self_type" : "type-1740",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-1759",
   "self_type" : "type-1759",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-60" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-1780",
   "self_type" : "type-1780",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-152" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-1769",
   "self_type" : "type-1769",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-1749",
   "self_type" : "type-1749",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-1725",
   "self_type" : "type-1725",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-1727",
   "self_type" : "type-1727",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-1733",
   "self_type" : "type-1733",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-1787",
   "self_type" : "type-1787",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-159" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-1782",
   "self_type" : "type-1782",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-157" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-1752",
   "self_type" : "type-1752",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-1771",
   "self_type" : "type-1771",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-1762",
   "self_type" : "type-1762",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-148" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-1743",
   "self_type" : "type-1743",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-1737",
   "self_type" : "type-1737",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-1757",
   "self_type" : "type-1757",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-60" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-1776",
   "self_type" : "type-1776",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-152" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-1767",
   "self_type" : "type-1767",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-1747",
   "self_type" : "type-1747",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-1723",
   "self_type" : "type-1723",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-1729",
   "self_type" : "type-1729",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-1734",
   "self_type" : "type-1734",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-1788",
   "self_type" : "type-1788",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-159" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-1784",
   "self_type" : "type-1784",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-157" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-1753",
   "self_type" : "type-1753",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-1773",
   "self_type" : "type-1773",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-1763",
   "self_type" : "type-1763",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-148" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-1744",
   "self_type" : "type-1744",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-1738",
   "self_type" : "type-1738",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-1758",
   "self_type" : "type-1758",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-60" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-1777",
   "self_type" : "type-1777",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-152" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-1768",
   "self_type" : "type-1768",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-1748",
   "self_type" : "type-1748",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-1724",
   "self_type" : "type-1724",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-1732",
   "self_type" : "type-1732",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-1736",
   "self_type" : "type-1736",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-1790",
   "self_type" : "type-1790",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-159" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-1786",
   "self_type" : "type-1786",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-157" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-1756",
   "self_type" : "type-1756",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-1775",
   "self_type" : "type-1775",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-1765",
   "self_type" : "type-1765",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-148" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-1746",
   "self_type" : "type-1746",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-1741",
   "self_type" : "type-1741",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-1760",
   "self_type" : "type-1760",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-60" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-1781",
   "self_type" : "type-1781",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-152" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-1770",
   "self_type" : "type-1770",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-1751",
   "self_type" : "type-1751",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-1726",
   "self_type" : "type-1726",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-469"
    }
   ],
   "linker_set_key" : "cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "type-1379",
   "self_type" : "type-1379",
   "size" : 128,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/sched.h",
   "unique_id" : "cpu_set_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "type-1021"
    }
   ],
   "linker_set_key" : "dirent",
   "name" : "dirent",
   "referenced_type" : "type-1020",
   "self_type" : "type-1020",
   "size" : 280,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/dirent.h",
   "unique_id" : "dirent"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "type-1021"
    }
   ],
   "linker_set_key" : "dirent64",
   "name" : "dirent64",
   "referenced_type" : "type-1022",
   "self_type" : "type-1022",
   "size" : 280,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/dirent.h",
   "unique_id" : "dirent64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "f_owner_ex",
   "name" : "f_owner_ex",
   "referenced_type" : "type-1868",
   "self_type" : "type-1868",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "_ZTS10f_owner_ex"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-469"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-468",
   "self_type" : "type-468",
   "size" : 128,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "flock",
   "name" : "flock",
   "referenced_type" : "type-1869",
   "self_type" : "type-1869",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "_ZTS5flock"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "flock64",
   "name" : "flock64",
   "referenced_type" : "type-1870",
   "self_type" : "type-1870",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "_ZTS7flock64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-1865",
   "self_type" : "type-1865",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/inttypes.h",
   "unique_id" : "_ZTS9imaxdiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "iovec",
   "name" : "iovec",
   "referenced_type" : "type-1876",
   "self_type" : "type-1876",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/uio.h",
   "unique_id" : "_ZTS5iovec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-350"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-350"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-353",
   "self_type" : "type-353",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-351"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-351"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-354",
   "self_type" : "type-354",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "decimal_point",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "int_curr_symbol",
     "field_offset" : 192,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "currency_symbol",
     "field_offset" : 256,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "mon_decimal_point",
     "field_offset" : 320,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "mon_thousands_sep",
     "field_offset" : 384,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "mon_grouping",
     "field_offset" : 448,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "positive_sign",
     "field_offset" : 512,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "negative_sign",
     "field_offset" : 576,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "int_frac_digits",
     "field_offset" : 640,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "frac_digits",
     "field_offset" : 648,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "p_cs_precedes",
     "field_offset" : 656,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "p_sep_by_space",
     "field_offset" : 664,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "n_cs_precedes",
     "field_offset" : 672,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "n_sep_by_space",
     "field_offset" : 680,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "p_sign_posn",
     "field_offset" : 688,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "n_sign_posn",
     "field_offset" : 696,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "int_p_cs_precedes",
     "field_offset" : 704,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "int_p_sep_by_space",
     "field_offset" : 712,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "int_n_cs_precedes",
     "field_offset" : 720,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "int_n_sep_by_space",
     "field_offset" : 728,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "int_p_sign_posn",
     "field_offset" : 736,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "int_n_sign_posn",
     "field_offset" : 744,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "lconv",
   "name" : "lconv",
   "referenced_type" : "type-1414",
   "self_type" : "type-1414",
   "size" : 96,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/locale.h",
   "unique_id" : "lconv"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-275",
   "self_type" : "type-275",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-276",
   "self_type" : "type-276",
   "size" : 16,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1884"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-1883",
   "self_type" : "type-1883",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-1885"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-1882"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-1882"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-1881"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-1880"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-1878"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-1884",
   "self_type" : "type-1884",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-1877",
   "self_type" : "type-1877",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-1879"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-1878",
   "self_type" : "type-1878",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-1879"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-1880",
   "self_type" : "type-1880",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-1879"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-1881",
   "self_type" : "type-1881",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-1879"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-1882",
   "self_type" : "type-1882",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 80,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.1/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-475"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "type-475"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-474",
   "self_type" : "type-474",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "gregs",
     "referenced_type" : "type-459"
    },
    {
     "field_name" : "fpregs",
     "field_offset" : 1472,
     "referenced_type" : "type-460"
    },
    {
     "field_name" : "__reserved1",
     "field_offset" : 1536,
     "referenced_type" : "type-452"
    }
   ],
   "linker_set_key" : "mcontext_t",
   "name" : "mcontext_t",
   "referenced_type" : "type-458",
   "self_type" : "type-458",
   "size" : 256,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/sys/ucontext.h",
   "unique_id" : "mcontext_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-1119"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-1118",
   "self_type" : "type-1118",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "type-957"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-3306",
   "self_type" : "type-3306",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-3309"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-3308",
   "self_type" : "type-3308",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS17pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-432"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-1386",
   "self_type" : "type-1386",
   "size" : 48,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1384"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-1383",
   "self_type" : "type-1383",
   "size" : 40,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-3311"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-3310",
   "self_type" : "type-3310",
   "size" : 56,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-3312",
   "self_type" : "type-3312",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/pthread_types.h",
   "unique_id" : "_ZTS18pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "sched_param",
   "name" : "sched_param",
   "referenced_type" : "type-1378",
   "self_type" : "type-1378",
   "size" : 4,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/sched.h",
   "unique_id" : "sched_param"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "type-44"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-437"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "type-405"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-436",
   "self_type" : "type-436",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "type-44"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "type-405"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-443",
   "self_type" : "type-443",
   "size" : 32,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-403"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-438"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:80:22) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:80:22 <Spelling=out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:72:3>",
   "name" : "sigaction64::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:80:22) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:80:22 <Spelling=out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:72:3>",
   "record_kind" : "union",
   "referenced_type" : "type-444",
   "self_type" : "type-444",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-403"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-438"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:79:20) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:79:20 <Spelling=out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:72:3>",
   "name" : "sigaction::(anonymous union at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:79:20) at out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:79:20 <Spelling=out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h:72:3>",
   "record_kind" : "union",
   "referenced_type" : "type-437",
   "self_type" : "type-437",
   "size" : 8,
   "source_file" : "/out/soong/.intermediates/bionic/libc/libc.llndk/android_x86_64_vendor_shared/gen/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r8",
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r9",
     "field_offset" : 64,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r10",
     "field_offset" : 128,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r11",
     "field_offset" : 192,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r12",
     "field_offset" : 256,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r13",
     "field_offset" : 320,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r14",
     "field_offset" : 384,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r15",
     "field_offset" : 448,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rdi",
     "field_offset" : 512,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rsi",
     "field_offset" : 576,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rbp",
     "field_offset" : 640,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rbx",
     "field_offset" : 704,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rdx",
     "field_offset" : 768,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rax",
     "field_offset" : 832,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rcx",
     "field_offset" : 896,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rsp",
     "field_offset" : 960,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "rip",
     "field_offset" : 1024,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 1088,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "cs",
     "field_offset" : 1152,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "gs",
     "field_offset" : 1168,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "fs",
     "field_offset" : 1184,
     "referenced_type" : "type-144"
    },
    {
     "field_offset" : 1200,
     "referenced_type" : "type-399"
    },
    {
     "field_name" : "err",
     "field_offset" : 1216,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 1280,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 1344,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 1408,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 1472,
     "referenced_type" : "type-400"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 1536,
     "referenced_type" : "type-397"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "ss",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "__pad0",
     "referenced_type" : "type-144"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigcontext::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:210:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:210:3",
   "name" : "sigcontext::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:210:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:210:3",
   "record_kind" : "union",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 2,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN10sigcontextUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gs",
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "__gsh",
     "field_offset" : 16,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "fs",
     "field_offset" : 32,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "__fsh",
     "field_offset" : 48,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "es",
     "field_offset" : 64,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "__esh",
     "field_offset" : 80,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "ds",
     "field_offset" : 96,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "__dsh",
     "field_offset" : 112,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "di",
     "field_offset" : 128,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "si",
     "field_offset" : 160,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "bp",
     "field_offset" : 192,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "sp",
     "field_offset" : 224,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "bx",
     "field_offset" : 256,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "dx",
     "field_offset" : 288,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "cx",
     "field_offset" : 320,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "ax",
     "field_offset" : 352,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 384,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "err",
     "field_offset" : 416,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "ip",
     "field_offset" : 448,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "cs",
     "field_offset" : 480,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "__csh",
     "field_offset" : 496,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "flags",
     "field_offset" : 512,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "sp_at_signal",
     "field_offset" : 544,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "ss",
     "field_offset" : 576,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "__ssh",
     "field_offset" : 592,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 608,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 640,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 672,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "sigcontext_32",
   "name" : "sigcontext_32",
   "referenced_type" : "type-395",
   "self_type" : "type-395",
   "size" : 88,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13sigcontext_32"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r8",
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r9",
     "field_offset" : 64,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r10",
     "field_offset" : 128,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r11",
     "field_offset" : 192,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r12",
     "field_offset" : 256,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r13",
     "field_offset" : 320,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r14",
     "field_offset" : 384,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "r15",
     "field_offset" : 448,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "di",
     "field_offset" : 512,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "si",
     "field_offset" : 576,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "bp",
     "field_offset" : 640,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "bx",
     "field_offset" : 704,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "dx",
     "field_offset" : 768,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "ax",
     "field_offset" : 832,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "cx",
     "field_offset" : 896,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "sp",
     "field_offset" : 960,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "ip",
     "field_offset" : 1024,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1088,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "cs",
     "field_offset" : 1152,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "gs",
     "field_offset" : 1168,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "fs",
     "field_offset" : 1184,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "ss",
     "field_offset" : 1200,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "err",
     "field_offset" : 1216,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 1280,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 1344,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 1408,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 1472,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 1536,
     "referenced_type" : "type-397"
    }
   ],
   "linker_set_key" : "sigcontext_64",
   "name" : "sigcontext_64",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13sigcontext_64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-408"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "type-431"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-430",
   "self_type" : "type-430",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-432"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-433"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3",
   "record_kind" : "union",
   "referenced_type" : "type-431",
   "self_type" : "type-431",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-434"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "type-28"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:226:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:229:5",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-422"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-421",
   "self_type" : "type-421",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-423"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "type-424"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3",
   "record_kind" : "union",
   "referenced_type" : "type-422",
   "self_type" : "type-422",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "type-409"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5 <Spelling=bionic/libc/kernel/uapi/asm-generic/siginfo.h:95:19>",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:102:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:103:5 <Spelling=bionic/libc/kernel/uapi/asm-generic/siginfo.h:95:19>",
   "referenced_type" : "type-423",
   "self_type" : "type-423",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-408",
   "self_type" : "type-408",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stx_mask",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "stx_blksize",
     "field_offset" : 32,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "stx_attributes",
     "field_offset" : 64,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "stx_nlink",
     "field_offset" : 128,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "stx_uid",
     "field_offset" : 160,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "stx_gid",
     "field_offset" : 192,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "stx_mode",
     "field_offset" : 224,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "__spare0",
     "field_offset" : 240,
     "referenced_type" : "type-1873"
    },
    {
     "field_name" : "stx_ino",
     "field_offset" : 256,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "stx_size",
     "field_offset" : 320,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "stx_blocks",
     "field_offset" : 384,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "stx_attributes_mask",
     "field_offset" : 448,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "stx_atime",
     "field_offset" : 512,
     "referenced_type" : "type-1871"
    },
    {
     "field_name" : "stx_btime",
     "field_offset" : 640,
     "referenced_type" : "type-1871"
    },
    {
     "field_name" : "stx_ctime",
     "field_offset" : 768,
     "referenced_type" : "type-1871"
    },
    {
     "field_name" : "stx_mtime",
     "field_offset" : 896,
     "referenced_type" : "type-1871"
    },
    {
     "field_name" : "stx_rdev_major",
     "field_offset" : 1024,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "stx_rdev_minor",
     "field_offset" : 1056,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "stx_dev_major",
     "field_offset" : 1088,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "stx_dev_minor",
     "field_offset" : 1120,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "__spare2",
     "field_offset" : 1152,
     "referenced_type" : "type-1874"
    }
   ],
   "linker_set_key" : "statx",
   "name" : "statx",
   "referenced_type" : "type-1872",
   "self_type" : "type-1872",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/linux/stat.h",
   "unique_id" : "_ZTS5statx"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "statx_timestamp",
   "name" : "statx_timestamp",
   "referenced_type" : "type-1871",
   "self_type" : "type-1871",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/stat.h",
   "unique_id" : "_ZTS15statx_timestamp"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::_DeallocateCaller",
   "name" : "std::_DeallocateCaller",
   "referenced_type" : "type-309",
   "self_type" : "type-309",
   "size" : 1,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSNSt3__117_DeallocateCallerE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "std::_PairT",
   "name" : "std::_PairT",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 16,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__16_PairTE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_const<unsigned long, false>",
   "name" : "std::__add_const<unsigned long, false>",
   "referenced_type" : "type-1838",
   "self_type" : "type-1838",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__111__add_constImLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<char, true>",
   "name" : "std::__add_lvalue_reference_impl<char, true>",
   "referenced_type" : "type-2683",
   "self_type" : "type-2683",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIcLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<const unsigned long, true>",
   "name" : "std::__add_lvalue_reference_impl<const unsigned long, true>",
   "referenced_type" : "type-2688",
   "self_type" : "type-2688",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIKmLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<unsigned char, true>",
   "name" : "std::__add_lvalue_reference_impl<unsigned char, true>",
   "referenced_type" : "type-2682",
   "self_type" : "type-2682",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIhLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<unsigned int, true>",
   "name" : "std::__add_lvalue_reference_impl<unsigned int, true>",
   "referenced_type" : "type-2686",
   "self_type" : "type-2686",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-60" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<unsigned long, true>",
   "name" : "std::__add_lvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "type-2687",
   "self_type" : "type-2687",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<__int128, true>",
   "name" : "std::__add_pointer_impl<__int128, true>",
   "referenced_type" : "type-2735",
   "self_type" : "type-2735",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-22" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implInLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair<char *, void (*)(void *)>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair<char *, void (*)(void *)>, true>",
   "referenced_type" : "type-2748",
   "self_type" : "type-2748",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-379" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_17__compressed_pairIPcPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair<unsigned char *, void (*)(void *)>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair<unsigned char *, void (*)(void *)>, true>",
   "referenced_type" : "type-2743",
   "self_type" : "type-2743",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-259" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_17__compressed_pairIPhPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair<unsigned int *, void (*)(void *)>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair<unsigned int *, void (*)(void *)>, true>",
   "referenced_type" : "type-2751",
   "self_type" : "type-2751",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-564" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_17__compressed_pairIPjPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<char *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<char *, 0, false>, true>",
   "referenced_type" : "type-2746",
   "self_type" : "type-2746",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-303" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "referenced_type" : "type-2764",
   "self_type" : "type-2764",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-560" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "referenced_type" : "type-2768",
   "self_type" : "type-2768",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-725" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "referenced_type" : "type-2756",
   "self_type" : "type-2756",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-230" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "referenced_type" : "type-2760",
   "self_type" : "type-2760",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-390" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-2763",
   "self_type" : "type-2763",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-488" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-2767",
   "self_type" : "type-2767",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-670" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "referenced_type" : "type-2753",
   "self_type" : "type-2753",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "referenced_type" : "type-2759",
   "self_type" : "type-2759",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-330" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "referenced_type" : "type-2736",
   "self_type" : "type-2736",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-54" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "referenced_type" : "type-2749",
   "self_type" : "type-2749",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-427" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "name" : "std::__add_pointer_impl<const std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "referenced_type" : "type-2737",
   "self_type" : "type-2737",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-114" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<const std::allocator<char>, true>",
   "name" : "std::__add_pointer_impl<const std::allocator<char>, true>",
   "referenced_type" : "type-2771",
   "self_type" : "type-2771",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-841" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIKNS_9allocatorIcEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<long double, true>",
   "name" : "std::__add_pointer_impl<long double, true>",
   "referenced_type" : "type-2734",
   "self_type" : "type-2734",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIgLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<long long, true>",
   "name" : "std::__add_pointer_impl<long long, true>",
   "referenced_type" : "type-2729",
   "self_type" : "type-2729",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<long, true>",
   "name" : "std::__add_pointer_impl<long, true>",
   "referenced_type" : "type-2733",
   "self_type" : "type-2733",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-148" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> >, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> >, true>",
   "referenced_type" : "type-2772",
   "self_type" : "type-2772",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-503" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<char *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<char *, 0, false>, true>",
   "referenced_type" : "type-2747",
   "self_type" : "type-2747",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-304" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "referenced_type" : "type-2766",
   "self_type" : "type-2766",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-537" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "referenced_type" : "type-2770",
   "self_type" : "type-2770",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "referenced_type" : "type-2758",
   "self_type" : "type-2758",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-231" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "referenced_type" : "type-2762",
   "self_type" : "type-2762",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-391" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-2765",
   "self_type" : "type-2765",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-489" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-2769",
   "self_type" : "type-2769",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-547" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "referenced_type" : "type-2757",
   "self_type" : "type-2757",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "referenced_type" : "type-2761",
   "self_type" : "type-2761",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-331" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "referenced_type" : "type-2738",
   "self_type" : "type-2738",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-55" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "referenced_type" : "type-2750",
   "self_type" : "type-2750",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-428" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "name" : "std::__add_pointer_impl<std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "referenced_type" : "type-2739",
   "self_type" : "type-2739",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-115" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__add_pointer_impl<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-2752",
   "self_type" : "type-2752",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_rvalue_reference_impl<unsigned long, true>",
   "name" : "std::__add_rvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "type-2716",
   "self_type" : "type-2716",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__127__add_rvalue_reference_implImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<double>",
   "name" : "std::__align_type<double>",
   "referenced_type" : "type-3127",
   "self_type" : "type-3127",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-159" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<int *>",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "type-3131",
   "self_type" : "type-3131",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-527" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIPiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<long double>",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "type-3128",
   "self_type" : "type-3128",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIgEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double4>",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "type-3130",
   "self_type" : "type-3130",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3115" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_16__struct_double4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double>",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "type-3129",
   "self_type" : "type-3129",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3113" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned char>",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "type-3122",
   "self_type" : "type-3122",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned int>",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "type-3124",
   "self_type" : "type-3124",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-60" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long long>",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "type-3126",
   "self_type" : "type-3126",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-152" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long>",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "type-3125",
   "self_type" : "type-3125",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__112__align_typeImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned short>",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "type-3123",
   "self_type" : "type-3123",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSNSt3__112__align_typeItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<android::hardware::GrantorDescriptor>, android::hardware::GrantorDescriptor *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<android::hardware::GrantorDescriptor>, android::hardware::GrantorDescriptor *, true>",
   "referenced_type" : "type-852",
   "self_type" : "type-852",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-589", "type-585" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorIN7android8hardware17GrantorDescriptorEEEPS4_Lb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<char16_t>, char16_t *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<char16_t>, char16_t *, true>",
   "referenced_type" : "type-847",
   "self_type" : "type-847",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-481", "type-493" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorIDsEEPDsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<char32_t>, char32_t *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<char32_t>, char32_t *, true>",
   "referenced_type" : "type-848",
   "self_type" : "type-848",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-485", "type-551" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorIDiEEPDiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<char>, char *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<char>, char *, true>",
   "referenced_type" : "type-845",
   "self_type" : "type-845",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-232", "type-13" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorIcEEPcLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, true>",
   "referenced_type" : "type-849",
   "self_type" : "type-849",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-578", "type-573" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEEPSG_Lb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__alloc_traits_difference_type<std::allocator<wchar_t>, wchar_t *, true>",
   "name" : "std::__alloc_traits_difference_type<std::allocator<wchar_t>, wchar_t *, true>",
   "referenced_type" : "type-846",
   "self_type" : "type-846",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-392", "type-335" ],
   "unique_id" : "_ZTSNSt3__130__alloc_traits_difference_typeINS_9allocatorIwEEPwLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__and_<>",
   "name" : "std::__and_<>",
   "referenced_type" : "type-1719",
   "self_type" : "type-1719",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__16__and_IJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__any",
   "name" : "std::__any",
   "referenced_type" : "type-2726",
   "self_type" : "type-2726",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__anyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, false>",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, true>",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, false>",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, true>",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, false>",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, true>",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, false>",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "type-51",
   "self_type" : "type-51",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, true>",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-640"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, false>",
   "name" : "std::__atomic_base<int, false>",
   "referenced_type" : "type-639",
   "self_type" : "type-639",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb0EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-639"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, true>",
   "name" : "std::__atomic_base<int, true>",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-645"
    }
   ],
   "linker_set_key" : "std::__atomic_base<unsigned int, false>",
   "name" : "std::__atomic_base<unsigned int, false>",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-60" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIjLb0EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-644"
    }
   ],
   "linker_set_key" : "std::__atomic_base<unsigned int, true>",
   "name" : "std::__atomic_base<unsigned int, true>",
   "referenced_type" : "type-643",
   "self_type" : "type-643",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-60" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__basic_string_common<true>",
   "name" : "std::__basic_string_common<true>",
   "record_kind" : "class",
   "referenced_type" : "type-504",
   "self_type" : "type-504",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "unique_id" : "_ZTSNSt3__121__basic_string_commonILb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__seg_",
     "referenced_type" : "type-37"
    },
    {
     "access" : "private",
     "field_name" : "__mask_",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "std::__bit_const_reference<std::__bitset<0, 0> >",
   "name" : "std::__bit_const_reference<std::__bitset<0, 0> >",
   "record_kind" : "class",
   "referenced_type" : "type-1098",
   "self_type" : "type-1098",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__bit_reference",
   "template_args" : [ "type-1091" ],
   "unique_id" : "_ZTSNSt3__121__bit_const_referenceINS_8__bitsetILm0ELm0EEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__seg_",
     "referenced_type" : "type-39"
    },
    {
     "access" : "private",
     "field_name" : "__ctz_",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "std::__bit_iterator<std::__bitset<0, 0>, false, 0>",
   "name" : "std::__bit_iterator<std::__bitset<0, 0>, false, 0>",
   "record_kind" : "class",
   "referenced_type" : "type-1090",
   "self_type" : "type-1090",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__bit_reference",
   "template_args" : [ "type-1091" ],
   "unique_id" : "_ZTSNSt3__114__bit_iteratorINS_8__bitsetILm0ELm0EEELb0ELm0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__seg_",
     "referenced_type" : "type-37"
    },
    {
     "access" : "private",
     "field_name" : "__ctz_",
     "field_offset" : 64,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "std::__bit_iterator<std::__bitset<0, 0>, true, 0>",
   "name" : "std::__bit_iterator<std::__bitset<0, 0>, true, 0>",
   "record_kind" : "class",
   "referenced_type" : "type-1095",
   "self_type" : "type-1095",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__bit_reference",
   "template_args" : [ "type-1091" ],
   "unique_id" : "_ZTSNSt3__114__bit_iteratorINS_8__bitsetILm0ELm0EEELb1ELm0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__seg_",
     "referenced_type" : "type-39"
    },
    {
     "access" : "private",
     "field_name" : "__mask_",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "std::__bit_reference<std::__bitset<0, 0>, true>",
   "name" : "std::__bit_reference<std::__bitset<0, 0>, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1101",
   "self_type" : "type-1101",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__bit_reference",
   "template_args" : [ "type-1091" ],
   "unique_id" : "_ZTSNSt3__115__bit_referenceINS_8__bitsetILm0ELm0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__bitset<0, 0>",
   "name" : "std::__bitset<0, 0>",
   "record_kind" : "class",
   "referenced_type" : "type-1091",
   "self_type" : "type-1091",
   "size" : 1,
   "source_file" : "/external/libcxx/include/bitset",
   "unique_id" : "_ZTSNSt3__18__bitsetILm0ELm0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char *>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char *>",
   "referenced_type" : "type-1077",
   "self_type" : "type-1077",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-13" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEPcEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [10]>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [10]>",
   "referenced_type" : "type-1075",
   "self_type" : "type-1075",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-1076" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEA10_cEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [11]>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [11]>",
   "referenced_type" : "type-1072",
   "self_type" : "type-1072",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-1073" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEA11_cEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [17]>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [17]>",
   "referenced_type" : "type-1067",
   "self_type" : "type-1067",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-1068" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEA17_cEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [2]>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [2]>",
   "referenced_type" : "type-1063",
   "self_type" : "type-1063",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-1064" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEA2_cEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [3]>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [3]>",
   "referenced_type" : "type-1065",
   "self_type" : "type-1065",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-1066" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEA3_cEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [8]>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [8]>",
   "referenced_type" : "type-1074",
   "self_type" : "type-1074",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-417" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEA8_cEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [9]>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, char [9]>",
   "referenced_type" : "type-1069",
   "self_type" : "type-1069",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-1070" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEA9_cEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, const char *>",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, const char *>",
   "referenced_type" : "type-1056",
   "self_type" : "type-1056",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-103" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEEPKcEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, std::allocator<char> >",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-1078",
   "self_type" : "type-1078",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-232" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "std::__can_be_converted_to_string_view<char, std::char_traits<char>, std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-1060",
   "self_type" : "type-1060",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-14", "type-505", "type-502" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIcNS_11char_traitsIcEENS_12basic_stringIcS2_NS_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char16_t, std::char_traits<char16_t>, const char16_t *>",
   "name" : "std::__can_be_converted_to_string_view<char16_t, std::char_traits<char16_t>, const char16_t *>",
   "referenced_type" : "type-1058",
   "self_type" : "type-1058",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-136", "type-538", "type-1038" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIDsNS_11char_traitsIDsEEPKDsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<char32_t, std::char_traits<char32_t>, const char32_t *>",
   "name" : "std::__can_be_converted_to_string_view<char32_t, std::char_traits<char32_t>, const char32_t *>",
   "referenced_type" : "type-1059",
   "self_type" : "type-1059",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-138", "type-557", "type-1044" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIDiNS_11char_traitsIDiEEPKDiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<wchar_t, std::char_traits<wchar_t>, const wchar_t *>",
   "name" : "std::__can_be_converted_to_string_view<wchar_t, std::char_traits<wchar_t>, const wchar_t *>",
   "referenced_type" : "type-1057",
   "self_type" : "type-1057",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-140", "type-1051", "type-1050" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIwNS_11char_traitsIwEEPKwEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__can_be_converted_to_string_view<wchar_t, std::char_traits<wchar_t>, std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> > >",
   "name" : "std::__can_be_converted_to_string_view<wchar_t, std::char_traits<wchar_t>, std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> > >",
   "referenced_type" : "type-1061",
   "self_type" : "type-1061",
   "size" : 1,
   "source_file" : "/external/libcxx/include/string",
   "template_args" : [ "type-140", "type-1051", "type-1062" ],
   "unique_id" : "_ZTSNSt3__133__can_be_converted_to_string_viewIwNS_11char_traitsIwEENS_12basic_stringIwS2_NS_9allocatorIwEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__check_tuple_constructor_fail",
   "name" : "std::__check_tuple_constructor_fail",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__130__check_tuple_constructor_failE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<__int128, __int128, void>",
   "name" : "std::__common_type2_imp<__int128, __int128, void>",
   "referenced_type" : "type-2741",
   "self_type" : "type-2741",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-22", "type-22", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impInnvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<__int128, long, void>",
   "name" : "std::__common_type2_imp<__int128, long, void>",
   "referenced_type" : "type-2784",
   "self_type" : "type-2784",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-22", "type-148", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impInlvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<long double, long double, void>",
   "name" : "std::__common_type2_imp<long double, long double, void>",
   "referenced_type" : "type-2638",
   "self_type" : "type-2638",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3", "type-3", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impIggvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<long long, long long, void>",
   "name" : "std::__common_type2_imp<long long, long long, void>",
   "referenced_type" : "type-1012",
   "self_type" : "type-1012",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2", "type-2", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impIxxvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<long long, long, void>",
   "name" : "std::__common_type2_imp<long long, long, void>",
   "referenced_type" : "type-2851",
   "self_type" : "type-2851",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2", "type-148", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impIxlvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type2_imp<long, long, void>",
   "name" : "std::__common_type2_imp<long, long, void>",
   "referenced_type" : "type-1861",
   "self_type" : "type-1861",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-148", "type-148", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type2_impIllvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3223"
    }
   ],
   "linker_set_key" : "std::__common_type_impl<std::__common_types<__int128, __int128, long>, void>",
   "name" : "std::__common_type_impl<std::__common_types<__int128, __int128, long>, void>",
   "referenced_type" : "type-3222",
   "self_type" : "type-3222",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3225", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type_implINS_14__common_typesIJnnlEEEvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type_impl<std::__common_types<__int128, long>, void>",
   "name" : "std::__common_type_impl<std::__common_types<__int128, long>, void>",
   "referenced_type" : "type-3223",
   "self_type" : "type-3223",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3224", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type_implINS_14__common_typesIJnlEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3228"
    }
   ],
   "linker_set_key" : "std::__common_type_impl<std::__common_types<long long, long long, long>, void>",
   "name" : "std::__common_type_impl<std::__common_types<long long, long long, long>, void>",
   "referenced_type" : "type-3227",
   "self_type" : "type-3227",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3230", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type_implINS_14__common_typesIJxxlEEEvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__common_type_impl<std::__common_types<long long, long>, void>",
   "name" : "std::__common_type_impl<std::__common_types<long long, long>, void>",
   "referenced_type" : "type-3228",
   "self_type" : "type-3228",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3229", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__common_type_implINS_14__common_typesIJxlEEEvEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-587"
    },
    {
     "access" : "private",
     "referenced_type" : "type-588"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<android::hardware::GrantorDescriptor *, std::allocator<android::hardware::GrantorDescriptor> >",
   "name" : "std::__compressed_pair<android::hardware::GrantorDescriptor *, std::allocator<android::hardware::GrantorDescriptor> >",
   "record_kind" : "class",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-585", "type-589" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairIPN7android8hardware17GrantorDescriptorENS_9allocatorIS3_EEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-304"
    },
    {
     "access" : "private",
     "referenced_type" : "type-115"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<char *, void (*)(void *)>",
   "name" : "std::__compressed_pair<char *, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "type-380",
   "self_type" : "type-380",
   "size" : 16,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-13", "type-116" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairIPcPFvPvEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-489"
    },
    {
     "access" : "private",
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, std::allocator<char16_t> >",
   "name" : "std::__compressed_pair<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, std::allocator<char16_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-536",
   "self_type" : "type-536",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-490", "type-481" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repES5_EE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-547"
    },
    {
     "access" : "private",
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, std::allocator<char32_t> >",
   "name" : "std::__compressed_pair<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, std::allocator<char32_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-548", "type-485" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repES5_EE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "referenced_type" : "type-231"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> >",
   "name" : "std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> >",
   "record_kind" : "class",
   "referenced_type" : "type-503",
   "self_type" : "type-503",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-9", "type-232" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-331"
    },
    {
     "access" : "private",
     "referenced_type" : "type-391"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<std::basic_string<wchar_t>::__rep, std::allocator<wchar_t> >",
   "name" : "std::__compressed_pair<std::basic_string<wchar_t>::__rep, std::allocator<wchar_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-894",
   "self_type" : "type-894",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-332", "type-392" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-576"
    },
    {
     "access" : "private",
     "referenced_type" : "type-577"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "std::__compressed_pair<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "record_kind" : "class",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-573", "type-578" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairIPNS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS_6vectorIPvNS_9allocatorISA_EEEEEEENSB_ISG_EEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-55"
    },
    {
     "access" : "private",
     "referenced_type" : "type-115"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<unsigned char *, void (*)(void *)>",
   "name" : "std::__compressed_pair<unsigned char *, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 16,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-56", "type-116" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairIPhPFvPvEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-428"
    },
    {
     "access" : "private",
     "referenced_type" : "type-115"
    }
   ],
   "linker_set_key" : "std::__compressed_pair<unsigned int *, void (*)(void *)>",
   "name" : "std::__compressed_pair<unsigned int *, void (*)(void *)>",
   "record_kind" : "class",
   "referenced_type" : "type-565",
   "self_type" : "type-565",
   "size" : 16,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-429", "type-116" ],
   "unique_id" : "_ZTSNSt3__117__compressed_pairIPjPFvPvEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-585"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<android::hardware::GrantorDescriptor *, 0, false>",
   "name" : "std::__compressed_pair_elem<android::hardware::GrantorDescriptor *, 0, false>",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-585" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPN7android8hardware17GrantorDescriptorELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<char *, 0, false>",
   "name" : "std::__compressed_pair_elem<char *, 0, false>",
   "referenced_type" : "type-304",
   "self_type" : "type-304",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPcLi0ELb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-589"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<android::hardware::GrantorDescriptor>, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<android::hardware::GrantorDescriptor>, 1, true>",
   "referenced_type" : "type-588",
   "self_type" : "type-588",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-589" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorIN7android8hardware17GrantorDescriptorEEELi1ELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-481"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>",
   "referenced_type" : "type-537",
   "self_type" : "type-537",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-485"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-485" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-232"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<char>, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<char>, 1, true>",
   "referenced_type" : "type-231",
   "self_type" : "type-231",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-232" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-578"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, 1, true>",
   "referenced_type" : "type-577",
   "self_type" : "type-577",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-578" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEELi1ELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-392"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>",
   "name" : "std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-392" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-490"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>",
   "name" : "std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>",
   "referenced_type" : "type-489",
   "self_type" : "type-489",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-490" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-548"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>",
   "name" : "std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>",
   "referenced_type" : "type-547",
   "self_type" : "type-547",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-548" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>",
   "name" : "std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-332"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>",
   "name" : "std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>",
   "referenced_type" : "type-331",
   "self_type" : "type-331",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-332" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-573"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, 0, false>",
   "name" : "std::__compressed_pair_elem<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, 0, false>",
   "referenced_type" : "type-576",
   "self_type" : "type-576",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-573" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPNS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS_6vectorIPvNS_9allocatorISA_EEEEEEELi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-56"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<unsigned char *, 0, false>",
   "name" : "std::__compressed_pair_elem<unsigned char *, 0, false>",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-56" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPhLi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-429"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<unsigned int *, 0, false>",
   "name" : "std::__compressed_pair_elem<unsigned int *, 0, false>",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-429" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPjLi0ELb0EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__value_",
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "std::__compressed_pair_elem<void (*)(void *), 1, false>",
   "name" : "std::__compressed_pair_elem<void (*)(void *), 1, false>",
   "referenced_type" : "type-115",
   "self_type" : "type-115",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-116" ],
   "unique_id" : "_ZTSNSt3__122__compressed_pair_elemIPFvPvELi1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<android::hardware::GrantorDescriptor, android::hardware::GrantorDescriptor *, std::allocator<android::hardware::GrantorDescriptor>, true>",
   "name" : "std::__const_pointer<android::hardware::GrantorDescriptor, android::hardware::GrantorDescriptor *, std::allocator<android::hardware::GrantorDescriptor>, true>",
   "referenced_type" : "type-730",
   "self_type" : "type-730",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-59", "type-585", "type-589" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerIN7android8hardware17GrantorDescriptorEPS3_NS_9allocatorIS3_EELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<char, char *, std::allocator<char>, true>",
   "name" : "std::__const_pointer<char, char *, std::allocator<char>, true>",
   "referenced_type" : "type-721",
   "self_type" : "type-721",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-14", "type-13", "type-232" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerIcPcNS_9allocatorIcEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<char16_t, char16_t *, std::allocator<char16_t>, true>",
   "name" : "std::__const_pointer<char16_t, char16_t *, std::allocator<char16_t>, true>",
   "referenced_type" : "type-726",
   "self_type" : "type-726",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-136", "type-493", "type-481" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerIDsPDsNS_9allocatorIDsEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<char32_t, char32_t *, std::allocator<char32_t>, true>",
   "name" : "std::__const_pointer<char32_t, char32_t *, std::allocator<char32_t>, true>",
   "referenced_type" : "type-727",
   "self_type" : "type-727",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-138", "type-551", "type-485" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerIDiPDiNS_9allocatorIDiEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, true>",
   "name" : "std::__const_pointer<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, true>",
   "referenced_type" : "type-728",
   "self_type" : "type-728",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-729", "type-573", "type-578" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS_6vectorIPvNS_9allocatorISA_EEEEEEEPSG_NSB_ISG_EELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_pointer<wchar_t, wchar_t *, std::allocator<wchar_t>, true>",
   "name" : "std::__const_pointer<wchar_t, wchar_t *, std::allocator<wchar_t>, true>",
   "referenced_type" : "type-722",
   "self_type" : "type-722",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-140", "type-335", "type-392" ],
   "unique_id" : "_ZTSNSt3__115__const_pointerIwPwNS_9allocatorIwEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<android::hardware::GrantorDescriptor *, std::allocator<android::hardware::GrantorDescriptor>, false>",
   "name" : "std::__const_void_pointer<android::hardware::GrantorDescriptor *, std::allocator<android::hardware::GrantorDescriptor>, false>",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-585", "type-589" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPN7android8hardware17GrantorDescriptorENS_9allocatorIS3_EELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<char *, std::allocator<char>, false>",
   "name" : "std::__const_void_pointer<char *, std::allocator<char>, false>",
   "referenced_type" : "type-751",
   "self_type" : "type-751",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-13", "type-232" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPcNS_9allocatorIcEELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<char16_t *, std::allocator<char16_t>, false>",
   "name" : "std::__const_void_pointer<char16_t *, std::allocator<char16_t>, false>",
   "referenced_type" : "type-755",
   "self_type" : "type-755",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-493", "type-481" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPDsNS_9allocatorIDsEELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<char32_t *, std::allocator<char32_t>, false>",
   "name" : "std::__const_void_pointer<char32_t *, std::allocator<char32_t>, false>",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-551", "type-485" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPDiNS_9allocatorIDiEELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, false>",
   "name" : "std::__const_void_pointer<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> *, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, false>",
   "referenced_type" : "type-757",
   "self_type" : "type-757",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-573", "type-578" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPNS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS_6vectorIPvNS_9allocatorISA_EEEEEEENSB_ISG_EELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__const_void_pointer<wchar_t *, std::allocator<wchar_t>, false>",
   "name" : "std::__const_void_pointer<wchar_t *, std::allocator<wchar_t>, false>",
   "referenced_type" : "type-752",
   "self_type" : "type-752",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-335", "type-392" ],
   "unique_id" : "_ZTSNSt3__120__const_void_pointerIPwNS_9allocatorIwEELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<__int128, true>",
   "name" : "std::__decay<__int128, true>",
   "referenced_type" : "type-2893",
   "self_type" : "type-2893",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-22" ],
   "unique_id" : "_ZTSNSt3__17__decayInLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair<char *, void (*)(void *)>, true>",
   "name" : "std::__decay<const std::__compressed_pair<char *, void (*)(void *)>, true>",
   "referenced_type" : "type-2901",
   "self_type" : "type-2901",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-379" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_17__compressed_pairIPcPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair<unsigned char *, void (*)(void *)>, true>",
   "name" : "std::__decay<const std::__compressed_pair<unsigned char *, void (*)(void *)>, true>",
   "referenced_type" : "type-2898",
   "self_type" : "type-2898",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-259" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_17__compressed_pairIPhPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair<unsigned int *, void (*)(void *)>, true>",
   "name" : "std::__decay<const std::__compressed_pair<unsigned int *, void (*)(void *)>, true>",
   "referenced_type" : "type-2904",
   "self_type" : "type-2904",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-564" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_17__compressed_pairIPjPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<char *, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<char *, 0, false>, true>",
   "referenced_type" : "type-2899",
   "self_type" : "type-2899",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-303" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "referenced_type" : "type-2915",
   "self_type" : "type-2915",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-560" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "referenced_type" : "type-2919",
   "self_type" : "type-2919",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-725" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "referenced_type" : "type-2907",
   "self_type" : "type-2907",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-230" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "referenced_type" : "type-2911",
   "self_type" : "type-2911",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-390" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-2914",
   "self_type" : "type-2914",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-488" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-2918",
   "self_type" : "type-2918",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-670" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "referenced_type" : "type-2906",
   "self_type" : "type-2906",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "referenced_type" : "type-2910",
   "self_type" : "type-2910",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-330" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "referenced_type" : "type-2894",
   "self_type" : "type-2894",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-54" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "referenced_type" : "type-2902",
   "self_type" : "type-2902",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-427" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "name" : "std::__decay<const std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "referenced_type" : "type-2895",
   "self_type" : "type-2895",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-114" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<const std::allocator<char>, true>",
   "name" : "std::__decay<const std::allocator<char>, true>",
   "referenced_type" : "type-2922",
   "self_type" : "type-2922",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-841" ],
   "unique_id" : "_ZTSNSt3__17__decayIKNS_9allocatorIcEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<long double, true>",
   "name" : "std::__decay<long double, true>",
   "referenced_type" : "type-2892",
   "self_type" : "type-2892",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__17__decayIgLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<long long, true>",
   "name" : "std::__decay<long long, true>",
   "referenced_type" : "type-2890",
   "self_type" : "type-2890",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__17__decayIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<long, true>",
   "name" : "std::__decay<long, true>",
   "referenced_type" : "type-2891",
   "self_type" : "type-2891",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-148" ],
   "unique_id" : "_ZTSNSt3__17__decayIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> >, true>",
   "name" : "std::__decay<std::__compressed_pair<std::basic_string<char>::__rep, std::allocator<char> >, true>",
   "referenced_type" : "type-2923",
   "self_type" : "type-2923",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-503" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_17__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES6_EELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<char *, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<char *, 0, false>, true>",
   "referenced_type" : "type-2900",
   "self_type" : "type-2900",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-304" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemIPcLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>, true>",
   "referenced_type" : "type-2917",
   "self_type" : "type-2917",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-537" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>, true>",
   "referenced_type" : "type-2921",
   "self_type" : "type-2921",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::allocator<char>, 1, true>, true>",
   "referenced_type" : "type-2909",
   "self_type" : "type-2909",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-231" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>, true>",
   "referenced_type" : "type-2913",
   "self_type" : "type-2913",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-391" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-2916",
   "self_type" : "type-2916",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-489" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep, 0, false>, true>",
   "referenced_type" : "type-2920",
   "self_type" : "type-2920",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-547" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::basic_string<char>::__rep, 0, false>, true>",
   "referenced_type" : "type-2908",
   "self_type" : "type-2908",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<std::basic_string<wchar_t>::__rep, 0, false>, true>",
   "referenced_type" : "type-2912",
   "self_type" : "type-2912",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-331" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<unsigned char *, 0, false>, true>",
   "referenced_type" : "type-2896",
   "self_type" : "type-2896",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-55" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemIPhLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<unsigned int *, 0, false>, true>",
   "referenced_type" : "type-2903",
   "self_type" : "type-2903",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-428" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemIPjLi0ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "name" : "std::__decay<std::__compressed_pair_elem<void (*)(void *), 1, false>, true>",
   "referenced_type" : "type-2897",
   "self_type" : "type-2897",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-115" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_22__compressed_pair_elemIPFvPvELi1ELb0EEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__decay<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-2905",
   "self_type" : "type-2905",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-31" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2378"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::__unique_ptr_deleter_sfinae<void (*)(void *)>, true>",
   "name" : "std::__dependent_type<std::__unique_ptr_deleter_sfinae<void (*)(void *)>, true>",
   "referenced_type" : "type-2377",
   "self_type" : "type-2377",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2378" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_27__unique_ptr_deleter_sfinaeIPFvPvEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2515"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::allocator<char16_t> >, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::allocator<char16_t> >, true>",
   "referenced_type" : "type-2514",
   "self_type" : "type-2514",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2515" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_9allocatorIDsEEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2555"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::allocator<char32_t> >, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::allocator<char32_t> >, true>",
   "referenced_type" : "type-2554",
   "self_type" : "type-2554",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2555" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_9allocatorIDiEEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2428"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::allocator<char> >, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::allocator<char> >, true>",
   "referenced_type" : "type-2427",
   "self_type" : "type-2427",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2428" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_9allocatorIcEEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2476"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::allocator<wchar_t> >, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::allocator<wchar_t> >, true>",
   "referenced_type" : "type-2475",
   "self_type" : "type-2475",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2476" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_9allocatorIwEEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2493"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep>, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char16_t, char_traits<char16_t>, allocator<char16_t> >::__rep>, true>",
   "referenced_type" : "type-2492",
   "self_type" : "type-2492",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2493" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2535"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep>, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char32_t, char_traits<char32_t>, allocator<char32_t> >::__rep>, true>",
   "referenced_type" : "type-2534",
   "self_type" : "type-2534",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2535" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2404"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char>::__rep>, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::basic_string<char>::__rep>, true>",
   "referenced_type" : "type-2403",
   "self_type" : "type-2403",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2404" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2453"
    }
   ],
   "linker_set_key" : "std::__dependent_type<std::is_default_constructible<std::basic_string<wchar_t>::__rep>, true>",
   "name" : "std::__dependent_type<std::is_default_constructible<std::basic_string<wchar_t>::__rep>, true>",
   "referenced_type" : "type-2452",
   "self_type" : "type-2452",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2453" ],
   "unique_id" : "_ZTSNSt3__116__dependent_typeINS_24is_default_constructibleINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repEEELb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "std::__destruct_n",
   "name" : "std::__destruct_n",
   "referenced_type" : "type-909",
   "self_type" : "type-909",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__destruct_nE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-167"
    }
   ],
   "linker_set_key" : "std::__do_message",
   "name" : "std::__do_message",
   "record_kind" : "class",
   "referenced_type" : "type-1357",
   "self_type" : "type-1357",
   "size" : 8,
   "source_file" : "/external/libcxx/include/system_error",
   "unique_id" : "_ZTSNSt3__112__do_messageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112__do_messageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112__do_messageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112__do_messageD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__114error_category4nameEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category23default_error_conditionEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112__do_message7messageEi"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_fail_tag",
   "name" : "std::__extract_key_fail_tag",
   "referenced_type" : "type-3290",
   "self_type" : "type-3290",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_fail_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_first_tag",
   "name" : "std::__extract_key_first_tag",
   "referenced_type" : "type-3292",
   "self_type" : "type-3292",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__123__extract_key_first_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_self_tag",
   "name" : "std::__extract_key_self_tag",
   "referenced_type" : "type-3291",
   "self_type" : "type-3291",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_self_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3111"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 24>",
   "referenced_type" : "type-3142",
   "self_type" : "type-3142",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3143" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3105"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "referenced_type" : "type-3152",
   "self_type" : "type-3152",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3153" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3111"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 24>",
   "referenced_type" : "type-3144",
   "self_type" : "type-3144",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3145" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3105"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 24>",
   "referenced_type" : "type-3148",
   "self_type" : "type-3148",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3149" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3111"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 24>",
   "referenced_type" : "type-3146",
   "self_type" : "type-3146",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3147" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3111"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 24>",
   "referenced_type" : "type-3132",
   "self_type" : "type-3132",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3133" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3111"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 24>",
   "referenced_type" : "type-3136",
   "self_type" : "type-3136",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3137" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3111"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 24>",
   "referenced_type" : "type-3140",
   "self_type" : "type-3140",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3141" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3111"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 24>",
   "referenced_type" : "type-3138",
   "self_type" : "type-3138",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3139" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3111"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 24>",
   "referenced_type" : "type-3134",
   "self_type" : "type-3134",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3135" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "type-959"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 64,
     "referenced_type" : "type-962"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 128,
     "referenced_type" : "type-963"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 192,
     "referenced_type" : "type-964"
    }
   ],
   "linker_set_key" : "std::__function::__policy",
   "name" : "std::__function::__policy",
   "referenced_type" : "type-958",
   "self_type" : "type-958",
   "size" : 32,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__110__function8__policyE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "type-957"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "std::__function::__policy_storage",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "referenced_type" : "type-956",
   "self_type" : "type-956",
   "size" : 16,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__110__function16__policy_storageE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<0>",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<1>",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILm1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "name" : "std::__has_const_pointer<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "referenced_type" : "type-720",
   "self_type" : "type-720",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-589", "type-25" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorIN7android8hardware17GrantorDescriptorEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<char16_t>, void>",
   "name" : "std::__has_const_pointer<std::allocator<char16_t>, void>",
   "referenced_type" : "type-715",
   "self_type" : "type-715",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-481", "type-25" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<char32_t>, void>",
   "name" : "std::__has_const_pointer<std::allocator<char32_t>, void>",
   "referenced_type" : "type-716",
   "self_type" : "type-716",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-485", "type-25" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<char>, void>",
   "name" : "std::__has_const_pointer<std::allocator<char>, void>",
   "referenced_type" : "type-713",
   "self_type" : "type-713",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-232", "type-25" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "name" : "std::__has_const_pointer<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "referenced_type" : "type-717",
   "self_type" : "type-717",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-578", "type-25" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_const_pointer<std::allocator<wchar_t>, void>",
   "name" : "std::__has_const_pointer<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-714",
   "self_type" : "type-714",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-392", "type-25" ],
   "unique_id" : "_ZTSNSt3__119__has_const_pointerINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "referenced_type" : "type-750",
   "self_type" : "type-750",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-589", "type-25" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorIN7android8hardware17GrantorDescriptorEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<char16_t>, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<char16_t>, void>",
   "referenced_type" : "type-747",
   "self_type" : "type-747",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-481", "type-25" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<char32_t>, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<char32_t>, void>",
   "referenced_type" : "type-748",
   "self_type" : "type-748",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-485", "type-25" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<char>, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<char>, void>",
   "referenced_type" : "type-745",
   "self_type" : "type-745",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-232", "type-25" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "referenced_type" : "type-749",
   "self_type" : "type-749",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-578", "type-25" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_const_void_pointer<std::allocator<wchar_t>, void>",
   "name" : "std::__has_const_void_pointer<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-746",
   "self_type" : "type-746",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-392", "type-25" ],
   "unique_id" : "_ZTSNSt3__124__has_const_void_pointerINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "name" : "std::__has_difference_type<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "referenced_type" : "type-667",
   "self_type" : "type-667",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-589", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorIN7android8hardware17GrantorDescriptorEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<char16_t>, void>",
   "name" : "std::__has_difference_type<std::allocator<char16_t>, void>",
   "referenced_type" : "type-664",
   "self_type" : "type-664",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-481", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<char32_t>, void>",
   "name" : "std::__has_difference_type<std::allocator<char32_t>, void>",
   "referenced_type" : "type-665",
   "self_type" : "type-665",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-485", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<char>, void>",
   "name" : "std::__has_difference_type<std::allocator<char>, void>",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-232", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "name" : "std::__has_difference_type<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "referenced_type" : "type-666",
   "self_type" : "type-666",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-578", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_difference_type<std::allocator<wchar_t>, void>",
   "name" : "std::__has_difference_type<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-663",
   "self_type" : "type-663",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-392", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_difference_typeINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "name" : "std::__has_is_always_equal<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "referenced_type" : "type-831",
   "self_type" : "type-831",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-589", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorIN7android8hardware17GrantorDescriptorEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<char16_t>, void>",
   "name" : "std::__has_is_always_equal<std::allocator<char16_t>, void>",
   "referenced_type" : "type-824",
   "self_type" : "type-824",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-481", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<char32_t>, void>",
   "name" : "std::__has_is_always_equal<std::allocator<char32_t>, void>",
   "referenced_type" : "type-827",
   "self_type" : "type-827",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-485", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<char>, void>",
   "name" : "std::__has_is_always_equal<std::allocator<char>, void>",
   "referenced_type" : "type-822",
   "self_type" : "type-822",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-232", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "name" : "std::__has_is_always_equal<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "referenced_type" : "type-830",
   "self_type" : "type-830",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-578", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_is_always_equal<std::allocator<wchar_t>, void>",
   "name" : "std::__has_is_always_equal<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-823",
   "self_type" : "type-823",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-392", "type-25" ],
   "unique_id" : "_ZTSNSt3__121__has_is_always_equalINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__has_iterator_category<std::iterator_traits<char *> >",
   "name" : "std::__has_iterator_category<std::iterator_traits<char *> >",
   "referenced_type" : "type-595",
   "self_type" : "type-595",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-596" ],
   "unique_id" : "_ZTSNSt3__123__has_iterator_categoryINS_15iterator_traitsIPcEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_iterator_category_convertible_to<char *, std::forward_iterator_tag, true>",
   "name" : "std::__has_iterator_category_convertible_to<char *, std::forward_iterator_tag, true>",
   "referenced_type" : "type-599",
   "self_type" : "type-599",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-13", "type-600" ],
   "unique_id" : "_ZTSNSt3__138__has_iterator_category_convertible_toIPcNS_20forward_iterator_tagELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_iterator_category_convertible_to<char *, std::input_iterator_tag, true>",
   "name" : "std::__has_iterator_category_convertible_to<char *, std::input_iterator_tag, true>",
   "referenced_type" : "type-597",
   "self_type" : "type-597",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-13", "type-598" ],
   "unique_id" : "_ZTSNSt3__138__has_iterator_category_convertible_toIPcNS_18input_iterator_tagELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_max_size<const std::allocator<char16_t> >",
   "name" : "std::__has_max_size<const std::allocator<char16_t> >",
   "referenced_type" : "type-843",
   "self_type" : "type-843",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-482" ],
   "unique_id" : "_ZTSNSt3__114__has_max_sizeIKNS_9allocatorIDsEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_max_size<const std::allocator<char32_t> >",
   "name" : "std::__has_max_size<const std::allocator<char32_t> >",
   "referenced_type" : "type-844",
   "self_type" : "type-844",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-498" ],
   "unique_id" : "_ZTSNSt3__114__has_max_sizeIKNS_9allocatorIDiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_max_size<const std::allocator<char> >",
   "name" : "std::__has_max_size<const std::allocator<char> >",
   "referenced_type" : "type-840",
   "self_type" : "type-840",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-841" ],
   "unique_id" : "_ZTSNSt3__114__has_max_sizeIKNS_9allocatorIcEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_max_size<const std::allocator<wchar_t> >",
   "name" : "std::__has_max_size<const std::allocator<wchar_t> >",
   "referenced_type" : "type-842",
   "self_type" : "type-842",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-478" ],
   "unique_id" : "_ZTSNSt3__114__has_max_sizeIKNS_9allocatorIwEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "name" : "std::__has_pointer_type<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "referenced_type" : "type-688",
   "self_type" : "type-688",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-589", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorIN7android8hardware17GrantorDescriptorEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<char16_t>, void>",
   "name" : "std::__has_pointer_type<std::allocator<char16_t>, void>",
   "referenced_type" : "type-684",
   "self_type" : "type-684",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-481", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<char32_t>, void>",
   "name" : "std::__has_pointer_type<std::allocator<char32_t>, void>",
   "referenced_type" : "type-685",
   "self_type" : "type-685",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-485", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<char>, void>",
   "name" : "std::__has_pointer_type<std::allocator<char>, void>",
   "referenced_type" : "type-680",
   "self_type" : "type-680",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-232", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorIcEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "name" : "std::__has_pointer_type<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> >, void>",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-578", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<std::allocator<wchar_t>, void>",
   "name" : "std::__has_pointer_type<std::allocator<wchar_t>, void>",
   "referenced_type" : "type-681",
   "self_type" : "type-681",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-392", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeINS_9allocatorIwEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_pointer_type<void (*)(void *), void>",
   "name" : "std::__has_pointer_type<void (*)(void *), void>",
   "referenced_type" : "type-687",
   "self_type" : "type-687",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-116", "type-25" ],
   "unique_id" : "_ZTSNSt3__118__has_pointer_typeIPFvPvEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_copy_assignment<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "name" : "std::__has_propagate_on_container_copy_assignment<std::allocator<android::hardware::GrantorDescriptor>, void>",
   "referenced_type" : "type-782",
   "self_type" : "type-782",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-589", "type-25" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_copy_assignmentINS_9allocatorIN7android8hardware17GrantorDescriptorEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char16_t>, void>",
   "name" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char16_t>, void>",
   "referenced_type" : "type-779",
   "self_type" : "type-779",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-481", "type-25" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_copy_assignmentINS_9allocatorIDsEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char32_t>, void>",
   "name" : "std::__has_propagate_on_container_copy_assignment<std::allocator<char32_t>, void>",
   "referenced_type" : "type-780",
   "self_type" : "type-780",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-485", "type-25" ],
   "unique_id" : "_ZTSNSt3__144__has_propagate_on_container_copy_assignmentINS_9allocatorIDiEEvEE"
  },
  {
   "alignment" : 1,
