{
 "array_types" :
 [
  {
   "linker_set_key" : "C2ChromaOffsetStruct []",
   "name" : "C2ChromaOffsetStruct []",
   "referenced_type" : "type-331",
   "self_type" : "type-330",
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "C2PlaneInfo [4]",
   "name" : "C2PlaneInfo [4]",
   "referenced_type" : "type-210",
   "self_type" : "type-218",
   "size" : 176,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [10]",
   "name" : "char [10]",
   "referenced_type" : "type-26",
   "self_type" : "type-346",
   "size" : 10,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [11]",
   "name" : "char [11]",
   "referenced_type" : "type-26",
   "self_type" : "type-415",
   "size" : 11,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [13]",
   "name" : "char [13]",
   "referenced_type" : "type-26",
   "self_type" : "type-349",
   "size" : 13,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [14]",
   "name" : "char [14]",
   "referenced_type" : "type-26",
   "self_type" : "type-406",
   "size" : 14,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h"
  },
  {

   "name" : "const float",
   "referenced_type" : "type-16",
   "self_type" : "type-48",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const gralloc_module_t",
   "name" : "const gralloc_module_t",
   "referenced_type" : "type-74",
   "self_type" : "type-78",
   "size" : 344,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const hw_module_t",
   "name" : "const hw_module_t",
   "referenced_type" : "type-22",
   "self_type" : "type-32",
   "size" : 248,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-2",
   "self_type" : "type-47",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const long",
   "name" : "const long",
   "referenced_type" : "type-290",
   "self_type" : "type-488",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const native_handle",
   "name" : "const native_handle",
   "referenced_type" : "type-59",
   "self_type" : "type-58",
   "size" : 12,
   "source_file" : "/hardware/libhardware/include/hardware/fb.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-202",
   "self_type" : "type-201",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<C2FieldDescriptor, std::allocator<C2FieldDescriptor> >",
   "name" : "const std::vector<C2FieldDescriptor, std::allocator<C2FieldDescriptor> >",
   "referenced_type" : "type-71",
   "self_type" : "type-70",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<C2Param::Index, std::allocator<C2Param::Index> >",
   "name" : "const std::vector<C2Param::Index, std::allocator<C2Param::Index> >",
   "referenced_type" : "type-334",
   "self_type" : "type-333",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive>, std::allocator<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive> > >",
   "name" : "const std::vector<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive>, std::allocator<std::pair<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, C2Value::Primitive> > >",
   "referenced_type" : "type-506",
   "self_type" : "type-505",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-5",
   "self_type" : "type-4",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-8",
   "self_type" : "type-46",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-18",
   "self_type" : "type-244",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "C2Allocator",
   "name" : "C2Allocator",
   "record_kind" : "class",
   "referenced_type" : "type-156",
   "self_type" : "type-156",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS11C2Allocator",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI11C2Allocator"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2Allocator7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2Allocator5getIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2Allocator9getTraitsEv"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator19newLinearAllocationEj13C2MemoryUsagePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator21priorLinearAllocationEPK13native_handlePNSt3__110shared_ptrI18C2LinearAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator20newGraphicAllocationEjjj13C2MemoryUsagePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "mangled_component_name" : "_ZN11C2Allocator22priorGraphicAllocationEPK13native_handlePNSt3__110shared_ptrI19C2GraphicAllocationEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11C2AllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11C2AllocatorD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "id",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "supportedTypes",
     "field_offset" : 224,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "minimumUsage",
     "field_offset" : 256,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "maximumUsage",
     "field_offset" : 320,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "C2Allocator::Traits",
   "name" : "C2Allocator::Traits",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 48,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTSN11C2Allocator6TraitsE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2AllocatorStore",
   "name" : "C2AllocatorStore",
   "record_kind" : "class",
   "referenced_type" : "type-317",
   "self_type" : "type-317",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS16C2AllocatorStore",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16C2AllocatorStore"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2AllocatorStore7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2AllocatorStore17listAllocators_nbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2AllocatorStore14fetchAllocatorEjPNSt3__110shared_ptrI11C2AllocatorEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16C2AllocatorStoreD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16C2AllocatorStoreD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-137"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "field_offset" : 128,
     "referenced_type" : "type-181"
    }
   ],
   "linker_set_key" : "C2Block1D",
   "name" : "C2Block1D",
   "record_kind" : "class",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS9C2Block1D"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-220"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mImpl",
     "field_offset" : 192,
     "referenced_type" : "type-243"
    }
   ],
   "linker_set_key" : "C2Block2D",
   "name" : "C2Block2D",
   "record_kind" : "class",
   "referenced_type" : "type-242",
   "self_type" : "type-242",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS9C2Block2D"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2BlockPool",
   "name" : "C2BlockPool",
   "record_kind" : "class",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS11C2BlockPool",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI11C2BlockPool"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2BlockPool10getLocalIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK11C2BlockPool14getAllocatorIdEv"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool16fetchLinearBlockEj13C2MemoryUsagePNSt3__110shared_ptrI13C2LinearBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool18fetchCircularBlockEj13C2MemoryUsagePNSt3__110shared_ptrI15C2CircularBlockEE"
    },
    {
     "mangled_component_name" : "_ZN11C2BlockPool17fetchGraphicBlockEjjj13C2MemoryUsagePNSt3__110shared_ptrI14C2GraphicBlockEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11C2BlockPoolD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11C2BlockPoolD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 64,
     "referenced_type" : "type-255"
    }
   ],
   "linker_set_key" : "C2Buffer",
   "name" : "C2Buffer",
   "record_kind" : "class",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS8C2Buffer",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8C2Buffer"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8C2BufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8C2BufferD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "referenced_type" : "type-252"
    }
   ],
   "linker_set_key" : "C2BufferData",
   "name" : "C2BufferData",
   "record_kind" : "class",
   "referenced_type" : "type-251",
   "self_type" : "type-251",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS12C2BufferData"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "C2ChromaOffsetStruct",
   "name" : "C2ChromaOffsetStruct",
   "referenced_type" : "type-331",
   "self_type" : "type-331",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2ChromaOffsetStruct"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-180"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mReserved",
     "field_offset" : 256,
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "mCommitted",
     "field_offset" : 320,
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "mUsed",
     "field_offset" : 384,
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "mFree",
     "field_offset" : 448,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "C2CircularBlock",
   "name" : "C2CircularBlock",
   "record_kind" : "class",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 64,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS15C2CircularBlock"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "C2CircularWriteView",
   "name" : "C2CircularWriteView",
   "record_kind" : "class",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS19C2CircularWriteView"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-192"
    }
   ],
   "linker_set_key" : "C2CircularWriter",
   "name" : "C2CircularWriter",
   "record_kind" : "class",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS16C2CircularWriter"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2Color",
   "name" : "C2Color",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS7C2Color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "range",
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "primaries",
     "field_offset" : 32,
     "referenced_type" : "type-430"
    },
    {
     "field_name" : "transfer",
     "field_offset" : 64,
     "referenced_type" : "type-431"
    },
    {
     "field_name" : "matrix",
     "field_offset" : 96,
     "referenced_type" : "type-432"
    }
   ],
   "linker_set_key" : "C2ColorAspectsStruct",
   "name" : "C2ColorAspectsStruct",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2ColorAspectsStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitDepth",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "subsampling",
     "field_offset" : 32,
     "referenced_type" : "type-426"
    },
    {
     "field_name" : "locations",
     "field_offset" : 64,
     "referenced_type" : "type-330"
    }
   ],
   "linker_set_key" : "C2ColorInfoStruct",
   "name" : "C2ColorInfoStruct",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS17C2ColorInfoStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "C2ColorXyStruct",
   "name" : "C2ColorXyStruct",
   "referenced_type" : "type-436",
   "self_type" : "type-436",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS15C2ColorXyStruct"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2Component",
   "name" : "C2Component",
   "record_kind" : "class",
   "referenced_type" : "type-300",
   "self_type" : "type-300",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS11C2Component",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI11C2Component"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component14setListener_vbERKNSt3__110shared_ptrINS_8ListenerEEE13c2_blocking_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8queue_nbEPNSt3__14listINS0_10unique_ptrI6C2WorkNS0_14default_deleteIS3_EEEENS0_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component11announce_nbERKNSt3__16vectorI13C2WorkOutlineNS0_9allocatorIS2_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8flush_smENS_12flush_mode_tEPNSt3__14listINS1_10unique_ptrI6C2WorkNS1_14default_deleteIS4_EEEENS1_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8drain_nbENS_12drain_mode_tE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component5startEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component7releaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component4intfEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11C2ComponentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11C2ComponentD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2Component::Listener",
   "name" : "C2Component::Listener",
   "record_kind" : "class",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTSN11C2Component8ListenerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN11C2Component8ListenerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8Listener13onWorkDone_nbENSt3__18weak_ptrIS_EENS1_4listINS1_10unique_ptrI6C2WorkNS1_14default_deleteIS6_EEEENS1_9allocatorIS9_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8Listener12onTripped_nbENSt3__18weak_ptrIS_EENS1_6vectorINS1_10shared_ptrI15C2SettingResultEENS1_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN11C2Component8Listener10onError_nbENSt3__18weak_ptrIS_EEj"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN11C2Component8ListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN11C2Component8ListenerD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-304"
    },
    {
     "field_name" : "domain",
     "field_offset" : 192,
     "referenced_type" : "type-305"
    },
    {
     "field_name" : "kind",
     "field_offset" : 224,
     "referenced_type" : "type-306"
    },
    {
     "field_name" : "rank",
     "field_offset" : 256,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "mediaType",
     "field_offset" : 320,
     "referenced_type" : "type-307"
    },
    {
     "field_name" : "owner",
     "field_offset" : 512,
     "referenced_type" : "type-308"
    },
    {
     "field_name" : "aliases",
     "field_offset" : 704,
     "referenced_type" : "type-309"
    }
   ],
   "linker_set_key" : "C2Component::Traits",
   "name" : "C2Component::Traits",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 112,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTSN11C2Component6TraitsE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2ComponentInterface",
   "name" : "C2ComponentInterface",
   "record_kind" : "class",
   "referenced_type" : "type-298",
   "self_type" : "type-298",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS20C2ComponentInterface",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI20C2ComponentInterface"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface5getIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface8query_vbERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEERKNS1_INS2_5IndexENS4_IS9_EEEE13c2_blocking_tPNS1_INS0_10unique_ptrIS2_NS0_14default_deleteIS2_EEEENS4_ISI_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN20C2ComponentInterface9config_vbERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEE13c2_blocking_tPNS1_INS0_10unique_ptrI15C2SettingResultNS0_14default_deleteISB_EEEENS4_ISE_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN20C2ComponentInterface15createTunnel_smEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN20C2ComponentInterface16releaseTunnel_smEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface23querySupportedParams_nbEPNSt3__16vectorINS0_10shared_ptrI17C2ParamDescriptorEENS0_9allocatorIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK20C2ComponentInterface23querySupportedValues_vbERNSt3__16vectorI27C2FieldSupportedValuesQueryNS0_9allocatorIS2_EEEE13c2_blocking_t"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN20C2ComponentInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN20C2ComponentInterfaceD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2ComponentStore",
   "name" : "C2ComponentStore",
   "record_kind" : "class",
   "referenced_type" : "type-321",
   "self_type" : "type-321",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS16C2ComponentStore",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16C2ComponentStore"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore7getNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore15createComponentENSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEEPNS0_10shared_ptrI11C2ComponentEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore15createInterfaceENSt3__112basic_stringIcNS0_11char_traitsIcEENS0_9allocatorIcEEEEPNS0_10shared_ptrI20C2ComponentInterfaceEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore14listComponentsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore10copyBufferENSt3__110shared_ptrI15C2GraphicBufferEES3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore8query_smERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEERKNS1_INS2_5IndexENS4_IS9_EEEEPNS1_INS0_10unique_ptrIS2_NS0_14default_deleteIS2_EEEENS4_ISH_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16C2ComponentStore9config_smERKNSt3__16vectorIP7C2ParamNS0_9allocatorIS3_EEEEPNS1_INS0_10unique_ptrI15C2SettingResultNS0_14default_deleteISA_EEEENS4_ISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore17getParamReflectorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore23querySupportedParams_nbEPNSt3__16vectorINS0_10shared_ptrI17C2ParamDescriptorEENS0_9allocatorIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ComponentStore23querySupportedValues_smERNSt3__16vectorI27C2FieldSupportedValuesQueryNS0_9allocatorIS2_EEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16C2ComponentStoreD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16C2ComponentStoreD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2Config",
   "name" : "C2Config",
   "referenced_type" : "type-342",
   "self_type" : "type-342",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS8C2Config"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-242"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFence",
     "field_offset" : 320,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "C2ConstGraphicBlock",
   "name" : "C2ConstGraphicBlock",
   "record_kind" : "class",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 56,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS19C2ConstGraphicBlock"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-180"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFence",
     "field_offset" : 256,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "C2ConstLinearBlock",
   "name" : "C2ConstLinearBlock",
   "record_kind" : "class",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 48,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS18C2ConstLinearBlock"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "referenced_type" : "type-120"
    }
   ],
   "linker_set_key" : "C2Event",
   "name" : "C2Event",
   "record_kind" : "class",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS7C2Event"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "C2Fence",
   "name" : "C2Fence",
   "record_kind" : "class",
   "referenced_type" : "type-116",
   "self_type" : "type-116",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS7C2Fence"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mType",
     "referenced_type" : "type-497"
    },
    {
     "access" : "private",
     "field_name" : "_mExtent",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "_mName",
     "field_offset" : 64,
     "referenced_type" : "type-498"
    },
    {
     "access" : "private",
     "field_name" : "_mNamedValues",
     "field_offset" : 256,
     "referenced_type" : "type-499"
    },
    {
     "access" : "private",
     "field_name" : "_mFieldId",
     "field_offset" : 448,
     "referenced_type" : "type-265"
    }
   ],
   "linker_set_key" : "C2FieldDescriptor",
   "name" : "C2FieldDescriptor",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 64,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS17C2FieldDescriptor"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "range",
     "field_offset" : 64,
     "referenced_type" : "type-288"
    },
    {
     "field_name" : "values",
     "field_offset" : 384,
     "referenced_type" : "type-292"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValues",
   "name" : "C2FieldSupportedValues",
   "referenced_type" : "type-286",
   "self_type" : "type-286",
   "size" : 72,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS22C2FieldSupportedValues"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "min",
     "referenced_type" : "type-289"
    },
    {
     "field_name" : "max",
     "field_offset" : 64,
     "referenced_type" : "type-289"
    },
    {
     "field_name" : "step",
     "field_offset" : 128,
     "referenced_type" : "type-289"
    },
    {
     "field_name" : "num",
     "field_offset" : 192,
     "referenced_type" : "type-289"
    },
    {
     "field_name" : "denom",
     "field_offset" : 256,
     "referenced_type" : "type-289"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "C2FieldSupportedValues::(anonymous struct at frameworks/av/media/codec2/core/include/C2Param.h:1530:5) at frameworks/av/media/codec2/core/include/C2Param.h:1530:5",
   "name" : "C2FieldSupportedValues::(anonymous struct at frameworks/av/media/codec2/core/include/C2Param.h:1530:5) at frameworks/av/media/codec2/core/include/C2Param.h:1530:5",
   "referenced_type" : "type-288",
   "self_type" : "type-288",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN22C2FieldSupportedValuesUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mField",
     "referenced_type" : "type-264"
    },
    {
     "access" : "private",
     "field_name" : "_mType",
     "field_offset" : 96,
     "referenced_type" : "type-285"
    },
    {
     "field_name" : "status",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "values",
     "field_offset" : 192,
     "referenced_type" : "type-286"
    }
   ],
   "linker_set_key" : "C2FieldSupportedValuesQuery",
   "name" : "C2FieldSupportedValuesQuery",
   "referenced_type" : "type-284",
   "self_type" : "type-284",
   "size" : 96,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS27C2FieldSupportedValuesQuery"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pixelFormat",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "bitDepth",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "subsampling",
     "field_offset" : 64,
     "referenced_type" : "type-426"
    },
    {
     "field_name" : "layout",
     "field_offset" : 96,
     "referenced_type" : "type-465"
    }
   ],
   "linker_set_key" : "C2FlexiblePixelFormatDescriptorStruct",
   "name" : "C2FlexiblePixelFormatDescriptorStruct",
   "referenced_type" : "type-464",
   "self_type" : "type-464",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS37C2FlexiblePixelFormatDescriptorStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-271"
    },
    {
     "field_name" : "ordinal",
     "field_offset" : 64,
     "referenced_type" : "type-268"
    },
    {
     "field_name" : "buffers",
     "field_offset" : 256,
     "referenced_type" : "type-272"
    },
    {
     "field_name" : "configUpdate",
     "field_offset" : 448,
     "referenced_type" : "type-273"
    },
    {
     "field_name" : "infoBuffers",
     "field_offset" : 640,
     "referenced_type" : "type-274"
    }
   ],
   "linker_set_key" : "C2FrameData",
   "name" : "C2FrameData",
   "referenced_type" : "type-270",
   "self_type" : "type-270",
   "size" : 104,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS11C2FrameData"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2FrameInfoParser",
   "name" : "C2FrameInfoParser",
   "record_kind" : "class",
   "referenced_type" : "type-315",
   "self_type" : "type-315",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Component.h",
   "unique_id" : "_ZTS17C2FrameInfoParser",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI17C2FrameInfoParser"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK17C2FrameInfoParser7getTypeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK17C2FrameInfoParser15getParsedParamsEv"
    },
    {
     "mangled_component_name" : "_ZN17C2FrameInfoParser5resetEv"
    },
    {
     "mangled_component_name" : "_ZN17C2FrameInfoParser10parseFrameER11C2FrameData"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17C2FrameInfoParserD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17C2FrameInfoParserD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "type-440"
    },
    {
     "field_name" : "count",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "C2GopLayerStruct",
   "name" : "C2GopLayerStruct",
   "referenced_type" : "type-441",
   "self_type" : "type-441",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS16C2GopLayerStruct"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-206"
    }
   ],
   "linker_set_key" : "C2GraphicAllocation",
   "name" : "C2GraphicAllocation",
   "record_kind" : "class",
   "referenced_type" : "type-240",
   "self_type" : "type-240",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS19C2GraphicAllocation",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI19C2GraphicAllocation"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN19C2GraphicAllocation3mapE6C2Rect13C2MemoryUsageP7C2FenceP14C2PlanarLayoutPPh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN19C2GraphicAllocation5unmapEPPh6C2RectP7C2Fence"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK19C2GraphicAllocation14getAllocatorIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK19C2GraphicAllocation6handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK19C2GraphicAllocation6equalsERKNSt3__110shared_ptrIKS_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN19C2GraphicAllocationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN19C2GraphicAllocationD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-242"
    }
   ],
   "linker_set_key" : "C2GraphicBlock",
   "name" : "C2GraphicBlock",
   "record_kind" : "class",
   "referenced_type" : "type-250",
   "self_type" : "type-250",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS14C2GraphicBlock"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-224"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 192,
     "referenced_type" : "type-246"
    }
   ],
   "linker_set_key" : "C2GraphicView",
   "name" : "C2GraphicView",
   "record_kind" : "class",
   "referenced_type" : "type-245",
   "self_type" : "type-245",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS13C2GraphicView"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mastering",
     "referenced_type" : "type-437"
    },
    {
     "field_name" : "maxCll",
     "field_offset" : 320,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "maxFall",
     "field_offset" : 352,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "C2HdrStaticMetadataStruct",
   "name" : "C2HdrStaticMetadataStruct",
   "referenced_type" : "type-438",
   "self_type" : "type-438",
   "size" : 48,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS25C2HdrStaticMetadataStruct"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "linker_set_key" : "C2Info",
   "name" : "C2Info",
   "referenced_type" : "type-401",
   "self_type" : "type-401",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS6C2Info"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "C2InfoBuffer",
   "name" : "C2InfoBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-257",
   "self_type" : "type-257",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS12C2InfoBuffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "type-446"
    },
    {
     "field_name" : "period",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "C2IntraRefreshStruct",
   "name" : "C2IntraRefreshStruct",
   "referenced_type" : "type-447",
   "self_type" : "type-447",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2IntraRefreshStruct"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "C2LinearAllocation",
   "name" : "C2LinearAllocation",
   "record_kind" : "class",
   "referenced_type" : "type-167",
   "self_type" : "type-167",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS18C2LinearAllocation",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI18C2LinearAllocation"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18C2LinearAllocation3mapEmm13C2MemoryUsageP7C2FencePPv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18C2LinearAllocation5unmapEPvmP7C2Fence"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK18C2LinearAllocation14getAllocatorIdEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK18C2LinearAllocation6handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK18C2LinearAllocation6equalsERKNSt3__110shared_ptrIS_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN18C2LinearAllocationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN18C2LinearAllocationD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-180"
    }
   ],
   "linker_set_key" : "C2LinearBlock",
   "name" : "C2LinearBlock",
   "record_kind" : "class",
   "referenced_type" : "type-190",
   "self_type" : "type-190",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS13C2LinearBlock"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "C2LinearCapacity",
   "name" : "C2LinearCapacity",
   "record_kind" : "class",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS16C2LinearCapacity"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-137"
    }
   ],
   "linker_set_key" : "C2LinearRange",
   "name" : "C2LinearRange",
   "record_kind" : "class",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS13C2LinearRange"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "red",
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "green",
     "field_offset" : 64,
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "blue",
     "field_offset" : 128,
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "white",
     "field_offset" : 192,
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "C2MasteringDisplayColorVolumeStruct",
   "name" : "C2MasteringDisplayColorVolumeStruct",
   "referenced_type" : "type-437",
   "self_type" : "type-437",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS35C2MasteringDisplayColorVolumeStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "expected",
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "C2MemoryUsage",
   "name" : "C2MemoryUsage",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2BufferBase.h",
   "unique_id" : "_ZTS13C2MemoryUsage"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pool",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "usage",
     "field_offset" : 64,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "planar",
     "field_offset" : 128,
     "referenced_type" : "type-403"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "capacity",
     "field_offset" : 224,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "outOfMemory",
     "field_offset" : 256,
     "referenced_type" : "type-340"
    }
   ],
   "linker_set_key" : "C2OutOfMemoryStruct",
   "name" : "C2OutOfMemoryStruct",
   "referenced_type" : "type-405",
   "self_type" : "type-405",
   "size" : 40,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS19C2OutOfMemoryStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mSize",
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "_mIndex",
     "field_offset" : 32,
     "referenced_type" : "type-97"
    }
   ],
   "linker_set_key" : "C2Param",
   "name" : "C2Param",
   "referenced_type" : "type-96",
   "self_type" : "type-96",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS7C2Param"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mIndex",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "C2Param::CoreIndex",
   "name" : "C2Param::CoreIndex",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN7C2Param9CoreIndexE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "C2Param::Index",
   "name" : "C2Param::Index",
   "referenced_type" : "type-97",
   "self_type" : "type-97",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN7C2Param5IndexE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "C2Param::Type",
   "name" : "C2Param::Type",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN7C2Param4TypeE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mIndex",
     "referenced_type" : "type-200"
    },
    {
     "access" : "private",
     "field_name" : "_mAttrib",
     "field_offset" : 32,
     "referenced_type" : "type-46"
    },
    {
     "access" : "private",
     "field_name" : "_mName",
     "field_offset" : 64,
     "referenced_type" : "type-201"
    },
    {
     "access" : "private",
     "field_name" : "_mDependencies",
     "field_offset" : 256,
     "referenced_type" : "type-203"
    }
   ],
   "linker_set_key" : "C2ParamDescriptor",
   "name" : "C2ParamDescriptor",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 56,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS17C2ParamDescriptor"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mIndex",
     "referenced_type" : "type-97"
    },
    {
     "access" : "private",
     "field_name" : "_mFieldId",
     "field_offset" : 32,
     "referenced_type" : "type-265"
    }
   ],
   "linker_set_key" : "C2ParamField",
   "name" : "C2ParamField",
   "referenced_type" : "type-264",
   "self_type" : "type-264",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS12C2ParamField"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "paramOrField",
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "values",
     "field_offset" : 128,
     "referenced_type" : "type-266"
    }
   ],
   "linker_set_key" : "C2ParamFieldValues",
   "name" : "C2ParamFieldValues",
   "referenced_type" : "type-263",
   "self_type" : "type-263",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS18C2ParamFieldValues"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "C2ParamReflector",
   "name" : "C2ParamReflector",
   "record_kind" : "class",
   "referenced_type" : "type-450",
   "self_type" : "type-450",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS16C2ParamReflector",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16C2ParamReflector"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16C2ParamReflector8describeEN7C2Param9CoreIndexE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16C2ParamReflectorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16C2ParamReflectorD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "C2PictureSizeStruct",
   "name" : "C2PictureSizeStruct",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS19C2PictureSizeStruct"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-206"
    }
   ],
   "linker_set_key" : "C2PlanarCapacity",
   "name" : "C2PlanarCapacity",
   "record_kind" : "class",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS16C2PlanarCapacity"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-217"
    },
    {
     "field_name" : "numPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "rootPlanes",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "planes",
     "field_offset" : 96,
     "referenced_type" : "type-218"
    }
   ],
   "linker_set_key" : "C2PlanarLayout",
   "name" : "C2PlanarLayout",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 188,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS14C2PlanarLayout"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-220"
    }
   ],
   "linker_set_key" : "C2PlanarSection",
   "name" : "C2PlanarSection",
   "record_kind" : "class",
   "referenced_type" : "type-229",
   "self_type" : "type-229",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS15C2PlanarSection"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "channel",
     "referenced_type" : "type-211"
    },
    {
     "field_name" : "colInc",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rowInc",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "colSampling",
     "field_offset" : 96,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "rowSampling",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "allocatedDepth",
     "field_offset" : 160,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "bitDepth",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "rightShift",
     "field_offset" : 224,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "endianness",
     "field_offset" : 256,
     "referenced_type" : "type-212"
    },
    {
     "field_name" : "rootIx",
     "field_offset" : 288,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "offset",
     "field_offset" : 320,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "C2PlaneInfo",
   "name" : "C2PlaneInfo",
   "referenced_type" : "type-210",
   "self_type" : "type-210",
   "size" : 44,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS11C2PlaneInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "profile",
     "referenced_type" : "type-360"
    },
    {
     "field_name" : "level",
     "field_offset" : 32,
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "C2ProfileLevelStruct",
   "name" : "C2ProfileLevelStruct",
   "referenced_type" : "type-362",
   "self_type" : "type-362",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2ProfileLevelStruct"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-132"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 64,
     "referenced_type" : "type-183"
    },
    {
     "access" : "private",
     "field_name" : "mOffset",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "C2ReadView",
   "name" : "C2ReadView",
   "record_kind" : "class",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS10C2ReadView"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "left",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "top",
     "field_offset" : 96,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "C2Rect",
   "name" : "C2Rect",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS6C2Rect"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-195"
    }
   ],
   "linker_set_key" : "C2RectStruct",
   "name" : "C2RectStruct",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS12C2RectStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flip",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "C2RotationStruct",
   "name" : "C2RotationStruct",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS16C2RotationStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "C2Segment",
   "name" : "C2Segment",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS9C2Segment"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "linker_set_key" : "C2Setting",
   "name" : "C2Setting",
   "referenced_type" : "type-376",
   "self_type" : "type-376",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS9C2Setting"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "failure",
     "referenced_type" : "type-262"
    },
    {
     "field_name" : "field",
     "field_offset" : 64,
     "referenced_type" : "type-263"
    },
    {
     "field_name" : "conflicts",
     "field_offset" : 256,
     "referenced_type" : "type-267"
    }
   ],
   "linker_set_key" : "C2SettingResult",
   "name" : "C2SettingResult",
   "referenced_type" : "type-261",
   "self_type" : "type-261",
   "size" : 56,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS15C2SettingResult"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "usage",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "capacity",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "heapMask",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "allocFlags",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minAlignment",
     "field_offset" : 160,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "C2StoreIonUsageStruct",
   "name" : "C2StoreIonUsageStruct",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS21C2StoreIonUsageStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mType",
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "_mFields",
     "field_offset" : 64,
     "referenced_type" : "type-70"
    }
   ],
   "linker_set_key" : "C2StructDescriptor",
   "name" : "C2StructDescriptor",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS18C2StructDescriptor"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "type-369"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-327"
    }
   ],
   "linker_set_key" : "C2SupplementalDataStruct",
   "name" : "C2SupplementalDataStruct",
   "referenced_type" : "type-370",
   "self_type" : "type-370",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS24C2SupplementalDataStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layerCount",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "bLayerCount",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "bitrateRatios",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "C2TemporalLayeringStruct",
   "name" : "C2TemporalLayeringStruct",
   "referenced_type" : "type-443",
   "self_type" : "type-443",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS24C2TemporalLayeringStruct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tile",
     "referenced_type" : "type-403"
    },
    {
     "field_name" : "columnCount",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "rowCount",
     "field_offset" : 96,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "order",
     "field_offset" : 128,
     "referenced_type" : "type-449"
    }
   ],
   "linker_set_key" : "C2TileLayoutStruct",
   "name" : "C2TileLayoutStruct",
   "referenced_type" : "type-451",
   "self_type" : "type-451",
   "size" : 20,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS18C2TileLayoutStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "enabled",
     "referenced_type" : "type-340"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 64,
     "referenced_type" : "type-290"
    }
   ],
   "linker_set_key" : "C2TimedControlStruct",
   "name" : "C2TimedControlStruct",
   "referenced_type" : "type-466",
   "self_type" : "type-466",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS20C2TimedControlStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "type-469"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "C2TimestampGapAdjustmentStruct",
   "name" : "C2TimestampGapAdjustmentStruct",
   "referenced_type" : "type-468",
   "self_type" : "type-468",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Config.h",
   "unique_id" : "_ZTS30C2TimestampGapAdjustmentStruct"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-376"
    }
   ],
   "linker_set_key" : "C2Tuning",
   "name" : "C2Tuning",
   "referenced_type" : "type-388",
   "self_type" : "type-388",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS8C2Tuning"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mType",
     "referenced_type" : "type-479"
    },
    {
     "access" : "private",
     "field_name" : "_mValue",
     "field_offset" : 64,
     "referenced_type" : "type-289"
    }
   ],
   "linker_set_key" : "C2Value",
   "name" : "C2Value",
   "record_kind" : "class",
   "referenced_type" : "type-478",
   "self_type" : "type-478",
   "size" : 16,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS7C2Value"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "u64",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "i64",
     "referenced_type" : "type-290"
    },
    {
     "field_name" : "c64",
     "referenced_type" : "type-269"
    },
    {
     "field_name" : "u32",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "i32",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "c32",
     "referenced_type" : "type-291"
    },
    {
     "field_name" : "fp",
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "C2Value::Primitive",
   "name" : "C2Value::Primitive",
   "record_kind" : "union",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTSN7C2Value9PrimitiveE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "chainInfo",
     "referenced_type" : "type-280"
    },
    {
     "field_name" : "input",
     "field_offset" : 128,
     "referenced_type" : "type-270"
    },
    {
     "field_name" : "worklets",
     "field_offset" : 960,
     "referenced_type" : "type-281"
    },
    {
     "field_name" : "workletsProcessed",
     "field_offset" : 1152,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "result",
     "field_offset" : 1184,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "C2Work",
   "name" : "C2Work",
   "referenced_type" : "type-279",
   "self_type" : "type-279",
   "size" : 152,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS6C2Work"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "type-269"
    },
    {
     "field_name" : "frameIndex",
     "field_offset" : 64,
     "referenced_type" : "type-269"
    },
    {
     "field_name" : "customOrdinal",
     "field_offset" : 128,
     "referenced_type" : "type-269"
    }
   ],
   "linker_set_key" : "C2WorkOrdinalStruct",
   "name" : "C2WorkOrdinalStruct",
   "referenced_type" : "type-268",
   "self_type" : "type-268",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS19C2WorkOrdinalStruct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ordinal",
     "referenced_type" : "type-268"
    },
    {
     "field_name" : "chain",
     "field_offset" : 192,
     "referenced_type" : "type-283"
    }
   ],
   "linker_set_key" : "C2WorkOutline",
   "name" : "C2WorkOutline",
   "referenced_type" : "type-282",
   "self_type" : "type-282",
   "size" : 48,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS13C2WorkOutline"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "component",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "tunings",
     "field_offset" : 64,
     "referenced_type" : "type-277"
    },
    {
     "field_name" : "failures",
     "field_offset" : 256,
     "referenced_type" : "type-278"
    },
    {
     "field_name" : "output",
     "field_offset" : 448,
     "referenced_type" : "type-270"
    }
   ],
   "linker_set_key" : "C2Worklet",
   "name" : "C2Worklet",
   "referenced_type" : "type-276",
   "self_type" : "type-276",
   "size" : 160,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Work.h",
   "unique_id" : "_ZTS9C2Worklet"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-153"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 128,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "C2WriteView",
   "name" : "C2WriteView",
   "record_kind" : "class",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 32,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS11C2WriteView"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "_C2CircularBlockSegment",
   "name" : "_C2CircularBlockSegment",
   "record_kind" : "class",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS23_C2CircularBlockSegment"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2Comparable_impl",
   "name" : "_C2Comparable_impl",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTS18_C2Comparable_impl"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2CoreIndexHelper_impl",
   "name" : "_C2CoreIndexHelper_impl",
   "referenced_type" : "type-324",
   "self_type" : "type-324",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTS23_C2CoreIndexHelper_impl"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-137"
    }
   ],
   "linker_set_key" : "_C2EditableLinearRangeAspect",
   "name" : "_C2EditableLinearRangeAspect",
   "record_kind" : "class",
   "referenced_type" : "type-153",
   "self_type" : "type-153",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS28_C2EditableLinearRangeAspect"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-220"
    }
   ],
   "linker_set_key" : "_C2EditablePlanarSectionAspect",
   "name" : "_C2EditablePlanarSectionAspect",
   "record_kind" : "class",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS30_C2EditablePlanarSectionAspect"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2EnumUtils",
   "name" : "_C2EnumUtils",
   "record_kind" : "class",
   "referenced_type" : "type-259",
   "self_type" : "type-259",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Enum.h",
   "unique_id" : "_ZTS12_C2EnumUtils"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mOffset",
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "_mSize",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "_C2FieldId",
   "name" : "_C2FieldId",
   "referenced_type" : "type-265",
   "self_type" : "type-265",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h",
   "unique_id" : "_ZTS10_C2FieldId"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<C2ChromaOffsetStruct [], void>",
   "name" : "_C2FlexHelper<C2ChromaOffsetStruct [], void>",
   "referenced_type" : "type-329",
   "self_type" : "type-329",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-330", "type-41" ],
   "unique_id" : "_ZTS13_C2FlexHelperIA_20C2ChromaOffsetStructvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<C2ChromaOffsetStruct, void>",
   "name" : "_C2FlexHelper<C2ChromaOffsetStruct, void>",
   "referenced_type" : "type-336",
   "self_type" : "type-336",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-331", "type-41" ],
   "unique_id" : "_ZTS13_C2FlexHelperI20C2ChromaOffsetStructvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<float [], void>",
   "name" : "_C2FlexHelper<float [], void>",
   "referenced_type" : "type-337",
   "self_type" : "type-337",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-15", "type-41" ],
   "unique_id" : "_ZTS13_C2FlexHelperIA_fvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<float, void>",
   "name" : "_C2FlexHelper<float, void>",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-16", "type-41" ],
   "unique_id" : "_ZTS13_C2FlexHelperIfvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<unsigned char [], void>",
   "name" : "_C2FlexHelper<unsigned char [], void>",
   "referenced_type" : "type-326",
   "self_type" : "type-326",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-327", "type-41" ],
   "unique_id" : "_ZTS13_C2FlexHelperIA_hvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2FlexHelper<unsigned char, void>",
   "name" : "_C2FlexHelper<unsigned char, void>",
   "referenced_type" : "type-328",
   "self_type" : "type-328",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "template_args" : [ "type-5", "type-41" ],
   "unique_id" : "_ZTS13_C2FlexHelperIhvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2Flexible_impl",
   "name" : "_C2Flexible_impl",
   "referenced_type" : "type-325",
   "self_type" : "type-325",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTS16_C2Flexible_impl"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mStatus",
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "_C2InnateStatus",
   "name" : "_C2InnateStatus",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS15_C2InnateStatus"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCapacity",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "_C2LinearCapacityAspect",
   "name" : "_C2LinearCapacityAspect",
   "record_kind" : "class",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS23_C2LinearCapacityAspect"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-132"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "_C2LinearRangeAspect",
   "name" : "_C2LinearRangeAspect",
   "record_kind" : "class",
   "referenced_type" : "type-137",
   "self_type" : "type-137",
   "size" : 12,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS20_C2LinearRangeAspect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_mWidth",
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "_mHeight",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "_C2PlanarCapacityAspect",
   "name" : "_C2PlanarCapacityAspect",
   "record_kind" : "class",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS23_C2PlanarCapacityAspect"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-206"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCrop",
     "field_offset" : 64,
     "referenced_type" : "type-195"
    }
   ],
   "linker_set_key" : "_C2PlanarSectionAspect",
   "name" : "_C2PlanarSectionAspect",
   "record_kind" : "class",
   "referenced_type" : "type-220",
   "self_type" : "type-220",
   "size" : 24,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Buffer.h",
   "unique_id" : "_ZTS22_C2PlanarSectionAspect"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_C2ValueArrayHelper",
   "name" : "_C2ValueArrayHelper",
   "referenced_type" : "type-339",
   "self_type" : "type-339",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2ParamDef.h",
   "unique_id" : "_ZTS19_C2ValueArrayHelper"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_cntr_compat_helper<unsigned int>",
   "name" : "_c2_cntr_compat_helper<unsigned int>",
   "referenced_type" : "type-319",
   "self_type" : "type-319",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTS22_c2_cntr_compat_helperIjE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_c2_cntr_compat_helper<unsigned long>",
   "name" : "_c2_cntr_compat_helper<unsigned long>",
   "referenced_type" : "type-133",
   "self_type" : "type-133",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTS22_c2_cntr_compat_helperImE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "alloc",
     "field_offset" : 960,
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "free",
     "field_offset" : 1024,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "dump",
     "field_offset" : 1088,
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 1152,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "alloc_device_t",
   "name" : "alloc_device_t",
   "referenced_type" : "type-99",
   "self_type" : "type-99",
   "size" : 200,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h",
   "unique_id" : "alloc_device_t"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::C2AndroidMemoryUsage",
   "name" : "android::C2AndroidMemoryUsage",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/android-C2Buffer.h",
   "unique_id" : "_ZTSN7android20C2AndroidMemoryUsageE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 16,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "component",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "cb",
     "field_offset" : 64,
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "cr",
     "field_offset" : 128,
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 192,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 256,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 320,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 80,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mValue",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "c2_cntr_t<unsigned int, void>",
   "name" : "c2_cntr_t<unsigned int, void>",
   "record_kind" : "class",
   "referenced_type" : "type-291",
   "self_type" : "type-291",
   "size" : 4,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "template_args" : [ "type-8", "type-41" ],
   "unique_id" : "_ZTS9c2_cntr_tIjvE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mValue",
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "c2_cntr_t<unsigned long, void>",
   "name" : "c2_cntr_t<unsigned long, void>",
   "record_kind" : "class",
   "referenced_type" : "type-269",
   "self_type" : "type-269",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "template_args" : [ "type-18", "type-41" ],
   "unique_id" : "_ZTS9c2_cntr_tImvE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "c2_types<unsigned int, unsigned int, unsigned int>",
   "name" : "c2_types<unsigned int, unsigned int, unsigned int>",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "unique_id" : "_ZTS8c2_typesIJjjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "c2_types<unsigned int, unsigned int>",
   "name" : "c2_types<unsigned int, unsigned int>",
   "referenced_type" : "type-472",
   "self_type" : "type-472",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "unique_id" : "_ZTS8c2_typesIJjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "c2_types<unsigned long, unsigned int>",
   "name" : "c2_types<unsigned long, unsigned int>",
   "referenced_type" : "type-517",
   "self_type" : "type-517",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "unique_id" : "_ZTS8c2_typesIJmjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "c2_types<unsigned long, unsigned long>",
   "name" : "c2_types<unsigned long, unsigned long>",
   "referenced_type" : "type-538",
   "self_type" : "type-538",
   "size" : 1,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2.h",
   "unique_id" : "_ZTS8c2_typesIJmmEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "flags",
     "field_offset" : 960,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "width",
     "field_offset" : 992,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "height",
     "field_offset" : 1024,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "stride",
     "field_offset" : 1056,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "format",
     "field_offset" : 1088,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "xdpi",
     "field_offset" : 1120,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "ydpi",
     "field_offset" : 1152,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "fps",
     "field_offset" : 1184,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "minSwapInterval",
     "field_offset" : 1216,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "maxSwapInterval",
     "field_offset" : 1248,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "numFramebuffers",
     "field_offset" : 1280,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 1312,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "setSwapInterval",
     "field_offset" : 1536,
     "referenced_type" : "type-50"
    },
    {
     "field_name" : "setUpdateRect",
     "field_offset" : 1600,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "post",
     "field_offset" : 1664,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "compositionComplete",
     "field_offset" : 1728,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "dump",
     "field_offset" : 1792,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "enableScreen",
     "field_offset" : 1856,
     "referenced_type" : "type-50"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 1920,
     "referenced_type" : "type-66"
    }
   ],
   "linker_set_key" : "framebuffer_device_t",
   "name" : "framebuffer_device_t",
   "referenced_type" : "type-45",
   "self_type" : "type-45",
   "size" : 288,
   "source_file" : "/hardware/libhardware/include/hardware/fb.h",
   "unique_id" : "framebuffer_device_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "registerBuffer",
     "field_offset" : 1984,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "unregisterBuffer",
     "field_offset" : 2048,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "lock",
     "field_offset" : 2112,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "unlock",
     "field_offset" : 2176,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "perform",
     "field_offset" : 2240,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "lock_ycbcr",
     "field_offset" : 2304,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "lockAsync",
     "field_offset" : 2368,
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "unlockAsync",
     "field_offset" : 2432,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "lockAsync_ycbcr",
     "field_offset" : 2496,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 2560,
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "gralloc_module_t",
   "name" : "gralloc_module_t",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 344,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h",
   "unique_id" : "gralloc_module_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "module",
     "field_offset" : 64,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "close",
     "field_offset" : 896,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "hw_device_t",
   "name" : "hw_device_t",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 120,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h",
   "unique_id" : "hw_device_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "open",
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "hw_module_methods_t",
   "name" : "hw_module_methods_t",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 8,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h",
   "unique_id" : "hw_module_methods_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "module_api_version",
     "field_offset" : 32,
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "hal_api_version",
     "field_offset" : 48,
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "id",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "author",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "methods",
     "field_offset" : 256,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "dso",
     "field_offset" : 320,
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "hw_module_t",
   "name" : "hw_module_t",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 248,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h",
   "unique_id" : "hw_module_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "C2ParamFieldValues &&",
   "name" : "C2ParamFieldValues &&",
   "referenced_type" : "type-263",
   "self_type" : "type-516",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "std::basic_string<char, std::char_traits<char>, std::allocator<char> > &&",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char> > &&",
   "referenced_type" : "type-396",
   "self_type" : "type-395",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "std::unique_ptr<C2FieldSupportedValues, std::default_delete<C2FieldSupportedValues> > &&",
   "name" : "std::unique_ptr<C2FieldSupportedValues, std::default_delete<C2FieldSupportedValues> > &&",
   "referenced_type" : "type-523",
   "self_type" : "type-522",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "std::vector<C2FieldDescriptor, std::allocator<C2FieldDescriptor> > &&",
   "name" : "std::vector<C2FieldDescriptor, std::allocator<C2FieldDescriptor> > &&",
   "referenced_type" : "type-179",
   "self_type" : "type-178",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "std::vector<C2Param::Index, std::allocator<C2Param::Index> > &&",
   "name" : "std::vector<C2Param::Index, std::allocator<C2Param::Index> > &&",
   "referenced_type" : "type-418",
   "self_type" : "type-417",
   "size" : 8,
   "source_file" : "/frameworks/av/media/codec2/core/include/C2Param.h"
  }
 ]
}
