{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [32]",
   "name" : "unsigned char [32]",
   "referenced_type" : "type-3",
   "self_type" : "type-48",
   "size" : 32,
   "source_file" : "/system/gatekeeper/include/gatekeeper/password_handle.h"
  },
  {
   "linker_set_key" : "unsigned char []",
   "name" : "unsigned char []",
   "referenced_type" : "type-3",
   "self_type" : "type-2",
   "source_file" : "/system/gatekeeper/include/gatekeeper/UniquePtr.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned char",
   "name" : "unsigned char",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned int",
   "name" : "unsigned int",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned long",
   "name" : "unsigned long",

   "name" : "unsigned int *",
   "referenced_type" : "type-6",
   "self_type" : "type-63",
   "size" : 8,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-61",
   "self_type" : "type-60",
   "size" : 8,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_utils.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::DefaultDelete<unsigned char []>",
   "name" : "const gatekeeper::DefaultDelete<unsigned char []>",
   "referenced_type" : "type-1",
   "self_type" : "type-37",
   "size" : 1,
   "source_file" : "/system/gatekeeper/include/gatekeeper/UniquePtr.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::DefaultDelete<unsigned char>",
   "name" : "const gatekeeper::DefaultDelete<unsigned char>",
   "referenced_type" : "type-41",
   "self_type" : "type-40",
   "size" : 1,
   "source_file" : "/system/gatekeeper/include/gatekeeper/UniquePtr.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::EnrollRequest",
   "name" : "const gatekeeper::EnrollRequest",
   "referenced_type" : "type-28",
   "self_type" : "type-30",
   "size" : 72,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::EnrollResponse",
   "name" : "const gatekeeper::EnrollResponse",
   "referenced_type" : "type-32",
   "self_type" : "type-34",
   "size" : 40,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::GateKeeperMessage",
   "name" : "const gatekeeper::GateKeeperMessage",
   "referenced_type" : "type-13",
   "self_type" : "type-15",
   "size" : 24,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::SizedBuffer",
   "name" : "const gatekeeper::SizedBuffer",
   "referenced_type" : "type-9",
   "self_type" : "type-59",
   "size" : 16,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::UniquePtr<unsigned char [], gatekeeper::DefaultDelete<unsigned char []> >",
   "name" : "const gatekeeper::UniquePtr<unsigned char [], gatekeeper::DefaultDelete<unsigned char []> >",
   "referenced_type" : "type-10",
   "self_type" : "type-36",
   "size" : 8,
   "source_file" : "/system/gatekeeper/include/gatekeeper/UniquePtr.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::UniquePtr<unsigned char, gatekeeper::DefaultDelete<unsigned char> >",
   "name" : "const gatekeeper::UniquePtr<unsigned char, gatekeeper::DefaultDelete<unsigned char> >",
   "referenced_type" : "type-43",
   "self_type" : "type-45",
   "size" : 8,
   "source_file" : "/system/gatekeeper/include/gatekeeper/UniquePtr.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::VerifyRequest",
   "name" : "const gatekeeper::VerifyRequest",
   "referenced_type" : "type-19",
   "self_type" : "type-21",
   "size" : 64,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::VerifyResponse",
   "name" : "const gatekeeper::VerifyResponse",
   "referenced_type" : "type-23",
   "self_type" : "type-26",
   "size" : 48,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::failure_record_t",
   "name" : "const gatekeeper::failure_record_t",
   "referenced_type" : "type-49",
   "self_type" : "type-55",
   "size" : 20,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const gatekeeper::password_handle_t",
   "name" : "const gatekeeper::password_handle_t",
   "referenced_type" : "type-47",
   "self_type" : "type-57",
   "size" : 58,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-3",
   "self_type" : "type-17",
   "size" : 1,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-6",
   "self_type" : "type-7",
   "size" : 4,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "gatekeeper::DefaultDelete<unsigned char []>",
   "name" : "gatekeeper::DefaultDelete<unsigned char []>",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 1,
   "source_file" : "/system/gatekeeper/include/gatekeeper/UniquePtr.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN10gatekeeper13DefaultDeleteIA_hEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "gatekeeper::DefaultDelete<unsigned char>",
   "name" : "gatekeeper::DefaultDelete<unsigned char>",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 1,
   "source_file" : "/system/gatekeeper/include/gatekeeper/UniquePtr.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN10gatekeeper13DefaultDeleteIhEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-13"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "password_handle",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "enrolled_password",
     "field_offset" : 320,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "provided_password",
     "field_offset" : 448,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "gatekeeper::EnrollRequest",
   "name" : "gatekeeper::EnrollRequest",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 72,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h",
   "unique_id" : "_ZTSN10gatekeeper13EnrollRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN10gatekeeper13EnrollRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper13EnrollRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper13EnrollRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper13EnrollRequest22nonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper13EnrollRequest17nonErrorSerializeEPh"
    },
    {
     "mangled_component_name" : "_ZN10gatekeeper13EnrollRequest19nonErrorDeserializeEPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-13"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "enrolled_password_handle",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "gatekeeper::EnrollResponse",
   "name" : "gatekeeper::EnrollResponse",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 40,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h",
   "unique_id" : "_ZTSN10gatekeeper14EnrollResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN10gatekeeper14EnrollResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper14EnrollResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper14EnrollResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper14EnrollResponse22nonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper14EnrollResponse17nonErrorSerializeEPh"
    },
    {
     "mangled_component_name" : "_ZN10gatekeeper14EnrollResponse19nonErrorDeserializeEPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "gatekeeper::GateKeeper",
   "name" : "gatekeeper::GateKeeper",
   "record_kind" : "class",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 8,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper.h",
   "unique_id" : "_ZTSN10gatekeeper10GateKeeperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN10gatekeeper10GateKeeperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper10GateKeeperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper10GateKeeperD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK10gatekeeper10GateKeeper15GetAuthTokenKeyEPPKhPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN10gatekeeper10GateKeeper14GetPasswordKeyEPPKhPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK10gatekeeper10GateKeeper24ComputePasswordSignatureEPhjPKhjS3_jm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK10gatekeeper10GateKeeper9GetRandomEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK10gatekeeper10GateKeeper16ComputeSignatureEPhjPKhjS3_j"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK10gatekeeper10GateKeeper24GetMillisecondsSinceBootEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN10gatekeeper10GateKeeper16GetFailureRecordEjmPNS_16failure_record_tEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN10gatekeeper10GateKeeper18ClearFailureRecordEjmb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN10gatekeeper10GateKeeper18WriteFailureRecordEjPNS_16failure_record_tEb"
    },
    {
     "mangled_component_name" : "_ZN10gatekeeper10GateKeeper19ComputeRetryTimeoutEPKNS_16failure_record_tE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK10gatekeeper10GateKeeper16IsHardwareBackedEv"
    },
    {
     "mangled_component_name" : "_ZN10gatekeeper10GateKeeper8DoVerifyEPKNS_17password_handle_tERKNS_11SizedBufferE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "error",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "user_id",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "retry_timeout",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "gatekeeper::GateKeeperMessage",
   "name" : "gatekeeper::GateKeeperMessage",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 24,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h",
   "unique_id" : "_ZTSN10gatekeeper17GateKeeperMessageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN10gatekeeper17GateKeeperMessageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper17GateKeeperMessageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper17GateKeeperMessageD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper17GateKeeperMessage22nonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper17GateKeeperMessage17nonErrorSerializeEPh"
    },
    {
     "mangled_component_name" : "_ZN10gatekeeper17GateKeeperMessage19nonErrorDeserializeEPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "gatekeeper::SizedBuffer",
   "name" : "gatekeeper::SizedBuffer",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 16,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h",
   "unique_id" : "_ZTSN10gatekeeper11SizedBufferE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "gatekeeper::UniquePtr<unsigned char [], gatekeeper::DefaultDelete<unsigned char []> >",
   "name" : "gatekeeper::UniquePtr<unsigned char [], gatekeeper::DefaultDelete<unsigned char []> >",
   "record_kind" : "class",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 8,
   "source_file" : "/system/gatekeeper/include/gatekeeper/UniquePtr.h",
   "template_args" : [ "type-2", "type-1" ],
   "unique_id" : "_ZTSN10gatekeeper9UniquePtrIA_hNS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "gatekeeper::UniquePtr<unsigned char, gatekeeper::DefaultDelete<unsigned char> >",
   "name" : "gatekeeper::UniquePtr<unsigned char, gatekeeper::DefaultDelete<unsigned char> >",
   "record_kind" : "class",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 8,
   "source_file" : "/system/gatekeeper/include/gatekeeper/UniquePtr.h",
   "template_args" : [ "type-3", "type-41" ],
   "unique_id" : "_ZTSN10gatekeeper9UniquePtrIhNS_13DefaultDeleteIhEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-13"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "password_handle",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "provided_password",
     "field_offset" : 384,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "gatekeeper::VerifyRequest",
   "name" : "gatekeeper::VerifyRequest",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 64,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h",
   "unique_id" : "_ZTSN10gatekeeper13VerifyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN10gatekeeper13VerifyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper13VerifyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper13VerifyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper13VerifyRequest22nonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper13VerifyRequest17nonErrorSerializeEPh"
    },
    {
     "mangled_component_name" : "_ZN10gatekeeper13VerifyRequest19nonErrorDeserializeEPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-13"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "auth_token",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "request_reenroll",
     "field_offset" : 320,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "gatekeeper::VerifyResponse",
   "name" : "gatekeeper::VerifyResponse",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 48,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper_messages.h",
   "unique_id" : "_ZTSN10gatekeeper14VerifyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN10gatekeeper14VerifyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper14VerifyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN10gatekeeper14VerifyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper14VerifyResponse22nonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK10gatekeeper14VerifyResponse17nonErrorSerializeEPh"
    },
    {
     "mangled_component_name" : "_ZN10gatekeeper14VerifyResponse19nonErrorDeserializeEPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "secure_user_id",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "last_checked_timestamp",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "failure_counter",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "gatekeeper::failure_record_t",
   "name" : "gatekeeper::failure_record_t",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 20,
   "source_file" : "/system/gatekeeper/include/gatekeeper/gatekeeper.h",
   "unique_id" : "_ZTSN10gatekeeper16failure_record_tE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "user_id",
     "field_offset" : 8,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "flags",
     "field_offset" : 72,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "salt",
     "field_offset" : 136,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "signature",
     "field_offset" : 200,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "hardware_backed",
     "field_offset" : 456,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "gatekeeper::password_handle_t",
   "name" : "gatekeeper::password_handle_t",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 58,
   "source_file" : "/system/gatekeeper/include/gatekeeper/password_handle.h",
   "unique_id" : "_ZTSN10gatekeeper17password_handle_tE"
  }
 ],
 "rvalue_reference_types" : []
}
