{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-120",
   "self_type" : "type-165",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [10]",
   "name" : "char [10]",
   "referenced_type" : "type-120",
   "self_type" : "type-728",
   "size" : 10,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [11]",
   "name" : "char [11]",
   "referenced_type" : "type-120",
   "self_type" : "type-750",
   "size" : 11,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [12]",
   "name" : "char [12]",
   "referenced_type" : "type-120",
   "self_type" : "type-724",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [13]",
   "name" : "char [13]",
   "referenced_type" : "type-120",
   "self_type" : "type-721",
   "size" : 13,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [14]",
   "name" : "char [14]",
   "referenced_type" : "type-120",
   "self_type" : "type-769",
   "size" : 14,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [15]",

   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const long",
   "name" : "const long",
   "referenced_type" : "type-100",
   "self_type" : "type-138",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const native_handle",
   "name" : "const native_handle",
   "referenced_type" : "type-89",
   "self_type" : "type-88",
   "size" : 12,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const short",
   "name" : "const short",
   "referenced_type" : "type-95",
   "self_type" : "type-481",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const signed char",
   "name" : "const signed char",
   "referenced_type" : "type-93",
   "self_type" : "type-478",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "const std::function<void ()>",
   "name" : "const std::function<void ()>",
   "referenced_type" : "type-252",
   "self_type" : "type-251",
   "size" : 48,
   "source_file" : "/system/libhwbinder/include/hwbinder/IPCThreadState.h"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "const std::function<void ()>",
   "name" : "const std::function<void ()>",
   "referenced_type" : "type-714",
   "self_type" : "type-713",
   "size" : 48,
   "source_file" : "/system/libhwbinder/include/hwbinder/IPCThreadState.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::unique_ptr<android::String16, std::default_delete<android::String16> >",
   "name" : "const std::unique_ptr<android::String16, std::default_delete<android::String16> >",
   "referenced_type" : "type-300",
   "self_type" : "type-299",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::unique_ptr<android::String16, std::default_delete<android::String16> >",
   "name" : "const std::unique_ptr<android::String16, std::default_delete<android::String16> >",
   "referenced_type" : "type-79",
   "self_type" : "type-78",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-11",
   "self_type" : "type-20",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned char *const",
   "name" : "const unsigned char *const",
   "referenced_type" : "type-19",
   "self_type" : "type-797",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-4",
   "self_type" : "type-74",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-7",
   "self_type" : "type-187",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long *const",
   "name" : "const unsigned long *const",
   "referenced_type" : "type-800",
   "self_type" : "type-799",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-13",
   "self_type" : "type-22",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-97",
   "self_type" : "type-483",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-17",
   "self_type" : "type-111",
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const void *const",
   "name" : "const void *const",
   "referenced_type" : "type-110",
   "self_type" : "type-489",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-23",
   "self_type" : "type-740",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-14",
   "self_type" : "type-68",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-9",
   "self_type" : "type-278",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/BpHwBinder.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-504"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "d_",
     "field_offset" : 64,
     "referenced_type" : "type-611"
    },
    {
     "access" : "private",
     "field_name" : "s_",
     "field_offset" : 128,
     "referenced_type" : "type-612"
    }
   ],
   "linker_set_key" : "Renamer",
   "name" : "Renamer",
   "record_kind" : "class",
   "referenced_type" : "type-610",
   "self_type" : "type-610",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mE7Renamer",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mE7Renamer"
    },
    {
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mENK7RenamerclEm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mEN7RenamerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mEN7RenamerD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFrameLines",
     "referenced_type" : "type-700"
    }
   ],
   "linker_set_key" : "android::CallStack",
   "name" : "android::CallStack",
   "record_kind" : "class",
   "referenced_type" : "type-810",
   "self_type" : "type-810",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/CallStack.h",
   "unique_id" : "_ZTSN7android9CallStackE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CallStack::StackDeleter",
   "name" : "android::CallStack::StackDeleter",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/CallStack.h",
   "unique_id" : "_ZTSN7android9CallStack12StackDeleterE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-137",
   "self_type" : "type-137",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-67"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 48,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-351"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-363",
   "self_type" : "type-363",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-289", "type-71" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-283"
    }
   ],
   "linker_set_key" : "android::KeyedVector<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "name" : "android::KeyedVector<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "record_kind" : "class",
   "referenced_type" : "type-282",
   "self_type" : "type-282",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-110", "type-286" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-254"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-262"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-261",
   "self_type" : "type-261",
   "size" : 56,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-267"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-266",
   "self_type" : "type-266",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-267"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-269",
   "self_type" : "type-269",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-518",
   "self_type" : "type-518",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-504",
   "self_type" : "type-504",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-284"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "type-351",
   "self_type" : "type-351",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-352" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-284"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "name" : "android::SortedVector<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-283",
   "self_type" : "type-283",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-285" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE7do_copyEPvS3_m"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE8do_splatEPvS3_m"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE15do_move_forwardEPvS3_m"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE16do_move_backwardEPvS3_m"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE10do_compareES3_S3_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-284",
   "self_type" : "type-284",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-290"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-383"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-382",
   "self_type" : "type-382",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-31"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 64,
     "referenced_type" : "type-63"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 128,
     "referenced_type" : "type-23"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 192,
     "referenced_type" : "type-64"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 512,
     "referenced_type" : "type-66"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 896,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 928,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 936,
     "referenced_type" : "type-68"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 960,
     "referenced_type" : "type-60"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 1024,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 152,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 136,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcim"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::Vector<android::RefBase *>",
   "name" : "android::Vector<android::RefBase *>",
   "record_kind" : "class",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN7android6VectorIPNS_7RefBaseEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_7RefBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::Vector<android::RefBase::weakref_type *>",
   "name" : "android::Vector<android::RefBase::weakref_type *>",
   "record_kind" : "class",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android6VectorIPNS_7RefBase12weakref_typeEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_7RefBase12weakref_typeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBase12weakref_typeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBase12weakref_typeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::Vector<android::String8>",
   "name" : "android::Vector<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "type-700",
   "self_type" : "type-700",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-382" ],
   "unique_id" : "_ZTSN7android6VectorINS_7String8EEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::BHwBinder *>",
   "name" : "android::Vector<android::hardware::BHwBinder *>",
   "record_kind" : "class",
   "referenced_type" : "type-525",
   "self_type" : "type-525",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android6VectorIPNS_8hardware9BHwBinderEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_8hardware9BHwBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_8hardware9BHwBinderEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_8hardware9BHwBinderEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::BpHwBinder::Obituary>",
   "name" : "android::Vector<android::hardware::BpHwBinder::Obituary>",
   "record_kind" : "class",
   "referenced_type" : "type-519",
   "self_type" : "type-519",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-294" ],
   "unique_id" : "_ZTSN7android6VectorINS_8hardware10BpHwBinder8ObituaryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware10BpHwBinder8ObituaryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware10BpHwBinder8ObituaryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware10BpHwBinder8ObituaryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "type-356",
   "self_type" : "type-356",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-326" ],
   "unique_id" : "_ZTSN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::Vector<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "name" : "android::Vector<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "record_kind" : "class",
   "referenced_type" : "type-628",
   "self_type" : "type-628",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-581" ],
   "unique_id" : "_ZTSN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-186"
    }
   ],
   "linker_set_key" : "android::Vector<int>",
   "name" : "android::Vector<int>",
   "record_kind" : "class",
   "referenced_type" : "type-622",
   "self_type" : "type-622",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android6VectorIiEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIiEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIiED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIiED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "type-23"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "type-74"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "type-187"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::aggregate_traits<android::String16, android::sp<android::hardware::IBinder> >",
   "referenced_type" : "type-420",
   "self_type" : "type-420",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-289", "type-71" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "name" : "android::aggregate_traits<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-579",
   "self_type" : "type-579",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110", "type-286" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 128,
     "referenced_type" : "type-38"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 192,
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "android::hardware::BHwBinder",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 48,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware9BHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "type-277"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-64"
    },
    {
     "access" : "private",
     "field_name" : "mAlive",
     "field_offset" : 416,
     "referenced_type" : "type-278"
    },
    {
     "access" : "private",
     "field_name" : "mObitsSent",
     "field_offset" : 448,
     "referenced_type" : "type-278"
    },
    {
     "access" : "private",
     "field_name" : "mObituaries",
     "field_offset" : 512,
     "referenced_type" : "type-279"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 576,
     "referenced_type" : "type-281"
    },
    {
     "access" : "private",
     "field_name" : "mConstantData",
     "field_offset" : 896,
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "mDescriptorCache",
     "field_offset" : 960,
     "referenced_type" : "type-289"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwBinder",
   "name" : "android::hardware::BpHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-276",
   "self_type" : "type-276",
   "size" : 144,
   "source_file" : "/system/libhwbinder/include/hwbinder/BpHwBinder.h",
   "unique_id" : "_ZTSN7android8hardware10BpHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 128,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10BpHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware10BpHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -128,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -128,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -128,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -128,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -128,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10BpHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10BpHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10BpHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware10BpHwBinder10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware10BpHwBinder15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware10BpHwBinder20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "recipient",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "cookie",
     "field_offset" : 128,
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwBinder::Obituary",
   "name" : "android::hardware::BpHwBinder::Obituary",
   "referenced_type" : "type-294",
   "self_type" : "type-294",
   "size" : 32,
   "source_file" : "/system/libhwbinder/include/hwbinder/BpHwBinder.h",
   "unique_id" : "_ZTSN7android8hardware10BpHwBinder8ObituaryE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mObjects",
     "referenced_type" : "type-282"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwBinder::ObjectManager",
   "name" : "android::hardware::BpHwBinder::ObjectManager",
   "record_kind" : "class",
   "referenced_type" : "type-281",
   "self_type" : "type-281",
   "size" : 40,
   "source_file" : "/system/libhwbinder/include/hwbinder/BpHwBinder.h",
   "unique_id" : "_ZTSN7android8hardware10BpHwBinder13ObjectManagerE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "object",
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "cleanupCookie",
     "field_offset" : 64,
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "func",
     "field_offset" : 128,
     "referenced_type" : "type-287"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwBinder::ObjectManager::entry_t",
   "name" : "android::hardware::BpHwBinder::ObjectManager::entry_t",
   "referenced_type" : "type-286",
   "self_type" : "type-286",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/BpHwBinder.h",
   "unique_id" : "_ZTSN7android8hardware10BpHwBinder13ObjectManager7entry_tE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-31"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 64,
     "referenced_type" : "type-145"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 128,
     "referenced_type" : "type-25"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 192,
     "referenced_type" : "type-146"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwRefBase",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 48,
   "source_file" : "/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware11BpHwRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-448"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSeq",
     "field_offset" : 96,
     "referenced_type" : "type-277"
    },
    {
     "access" : "private",
     "field_name" : "mIndex",
     "field_offset" : 128,
     "referenced_type" : "type-277"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 160,
     "referenced_type" : "type-64"
    },
    {
     "access" : "private",
     "field_name" : "mGlobalState",
     "field_offset" : 512,
     "referenced_type" : "type-582"
    }
   ],
   "linker_set_key" : "android::hardware::BufferedTextOutput",
   "name" : "android::hardware::BufferedTextOutput",
   "record_kind" : "class",
   "referenced_type" : "type-613",
   "self_type" : "type-613",
   "size" : 72,
   "source_file" : "/system/libhwbinder/include/hwbinder/BufferedTextOutput.h",
   "unique_id" : "_ZTSN7android8hardware18BufferedTextOutputE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware18BufferedTextOutputE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware18BufferedTextOutputD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware18BufferedTextOutputD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware18BufferedTextOutput5printEPKcm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware18BufferedTextOutput10moveIndentEi"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware18BufferedTextOutput10pushBundleEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware18BufferedTextOutput9popBundleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware18BufferedTextOutput10writeLinesERK5iovecm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-110"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mBytesPerLine",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mSingleLineCutoff",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mAlignment",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mCArrayStyle",
     "field_offset" : 320,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::hardware::HexDump",
   "name" : "android::hardware::HexDump",
   "record_kind" : "class",
   "referenced_type" : "type-455",
   "self_type" : "type-455",
   "size" : 48,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h",
   "unique_id" : "_ZTSN7android8hardware7HexDumpE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder::DeathRecipient",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "android::hardware::IInterface",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-298",
   "self_type" : "type-298",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/IInterface.h",
   "unique_id" : "_ZTSN7android8hardware10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mProcess",
     "referenced_type" : "type-544"
    },
    {
     "access" : "private",
     "field_name" : "mPendingStrongDerefs",
     "field_offset" : 64,
     "referenced_type" : "type-525"
    },
    {
     "access" : "private",
     "field_name" : "mPendingWeakDerefs",
     "field_offset" : 384,
     "referenced_type" : "type-526"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteStrongDerefs",
     "field_offset" : 704,
     "referenced_type" : "type-527"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteWeakDerefs",
     "field_offset" : 1024,
     "referenced_type" : "type-526"
    },
    {
     "access" : "private",
     "field_name" : "mIn",
     "field_offset" : 1344,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mOut",
     "field_offset" : 2432,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mLastError",
     "field_offset" : 3520,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mCallingPid",
     "field_offset" : 3552,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mCallingSid",
     "field_offset" : 3584,
     "referenced_type" : "type-383"
    },
    {
     "access" : "private",
     "field_name" : "mCallingUid",
     "field_offset" : 3648,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mStrictModePolicy",
     "field_offset" : 3680,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mLastTransactionBinderFlags",
     "field_offset" : 3712,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mContextObject",
     "field_offset" : 3776,
     "referenced_type" : "type-545"
    },
    {
     "access" : "private",
     "field_name" : "mIsLooper",
     "field_offset" : 3840,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mIsPollingThread",
     "field_offset" : 3848,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mPostCommandTasks",
     "field_offset" : 3904,
     "referenced_type" : "type-546"
    },
    {
     "access" : "private",
     "field_name" : "mIPCThreadStateBase",
     "field_offset" : 4096,
     "referenced_type" : "type-547"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 4160,
     "referenced_type" : "type-385"
    }
   ],
   "linker_set_key" : "android::hardware::IPCThreadState",
   "name" : "android::hardware::IPCThreadState",
   "record_kind" : "class",
   "referenced_type" : "type-543",
   "self_type" : "type-543",
   "size" : 528,
   "source_file" : "/system/libhwbinder/include/hwbinder/IPCThreadState.h",
   "unique_id" : "_ZTSN7android8hardware14IPCThreadStateE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 320,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 384,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 448,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 512,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 576,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 640,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 704,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 768,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 832,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 896,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 904,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 912,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 960,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 1024,
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 136,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel::BufferInfo",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "type-309",
   "self_type" : "type-309",
   "size" : 24,
   "source_file" : "/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6Parcel10BufferInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-31"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 128,
     "referenced_type" : "type-23"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 192,
     "referenced_type" : "type-376"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 512,
     "referenced_type" : "type-377"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 896,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 960,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 1024,
     "referenced_type" : "type-100"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 1088,
     "referenced_type" : "type-64"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 1408,
     "referenced_type" : "type-356"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 1728,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 1792,
     "referenced_type" : "type-378"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 1856,
     "referenced_type" : "type-23"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 1920,
     "referenced_type" : "type-363"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 2240,
     "referenced_type" : "type-382"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 2304,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 2312,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 2336,
     "referenced_type" : "type-278"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 2368,
     "referenced_type" : "type-187"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 2432,
     "referenced_type" : "type-385"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "type-375",
   "self_type" : "type-375",
   "size" : 328,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessStateE",
   "vtable_components" :
   [
    {
     "component_value" : 312,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -312,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -312,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "refs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState::handle_entry",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "type-326",
   "self_type" : "type-326",
   "size" : 16,
   "source_file" : "/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessState12handle_entryE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::hardware::TextOutput",
   "name" : "android::hardware::TextOutput",
   "record_kind" : "class",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h",
   "unique_id" : "_ZTSN7android8hardware10TextOutputE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10TextOutputE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10TextOutputD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10TextOutputD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10TextOutput5printEPKcm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10TextOutput10moveIndentEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10TextOutput10pushBundleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10TextOutput9popBundleEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTO",
     "referenced_type" : "type-587"
    }
   ],
   "linker_set_key" : "android::hardware::TextOutput::Bundle",
   "name" : "android::hardware::TextOutput::Bundle",
   "record_kind" : "class",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 8,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h",
   "unique_id" : "_ZTSN7android8hardware10TextOutput6BundleE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCode",
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::hardware::TypeCode",
   "name" : "android::hardware::TypeCode",
   "record_kind" : "class",
   "referenced_type" : "type-452",
   "self_type" : "type-452",
   "size" : 4,
   "source_file" : "/system/libhwbinder/include/hwbinder/TextOutput.h",
   "unique_id" : "_ZTSN7android8hardware8TypeCodeE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-289"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> >",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-289", "type-71" ],
   "unique_id" : "_ZTSN7android16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-286"
    }
   ],
   "linker_set_key" : "android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "name" : "android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-487",
   "self_type" : "type-487",
   "size" : 32,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110", "type-286" ],
   "unique_id" : "_ZTSN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-61"
    }
   ],
   "linker_set_key" : "android::sp<android::Thread>",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-62" ],
   "unique_id" : "_ZTSN7android2spINS_6ThreadEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::BHwBinder>",
   "name" : "android::sp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-545",
   "self_type" : "type-545",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-582"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::BufferedTextOutput::BufferState>",
   "name" : "android::sp<android::hardware::BufferedTextOutput::BufferState>",
   "record_kind" : "class",
   "referenced_type" : "type-581",
   "self_type" : "type-581",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-584" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "name" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-513",
   "self_type" : "type-513",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-53"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IBinder>",
   "name" : "android::sp<android::hardware::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware7IBinderEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-664"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IInterface>",
   "name" : "android::sp<android::hardware::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "type-663",
   "self_type" : "type-663",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-298" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware10IInterfaceEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-374"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::ProcessState>",
   "name" : "android::sp<android::hardware::ProcessState>",
   "record_kind" : "class",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-375" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware12ProcessStateEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::RefBase *>",
   "name" : "android::trait_pointer<android::RefBase *>",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN7android13trait_pointerIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::RefBase::weakref_type *>",
   "name" : "android::trait_pointer<android::RefBase::weakref_type *>",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android13trait_pointerIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::String16>",
   "name" : "android::trait_pointer<android::String16>",
   "referenced_type" : "type-414",
   "self_type" : "type-414",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-289" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::hardware::BHwBinder *>",
   "name" : "android::trait_pointer<android::hardware::BHwBinder *>",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android13trait_pointerIPNS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::hardware::BpHwBinder::Obituary>",
   "name" : "android::trait_pointer<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "type-573",
   "self_type" : "type-573",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-294" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_8hardware10BpHwBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "name" : "android::trait_pointer<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-572",
   "self_type" : "type-572",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-286" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::hardware::ProcessState::handle_entry>",
   "name" : "android::trait_pointer<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "type-412",
   "self_type" : "type-412",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-326" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_8hardware12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-323" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_pointer<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-570",
   "self_type" : "type-570",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_pointer<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-640",
   "self_type" : "type-640",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-581" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::sp<android::hardware::IBinder> >",
   "name" : "android::trait_pointer<android::sp<android::hardware::IBinder> >",
   "referenced_type" : "type-415",
   "self_type" : "type-415",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<const void *>",
   "name" : "android::trait_pointer<const void *>",
   "referenced_type" : "type-571",
   "self_type" : "type-571",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android13trait_pointerIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<int>",
   "name" : "android::trait_pointer<int>",
   "referenced_type" : "type-444",
   "self_type" : "type-444",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android13trait_pointerIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::RefBase *>",
   "name" : "android::trait_trivial_copy<android::RefBase *>",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::RefBase::weakref_type *>",
   "name" : "android::trait_trivial_copy<android::RefBase::weakref_type *>",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::String16>",
   "name" : "android::trait_trivial_copy<android::String16>",
   "referenced_type" : "type-405",
   "self_type" : "type-405",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-289" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::hardware::BHwBinder *>",
   "name" : "android::trait_trivial_copy<android::hardware::BHwBinder *>",
   "referenced_type" : "type-807",
   "self_type" : "type-807",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIPNS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::hardware::BpHwBinder::Obituary>",
   "name" : "android::trait_trivial_copy<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "type-564",
   "self_type" : "type-564",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-294" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_8hardware10BpHwBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "name" : "android::trait_trivial_copy<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-562",
   "self_type" : "type-562",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-286" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::hardware::ProcessState::handle_entry>",
   "name" : "android::trait_trivial_copy<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "type-404",
   "self_type" : "type-404",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-326" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_8hardware12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-323" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_trivial_copy<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-637",
   "self_type" : "type-637",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-581" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::sp<android::hardware::IBinder> >",
   "name" : "android::trait_trivial_copy<android::sp<android::hardware::IBinder> >",
   "referenced_type" : "type-406",
   "self_type" : "type-406",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-305",
   "self_type" : "type-305",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-331",
   "self_type" : "type-331",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-120" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<const void *>",
   "name" : "android::trait_trivial_copy<const void *>",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-475",
   "self_type" : "type-475",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-471",
   "self_type" : "type-471",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-463",
   "self_type" : "type-463",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-461" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-440",
   "self_type" : "type-440",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-368",
   "self_type" : "type-368",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-95" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-344",
   "self_type" : "type-344",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-432",
   "self_type" : "type-432",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-467",
   "self_type" : "type-467",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-394",
   "self_type" : "type-394",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-97" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::RefBase *>",
   "name" : "android::trait_trivial_ctor<android::RefBase *>",
   "referenced_type" : "type-752",
   "self_type" : "type-752",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::RefBase::weakref_type *>",
   "name" : "android::trait_trivial_ctor<android::RefBase::weakref_type *>",
   "referenced_type" : "type-741",
   "self_type" : "type-741",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::String16>",
   "name" : "android::trait_trivial_ctor<android::String16>",
   "referenced_type" : "type-397",
   "self_type" : "type-397",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-289" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::hardware::BHwBinder *>",
   "name" : "android::trait_trivial_ctor<android::hardware::BHwBinder *>",
   "referenced_type" : "type-730",
   "self_type" : "type-730",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIPNS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::hardware::BpHwBinder::Obituary>",
   "name" : "android::trait_trivial_ctor<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-294" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_8hardware10BpHwBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "name" : "android::trait_trivial_ctor<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-286" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::hardware::ProcessState::handle_entry>",
   "name" : "android::trait_trivial_ctor<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "type-395",
   "self_type" : "type-395",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-326" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_8hardware12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-323" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-552",
   "self_type" : "type-552",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_trivial_ctor<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-581" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::sp<android::hardware::IBinder> >",
   "name" : "android::trait_trivial_ctor<android::sp<android::hardware::IBinder> >",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-318",
   "self_type" : "type-318",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-120" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<const void *>",
   "name" : "android::trait_trivial_ctor<const void *>",
   "referenced_type" : "type-553",
   "self_type" : "type-553",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-473",
   "self_type" : "type-473",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-469",
   "self_type" : "type-469",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-460",
   "self_type" : "type-460",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-461" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-347",
   "self_type" : "type-347",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-95" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-339",
   "self_type" : "type-339",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-430",
   "self_type" : "type-430",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-465",
   "self_type" : "type-465",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-446",
   "self_type" : "type-446",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-386",
   "self_type" : "type-386",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-97" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::RefBase *>",
   "name" : "android::trait_trivial_dtor<android::RefBase *>",
   "referenced_type" : "type-805",
   "self_type" : "type-805",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::RefBase::weakref_type *>",
   "name" : "android::trait_trivial_dtor<android::RefBase::weakref_type *>",
   "referenced_type" : "type-795",
   "self_type" : "type-795",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::String16>",
   "name" : "android::trait_trivial_dtor<android::String16>",
   "referenced_type" : "type-401",
   "self_type" : "type-401",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-289" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::hardware::BHwBinder *>",
   "name" : "android::trait_trivial_dtor<android::hardware::BHwBinder *>",
   "referenced_type" : "type-783",
   "self_type" : "type-783",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIPNS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::hardware::BpHwBinder::Obituary>",
   "name" : "android::trait_trivial_dtor<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-294" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_8hardware10BpHwBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "name" : "android::trait_trivial_dtor<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-286" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::hardware::ProcessState::handle_entry>",
   "name" : "android::trait_trivial_dtor<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-326" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_8hardware12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-323" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-559",
   "self_type" : "type-559",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_trivial_dtor<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-636",
   "self_type" : "type-636",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-581" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::sp<android::hardware::IBinder> >",
   "name" : "android::trait_trivial_dtor<android::sp<android::hardware::IBinder> >",
   "referenced_type" : "type-402",
   "self_type" : "type-402",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-321",
   "self_type" : "type-321",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-120" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<const void *>",
   "name" : "android::trait_trivial_dtor<const void *>",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-474",
   "self_type" : "type-474",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-470",
   "self_type" : "type-470",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-424",
   "self_type" : "type-424",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-461" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-439",
   "self_type" : "type-439",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-367",
   "self_type" : "type-367",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-95" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-340",
   "self_type" : "type-340",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-431",
   "self_type" : "type-431",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-466",
   "self_type" : "type-466",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-449",
   "self_type" : "type-449",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-97" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::RefBase *>",
   "name" : "android::trait_trivial_move<android::RefBase *>",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::RefBase::weakref_type *>",
   "name" : "android::trait_trivial_move<android::RefBase::weakref_type *>",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String16>",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "template_args" : [ "type-289" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String8>",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "type-382" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::hardware::BHwBinder *>",
   "name" : "android::trait_trivial_move<android::hardware::BHwBinder *>",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIPNS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::hardware::BpHwBinder::Obituary>",
   "name" : "android::trait_trivial_move<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "type-569",
   "self_type" : "type-569",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-294" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8hardware10BpHwBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "name" : "android::trait_trivial_move<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-286" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::hardware::ProcessState::handle_entry>",
   "name" : "android::trait_trivial_move<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "type-408",
   "self_type" : "type-408",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-326" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8hardware12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "referenced_type" : "type-410",
   "self_type" : "type-410",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-323" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-568",
   "self_type" : "type-568",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_trivial_move<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-581" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::sp<android::hardware::IBinder> >",
   "name" : "android::trait_trivial_move<android::sp<android::hardware::IBinder> >",
   "referenced_type" : "type-409",
   "self_type" : "type-409",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-317",
   "self_type" : "type-317",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-120" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<const void *>",
   "name" : "android::trait_trivial_move<const void *>",
   "referenced_type" : "type-565",
   "self_type" : "type-565",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-472",
   "self_type" : "type-472",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-464",
   "self_type" : "type-464",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-461" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-443",
   "self_type" : "type-443",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-371",
   "self_type" : "type-371",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-95" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-345",
   "self_type" : "type-345",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-468",
   "self_type" : "type-468",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-459",
   "self_type" : "type-459",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-400",
   "self_type" : "type-400",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-97" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-232",
   "self_type" : "type-232",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::RefBase *>",
   "name" : "android::traits<android::RefBase *>",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN7android6traitsIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::RefBase::weakref_type *>",
   "name" : "android::traits<android::RefBase::weakref_type *>",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android6traitsIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::String16>",
   "name" : "android::traits<android::String16>",
   "referenced_type" : "type-418",
   "self_type" : "type-418",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-289" ],
   "unique_id" : "_ZTSN7android6traitsINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::hardware::BHwBinder *>",
   "name" : "android::traits<android::hardware::BHwBinder *>",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android6traitsIPNS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::hardware::BpHwBinder::Obituary>",
   "name" : "android::traits<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "type-578",
   "self_type" : "type-578",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-294" ],
   "unique_id" : "_ZTSN7android6traitsINS_8hardware10BpHwBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "name" : "android::traits<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-576",
   "self_type" : "type-576",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-286" ],
   "unique_id" : "_ZTSN7android6traitsINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::hardware::ProcessState::handle_entry>",
   "name" : "android::traits<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "type-416",
   "self_type" : "type-416",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-326" ],
   "unique_id" : "_ZTSN7android6traitsINS_8hardware12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::traits<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "referenced_type" : "type-417",
   "self_type" : "type-417",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-323" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "name" : "android::traits<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-574",
   "self_type" : "type-574",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "name" : "android::traits<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-641",
   "self_type" : "type-641",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-581" ],
   "unique_id" : "_ZTSN7android6traitsINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::sp<android::hardware::IBinder> >",
   "name" : "android::traits<android::sp<android::hardware::IBinder> >",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android6traitsINS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<const void *>",
   "name" : "android::traits<const void *>",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android6traitsIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<int>",
   "name" : "android::traits<int>",
   "referenced_type" : "type-445",
   "self_type" : "type-445",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android6traitsIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-683"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::RefBase *>",
   "name" : "android::use_trivial_move<android::RefBase *>",
   "referenced_type" : "type-682",
   "self_type" : "type-682",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-30" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-681"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::RefBase::weakref_type *>",
   "name" : "android::use_trivial_move<android::RefBase::weakref_type *>",
   "referenced_type" : "type-680",
   "self_type" : "type-680",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-679"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::hardware::BHwBinder *>",
   "name" : "android::use_trivial_move<android::hardware::BHwBinder *>",
   "referenced_type" : "type-678",
   "self_type" : "type-678",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIPNS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-499"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::hardware::BpHwBinder::Obituary>",
   "name" : "android::use_trivial_move<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "type-498",
   "self_type" : "type-498",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-294" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_8hardware10BpHwBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-334"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::hardware::ProcessState::handle_entry>",
   "name" : "android::use_trivial_move<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-326" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_8hardware12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-336"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::use_trivial_move<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "referenced_type" : "type-335",
   "self_type" : "type-335",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-323" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-497"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "name" : "android::use_trivial_move<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-643"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "name" : "android::use_trivial_move<android::sp<android::hardware::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-642",
   "self_type" : "type-642",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-581" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-423"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<int>",
   "name" : "android::use_trivial_move<int>",
   "referenced_type" : "type-422",
   "self_type" : "type-422",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIiEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-83"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "name" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-53"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::IBinder>",
   "name" : "android::wp<android::hardware::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware7IBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-102"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-242",
   "self_type" : "type-242",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-224"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-236"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-230"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-234"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-233",
   "self_type" : "type-233",
   "size" : 16,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "component",
     "field_offset" : 64,
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-229",
   "self_type" : "type-229",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-240"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-240"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-240"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-240"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-102"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-102"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-240",
   "self_type" : "type-240",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "cb",
     "field_offset" : 64,
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "cr",
     "field_offset" : 128,
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "type-224"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 80,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-173"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-172",
   "self_type" : "type-172",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-174"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-171"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-171"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-170"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-164"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-165"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-164",
   "self_type" : "type-164",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-165"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-165"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-170",
   "self_type" : "type-170",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-165"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lock",
     "referenced_type" : "type-621"
    },
    {
     "field_name" : "has_tls",
     "field_offset" : 320,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tls",
     "field_offset" : 352,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "thread_store_t",
   "name" : "thread_store_t",
   "referenced_type" : "type-620",
   "self_type" : "type-620",
   "size" : 48,
   "source_file" : "/system/core/libcutils/include/cutils/threads.h",
   "unique_id" : "thread_store_t"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "android::sp<android::hardware::IBinder::DeathRecipient> &&",
   "name" : "android::sp<android::hardware::IBinder::DeathRecipient> &&",
   "referenced_type" : "type-513",
   "self_type" : "type-534",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::sp<android::hardware::IBinder> &&",
   "name" : "android::sp<android::hardware::IBinder> &&",
   "referenced_type" : "type-71",
   "self_type" : "type-70",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  }
 ]
}
