{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "JHUFF_TBL *[4]",
   "name" : "JHUFF_TBL *[4]",
   "referenced_type" : "type-79",
   "self_type" : "type-78",
   "size" : 32,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "JQUANT_TBL *[4]",
   "name" : "JQUANT_TBL *[4]",
   "referenced_type" : "type-73",
   "self_type" : "type-77",
   "size" : 32,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [256]",
   "name" : "char [256]",
   "referenced_type" : "type-6",
   "self_type" : "type-251",
   "size" : 256,
   "source_file" : "/external/libjpeg-turbo/jchuff.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [64]",
   "name" : "char [64]",
   "referenced_type" : "type-6",
   "self_type" : "type-417",
   "size" : 64,
   "source_file" : "/external/libjpeg-turbo/jmemsys.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [80]",
   "name" : "char [80]",
   "referenced_type" : "type-6",
   "self_type" : "type-61",
   "size" : 80,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [10]",
   "name" : "int [10]",
   "referenced_type" : "type-2",
   "self_type" : "type-90",
   "size" : 40,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [17]",
   "name" : "int [17]",
   "referenced_type" : "type-2",

   "linker_set_key" : "void (*)(jpeg_decompress_struct *, jpeg_component_info *, short *, unsigned char **, unsigned int)",
   "name" : "void (*)(jpeg_decompress_struct *, jpeg_component_info *, short *, unsigned char **, unsigned int)",
   "referenced_type" : "type-191",
   "self_type" : "type-190",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jpegint.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(jpeg_decompress_struct *, jpeg_component_info *, unsigned char **, unsigned char ***)",
   "name" : "void (*)(jpeg_decompress_struct *, jpeg_component_info *, unsigned char **, unsigned char ***)",
   "referenced_type" : "type-403",
   "self_type" : "type-402",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jdsample.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(jpeg_decompress_struct *, long)",
   "name" : "void (*)(jpeg_decompress_struct *, long)",
   "referenced_type" : "type-153",
   "self_type" : "type-152",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(jpeg_decompress_struct *, unsigned char ***, unsigned int *, unsigned int, unsigned char **, unsigned int *, unsigned int)",
   "name" : "void (*)(jpeg_decompress_struct *, unsigned char ***, unsigned int *, unsigned int, unsigned char **, unsigned int *, unsigned int)",
   "referenced_type" : "type-178",
   "self_type" : "type-177",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jpegint.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(jpeg_decompress_struct *, unsigned char ***, unsigned int, unsigned char **, int)",
   "name" : "void (*)(jpeg_decompress_struct *, unsigned char ***, unsigned int, unsigned char **, int)",
   "referenced_type" : "type-198",
   "self_type" : "type-197",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jpegint.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(jpeg_decompress_struct *, unsigned char **, unsigned char **, int)",
   "name" : "void (*)(jpeg_decompress_struct *, unsigned char **, unsigned char **, int)",
   "referenced_type" : "type-204",
   "self_type" : "type-203",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jpegint.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void (*)(jpeg_decompress_struct *, unsigned char **, unsigned int *, unsigned int)",
   "name" : "void (*)(jpeg_decompress_struct *, unsigned char **, unsigned int *, unsigned int)",
   "referenced_type" : "type-169",
   "self_type" : "type-168",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jpegint.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-15",
   "self_type" : "type-28",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *(*)(jpeg_common_struct *, int, unsigned long)",
   "name" : "void *(*)(jpeg_common_struct *, int, unsigned long)",
   "referenced_type" : "type-27",
   "self_type" : "type-26",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-6",
   "self_type" : "type-5",
   "size" : 1,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const char *const",
   "name" : "const char *const",
   "referenced_type" : "type-4",
   "self_type" : "type-3",
   "size" : 8,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-2",
   "self_type" : "type-2694",
   "size" : 4,
   "source_file" : "/external/libjpeg-turbo/jsimd.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const jpeg_scan_info",
   "name" : "const jpeg_scan_info",
   "referenced_type" : "type-86",
   "self_type" : "type-85",
   "size" : 36,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const short",
   "name" : "const short",
   "referenced_type" : "type-38",
   "self_type" : "type-2692",
   "size" : 2,
   "source_file" : "/external/libjpeg-turbo/jsimd.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-10",
   "self_type" : "type-138",
   "size" : 1,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-32",
   "self_type" : "type-215",
   "size" : 4,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "int const[17]",
   "name" : "int const[17]",
   "referenced_type" : "type-1",
   "self_type" : "type-223",
   "size" : 68,
   "source_file" : "/external/libjpeg-turbo/jmorecfg.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "int const[]",
   "name" : "int const[]",
   "referenced_type" : "type-218",
   "self_type" : "type-219",
   "source_file" : "/external/libjpeg-turbo/jpegint.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "long const[]",
   "name" : "long const[]",
   "referenced_type" : "type-220",
   "self_type" : "type-221",
   "source_file" : "/external/libjpeg-turbo/jpegint.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[65536]",
   "name" : "unsigned char const[65536]",
   "referenced_type" : "type-265",
   "self_type" : "type-266",
   "size" : 65536,
   "source_file" : "/external/libjpeg-turbo/jpeg_nbits_table.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bits",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "huffval",
     "field_offset" : 136,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "sent_table",
     "field_offset" : 2208,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "JHUFF_TBL",
   "name" : "JHUFF_TBL",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 280,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "JHUFF_TBL"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quantval",
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "sent_table",
     "field_offset" : 1024,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "JQUANT_TBL",
   "name" : "JQUANT_TBL",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 132,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "JQUANT_TBL"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "read_backing_store",
     "referenced_type" : "type-408"
    },
    {
     "field_name" : "write_backing_store",
     "field_offset" : 64,
     "referenced_type" : "type-408"
    },
    {
     "field_name" : "close_backing_store",
     "field_offset" : 128,
     "referenced_type" : "type-413"
    },
    {
     "field_name" : "temp_file",
     "field_offset" : 192,
     "referenced_type" : "type-415"
    },
    {
     "field_name" : "temp_name",
     "field_offset" : 256,
     "referenced_type" : "type-417"
    }
   ],
   "linker_set_key" : "backing_store_struct",
   "name" : "backing_store_struct",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 96,
   "source_file" : "/external/libjpeg-turbo/jmemsys.h",
   "unique_id" : "backing_store_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "get_buffer",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "bits_left",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "bitread_perm_state",
   "name" : "bitread_perm_state",
   "referenced_type" : "type-548",
   "self_type" : "type-548",
   "size" : 16,
   "source_file" : "/external/libjpeg-turbo/jdhuff.h",
   "unique_id" : "bitread_perm_state"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next_input_byte",
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "bytes_in_buffer",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "get_buffer",
     "field_offset" : 128,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "bits_left",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cinfo",
     "field_offset" : 256,
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "bitread_working_state",
   "name" : "bitread_working_state",
   "referenced_type" : "type-549",
   "self_type" : "type-549",
   "size" : 40,
   "source_file" : "/external/libjpeg-turbo/jdhuff.h",
   "unique_id" : "bitread_working_state"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ehufco",
     "referenced_type" : "type-250"
    },
    {
     "field_name" : "ehufsi",
     "field_offset" : 8192,
     "referenced_type" : "type-251"
    }
   ],
   "linker_set_key" : "c_derived_tbl",
   "name" : "c_derived_tbl",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 1280,
   "source_file" : "/external/libjpeg-turbo/jchuff.h",
   "unique_id" : "c_derived_tbl"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "maxcode",
     "referenced_type" : "type-543"
    },
    {
     "field_name" : "valoffset",
     "field_offset" : 1152,
     "referenced_type" : "type-543"
    },
    {
     "field_name" : "pub",
     "field_offset" : 2304,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "lookup",
     "field_offset" : 2368,
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "d_derived_tbl",
   "name" : "d_derived_tbl",
   "referenced_type" : "type-542",
   "self_type" : "type-542",
   "size" : 1320,
   "source_file" : "/external/libjpeg-turbo/jdhuff.h",
   "unique_id" : "d_derived_tbl"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "compress_data",
     "field_offset" : 64,
     "referenced_type" : "type-126"
    }
   ],
   "linker_set_key" : "jpeg_c_coef_controller",
   "name" : "jpeg_c_coef_controller",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 16,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_c_coef_controller"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "process_data",
     "field_offset" : 64,
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "jpeg_c_main_controller",
   "name" : "jpeg_c_main_controller",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 16,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_c_main_controller"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "pre_process_data",
     "field_offset" : 64,
     "referenced_type" : "type-100"
    }
   ],
   "linker_set_key" : "jpeg_c_prep_controller",
   "name" : "jpeg_c_prep_controller",
   "referenced_type" : "type-99",
   "self_type" : "type-99",
   "size" : 16,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_c_prep_controller"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "color_convert",
     "field_offset" : 64,
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "jpeg_color_converter",
   "name" : "jpeg_color_converter",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 16,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_color_converter"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "color_convert",
     "field_offset" : 64,
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "jpeg_color_deconverter",
   "name" : "jpeg_color_deconverter",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 16,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_color_deconverter"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-201"
    },
    {
     "field_name" : "color_quantize",
     "field_offset" : 64,
     "referenced_type" : "type-203"
    },
    {
     "field_name" : "finish_pass",
     "field_offset" : 128,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "new_color_map",
     "field_offset" : 192,
     "referenced_type" : "type-149"
    }
   ],
   "linker_set_key" : "jpeg_color_quantizer",
   "name" : "jpeg_color_quantizer",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 32,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_color_quantizer"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "err",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "mem",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "progress",
     "field_offset" : 128,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "client_data",
     "field_offset" : 192,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "is_decompressor",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "global_state",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_common_struct",
   "name" : "jpeg_common_struct",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 40,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_common_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "prepare_for_pass",
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "pass_startup",
     "field_offset" : 64,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "finish_pass",
     "field_offset" : 128,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "call_pass_startup",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "is_last_pass",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_comp_master",
   "name" : "jpeg_comp_master",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 32,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_comp_master"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "component_id",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "component_index",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "h_samp_factor",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "v_samp_factor",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "quant_tbl_no",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dc_tbl_no",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ac_tbl_no",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "width_in_blocks",
     "field_offset" : 224,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "height_in_blocks",
     "field_offset" : 256,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "DCT_scaled_size",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "downsampled_width",
     "field_offset" : 320,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "downsampled_height",
     "field_offset" : 352,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "component_needed",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "MCU_width",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "MCU_height",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "MCU_blocks",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "MCU_sample_width",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "last_col_width",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "last_row_height",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "quant_table",
     "field_offset" : 640,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "dct_table",
     "field_offset" : 704,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "jpeg_component_info",
   "name" : "jpeg_component_info",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 96,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_component_info"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "err",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "mem",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "progress",
     "field_offset" : 128,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "client_data",
     "field_offset" : 192,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "is_decompressor",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "global_state",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dest",
     "field_offset" : 320,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "image_width",
     "field_offset" : 384,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "image_height",
     "field_offset" : 416,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "input_components",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "in_color_space",
     "field_offset" : 480,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "input_gamma",
     "field_offset" : 512,
     "referenced_type" : "type-70"
    },
    {
     "field_name" : "data_precision",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "num_components",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "jpeg_color_space",
     "field_offset" : 640,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "comp_info",
     "field_offset" : 704,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "quant_tbl_ptrs",
     "field_offset" : 768,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "dc_huff_tbl_ptrs",
     "field_offset" : 1024,
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "ac_huff_tbl_ptrs",
     "field_offset" : 1280,
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "arith_dc_L",
     "field_offset" : 1536,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "arith_dc_U",
     "field_offset" : 1664,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "arith_ac_K",
     "field_offset" : 1792,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "num_scans",
     "field_offset" : 1920,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "scan_info",
     "field_offset" : 1984,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "raw_data_in",
     "field_offset" : 2048,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "arith_code",
     "field_offset" : 2080,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "optimize_coding",
     "field_offset" : 2112,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "CCIR601_sampling",
     "field_offset" : 2144,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "smoothing_factor",
     "field_offset" : 2176,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dct_method",
     "field_offset" : 2208,
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "restart_interval",
     "field_offset" : 2240,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "restart_in_rows",
     "field_offset" : 2272,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "write_JFIF_header",
     "field_offset" : 2304,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "JFIF_major_version",
     "field_offset" : 2336,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "JFIF_minor_version",
     "field_offset" : 2344,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "density_unit",
     "field_offset" : 2352,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "X_density",
     "field_offset" : 2368,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "Y_density",
     "field_offset" : 2384,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "write_Adobe_marker",
     "field_offset" : 2400,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "next_scanline",
     "field_offset" : 2432,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "progressive_mode",
     "field_offset" : 2464,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "max_h_samp_factor",
     "field_offset" : 2496,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "max_v_samp_factor",
     "field_offset" : 2528,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "total_iMCU_rows",
     "field_offset" : 2560,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "comps_in_scan",
     "field_offset" : 2592,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cur_comp_info",
     "field_offset" : 2624,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "MCUs_per_row",
     "field_offset" : 2880,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "MCU_rows_in_scan",
     "field_offset" : 2912,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "blocks_in_MCU",
     "field_offset" : 2944,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "MCU_membership",
     "field_offset" : 2976,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "Ss",
     "field_offset" : 3296,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Se",
     "field_offset" : 3328,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Ah",
     "field_offset" : 3360,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Al",
     "field_offset" : 3392,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "master",
     "field_offset" : 3456,
     "referenced_type" : "type-91"
    },
    {
     "field_name" : "main",
     "field_offset" : 3520,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "prep",
     "field_offset" : 3584,
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "coef",
     "field_offset" : 3648,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "marker",
     "field_offset" : 3712,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "cconvert",
     "field_offset" : 3776,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "downsample",
     "field_offset" : 3840,
     "referenced_type" : "type-112"
    },
    {
     "field_name" : "fdct",
     "field_offset" : 3904,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "entropy",
     "field_offset" : 3968,
     "referenced_type" : "type-120"
    },
    {
     "field_name" : "script_space",
     "field_offset" : 4032,
     "referenced_type" : "type-124"
    },
    {
     "field_name" : "script_space_size",
     "field_offset" : 4096,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_compress_struct",
   "name" : "jpeg_compress_struct",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 520,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_compress_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_input_pass",
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "consume_data",
     "field_offset" : 64,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "start_output_pass",
     "field_offset" : 128,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "decompress_data",
     "field_offset" : 192,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "coef_arrays",
     "field_offset" : 256,
     "referenced_type" : "type-174"
    }
   ],
   "linker_set_key" : "jpeg_d_coef_controller",
   "name" : "jpeg_d_coef_controller",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 40,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_d_coef_controller"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-166"
    },
    {
     "field_name" : "process_data",
     "field_offset" : 64,
     "referenced_type" : "type-168"
    }
   ],
   "linker_set_key" : "jpeg_d_main_controller",
   "name" : "jpeg_d_main_controller",
   "referenced_type" : "type-165",
   "self_type" : "type-165",
   "size" : 16,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_d_main_controller"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-166"
    },
    {
     "field_name" : "post_process_data",
     "field_offset" : 64,
     "referenced_type" : "type-177"
    }
   ],
   "linker_set_key" : "jpeg_d_post_controller",
   "name" : "jpeg_d_post_controller",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 16,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_d_post_controller"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "prepare_for_output_pass",
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "finish_output_pass",
     "field_offset" : 64,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "is_dummy_pass",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "first_iMCU_col",
     "field_offset" : 160,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "last_iMCU_col",
     "field_offset" : 192,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "first_MCU_col",
     "field_offset" : 224,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "last_MCU_col",
     "field_offset" : 544,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "jinit_upsampler_no_alloc",
     "field_offset" : 864,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_decomp_master",
   "name" : "jpeg_decomp_master",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 112,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_decomp_master"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "err",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "mem",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "progress",
     "field_offset" : 128,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "client_data",
     "field_offset" : 192,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "is_decompressor",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "global_state",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "src",
     "field_offset" : 320,
     "referenced_type" : "type-147"
    },
    {
     "field_name" : "image_width",
     "field_offset" : 384,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "image_height",
     "field_offset" : 416,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "num_components",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "jpeg_color_space",
     "field_offset" : 480,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "out_color_space",
     "field_offset" : 512,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "scale_num",
     "field_offset" : 544,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "scale_denom",
     "field_offset" : 576,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "output_gamma",
     "field_offset" : 640,
     "referenced_type" : "type-70"
    },
    {
     "field_name" : "buffered_image",
     "field_offset" : 704,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "raw_data_out",
     "field_offset" : 736,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dct_method",
     "field_offset" : 768,
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "do_fancy_upsampling",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "do_block_smoothing",
     "field_offset" : 832,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "quantize_colors",
     "field_offset" : 864,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "dither_mode",
     "field_offset" : 896,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "two_pass_quantize",
     "field_offset" : 928,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "desired_number_of_colors",
     "field_offset" : 960,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "enable_1pass_quant",
     "field_offset" : 992,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "enable_external_quant",
     "field_offset" : 1024,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "enable_2pass_quant",
     "field_offset" : 1056,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "output_width",
     "field_offset" : 1088,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "output_height",
     "field_offset" : 1120,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "out_color_components",
     "field_offset" : 1152,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "output_components",
     "field_offset" : 1184,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rec_outbuf_height",
     "field_offset" : 1216,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "actual_number_of_colors",
     "field_offset" : 1248,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "colormap",
     "field_offset" : 1280,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "output_scanline",
     "field_offset" : 1344,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "input_scan_number",
     "field_offset" : 1376,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "input_iMCU_row",
     "field_offset" : 1408,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "output_scan_number",
     "field_offset" : 1440,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "output_iMCU_row",
     "field_offset" : 1472,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "coef_bits",
     "field_offset" : 1536,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "quant_tbl_ptrs",
     "field_offset" : 1600,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "dc_huff_tbl_ptrs",
     "field_offset" : 1856,
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "ac_huff_tbl_ptrs",
     "field_offset" : 2112,
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "data_precision",
     "field_offset" : 2368,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "comp_info",
     "field_offset" : 2432,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "progressive_mode",
     "field_offset" : 2496,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "arith_code",
     "field_offset" : 2528,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "arith_dc_L",
     "field_offset" : 2560,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "arith_dc_U",
     "field_offset" : 2688,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "arith_ac_K",
     "field_offset" : 2816,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "restart_interval",
     "field_offset" : 2944,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "saw_JFIF_marker",
     "field_offset" : 2976,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "JFIF_major_version",
     "field_offset" : 3008,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "JFIF_minor_version",
     "field_offset" : 3016,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "density_unit",
     "field_offset" : 3024,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "X_density",
     "field_offset" : 3040,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "Y_density",
     "field_offset" : 3056,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "saw_Adobe_marker",
     "field_offset" : 3072,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Adobe_transform",
     "field_offset" : 3104,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "CCIR601_sampling",
     "field_offset" : 3136,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "marker_list",
     "field_offset" : 3200,
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "max_h_samp_factor",
     "field_offset" : 3264,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "max_v_samp_factor",
     "field_offset" : 3296,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "min_DCT_scaled_size",
     "field_offset" : 3328,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "total_iMCU_rows",
     "field_offset" : 3360,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "sample_range_limit",
     "field_offset" : 3392,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "comps_in_scan",
     "field_offset" : 3456,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cur_comp_info",
     "field_offset" : 3520,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "MCUs_per_row",
     "field_offset" : 3776,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "MCU_rows_in_scan",
     "field_offset" : 3808,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "blocks_in_MCU",
     "field_offset" : 3840,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "MCU_membership",
     "field_offset" : 3872,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "Ss",
     "field_offset" : 4192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Se",
     "field_offset" : 4224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Ah",
     "field_offset" : 4256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Al",
     "field_offset" : 4288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "unread_marker",
     "field_offset" : 4320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "master",
     "field_offset" : 4352,
     "referenced_type" : "type-161"
    },
    {
     "field_name" : "main",
     "field_offset" : 4416,
     "referenced_type" : "type-164"
    },
    {
     "field_name" : "coef",
     "field_offset" : 4480,
     "referenced_type" : "type-170"
    },
    {
     "field_name" : "post",
     "field_offset" : 4544,
     "referenced_type" : "type-175"
    },
    {
     "field_name" : "inputctl",
     "field_offset" : 4608,
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "marker",
     "field_offset" : 4672,
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "entropy",
     "field_offset" : 4736,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "idct",
     "field_offset" : 4800,
     "referenced_type" : "type-187"
    },
    {
     "field_name" : "upsample",
     "field_offset" : 4864,
     "referenced_type" : "type-193"
    },
    {
     "field_name" : "cconvert",
     "field_offset" : 4928,
     "referenced_type" : "type-195"
    },
    {
     "field_name" : "cquantize",
     "field_offset" : 4992,
     "referenced_type" : "type-199"
    }
   ],
   "linker_set_key" : "jpeg_decompress_struct",
   "name" : "jpeg_decompress_struct",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 632,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_decompress_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next_output_byte",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "free_in_buffer",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "init_destination",
     "field_offset" : 128,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "empty_output_buffer",
     "field_offset" : 192,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "term_destination",
     "field_offset" : 256,
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "jpeg_destination_mgr",
   "name" : "jpeg_destination_mgr",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 40,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_destination_mgr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "downsample",
     "field_offset" : 64,
     "referenced_type" : "type-114"
    },
    {
     "field_name" : "need_context_rows",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_downsampler",
   "name" : "jpeg_downsampler",
   "referenced_type" : "type-113",
   "self_type" : "type-113",
   "size" : 24,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_downsampler"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "decode_mcu",
     "field_offset" : 64,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "insufficient_data",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_entropy_decoder",
   "name" : "jpeg_entropy_decoder",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 24,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_entropy_decoder"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "encode_mcu",
     "field_offset" : 64,
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "finish_pass",
     "field_offset" : 128,
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "jpeg_entropy_encoder",
   "name" : "jpeg_entropy_encoder",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 24,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_entropy_encoder"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "error_exit",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "emit_message",
     "field_offset" : 64,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "output_message",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "format_message",
     "field_offset" : 192,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "reset_error_mgr",
     "field_offset" : 256,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "msg_code",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg_parm",
     "field_offset" : 352,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "trace_level",
     "field_offset" : 992,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "num_warnings",
     "field_offset" : 1024,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "jpeg_message_table",
     "field_offset" : 1088,
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "last_jpeg_message",
     "field_offset" : 1152,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "addon_message_table",
     "field_offset" : 1216,
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "first_addon_message",
     "field_offset" : 1280,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "last_addon_message",
     "field_offset" : 1312,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_error_mgr",
   "name" : "jpeg_error_mgr",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 168,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_error_mgr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "i",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "s",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "jpeg_error_mgr::(anonymous union at /external/libjpeg-turbo/simd/x86_64/../../jpeglib.h:738:3) at /external/libjpeg-turbo/simd/x86_64/../../jpeglib.h:738:3",
   "name" : "jpeg_error_mgr::(anonymous union at /external/libjpeg-turbo/simd/x86_64/../../jpeglib.h:738:3) at /external/libjpeg-turbo/simd/x86_64/../../jpeglib.h:738:3",
   "record_kind" : "union",
   "referenced_type" : "type-2685",
   "self_type" : "type-2685",
   "size" : 80,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_error_mgr::(anonymous union at /external/libjpeg-turbo/simd/x86_64/../../jpeglib.h:738:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "i",
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "s",
     "referenced_type" : "type-61"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "jpeg_error_mgr::(anonymous union at external/libjpeg-turbo/jpeglib.h:738:3) at external/libjpeg-turbo/jpeglib.h:738:3",
   "name" : "jpeg_error_mgr::(anonymous union at external/libjpeg-turbo/jpeglib.h:738:3) at external/libjpeg-turbo/jpeglib.h:738:3",
   "record_kind" : "union",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 80,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_error_mgr::(anonymous union at external/libjpeg-turbo/jpeglib.h:738:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "forward_DCT",
     "field_offset" : 64,
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "jpeg_forward_dct",
   "name" : "jpeg_forward_dct",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 16,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_forward_dct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "consume_input",
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "reset_input_controller",
     "field_offset" : 64,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "start_input_pass",
     "field_offset" : 128,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "finish_input_pass",
     "field_offset" : 192,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "has_multiple_scans",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eoi_reached",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_input_controller",
   "name" : "jpeg_input_controller",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 40,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_input_controller"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "inverse_DCT",
     "field_offset" : 64,
     "referenced_type" : "type-189"
    }
   ],
   "linker_set_key" : "jpeg_inverse_dct",
   "name" : "jpeg_inverse_dct",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 88,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_inverse_dct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reset_marker_reader",
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "read_markers",
     "field_offset" : 64,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "read_restart_marker",
     "field_offset" : 128,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "saw_SOI",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "saw_SOF",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "next_restart_num",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "discarded_bytes",
     "field_offset" : 288,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "jpeg_marker_reader",
   "name" : "jpeg_marker_reader",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 40,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_marker_reader"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "marker",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "original_length",
     "field_offset" : 96,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "data_length",
     "field_offset" : 128,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "jpeg_marker_struct",
   "name" : "jpeg_marker_struct",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 32,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_marker_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "write_file_header",
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "write_frame_header",
     "field_offset" : 64,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "write_scan_header",
     "field_offset" : 128,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "write_file_trailer",
     "field_offset" : 192,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "write_tables_only",
     "field_offset" : 256,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "write_marker_header",
     "field_offset" : 320,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "write_marker_byte",
     "field_offset" : 384,
     "referenced_type" : "type-106"
    }
   ],
   "linker_set_key" : "jpeg_marker_writer",
   "name" : "jpeg_marker_writer",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 56,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_marker_writer"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alloc_small",
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "alloc_large",
     "field_offset" : 64,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "alloc_sarray",
     "field_offset" : 128,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "alloc_barray",
     "field_offset" : 192,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "request_virt_sarray",
     "field_offset" : 256,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "request_virt_barray",
     "field_offset" : 320,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "realize_virt_arrays",
     "field_offset" : 384,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "access_virt_sarray",
     "field_offset" : 448,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "access_virt_barray",
     "field_offset" : 512,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "free_pool",
     "field_offset" : 576,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "self_destruct",
     "field_offset" : 640,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "max_memory_to_use",
     "field_offset" : 704,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "max_alloc_chunk",
     "field_offset" : 768,
     "referenced_type" : "type-53"
    }
   ],
   "linker_set_key" : "jpeg_memory_mgr",
   "name" : "jpeg_memory_mgr",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 104,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_memory_mgr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "progress_monitor",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "pass_counter",
     "field_offset" : 64,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "pass_limit",
     "field_offset" : 128,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "completed_passes",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "total_passes",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_progress_mgr",
   "name" : "jpeg_progress_mgr",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 32,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_progress_mgr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "comps_in_scan",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "component_index",
     "field_offset" : 32,
     "referenced_type" : "type-87"
    },
    {
     "field_name" : "Ss",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Se",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Ah",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "Al",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_scan_info",
   "name" : "jpeg_scan_info",
   "referenced_type" : "type-86",
   "self_type" : "type-86",
   "size" : 36,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_scan_info"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next_input_byte",
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "bytes_in_buffer",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "init_source",
     "field_offset" : 128,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "fill_input_buffer",
     "field_offset" : 192,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "skip_input_data",
     "field_offset" : 256,
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "resync_to_restart",
     "field_offset" : 320,
     "referenced_type" : "type-154"
    },
    {
     "field_name" : "term_source",
     "field_offset" : 384,
     "referenced_type" : "type-149"
    }
   ],
   "linker_set_key" : "jpeg_source_mgr",
   "name" : "jpeg_source_mgr",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 56,
   "source_file" : "/external/libjpeg-turbo/jpeglib.h",
   "unique_id" : "jpeg_source_mgr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_pass",
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "upsample",
     "field_offset" : 64,
     "referenced_type" : "type-177"
    },
    {
     "field_name" : "need_context_rows",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "jpeg_upsampler",
   "name" : "jpeg_upsampler",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 24,
   "source_file" : "/external/libjpeg-turbo/jpegint.h",
   "unique_id" : "jpeg_upsampler"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pub",
     "referenced_type" : "type-171"
    },
    {
     "field_name" : "MCU_ctr",
     "field_offset" : 320,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "MCU_vert_offset",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "MCU_rows_per_iMCU_row",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "MCU_buffer",
     "field_offset" : 448,
     "referenced_type" : "type-395"
    },
    {
     "field_name" : "workspace",
     "field_offset" : 1088,
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "whole_image",
     "field_offset" : 1152,
     "referenced_type" : "type-396"
    },
    {
     "field_name" : "coef_bits_latch",
     "field_offset" : 1792,
     "referenced_type" : "type-397"
    }
   ],
   "linker_set_key" : "my_coef_controller",
   "name" : "my_coef_controller",
   "referenced_type" : "type-394",
   "self_type" : "type-394",
   "size" : 232,
   "source_file" : "/external/libjpeg-turbo/jdcoefct.h",
   "unique_id" : "my_coef_controller"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pub",
     "referenced_type" : "type-162"
    },
    {
     "field_name" : "pass_number",
     "field_offset" : 896,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "using_merged_upsample",
     "field_offset" : 928,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "quantizer_1pass",
     "field_offset" : 960,
     "referenced_type" : "type-199"
    },
    {
     "field_name" : "quantizer_2pass",
     "field_offset" : 1024,
     "referenced_type" : "type-199"
    }
   ],
   "linker_set_key" : "my_decomp_master",
   "name" : "my_decomp_master",
   "referenced_type" : "type-384",
   "self_type" : "type-384",
   "size" : 136,
   "source_file" : "/external/libjpeg-turbo/jdmaster.h",
   "unique_id" : "my_decomp_master"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pub",
     "referenced_type" : "type-165"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "type-392"
    },
    {
     "field_name" : "buffer_full",
     "field_offset" : 768,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rowgroup_ctr",
     "field_offset" : 800,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "xbuffer",
     "field_offset" : 832,
     "referenced_type" : "type-393"
    },
    {
     "field_name" : "whichptr",
     "field_offset" : 960,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "context_state",
     "field_offset" : 992,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rowgroups_avail",
     "field_offset" : 1024,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "iMCU_row_ctr",
     "field_offset" : 1056,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "my_main_controller",
   "name" : "my_main_controller",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 136,
   "source_file" : "/external/libjpeg-turbo/jdmainct.h",
   "unique_id" : "my_main_controller"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pub",
     "referenced_type" : "type-194"
    },
    {
     "field_name" : "color_buf",
     "field_offset" : 192,
     "referenced_type" : "type-392"
    },
    {
     "field_name" : "methods",
     "field_offset" : 832,
     "referenced_type" : "type-401"
    },
    {
     "field_name" : "next_row_out",
     "field_offset" : 1472,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rows_to_go",
     "field_offset" : 1504,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "rowgroup_height",
     "field_offset" : 1536,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "h_expand",
     "field_offset" : 1856,
     "referenced_type" : "type-406"
    },
    {
     "field_name" : "v_expand",
     "field_offset" : 1936,
     "referenced_type" : "type-406"
    }
   ],
   "linker_set_key" : "my_upsampler",
   "name" : "my_upsampler",
   "referenced_type" : "type-400",
   "self_type" : "type-400",
   "size" : 256,
   "source_file" : "/external/libjpeg-turbo/jdsample.h",
   "unique_id" : "my_upsampler"
  }
 ],
 "rvalue_reference_types" : []
}
