{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "AHardwareBuffer_Plane [4]",
   "name" : "AHardwareBuffer_Plane [4]",
   "referenced_type" : "type-913",
   "self_type" : "type-915",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "linker_set_key" : "OMX_COMPONENTREGISTERTYPE []",
   "name" : "OMX_COMPONENTREGISTERTYPE []",
   "referenced_type" : "type-1472",
   "self_type" : "type-1497",
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE [1]",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE [1]",
   "referenced_type" : "type-513",
   "self_type" : "type-522",
   "size" : 264,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::AMessage::Item [64]",
   "name" : "android::AMessage::Item [64]",
   "referenced_type" : "type-176",
   "self_type" : "type-175",
   "size" : 2560,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::MediaImage2::PlaneInfo [4]",
   "name" : "android::MediaImage2::PlaneInfo [4]",
   "referenced_type" : "type-1803",
   "self_type" : "type-1802",
   "size" : 80,

   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-2072",
   "self_type" : "type-2071",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-396",
   "self_type" : "type-395",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-700",
   "self_type" : "type-699",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-853",
   "self_type" : "type-852",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-1220",
   "self_type" : "type-1219",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-424",
   "self_type" : "type-423",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-118",
   "self_type" : "type-737",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-35",
   "self_type" : "type-220",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-21",
   "self_type" : "type-221",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-732",
   "self_type" : "type-739",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-349",
   "self_type" : "type-2191",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-95",
   "self_type" : "type-489",
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-155",
   "self_type" : "type-154",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "referenced_type" : "type-912",
   "self_type" : "type-912",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Desc"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "referenced_type" : "type-913",
   "self_type" : "type-913",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Plane"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-915"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "referenced_type" : "type-914",
   "self_type" : "type-914",
   "size" : 72,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Planes"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-785"
    },
    {
     "field_name" : "width",
     "field_offset" : 448,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "height",
     "field_offset" : 480,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "stride",
     "field_offset" : 512,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "format",
     "field_offset" : 544,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 576,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 640,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 704,
     "referenced_type" : "type-790"
    },
    {
     "field_name" : "handle",
     "field_offset" : 768,
     "referenced_type" : "type-531"
    },
    {
     "field_name" : "usage",
     "field_offset" : 832,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 896,
     "referenced_type" : "type-791"
    }
   ],
   "linker_set_key" : "ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "type-784",
   "self_type" : "type-784",
   "size" : 168,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "ANativeWindowBuffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "ARect",
   "name" : "ARect",
   "referenced_type" : "type-836",
   "self_type" : "type-836",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h",
   "unique_id" : "ARect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "OMX_BS32",
   "name" : "OMX_BS32",
   "referenced_type" : "type-1461",
   "self_type" : "type-1461",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_BS32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_BU32",
   "name" : "OMX_BU32",
   "referenced_type" : "type-1460",
   "self_type" : "type-1460",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_BU32"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "nAllocLen",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nFilledLen",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 256,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "pPlatformPrivate",
     "field_offset" : 320,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "pInputPortPrivate",
     "field_offset" : 384,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "pOutputPortPrivate",
     "field_offset" : 448,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "hMarkTargetComponent",
     "field_offset" : 512,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 576,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "nTickCount",
     "field_offset" : 640,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nTimeStamp",
     "field_offset" : 704,
     "referenced_type" : "type-517"
    },
    {
     "field_name" : "nFlags",
     "field_offset" : 768,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nOutputPortIndex",
     "field_offset" : 800,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nInputPortIndex",
     "field_offset" : 832,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE",
   "referenced_type" : "type-1543",
   "self_type" : "type-1543",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_BUFFERHEADERTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EventHandler",
     "referenced_type" : "type-1576"
    },
    {
     "field_name" : "EmptyBufferDone",
     "field_offset" : 64,
     "referenced_type" : "type-1578"
    },
    {
     "field_name" : "FillBufferDone",
     "field_offset" : 128,
     "referenced_type" : "type-1578"
    }
   ],
   "linker_set_key" : "OMX_CALLBACKTYPE",
   "name" : "OMX_CALLBACKTYPE",
   "referenced_type" : "type-1575",
   "self_type" : "type-1575",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_CALLBACKTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pName",
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "pInitialize",
     "field_offset" : 64,
     "referenced_type" : "type-1473"
    }
   ],
   "linker_set_key" : "OMX_COMPONENTREGISTERTYPE",
   "name" : "OMX_COMPONENTREGISTERTYPE",
   "referenced_type" : "type-1472",
   "self_type" : "type-1472",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_COMPONENTREGISTERTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "cName",
     "field_offset" : 96,
     "referenced_type" : "type-514"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 1120,
     "referenced_type" : "type-521"
    },
    {
     "field_name" : "nParamCount",
     "field_offset" : 1152,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nParamSizeUsed",
     "field_offset" : 1184,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "param",
     "field_offset" : 1216,
     "referenced_type" : "type-522"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE",
   "referenced_type" : "type-518",
   "self_type" : "type-518",
   "size" : 416,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h",
   "unique_id" : "OMX_CONFIG_ANDROID_VENDOR_EXTENSIONTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cKey",
     "referenced_type" : "type-514"
    },
    {
     "field_name" : "eValueType",
     "field_offset" : 1024,
     "referenced_type" : "type-512"
    },
    {
     "field_name" : "bSet",
     "field_offset" : 1056,
     "referenced_type" : "type-515"
    },
    {
     "field_offset" : 1088,
     "referenced_type" : "type-516"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE",
   "referenced_type" : "type-513",
   "self_type" : "type-513",
   "size" : 264,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h",
   "unique_id" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nInt32",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "nInt64",
     "referenced_type" : "type-517"
    },
    {
     "field_name" : "cString",
     "referenced_type" : "type-514"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5",
   "name" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5",
   "record_kind" : "union",
   "referenced_type" : "type-516",
   "self_type" : "type-516",
   "size" : 128,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h",
   "unique_id" : "OMX_CONFIG_ANDROID_VENDOR_PARAMTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_IndexExt.h:137:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBacklight",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nTimeout",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BACKLIGHTTYPE",
   "name" : "OMX_CONFIG_BACKLIGHTTYPE",
   "referenced_type" : "type-1778",
   "self_type" : "type-1778",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_BACKLIGHTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBrightness",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "name" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "referenced_type" : "type-1777",
   "self_type" : "type-1777",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_BRIGHTNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bContinuous",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bFrameLimited",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nFrameLimit",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CAPTUREMODETYPE",
   "name" : "OMX_CONFIG_CAPTUREMODETYPE",
   "referenced_type" : "type-1815",
   "self_type" : "type-1815",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_CAPTUREMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nRGBAlphaConstant",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eColorBlend",
     "field_offset" : 128,
     "referenced_type" : "type-1676"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORBLENDTYPE",
   "name" : "OMX_CONFIG_COLORBLENDTYPE",
   "referenced_type" : "type-1683",
   "self_type" : "type-1683",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORBLENDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "xColorMatrix",
     "field_offset" : 96,
     "referenced_type" : "type-1625"
    },
    {
     "field_name" : "xColorOffset",
     "field_offset" : 384,
     "referenced_type" : "type-1627"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "name" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "referenced_type" : "type-1624",
   "self_type" : "type-1624",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORCONVERSIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bColorEnhancement",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nCustomizedU",
     "field_offset" : 128,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "nCustomizedV",
     "field_offset" : 136,
     "referenced_type" : "type-118"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "name" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "referenced_type" : "type-1655",
   "self_type" : "type-1655",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORENHANCEMENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nARGBColor",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nARGBMask",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORKEYTYPE",
   "name" : "OMX_CONFIG_COLORKEYTYPE",
   "referenced_type" : "type-1665",
   "self_type" : "type-1665",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORKEYTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nContrast",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTRASTTYPE",
   "name" : "OMX_CONFIG_CONTRASTTYPE",
   "referenced_type" : "type-1776",
   "self_type" : "type-1776",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_CONTRASTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eDither",
     "field_offset" : 96,
     "referenced_type" : "type-1812"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_DITHERTYPE",
   "name" : "OMX_CONFIG_DITHERTYPE",
   "referenced_type" : "type-1814",
   "self_type" : "type-1814",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_DITHERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eExposureControl",
     "field_offset" : 96,
     "referenced_type" : "type-1749"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "name" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "referenced_type" : "type-1754",
   "self_type" : "type-1754",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_EXPOSURECONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eMetering",
     "field_offset" : 96,
     "referenced_type" : "type-1820"
    },
    {
     "field_name" : "xEVCompensation",
     "field_offset" : 128,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "nApertureFNumber",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bAutoAperture",
     "field_offset" : 192,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nShutterSpeedMsec",
     "field_offset" : 224,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bAutoShutterSpeed",
     "field_offset" : 256,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nSensitivity",
     "field_offset" : 288,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bAutoSensitivity",
     "field_offset" : 320,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "name" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "referenced_type" : "type-1821",
   "self_type" : "type-1821",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_EXPOSUREVALUETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bCenter",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bLeft",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bRight",
     "field_offset" : 160,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bTop",
     "field_offset" : 192,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bBottom",
     "field_offset" : 224,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bTopLeft",
     "field_offset" : 256,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bTopRight",
     "field_offset" : 288,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bBottomLeft",
     "field_offset" : 320,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bBottomRight",
     "field_offset" : 352,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "name" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "referenced_type" : "type-1826",
   "self_type" : "type-1826",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_FOCUSREGIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "xEncodeFramerate",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FRAMERATETYPE",
   "name" : "OMX_CONFIG_FRAMERATETYPE",
   "referenced_type" : "type-1925",
   "self_type" : "type-1925",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_FRAMERATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bStab",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FRAMESTABTYPE",
   "name" : "OMX_CONFIG_FRAMESTABTYPE",
   "referenced_type" : "type-1740",
   "self_type" : "type-1740",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_FRAMESTABTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nGamma",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_GAMMATYPE",
   "name" : "OMX_CONFIG_GAMMATYPE",
   "referenced_type" : "type-1779",
   "self_type" : "type-1779",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_GAMMATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eImageFilter",
     "field_offset" : 96,
     "referenced_type" : "type-1649"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "name" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "referenced_type" : "type-1652",
   "self_type" : "type-1652",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_IMAGEFILTERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "IntraRefreshVOP",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "name" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "referenced_type" : "type-1926",
   "self_type" : "type-1926",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_INTRAREFRESHVOPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nLightness",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_LIGHTNESSTYPE",
   "name" : "OMX_CONFIG_LIGHTNESSTYPE",
   "referenced_type" : "type-1781",
   "self_type" : "type-1781",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_LIGHTNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nErrMapSize",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "ErrMap",
     "field_offset" : 128,
     "referenced_type" : "type-1569"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "name" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "referenced_type" : "type-1931",
   "self_type" : "type-1931",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "name" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "referenced_type" : "type-1932",
   "self_type" : "type-1932",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_MBERRORREPORTINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eMirror",
     "field_offset" : 96,
     "referenced_type" : "type-1698"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MIRRORTYPE",
   "name" : "OMX_CONFIG_MIRRORTYPE",
   "referenced_type" : "type-1709",
   "self_type" : "type-1709",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_MIRRORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nDepth",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nAlpha",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_PLANEBLENDTYPE",
   "name" : "OMX_CONFIG_PLANEBLENDTYPE",
   "referenced_type" : "type-1786",
   "self_type" : "type-1786",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_PLANEBLENDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nX",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "nY",
     "field_offset" : 128,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_POINTTYPE",
   "name" : "OMX_CONFIG_POINTTYPE",
   "referenced_type" : "type-1717",
   "self_type" : "type-1717",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_POINTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nLeft",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "nTop",
     "field_offset" : 128,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_RECTTYPE",
   "name" : "OMX_CONFIG_RECTTYPE",
   "referenced_type" : "type-1723",
   "self_type" : "type-1723",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_RECTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nRotation",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_ROTATIONTYPE",
   "name" : "OMX_CONFIG_ROTATIONTYPE",
   "referenced_type" : "type-1691",
   "self_type" : "type-1691",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_ROTATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nSaturation",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_SATURATIONTYPE",
   "name" : "OMX_CONFIG_SATURATIONTYPE",
   "referenced_type" : "type-1780",
   "self_type" : "type-1780",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_SATURATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "xWidth",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "xHeight",
     "field_offset" : 128,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_SCALEFACTORTYPE",
   "name" : "OMX_CONFIG_SCALEFACTORTYPE",
   "referenced_type" : "type-1648",
   "self_type" : "type-1648",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_SCALEFACTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eEffect",
     "field_offset" : 96,
     "referenced_type" : "type-1788"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "name" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "referenced_type" : "type-1805",
   "self_type" : "type-1805",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_TRANSITIONEFFECTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eWhiteBalControl",
     "field_offset" : 96,
     "referenced_type" : "type-1741"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "name" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "referenced_type" : "type-1745",
   "self_type" : "type-1745",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_WHITEBALCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_FRAMESIZETYPE",
   "name" : "OMX_FRAMESIZETYPE",
   "referenced_type" : "type-1688",
   "self_type" : "type-1688",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_FRAMESIZETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hMarkTargetComponent",
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 64,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "OMX_MARKTYPE",
   "name" : "OMX_MARKTYPE",
   "referenced_type" : "type-1462",
   "self_type" : "type-1462",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_MARKTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eNaluFormat",
     "field_offset" : 96,
     "referenced_type" : "type-1942"
    }
   ],
   "linker_set_key" : "OMX_NALSTREAMFORMATTYPE",
   "name" : "OMX_NALSTREAMFORMATTYPE",
   "referenced_type" : "type-1943",
   "self_type" : "type-1943",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_NALSTREAMFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eType",
     "field_offset" : 96,
     "referenced_type" : "type-1556"
    },
    {
     "field_name" : "nDataSize",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "type-1569"
    }
   ],
   "linker_set_key" : "OMX_OTHER_EXTRADATATYPE",
   "name" : "OMX_OTHER_EXTRADATATYPE",
   "referenced_type" : "type-1568",
   "self_type" : "type-1568",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_OTHER_EXTRADATATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eBufferSupplier",
     "field_offset" : 96,
     "referenced_type" : "type-1615"
    }
   ],
   "linker_set_key" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "name" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "referenced_type" : "type-1618",
   "self_type" : "type-1618",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PARAM_BUFFERSUPPLIERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "cRole",
     "field_offset" : 64,
     "referenced_type" : "type-514"
    }
   ],
   "linker_set_key" : "OMX_PARAM_COMPONENTROLETYPE",
   "name" : "OMX_PARAM_COMPONENTROLETYPE",
   "referenced_type" : "type-1520",
   "self_type" : "type-1520",
   "size" : 136,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PARAM_COMPONENTROLETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eUnitType",
     "field_offset" : 96,
     "referenced_type" : "type-1806"
    },
    {
     "field_name" : "eEncapsulationType",
     "field_offset" : 128,
     "referenced_type" : "type-1807"
    }
   ],
   "linker_set_key" : "OMX_PARAM_DATAUNITTYPE",
   "name" : "OMX_PARAM_DATAUNITTYPE",
   "referenced_type" : "type-1808",
   "self_type" : "type-1808",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_DATAUNITTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bDeblocking",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_PARAM_DEBLOCKINGTYPE",
   "name" : "OMX_PARAM_DEBLOCKINGTYPE",
   "referenced_type" : "type-1735",
   "self_type" : "type-1735",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_DEBLOCKINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eFocusStatus",
     "field_offset" : 96,
     "referenced_type" : "type-1827"
    },
    {
     "field_name" : "bCenterStatus",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bLeftStatus",
     "field_offset" : 160,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bRightStatus",
     "field_offset" : 192,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bTopStatus",
     "field_offset" : 224,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bBottomStatus",
     "field_offset" : 256,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bTopLeftStatus",
     "field_offset" : 288,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bTopRightStatus",
     "field_offset" : 320,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bBottomLeftStatus",
     "field_offset" : 352,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bBottomRightStatus",
     "field_offset" : 384,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "name" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "referenced_type" : "type-1828",
   "self_type" : "type-1828",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_FOCUSSTATUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nInterleavePortIndex",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_PARAM_INTERLEAVETYPE",
   "name" : "OMX_PARAM_INTERLEAVETYPE",
   "referenced_type" : "type-1787",
   "self_type" : "type-1787",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_INTERLEAVETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nMacroblocks",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_PARAM_MACROBLOCKSTYPE",
   "name" : "OMX_PARAM_MACROBLOCKSTYPE",
   "referenced_type" : "type-1934",
   "self_type" : "type-1934",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_PARAM_MACROBLOCKSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bOneShot",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "sFrameSize",
     "field_offset" : 160,
     "referenced_type" : "type-1688"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SENSORMODETYPE",
   "name" : "OMX_PARAM_SENSORMODETYPE",
   "referenced_type" : "type-1772",
   "self_type" : "type-1772",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_SENSORMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPorts",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nStartPortNumber",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_PORT_PARAM_TYPE",
   "name" : "OMX_PORT_PARAM_TYPE",
   "referenced_type" : "type-1570",
   "self_type" : "type-1570",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PORT_PARAM_TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nGroupPriority",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nGroupID",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_PRIORITYMGMTTYPE",
   "name" : "OMX_PRIORITYMGMTTYPE",
   "referenced_type" : "type-1507",
   "self_type" : "type-1507",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PRIORITYMGMTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTunnelFlags",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eSupplier",
     "field_offset" : 32,
     "referenced_type" : "type-1615"
    }
   ],
   "linker_set_key" : "OMX_TUNNELSETUPTYPE",
   "name" : "OMX_TUNNELSETUPTYPE",
   "referenced_type" : "type-1621",
   "self_type" : "type-1621",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_TUNNELSETUPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "nVersion",
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VERSIONTYPE",
   "name" : "OMX_VERSIONTYPE",
   "record_kind" : "union",
   "referenced_type" : "type-519",
   "self_type" : "type-519",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_VERSIONTYPE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nVersionMajor",
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "nVersionMinor",
     "field_offset" : 8,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "nRevision",
     "field_offset" : 16,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "nStep",
     "field_offset" : 24,
     "referenced_type" : "type-118"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5",
   "name" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5",
   "referenced_type" : "type-520",
   "self_type" : "type-520",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nRefreshPeriod",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE",
   "referenced_type" : "type-1990",
   "self_type" : "type-1990",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_CONFIG_ANDROID_INTRAREFRESHTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 96,
     "referenced_type" : "type-1999"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 192,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 224,
     "referenced_type" : "type-114"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "type-2020",
   "self_type" : "type-2020",
   "size" : 60,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_CONFIG_ANDROID_TEMPORALLAYERINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nIDRPeriod",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "name" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "referenced_type" : "type-1938",
   "self_type" : "type-1938",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nEncodeBitrate",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "name" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "referenced_type" : "type-1924",
   "self_type" : "type-1924",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_BITRATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nNaluBytes",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_NALSIZE",
   "name" : "OMX_VIDEO_CONFIG_NALSIZE",
   "referenced_type" : "type-1941",
   "self_type" : "type-1941",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_NALSIZE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nTileWidth",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nTileHeight",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nGridRows",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nGridCols",
     "field_offset" : 224,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE",
   "referenced_type" : "type-2021",
   "self_type" : "type-2021",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_ANDROID_IMAGEGRIDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eSupportedPatterns",
     "field_offset" : 96,
     "referenced_type" : "type-1999"
    },
    {
     "field_name" : "nLayerCountMax",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBLayerCountMax",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "ePattern",
     "field_offset" : 192,
     "referenced_type" : "type-1999"
    },
    {
     "field_name" : "nPLayerCountActual",
     "field_offset" : 224,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBLayerCountActual",
     "field_offset" : 256,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bBitrateRatiosSpecified",
     "field_offset" : 288,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nBitrateRatios",
     "field_offset" : 320,
     "referenced_type" : "type-114"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE",
   "referenced_type" : "type-2002",
   "self_type" : "type-2002",
   "size" : 72,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_ANDROID_TEMPORALLAYERINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eTemporalPattern",
     "field_offset" : 128,
     "referenced_type" : "type-1957"
    },
    {
     "field_name" : "nTemporalLayerCount",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nTemporalLayerBitrateRatio",
     "field_offset" : 192,
     "referenced_type" : "type-1962"
    },
    {
     "field_name" : "nMinQuantizer",
     "field_offset" : 288,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nMaxQuantizer",
     "field_offset" : 320,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "name" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE",
   "referenced_type" : "type-1961",
   "self_type" : "type-1961",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_ANDROID_VP8ENCODERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nNumSliceGroups",
     "field_offset" : 96,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "nSliceGroupMapType",
     "field_offset" : 104,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "eSliceMode",
     "field_offset" : 128,
     "referenced_type" : "type-1935"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "name" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "referenced_type" : "type-1937",
   "self_type" : "type-1937",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_AVCSLICEFMO"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bUseHadamard",
     "field_offset" : 192,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nRefFrames",
     "field_offset" : 224,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nRefIdx10ActiveMinus1",
     "field_offset" : 256,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nRefIdx11ActiveMinus1",
     "field_offset" : 288,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bEnableUEP",
     "field_offset" : 320,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bEnableFMO",
     "field_offset" : 352,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bEnableASO",
     "field_offset" : 384,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bEnableRS",
     "field_offset" : 416,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 448,
     "referenced_type" : "type-1914"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 480,
     "referenced_type" : "type-1915"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 512,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bFrameMBsOnly",
     "field_offset" : 544,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bMBAFF",
     "field_offset" : 576,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bEntropyCodingCABAC",
     "field_offset" : 608,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bWeightedPPrediction",
     "field_offset" : 640,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nWeightedBipredicitonMode",
     "field_offset" : 672,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bconstIpred",
     "field_offset" : 704,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bDirect8x8Inference",
     "field_offset" : 736,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bDirectSpatialTemporal",
     "field_offset" : 768,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nCabacInitIdc",
     "field_offset" : 800,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eLoopFilterMode",
     "field_offset" : 832,
     "referenced_type" : "type-1916"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_AVCTYPE",
   "name" : "OMX_VIDEO_PARAM_AVCTYPE",
   "referenced_type" : "type-1918",
   "self_type" : "type-1918",
   "size" : 108,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_AVCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eControlRate",
     "field_offset" : 96,
     "referenced_type" : "type-1840"
    },
    {
     "field_offset" : 128,
     "referenced_type" : "type-1842"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "referenced_type" : "type-1841",
   "self_type" : "type-1841",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_BITRATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTargetBitrate",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nQualityFactor",
     "referenced_type" : "type-35"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5",
   "record_kind" : "union",
   "referenced_type" : "type-1842",
   "self_type" : "type-1842",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bEnableHEC",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bEnableResync",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nResynchMarkerSpacing",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bEnableDataPartitioning",
     "field_offset" : 192,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bEnableRVLC",
     "field_offset" : 224,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "name" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "referenced_type" : "type-1855",
   "self_type" : "type-1855",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "type-1870"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "type-1879"
    },
    {
     "field_name" : "bPLUSPTYPEAllowed",
     "field_offset" : 224,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 256,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bForceRoundingTypeToZero",
     "field_offset" : 288,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nPictureHeaderRepetition",
     "field_offset" : 320,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nGOBHeaderInterval",
     "field_offset" : 352,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_H263TYPE",
   "name" : "OMX_VIDEO_PARAM_H263TYPE",
   "referenced_type" : "type-1891",
   "self_type" : "type-1891",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_H263TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-1967"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-1969"
    },
    {
     "field_name" : "nKeyFrameInterval",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_HEVCTYPE",
   "name" : "OMX_VIDEO_PARAM_HEVCTYPE",
   "referenced_type" : "type-1970",
   "self_type" : "type-1970",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_HEVCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eRefreshMode",
     "field_offset" : 96,
     "referenced_type" : "type-1849"
    },
    {
     "field_name" : "nAirMBs",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nAirRef",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nCirMBs",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "referenced_type" : "type-1852",
   "self_type" : "type-1852",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eAccuracy",
     "field_offset" : 96,
     "referenced_type" : "type-1847"
    },
    {
     "field_name" : "bUnrestrictedMVs",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bFourMV",
     "field_offset" : 160,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "sXSearchRange",
     "field_offset" : 192,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "sYSearchRange",
     "field_offset" : 224,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "name" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "referenced_type" : "type-1848",
   "self_type" : "type-1848",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "type-1900"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "type-1901"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "referenced_type" : "type-1902",
   "self_type" : "type-1902",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MPEG2TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bSVH",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bGov",
     "field_offset" : 160,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 224,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nIDCVLCThreshold",
     "field_offset" : 256,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bACPred",
     "field_offset" : 288,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nMaxPacketSize",
     "field_offset" : 320,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nTimeIncRes",
     "field_offset" : 352,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 384,
     "referenced_type" : "type-1903"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 416,
     "referenced_type" : "type-1905"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 448,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nHeaderExtension",
     "field_offset" : 480,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bReversibleVLC",
     "field_offset" : 512,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "referenced_type" : "type-1906",
   "self_type" : "type-1906",
   "size" : 68,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MPEG4TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "type-1829"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "type-1622"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-1834",
   "self_type" : "type-1834",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nProfileIndex",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "name" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "referenced_type" : "type-1923",
   "self_type" : "type-1923",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nQpI",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nQpP",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nQpB",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "name" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "referenced_type" : "type-1837",
   "self_type" : "type-1837",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "type-1912"
    },
    {
     "field_name" : "nBitsPerPixel",
     "field_offset" : 128,
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "nPaddedWidth",
     "field_offset" : 144,
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "nPaddedHeight",
     "field_offset" : 160,
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBitstreamFlags",
     "field_offset" : 224,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBitstreamVersion",
     "field_offset" : 256,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nMaxEncodeFrameSize",
     "field_offset" : 288,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bEnablePostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bEnableTemporalInterpolation",
     "field_offset" : 352,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bEnableLatencyMode",
     "field_offset" : 384,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_RVTYPE",
   "name" : "OMX_VIDEO_PARAM_RVTYPE",
   "referenced_type" : "type-1913",
   "self_type" : "type-1913",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_RVTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "b16x16",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "b16x8",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "b8x16",
     "field_offset" : 160,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "b8x8",
     "field_offset" : 192,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "b8x4",
     "field_offset" : 224,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "b4x8",
     "field_offset" : 256,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "b4x4",
     "field_offset" : 288,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "name" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "referenced_type" : "type-1867",
   "self_type" : "type-1867",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_VBSMCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bEnableVFU",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nFirstGOB",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nFirstMB",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nNumMBs",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "name" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "referenced_type" : "type-1839",
   "self_type" : "type-1839",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-1949"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-1950"
    },
    {
     "field_name" : "nDCTPartitions",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 192,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VP8TYPE",
   "name" : "OMX_VIDEO_PARAM_VP8TYPE",
   "referenced_type" : "type-1951",
   "self_type" : "type-1951",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_VP8TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-1964"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-1965"
    },
    {
     "field_name" : "bErrorResilientMode",
     "field_offset" : 160,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "nTileRows",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nTileColumns",
     "field_offset" : 224,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bEnableFrameParallelDecoding",
     "field_offset" : 256,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VP9TYPE",
   "name" : "OMX_VIDEO_PARAM_VP9TYPE",
   "referenced_type" : "type-1966",
   "self_type" : "type-1966",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_PARAM_VP9TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "type-1910"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_WMVTYPE",
   "name" : "OMX_VIDEO_PARAM_WMVTYPE",
   "referenced_type" : "type-1911",
   "self_type" : "type-1911",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_WMVTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 192,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 224,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nBitrate",
     "field_offset" : 256,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 288,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 320,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 352,
     "referenced_type" : "type-1829"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 384,
     "referenced_type" : "type-1622"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 448,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "name" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "referenced_type" : "type-1830",
   "self_type" : "type-1830",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nMediaTimeUs",
     "referenced_type" : "type-517"
    },
    {
     "field_name" : "nSystemTimeNs",
     "field_offset" : 64,
     "referenced_type" : "type-517"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_RENDEREVENTTYPE",
   "name" : "OMX_VIDEO_RENDEREVENTTYPE",
   "referenced_type" : "type-1976",
   "self_type" : "type-1976",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_RENDEREVENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bDepedentSegments",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bEnableLoopFilterAcrossSlices",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_SLICESEGMENTSTYPE",
   "name" : "OMX_VIDEO_SLICESEGMENTSTYPE",
   "referenced_type" : "type-1975",
   "self_type" : "type-1975",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_SLICESEGMENTSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bIsIntraFrame",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bIsGoldenOrAlternateFrame",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE",
   "referenced_type" : "type-1953",
   "self_type" : "type-1953",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_VP8REFERENCEFRAMEINFOTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "bPreviousFrameRefresh",
     "field_offset" : 96,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bGoldenFrameRefresh",
     "field_offset" : 128,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bAlternateFrameRefresh",
     "field_offset" : 160,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bUsePreviousFrame",
     "field_offset" : 192,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bUseGoldenFrame",
     "field_offset" : 224,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "bUseAlternateFrame",
     "field_offset" : 256,
     "referenced_type" : "type-515"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "name" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE",
   "referenced_type" : "type-1952",
   "self_type" : "type-1952",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_VideoExt.h",
   "unique_id" : "OMX_VIDEO_VP8REFERENCEFRAMETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-931"
    },
    {
     "field_name" : "alloc",
     "field_offset" : 960,
     "referenced_type" : "type-980"
    },
    {
     "field_name" : "free",
     "field_offset" : 1024,
     "referenced_type" : "type-984"
    },
    {
     "field_name" : "dump",
     "field_offset" : 1088,
     "referenced_type" : "type-986"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 1152,
     "referenced_type" : "type-791"
    }
   ],
   "linker_set_key" : "alloc_device_t",
   "name" : "alloc_device_t",
   "referenced_type" : "type-979",
   "self_type" : "type-979",
   "size" : 200,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h",
   "unique_id" : "alloc_device_t"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-80"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMeta",
     "field_offset" : 128,
     "referenced_type" : "type-164"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 192,
     "referenced_type" : "type-94"
    },
    {
     "access" : "private",
     "field_name" : "mCapacity",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mRangeOffset",
     "field_offset" : 320,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mRangeLength",
     "field_offset" : 384,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mInt32Data",
     "field_offset" : 448,
     "referenced_type" : "type-48"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsData",
     "field_offset" : 480,
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "android::ABuffer",
   "name" : "android::ABuffer",
   "referenced_type" : "type-564",
   "self_type" : "type-564",
   "size" : 64,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ABuffer.h",
   "unique_id" : "_ZTSN7android7ABufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7ABufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ABufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ABufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::AData<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::AData<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AData.h",
   "unique_id" : "_ZTSN7android5ADataIJilmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ADebug",
   "name" : "android::ADebug",
   "referenced_type" : "type-509",
   "self_type" : "type-509",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ADebug.h",
   "unique_id" : "_ZTSN7android6ADebugE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-80"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 128,
     "referenced_type" : "type-132"
    },
    {
     "access" : "private",
     "field_name" : "mQueueChangedCondition",
     "field_offset" : 448,
     "referenced_type" : "type-144"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 832,
     "referenced_type" : "type-158"
    },
    {
     "access" : "private",
     "field_name" : "mEventQueue",
     "field_offset" : 1024,
     "referenced_type" : "type-160"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 1152,
     "referenced_type" : "type-183"
    },
    {
     "access" : "private",
     "field_name" : "mRunningLocally",
     "field_offset" : 1216,
     "referenced_type" : "type-155"
    },
    {
     "access" : "private",
     "field_name" : "mRepliesLock",
     "field_offset" : 1248,
     "referenced_type" : "type-132"
    },
    {
     "access" : "private",
     "field_name" : "mRepliesCondition",
     "field_offset" : 1568,
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "android::ALooper",
   "name" : "android::ALooper",
   "referenced_type" : "type-157",
   "self_type" : "type-157",
   "size" : 248,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ALooper.h",
   "unique_id" : "_ZTSN7android7ALooperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7ALooperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ALooperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ALooperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mWhenUs",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-164"
    }
   ],
   "linker_set_key" : "android::ALooper::Event",
   "name" : "android::ALooper::Event",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ALooper.h",
   "unique_id" : "_ZTSN7android7ALooper5EventE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-80"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mWhat",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "access" : "private",
     "field_name" : "mTarget",
     "field_offset" : 160,
     "referenced_type" : "type-48"
    },
    {
     "access" : "private",
     "field_name" : "mHandler",
     "field_offset" : 192,
     "referenced_type" : "type-167"
    },
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 320,
     "referenced_type" : "type-173"
    },
    {
     "access" : "private",
     "field_name" : "mItems",
     "field_offset" : 448,
     "referenced_type" : "type-175"
    },
    {
     "access" : "private",
     "field_name" : "mNumItems",
     "field_offset" : 20928,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::AMessage",
   "name" : "android::AMessage",
   "referenced_type" : "type-166",
   "self_type" : "type-166",
   "size" : 2624,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8AMessageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AMessageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AMessageD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "u",
     "referenced_type" : "type-177"
    },
    {
     "field_name" : "mName",
     "field_offset" : 128,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "mNameLength",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "mType",
     "field_offset" : 256,
     "referenced_type" : "type-182"
    }
   ],
   "linker_set_key" : "android::AMessage::Item",
   "name" : "android::AMessage::Item",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 40,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessage4ItemE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int32Value",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "int64Value",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "sizeValue",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "floatValue",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "doubleValue",
     "referenced_type" : "type-178"
    },
    {
     "field_name" : "ptrValue",
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "refValue",
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "stringValue",
     "referenced_type" : "type-180"
    },
    {
     "field_name" : "rectValue",
     "referenced_type" : "type-181"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::AMessage::Item::(anonymous union at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9) at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9",
   "name" : "android::AMessage::Item::(anonymous union at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9) at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9",
   "record_kind" : "union",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessage4ItemUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mLeft",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "mTop",
     "field_offset" : 32,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "mRight",
     "field_offset" : 64,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "mBottom",
     "field_offset" : 96,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "android::AMessage::Rect",
   "name" : "android::AMessage::Rect",
   "referenced_type" : "type-181",
   "self_type" : "type-181",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessage4RectE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-784"
    },
    {
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "android::ANativeObjectBase<ANativeWindowBuffer, android::GraphicBuffer, android::RefBase, android_native_base_t>",
   "name" : "android::ANativeObjectBase<ANativeWindowBuffer, android::GraphicBuffer, android::RefBase, android_native_base_t>",
   "record_kind" : "class",
   "referenced_type" : "type-783",
   "self_type" : "type-783",
   "size" : 184,
   "source_file" : "/frameworks/native/libs/ui/include/ui/ANativeObjectBase.h",
   "template_args" : [ "type-784", "type-775", "type-80", "type-785" ],
   "unique_id" : "_ZTSN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android17ANativeObjectBaseI19ANativeWindowBufferNS_13GraphicBufferENS_7RefBaseE21android_native_base_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-80"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 128,
     "referenced_type" : "type-173"
    },
    {
     "access" : "private",
     "field_name" : "mReply",
     "field_offset" : 256,
     "referenced_type" : "type-164"
    },
    {
     "access" : "private",
     "field_name" : "mReplied",
     "field_offset" : 320,
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "android::AReplyToken",
   "name" : "android::AReplyToken",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android11AReplyTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AReplyTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "referenced_type" : "type-159"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mAllocSize",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::AString",
   "name" : "android::AString",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h",
   "unique_id" : "_ZTSN7android7AStringE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-96"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 64,
     "referenced_type" : "type-93"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "android::BBinder",
   "name" : "android::BBinder",
   "record_kind" : "class",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android7BBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-254"
    },
    {
     "referenced_type" : "type-92"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IGraphicBufferSource>",
   "name" : "android::BnInterface<android::IGraphicBufferSource>",
   "record_kind" : "class",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-255" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_20IGraphicBufferSourceEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_20IGraphicBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_20IGraphicBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_20IGraphicBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_20IGraphicBufferSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_20IGraphicBufferSourceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource9configureERKNS_2spINS_8IOMXNodeEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource10setSuspendEbl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource29setRepeatPreviousFrameDelayUsEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource9setMaxFpsEf"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource18setTimeLapseConfigEdd"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource14setStartTimeUsEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource13setStopTimeUsEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource19getStopTimeOffsetUsEPl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource15setColorAspectsEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource15setTimeOffsetUsEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource22signalEndOfInputStreamEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_20IGraphicBufferSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_20IGraphicBufferSourceEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_20IGraphicBufferSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_20IGraphicBufferSourceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_20IGraphicBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_20IGraphicBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_20IGraphicBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_20IGraphicBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_20IGraphicBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-91"
    },
    {
     "referenced_type" : "type-92"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IMediaCodecList>",
   "name" : "android::BnInterface<android::IMediaCodecList>",
   "record_kind" : "class",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-91" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_15IMediaCodecListEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IMediaCodecListEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaCodecListEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaCodecListEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaCodecListEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_15IMediaCodecListEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList11countCodecsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList12getCodecInfoEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList17getGlobalSettingsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList15findCodecByTypeEPKcbm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList15findCodecByNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaCodecListEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IMediaCodecListEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaCodecListEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_15IMediaCodecListEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaCodecListEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaCodecListEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IMediaCodecListEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_15IMediaCodecListEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_15IMediaCodecListEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-354"
    },
    {
     "referenced_type" : "type-92"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IMemory>",
   "name" : "android::BnInterface<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "type-353",
   "self_type" : "type-353",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-354" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_7IMemoryEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-352"
    },
    {
     "referenced_type" : "type-92"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IMemoryHeap>",
   "name" : "android::BnInterface<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "type-351",
   "self_type" : "type-351",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-352" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2168"
    },
    {
     "referenced_type" : "type-92"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IOMXBufferSource>",
   "name" : "android::BnInterface<android::IOMXBufferSource>",
   "record_kind" : "class",
   "referenced_type" : "type-2167",
   "self_type" : "type-2167",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-2169" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_16IOMXBufferSourceEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_16IOMXBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IOMXBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IOMXBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IOMXBufferSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_16IOMXBufferSourceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource14onOmxExecutingEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource9onOmxIdleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource11onOmxLoadedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource18onInputBufferAddedEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource20onInputBufferEmptiedEiRKNS_18OMXFenceParcelableE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IOMXBufferSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_16IOMXBufferSourceEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_16IOMXBufferSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_16IOMXBufferSourceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_16IOMXBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_16IOMXBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_16IOMXBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_16IOMXBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_16IOMXBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-301"
    },
    {
     "referenced_type" : "type-92"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IOMXNode>",
   "name" : "android::BnInterface<android::IOMXNode>",
   "record_kind" : "class",
   "referenced_type" : "type-300",
   "self_type" : "type-300",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-301" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_8IOMXNodeEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-271"
    },
    {
     "referenced_type" : "type-92"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IOMXObserver>",
   "name" : "android::BnInterface<android::IOMXObserver>",
   "record_kind" : "class",
   "referenced_type" : "type-358",
   "self_type" : "type-358",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-271" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_12IOMXObserverEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "android::BnMediaCodecList",
   "name" : "android::BnMediaCodecList",
   "record_kind" : "class",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IMediaCodecList.h",
   "unique_id" : "_ZTSN7android16BnMediaCodecListE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16BnMediaCodecListE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16BnMediaCodecListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16BnMediaCodecListD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaCodecListEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_15IMediaCodecListEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList11countCodecsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList12getCodecInfoEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList17getGlobalSettingsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList15findCodecByTypeEPKcbm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList15findCodecByNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaCodecListEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android16BnMediaCodecList10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16BnMediaCodecListE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaCodecListEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_15IMediaCodecListEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android16BnMediaCodecListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android16BnMediaCodecListD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android16BnMediaCodecList10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16BnMediaCodecListE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android16BnMediaCodecListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android16BnMediaCodecListD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-353"
    }
   ],
   "linker_set_key" : "android::BnMemory",
   "name" : "android::BnMemory",
   "record_kind" : "class",
   "referenced_type" : "type-370",
   "self_type" : "type-370",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "unique_id" : "_ZTSN7android8BnMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-351"
    }
   ],
   "linker_set_key" : "android::BnMemoryHeap",
   "name" : "android::BnMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "unique_id" : "_ZTSN7android12BnMemoryHeapE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-300"
    }
   ],
   "linker_set_key" : "android::BnOMXNode",
   "name" : "android::BnOMXNode",
   "record_kind" : "class",
   "referenced_type" : "type-299",
   "self_type" : "type-299",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android9BnOMXNodeE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BnOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BnOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BnOMXNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android9BnOMXNode10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZNK7android9BnOMXNode8isSecureEv"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BnOMXNodeE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android9BnOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android9BnOMXNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android9BnOMXNode10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BnOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BnOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BnOMXNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-358"
    }
   ],
   "linker_set_key" : "android::BnOMXObserver",
   "name" : "android::BnOMXObserver",
   "record_kind" : "class",
   "referenced_type" : "type-508",
   "self_type" : "type-508",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android13BnOMXObserverE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13BnOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13BnOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13BnOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android13BnOMXObserver10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13BnOMXObserverE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IOMXObserverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_12IOMXObserverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android13BnOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android13BnOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android13BnOMXObserver10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13BnOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android13BnOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android13BnOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-592"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IGraphicBufferSource>",
   "name" : "android::BpInterface<android::IGraphicBufferSource>",
   "record_kind" : "class",
   "referenced_type" : "type-591",
   "self_type" : "type-591",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-593" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_20IGraphicBufferSourceEEE",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_20IGraphicBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_20IGraphicBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_20IGraphicBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_20IGraphicBufferSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android20IGraphicBufferSource22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource9configureERKNS_2spINS_8IOMXNodeEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource10setSuspendEbl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource29setRepeatPreviousFrameDelayUsEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource9setMaxFpsEf"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource18setTimeLapseConfigEdd"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource14setStartTimeUsEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource13setStopTimeUsEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource19getStopTimeOffsetUsEPl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource15setColorAspectsEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource15setTimeOffsetUsEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android20IGraphicBufferSource22signalEndOfInputStreamEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_20IGraphicBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_20IGraphicBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_20IGraphicBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_20IGraphicBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_20IGraphicBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_20IGraphicBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-91"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IMediaCodecList>",
   "name" : "android::BpInterface<android::IMediaCodecList>",
   "record_kind" : "class",
   "referenced_type" : "type-2219",
   "self_type" : "type-2219",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-91" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_15IMediaCodecListEEE",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IMediaCodecListEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IMediaCodecListEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IMediaCodecListEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IMediaCodecListEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android15IMediaCodecList22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList11countCodecsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList12getCodecInfoEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList17getGlobalSettingsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList15findCodecByTypeEPKcbm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList15findCodecByNameEPKc"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IMediaCodecListEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_15IMediaCodecListEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_15IMediaCodecListEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IMediaCodecListEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_15IMediaCodecListEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_15IMediaCodecListEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2182"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IOMXBufferSource>",
   "name" : "android::BpInterface<android::IOMXBufferSource>",
   "record_kind" : "class",
   "referenced_type" : "type-2181",
   "self_type" : "type-2181",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-2183" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_16IOMXBufferSourceEEE",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_16IOMXBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_16IOMXBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_16IOMXBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_16IOMXBufferSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android16IOMXBufferSource22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource14onOmxExecutingEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource9onOmxIdleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource11onOmxLoadedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource18onInputBufferAddedEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IOMXBufferSource20onInputBufferEmptiedEiRKNS_18OMXFenceParcelableE"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_16IOMXBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_16IOMXBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_16IOMXBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_16IOMXBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_16IOMXBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_16IOMXBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-301"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IOMXNode>",
   "name" : "android::BpInterface<android::IOMXNode>",
   "record_kind" : "class",
   "referenced_type" : "type-360",
   "self_type" : "type-360",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-301" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_8IOMXNodeEEE",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_8IOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_8IOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_8IOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-271"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IOMXObserver>",
   "name" : "android::BpInterface<android::IOMXObserver>",
   "record_kind" : "class",
   "referenced_type" : "type-365",
   "self_type" : "type-365",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-271" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_12IOMXObserverEEE",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_12IOMXObserverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12IOMXObserver22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_12IOMXObserverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_12IOMXObserverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_12IOMXObserverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-80"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 64,
     "referenced_type" : "type-362"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 128,
     "referenced_type" : "type-170"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 192,
     "referenced_type" : "type-363"
    }
   ],
   "linker_set_key" : "android::BpRefBase",
   "name" : "android::BpRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-361",
   "self_type" : "type-361",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android9BpRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mRange",
     "referenced_type" : "type-1551"
    },
    {
     "field_name" : "mPrimaries",
     "field_offset" : 32,
     "referenced_type" : "type-1475"
    },
    {
     "field_name" : "mTransfer",
     "field_offset" : 64,
     "referenced_type" : "type-1476"
    },
    {
     "field_name" : "mMatrixCoeffs",
     "field_offset" : 96,
     "referenced_type" : "type-1477"
    }
   ],
   "linker_set_key" : "android::ColorAspects",
   "name" : "android::ColorAspects",
   "referenced_type" : "type-1550",
   "self_type" : "type-1550",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android12ColorAspectsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-693",
   "self_type" : "type-693",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-145"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 48,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1588"
    },
    {
     "referenced_type" : "type-1590"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFenceFd",
     "field_offset" : 32,
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "android::Fence",
   "name" : "android::Fence",
   "record_kind" : "class",
   "referenced_type" : "type-1587",
   "self_type" : "type-1587",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/ui/include/ui/Fence.h",
   "unique_id" : "_ZTSN7android5FenceE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mState",
     "referenced_type" : "type-1759"
    },
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 32,
     "referenced_type" : "type-1761"
    },
    {
     "access" : "private",
     "field_name" : "mFence",
     "field_offset" : 384,
     "referenced_type" : "type-1585"
    },
    {
     "access" : "private",
     "field_name" : "mSignalTime",
     "field_offset" : 448,
     "referenced_type" : "type-1762"
    }
   ],
   "linker_set_key" : "android::FenceTime",
   "name" : "android::FenceTime",
   "record_kind" : "class",
   "referenced_type" : "type-1758",
   "self_type" : "type-1758",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android9FenceTimeE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1684"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "state",
     "referenced_type" : "type-1686"
    },
    {
     "field_name" : "fence",
     "field_offset" : 64,
     "referenced_type" : "type-1585"
    },
    {
     "field_name" : "signalTime",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android::FenceTime::Snapshot",
   "name" : "android::FenceTime::Snapshot",
   "referenced_type" : "type-1685",
   "self_type" : "type-1685",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android9FenceTime8SnapshotE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1770"
    },
    {
     "access" : "private",
     "field_name" : "mQueue",
     "field_offset" : 320,
     "referenced_type" : "type-1771"
    }
   ],
   "linker_set_key" : "android::FenceTimeline",
   "name" : "android::FenceTimeline",
   "record_kind" : "class",
   "referenced_type" : "type-1769",
   "self_type" : "type-1769",
   "size" : 88,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android13FenceTimelineE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-1774"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 320,
     "referenced_type" : "type-1775"
    }
   ],
   "linker_set_key" : "android::FenceToFenceTimeMap",
   "name" : "android::FenceToFenceTimeMap",
   "record_kind" : "class",
   "referenced_type" : "type-1773",
   "self_type" : "type-1773",
   "size" : 80,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h",
   "unique_id" : "_ZTSN7android19FenceToFenceTimeMapE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::Fence>",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-1590",
   "self_type" : "type-1590",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1587" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_5FenceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FenceTime::Snapshot>",
   "name" : "android::Flattenable<android::FenceTime::Snapshot>",
   "record_kind" : "class",
   "referenced_type" : "type-1684",
   "self_type" : "type-1684",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1685" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_9FenceTime8SnapshotEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::GraphicBuffer>",
   "name" : "android::Flattenable<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-792",
   "self_type" : "type-792",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-775" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_13GraphicBufferEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::FlattenableUtils",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-694",
   "self_type" : "type-694",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "unique_id" : "_ZTSN7android16FlattenableUtilsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::FloatRect",
   "name" : "android::FloatRect",
   "record_kind" : "class",
   "referenced_type" : "type-993",
   "self_type" : "type-993",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FloatRect.h",
   "unique_id" : "_ZTSN7android9FloatRectE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-783"
    },
    {
     "referenced_type" : "type-792"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 1472,
     "referenced_type" : "type-118"
    },
    {
     "access" : "private",
     "field_name" : "mBufferMapper",
     "field_offset" : 1536,
     "referenced_type" : "type-776"
    },
    {
     "access" : "private",
     "field_name" : "mInitCheck",
     "field_offset" : 1600,
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumFds",
     "field_offset" : 1664,
     "referenced_type" : "type-35"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumInts",
     "field_offset" : 1696,
     "referenced_type" : "type-35"
    },
    {
     "access" : "private",
     "field_name" : "mId",
     "field_offset" : 1728,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mBufferId",
     "field_offset" : 1792,
     "referenced_type" : "type-48"
    },
    {
     "access" : "private",
     "field_name" : "mGenerationNumber",
     "field_offset" : 1824,
     "referenced_type" : "type-35"
    },
    {
     "access" : "private",
     "field_name" : "mDeathCallbacks",
     "field_offset" : 1856,
     "referenced_type" : "type-781"
    },
    {
     "access" : "private",
     "field_name" : "mBufferHubBuffer",
     "field_offset" : 2048,
     "referenced_type" : "type-782"
    }
   ],
   "linker_set_key" : "android::GraphicBuffer",
   "name" : "android::GraphicBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-775",
   "self_type" : "type-775",
   "size" : 264,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBuffer.h",
   "unique_id" : "_ZTSN7android13GraphicBufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13GraphicBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-780"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMapper",
     "referenced_type" : "type-778"
    },
    {
     "access" : "private",
     "field_name" : "mMapperVersion",
     "field_offset" : 64,
     "referenced_type" : "type-779"
    }
   ],
   "linker_set_key" : "android::GraphicBufferMapper",
   "name" : "android::GraphicBufferMapper",
   "record_kind" : "class",
   "referenced_type" : "type-777",
   "self_type" : "type-777",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBufferMapper.h",
   "unique_id" : "_ZTSN7android19GraphicBufferMapperE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-326"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "recipient",
     "field_offset" : 64,
     "referenced_type" : "type-322"
    },
    {
     "field_name" : "cookie",
     "field_offset" : 192,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "who",
     "field_offset" : 320,
     "referenced_type" : "type-324"
    }
   ],
   "linker_set_key" : "android::H2BConverter<IOmxNode, BnOMXNode>::Obituary",
   "name" : "android::H2BConverter<IOmxNode, BnOMXNode>::Obituary",
   "referenced_type" : "type-321",
   "self_type" : "type-321",
   "size" : 72,
   "source_file" : "/system/libhidl/transport/token/1.0/utils/include/hidl/HybridInterface.h",
   "unique_id" : "_ZTSN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE",
   "vtable_components" :
   [
    {
     "component_value" : 56,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8Obituary11serviceDiedEmRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE8ObituaryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-299"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mBase",
     "field_offset" : 256,
     "referenced_type" : "type-293"
    },
    {
     "access" : "private",
     "field_name" : "mObituariesLock",
     "field_offset" : 320,
     "referenced_type" : "type-297"
    },
    {
     "access" : "private",
     "field_name" : "mObituaries",
     "field_offset" : 640,
     "referenced_type" : "type-298"
    }
   ],
   "linker_set_key" : "android::H2BConverter<android::hardware::media::omx::V1_0::IOmxNode, android::BnOMXNode>",
   "name" : "android::H2BConverter<android::hardware::media::omx::V1_0::IOmxNode, android::BnOMXNode>",
   "record_kind" : "class",
   "referenced_type" : "type-292",
   "self_type" : "type-292",
   "size" : 120,
   "source_file" : "/system/libhidl/transport/token/1.0/utils/include/hidl/HybridInterface.h",
   "template_args" : [ "type-295", "type-299" ],
   "unique_id" : "_ZTSN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE",
   "vtable_components" :
   [
    {
     "component_value" : 104,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE10onTransactEjRKNS_6ParcelEPS8_j"
    },
    {
     "mangled_component_name" : "_ZNK7android9BnOMXNode8isSecureEv"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPSB_"
    },
    {
     "component_value" : 96,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_8IOMXNodeEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_8IOMXNodeEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPSB_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEE10onTransactEjRKNS_6ParcelEPS8_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -104,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -104,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12H2BConverterINS_8hardware5media3omx4V1_08IOmxNodeENS_9BnOMXNodeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mID",
     "referenced_type" : "type-1480"
    },
    {
     "field_offset" : 8,
     "referenced_type" : "type-1481"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo",
   "name" : "android::HDRStaticInfo",
   "referenced_type" : "type-1479",
   "self_type" : "type-1479",
   "size" : 25,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "sType1",
     "referenced_type" : "type-1482"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "name" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "record_kind" : "union",
   "referenced_type" : "type-1481",
   "self_type" : "type-1481",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoUt_E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "y",
     "field_offset" : 16,
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Primaries1",
   "name" : "android::HDRStaticInfo::Primaries1",
   "referenced_type" : "type-1483",
   "self_type" : "type-1483",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo10Primaries1E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mR",
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "mG",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "mB",
     "field_offset" : 64,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "mW",
     "field_offset" : 96,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "mMaxDisplayLuminance",
     "field_offset" : 128,
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "mMinDisplayLuminance",
     "field_offset" : 144,
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "mMaxContentLightLevel",
     "field_offset" : 160,
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "mMaxFrameAverageLightLevel",
     "field_offset" : 176,
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Type1",
   "name" : "android::HDRStaticInfo::Type1",
   "referenced_type" : "type-1482",
   "self_type" : "type-1482",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo5Type1E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-301"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mBpBinder",
     "field_offset" : 64,
     "referenced_type" : "type-325"
    },
    {
     "access" : "protected",
     "field_name" : "mBp",
     "field_offset" : 128,
     "referenced_type" : "type-283"
    },
    {
     "access" : "protected",
     "field_name" : "mBase",
     "field_offset" : 192,
     "referenced_type" : "type-437"
    },
    {
     "access" : "protected",
     "field_name" : "mHalVariant",
     "field_offset" : 256,
     "referenced_type" : "type-439"
    },
    {
     "access" : "protected",
     "field_name" : "mHasConverter",
     "field_offset" : 384,
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "android::HpInterface<android::BpOMXNode, android::hardware::media::omx::V1_0::utils::LWOmxNode>",
   "name" : "android::HpInterface<android::BpOMXNode, android::hardware::media::omx::V1_0::utils::LWOmxNode>",
   "record_kind" : "class",
   "referenced_type" : "type-436",
   "self_type" : "type-436",
   "size" : 72,
   "source_file" : "/system/libhidl/transport/token/1.0/utils/include/hidl/HybridInterface.h",
   "template_args" : [ "type-440", "type-291" ],
   "unique_id" : "_ZTSN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEEE",
   "vtable_components" :
   [
    {
     "component_value" : 56,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEE13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11HpInterfaceINS_9BpOMXNodeENS_8hardware5media3omx4V1_05utils9LWOmxNodeEJEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "android::IBinder",
   "name" : "android::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-96",
   "self_type" : "type-96",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder13isBinderAliveEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder10pingBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder11linkToDeathERKNS_2spINS0_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder13unlinkToDeathERKNS_2wpINS0_14DeathRecipientEEEPvjPS3_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "android::IBinder::DeathRecipient",
   "name" : "android::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipient10binderDiedERKNS_2wpIS0_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "android::IInterface",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "unique_id" : "_ZTSN7android10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "android::IMediaCodecList",
   "name" : "android::IMediaCodecList",
   "record_kind" : "class",
   "referenced_type" : "type-91",
   "self_type" : "type-91",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IMediaCodecList.h",
   "unique_id" : "_ZTSN7android15IMediaCodecListE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IMediaCodecListE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IMediaCodecListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IMediaCodecListD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android15IMediaCodecList22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList11countCodecsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList12getCodecInfoEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList17getGlobalSettingsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList15findCodecByTypeEPKcbm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaCodecList15findCodecByNameEPKc"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IMediaCodecListE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15IMediaCodecListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15IMediaCodecListD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "android::IMemory",
   "name" : "android::IMemory",
   "record_kind" : "class",
   "referenced_type" : "type-354",
   "self_type" : "type-354",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "unique_id" : "_ZTSN7android7IMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7IMemory22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "android::IMemoryHeap",
   "name" : "android::IMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "type-352",
   "self_type" : "type-352",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "unique_id" : "_ZTSN7android11IMemoryHeapE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11IMemoryHeap22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "android::IOMX",
   "name" : "android::IOMX",
   "record_kind" : "class",
   "referenced_type" : "type-2022",
   "self_type" : "type-2022",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android4IOMXE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4IOMXE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4IOMXD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4IOMXD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IOMX9listNodesEPNS_4ListINS0_13ComponentInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IOMX12allocateNodeEPKcRKNS_2spINS_12IOMXObserverEEEPNS3_INS_8IOMXNodeEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IOMX18createInputSurfaceEPNS_2spINS_22IGraphicBufferProducerEEEPNS1_INS_20IGraphicBufferSourceEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mName",
     "referenced_type" : "type-50"
    },
    {
     "field_name" : "mRoles",
     "field_offset" : 64,
     "referenced_type" : "type-624"
    }
   ],
   "linker_set_key" : "android::IOMX::ComponentInfo",
   "name" : "android::IOMX::ComponentInfo",
   "referenced_type" : "type-1563",
   "self_type" : "type-1563",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android4IOMX13ComponentInfoE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "android::IOMXNode",
   "name" : "android::IOMXNode",
   "record_kind" : "class",
   "referenced_type" : "type-301",
   "self_type" : "type-301",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android8IOMXNodeE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8IOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8IOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8IOMXNodeD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8IOMXNode22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode8freeNodeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11sendCommandE15OMX_COMMANDTYPEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12getParameterE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode12setParameterE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9getConfigE13OMX_INDEXTYPEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9setConfigE13OMX_INDEXTYPEPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11setPortModeEjNS_4IOMX8PortModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode26prepareForAdaptivePlaybackEj8OMX_BOOLjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode24configureVideoTunnelModeEj8OMX_BOOLjPP13native_handle"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode21getGraphicBufferUsageEjPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15setInputSurfaceERKNS_2spINS_16IOMXBufferSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode20allocateSecureBufferEjmPjPPvPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode9useBufferEjRKNS_9OMXBufferEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10freeBufferEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode10fillBufferEjRKNS_9OMXBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode11emptyBufferEjRKNS_9OMXBufferEjxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode17getExtensionIndexEPKcP13OMX_INDEXTYPE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8IOMXNode15dispatchMessageERKNS_11omx_messageE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8IOMXNodeE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8IOMXNodeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8IOMXNodeD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "android::IOMXObserver",
   "name" : "android::IOMXObserver",
   "record_kind" : "class",
   "referenced_type" : "type-271",
   "self_type" : "type-271",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IOMX.h",
   "unique_id" : "_ZTSN7android12IOMXObserverE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12IOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12IOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12IOMXObserverD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12IOMXObserver22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IOMXObserver10onMessagesERKNSt3__14listINS_11omx_messageENS1_9allocatorIS3_EEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12IOMXObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12IOMXObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12IOMXObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-217"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::AString, android::sp<android::MediaCodecInfo::Capabilities> >",
   "name" : "android::KeyedVector<android::AString, android::sp<android::MediaCodecInfo::Capabilities> >",
   "record_kind" : "class",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-158", "type-223" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Point>",
   "name" : "android::LightFlattenable<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-831",
   "self_type" : "type-831",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-832" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::LightFlattenable<android::Rect>",
   "name" : "android::LightFlattenable<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-834",
   "self_type" : "type-834",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-835" ],
   "unique_id" : "_ZTSN7android16LightFlattenableINS_4RectEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-831"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Point>",
   "name" : "android::LightFlattenablePod<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-833",
   "self_type" : "type-833",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-832" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_5PointEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-834"
    }
   ],
   "linker_set_key" : "android::LightFlattenablePod<android::Rect>",
   "name" : "android::LightFlattenablePod<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-837",
   "self_type" : "type-837",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-835" ],
   "unique_id" : "_ZTSN7android19LightFlattenablePodINS_4RectEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-1589"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::Fence>",
   "name" : "android::LightRefBase<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-1588",
   "self_type" : "type-1588",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-1587" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_5FenceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-263"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-262",
   "self_type" : "type-262",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-258" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::List<String8>::CONST_ITERATOR<android::String8>",
   "name" : "android::List<String8>::CONST_ITERATOR<android::String8>",
   "referenced_type" : "type-1658",
   "self_type" : "type-1658",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-50" ],
   "unique_id" : "_ZTSN7android4ListINS_7String8EE14CONST_ITERATORIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::List<String8>::NON_CONST_ITERATOR<android::String8>",
   "name" : "android::List<String8>::NON_CONST_ITERATOR<android::String8>",
   "referenced_type" : "type-1659",
   "self_type" : "type-1659",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-50" ],
   "unique_id" : "_ZTSN7android4ListINS_7String8EE18NON_CONST_ITERATORIS1_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-1657"
    }
   ],
   "linker_set_key" : "android::List<String8>::_ListIterator<android::String8, android::List<String8>::CONST_ITERATOR>",
   "name" : "android::List<String8>::_ListIterator<android::String8, android::List<String8>::CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-1664",
   "self_type" : "type-1664",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-50" ],
   "unique_id" : "_ZTSN7android4ListINS_7String8EE13_ListIteratorIS1_NS2_14CONST_ITERATOREEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mpNode",
     "referenced_type" : "type-1654"
    }
   ],
   "linker_set_key" : "android::List<String8>::_ListIterator<android::String8, android::List<String8>::NON_CONST_ITERATOR>",
   "name" : "android::List<String8>::_ListIterator<android::String8, android::List<String8>::NON_CONST_ITERATOR>",
   "record_kind" : "class",
   "referenced_type" : "type-1660",
   "self_type" : "type-1660",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-50" ],
   "unique_id" : "_ZTSN7android4ListINS_7String8EE13_ListIteratorIS1_NS2_18NON_CONST_ITERATOREEE"
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "referenced_type" : "type-50"
    },
    {
     "access" : "private",
     "field_name" : "mpPrev",
     "field_offset" : 64,
     "referenced_type" : "type-1654"
    },
    {
     "access" : "private",
     "field_name" : "mpNext",
     "field_offset" : 128,
     "referenced_type" : "type-1654"
    }
   ],
   "linker_set_key" : "android::List<String8>::_Node",
   "name" : "android::List<String8>::_Node",
   "record_kind" : "class",
   "referenced_type" : "type-1653",
   "self_type" : "type-1653",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "unique_id" : "_ZTSN7android4ListINS_7String8EE5_NodeE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "type-161"
    }
   ],
   "linker_set_key" : "android::List<android::ALooper::Event>",
   "name" : "android::List<android::ALooper::Event>",
   "record_kind" : "class",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSN7android4ListINS_7ALooper5EventEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_7ALooper5EventEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7ALooper5EventEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7ALooper5EventEED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mpMiddle",
     "field_offset" : 64,
     "referenced_type" : "type-625"
    }
   ],
   "linker_set_key" : "android::List<android::String8>",
   "name" : "android::List<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "type-624",
   "self_type" : "type-624",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/List.h",
   "template_args" : [ "type-50" ],
   "unique_id" : "_ZTSN7android4ListINS_7String8EEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4ListINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4ListINS_7String8EED0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-80"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMeta",
     "field_offset" : 128,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mFormat",
     "field_offset" : 192,
     "referenced_type" : "type-164"
    },
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "field_offset" : 256,
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "android::MediaCodecBuffer",
   "name" : "android::MediaCodecBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 40,
   "source_file" : "/frameworks/av/media/libmedia/include/media/MediaCodecBuffer.h",
   "unique_id" : "_ZTSN7android16MediaCodecBufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16MediaCodecBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16MediaCodecBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16MediaCodecBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android16MediaCodecBuffer8setRangeEmm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-80"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 128,
     "referenced_type" : "type-158"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 320,
     "referenced_type" : "type-158"
    },
    {
     "access" : "private",
     "field_name" : "mAttributes",
     "field_offset" : 512,
     "referenced_type" : "type-215"
    },
    {
     "access" : "private",
     "field_name" : "mCaps",
     "field_offset" : 576,
     "referenced_type" : "type-216"
    },
    {
     "access" : "private",
     "field_name" : "mAliases",
     "field_offset" : 896,
     "referenced_type" : "type-224"
    },
    {
     "access" : "private",
     "field_name" : "mRank",
     "field_offset" : 1216,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android::MediaCodecInfo",
   "name" : "android::MediaCodecInfo",
   "referenced_type" : "type-214",
   "self_type" : "type-214",
   "size" : 160,
   "source_file" : "/frameworks/av/media/libmedia/include/media/MediaCodecInfo.h",
   "unique_id" : "_ZTSN7android14MediaCodecInfoE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MediaCodecInfoE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MediaCodecInfoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MediaCodecInfoD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-80"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mProfileLevels",
     "field_offset" : 128,
     "referenced_type" : "type-585"
    },
    {
     "access" : "protected",
     "field_name" : "mProfileLevelsSorted",
     "field_offset" : 448,
     "referenced_type" : "type-587"
    },
    {
     "access" : "protected",
     "field_name" : "mColorFormats",
     "field_offset" : 768,
     "referenced_type" : "type-588"
    },
    {
     "access" : "protected",
     "field_name" : "mColorFormatsSorted",
     "field_offset" : 1088,
     "referenced_type" : "type-589"
    },
    {
     "access" : "protected",
     "field_name" : "mDetails",
     "field_offset" : 1408,
     "referenced_type" : "type-164"
    }
   ],
   "linker_set_key" : "android::MediaCodecInfo::Capabilities",
   "name" : "android::MediaCodecInfo::Capabilities",
   "referenced_type" : "type-584",
   "self_type" : "type-584",
   "size" : 184,
   "source_file" : "/frameworks/av/media/libmedia/include/media/MediaCodecInfo.h",
   "unique_id" : "_ZTSN7android14MediaCodecInfo12CapabilitiesE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MediaCodecInfo12CapabilitiesE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MediaCodecInfo12CapabilitiesD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MediaCodecInfo12CapabilitiesD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCap",
     "referenced_type" : "type-583"
    }
   ],
   "linker_set_key" : "android::MediaCodecInfo::CapabilitiesWriter",
   "name" : "android::MediaCodecInfo::CapabilitiesWriter",
   "referenced_type" : "type-760",
   "self_type" : "type-760",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmedia/include/media/MediaCodecInfo.h",
   "unique_id" : "_ZTSN7android14MediaCodecInfo18CapabilitiesWriterE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mProfile",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mLevel",
     "field_offset" : 32,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android::MediaCodecInfo::ProfileLevel",
   "name" : "android::MediaCodecInfo::ProfileLevel",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmedia/include/media/MediaCodecInfo.h",
   "unique_id" : "_ZTSN7android14MediaCodecInfo12ProfileLevelE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mInfo",
     "referenced_type" : "type-213"
    }
   ],
   "linker_set_key" : "android::MediaCodecInfoWriter",
   "name" : "android::MediaCodecInfoWriter",
   "referenced_type" : "type-762",
   "self_type" : "type-762",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmedia/include/media/MediaCodecInfo.h",
   "unique_id" : "_ZTSN7android20MediaCodecInfoWriterE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-195"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mInitCheck",
     "field_offset" : 256,
     "referenced_type" : "type-48"
    },
    {
     "access" : "private",
     "field_name" : "mGlobalSettings",
     "field_offset" : 320,
     "referenced_type" : "type-164"
    },
    {
     "access" : "private",
     "field_name" : "mCodecInfos",
     "field_offset" : 384,
     "referenced_type" : "type-198"
    }
   ],
   "linker_set_key" : "android::MediaCodecList",
   "name" : "android::MediaCodecList",
   "referenced_type" : "type-197",
   "self_type" : "type-197",
   "size" : 88,
   "source_file" : "/frameworks/av/media/libstagefright/include/media/stagefright/MediaCodecList.h",
   "unique_id" : "_ZTSN7android14MediaCodecListE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MediaCodecListE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MediaCodecListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MediaCodecListD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaCodecListEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_15IMediaCodecListEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MediaCodecList11countCodecsEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MediaCodecList12getCodecInfoEm"
    },
    {
     "mangled_component_name" : "_ZNK7android14MediaCodecList17getGlobalSettingsEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MediaCodecList15findCodecByTypeEPKcbm"
    },
    {
     "mangled_component_name" : "_ZNK7android14MediaCodecList15findCodecByNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaCodecListEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android16BnMediaCodecList10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 64,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MediaCodecListE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaCodecListEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_15IMediaCodecListEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android14MediaCodecListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android14MediaCodecListD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android16BnMediaCodecList10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MediaCodecListE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android14MediaCodecListD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android14MediaCodecListD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-203"
    }
   ],
   "linker_set_key" : "android::MediaCodecList::BinderDeathObserver",
   "name" : "android::MediaCodecList::BinderDeathObserver",
   "record_kind" : "class",
   "referenced_type" : "type-202",
   "self_type" : "type-202",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/include/media/stagefright/MediaCodecList.h",
   "unique_id" : "_ZTSN7android14MediaCodecList19BinderDeathObserverE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MediaCodecList19BinderDeathObserverE"
    },
    {
     "mangled_component_name" : "_ZN7android14MediaCodecList19BinderDeathObserver10binderDiedERKNS_2wpINS_7IBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MediaCodecList19BinderDeathObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MediaCodecList19BinderDeathObserverD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MediaCodecList19BinderDeathObserverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android14MediaCodecList19BinderDeathObserverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android14MediaCodecList19BinderDeathObserverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::MediaCodecListBuilderBase",
   "name" : "android::MediaCodecListBuilderBase",
   "referenced_type" : "type-2251",
   "self_type" : "type-2251",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/include/media/stagefright/MediaCodecListWriter.h",
   "unique_id" : "_ZTSN7android25MediaCodecListBuilderBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android25MediaCodecListBuilderBaseE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android25MediaCodecListBuilderBase19buildMediaCodecListEPNS_20MediaCodecListWriterE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android25MediaCodecListBuilderBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android25MediaCodecListBuilderBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGlobalSettings",
     "referenced_type" : "type-2246"
    },
    {
     "access" : "private",
     "field_name" : "mCodecInfos",
     "field_offset" : 192,
     "referenced_type" : "type-2247"
    }
   ],
   "linker_set_key" : "android::MediaCodecListWriter",
   "name" : "android::MediaCodecListWriter",
   "referenced_type" : "type-2245",
   "self_type" : "type-2245",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libstagefright/include/media/stagefright/MediaCodecListWriter.h",
   "unique_id" : "_ZTSN7android20MediaCodecListWriterE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "type-1796"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 160,
     "referenced_type" : "type-1797"
    }
   ],
   "linker_set_key" : "android::MediaImage",
   "name" : "android::MediaImage",
   "referenced_type" : "type-1795",
   "self_type" : "type-1795",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android10MediaImageE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "type-1801"
    },
    {
     "field_name" : "mNumPlanes",
     "field_offset" : 32,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mWidth",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mHeight",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mBitDepth",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mBitDepthAllocated",
     "field_offset" : 160,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mPlane",
     "field_offset" : 192,
     "referenced_type" : "type-1802"
    }
   ],
   "linker_set_key" : "android::MediaImage2",
   "name" : "android::MediaImage2",
   "referenced_type" : "type-1800",
   "self_type" : "type-1800",
   "size" : 104,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android11MediaImage2E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android::MediaImage2::PlaneInfo",
   "name" : "android::MediaImage2::PlaneInfo",
   "referenced_type" : "type-1803",
   "self_type" : "type-1803",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android11MediaImage29PlaneInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mColInc",
     "field_offset" : 32,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mRowInc",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mHorizSubsampling",
     "field_offset" : 96,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mVertSubsampling",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "android::MediaImage::PlaneInfo",
   "name" : "android::MediaImage::PlaneInfo",
   "referenced_type" : "type-1798",
   "self_type" : "type-1798",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android10MediaImage9PlaneInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-133"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-135"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-134",
   "self_type" : "type-134",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-262"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "type-259"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufferType",
     "referenced_type" : "type-524"
    },
    {
     "access" : "private",
     "field_name" : "mRangeOffset",
     "field_offset" : 32,
     "referenced_type" : "type-35"
    },
    {
     "access" : "private",
     "field_name" : "mRangeLength",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "access" : "private",
     "field_name" : "mMem",
     "field_offset" : 128,
     "referenced_type" : "type-525"
    },
    {
     "access" : "private",
     "field_name" : "mGraphicBuffer",
     "field_offset" : 192,
     "referenced_type" : "type-309"
    },
    {
     "access" : "private",
     "field_name" : "mNativeHandle",
     "field_offset" : 256,
     "referenced_type" : "type-256"
    },
    {
     "access" : "private",
     "field_name" : "mHidlMemory",
     "field_offset" : 320,
     "referenced_type" : "type-527"
    }
   ],
   "linker_set_key" : "android::OMXBuffer",
   "name" : "android::OMXBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-523",
   "self_type" : "type-523",
   "size" : 80,
   "source_file" : "/frameworks/av/media/libmedia/include/media/OMXBuffer.h",
   "unique_id" : "_ZTSN7android9OMXBufferE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-708"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFenceFd",
     "field_offset" : 64,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "android::OMXFenceParcelable",
   "name" : "android::OMXFenceParcelable",
   "referenced_type" : "type-1548",
   "self_type" : "type-1548",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmedia/include/media/OMXFenceParcelable.h",
   "unique_id" : "_ZTSN7android18OMXFenceParcelableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android18OMXFenceParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android18OMXFenceParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android18OMXFenceParcelableD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android18OMXFenceParcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android18OMXFenceParcelable14readFromParcelEPKNS_6ParcelE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mError",
     "referenced_type" : "type-48"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 64,
     "referenced_type" : "type-117"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 320,
     "referenced_type" : "type-731"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 384,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 448,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 512,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSorted",
     "field_offset" : 576,
     "referenced_type" : "type-155"
    },
    {
     "access" : "private",
     "field_name" : "mRequestHeaderPresent",
     "field_offset" : 584,
     "referenced_type" : "type-155"
    },
    {
     "access" : "private",
     "field_name" : "mWorkSourceRequestHeaderPosition",
     "field_offset" : 640,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 704,
     "referenced_type" : "type-155"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 712,
     "referenced_type" : "type-155"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 720,
     "referenced_type" : "type-155"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 768,
     "referenced_type" : "type-733"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 832,
     "referenced_type" : "type-94"
    },
    {
     "access" : "private",
     "field_name" : "mOpenAshmemSize",
     "field_offset" : 896,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::Parcel",
   "name" : "android::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-730",
   "self_type" : "type-730",
