{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "__bpf_label [512]",
   "name" : "__bpf_label [512]",
   "referenced_type" : "type-9",
   "self_type" : "type-8",
   "size" : 8192,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "linker_set_key" : "const char *[]",
   "name" : "const char *[]",
   "referenced_type" : "type-10",
   "self_type" : "type-37",
   "source_file" : "/external/minijail/util.h"
  },
  {
   "linker_set_key" : "constant_entry []",
   "name" : "constant_entry []",
   "referenced_type" : "type-76",
   "self_type" : "type-77",
   "source_file" : "/external/minijail/libconstants.h"
  },
  {
   "linker_set_key" : "syscall_entry []",
   "name" : "syscall_entry []",
   "referenced_type" : "type-79",
   "self_type" : "type-80",
   "source_file" : "/external/minijail/libsyscalls.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned long long [6]",
   "name" : "unsigned long long [6]",
   "referenced_type" : "type-4",
   "self_type" : "type-5",
   "size" : 48,
   "source_file" : "/external/minijail/bpf.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 1
  },
  {

   "name" : "minijail *",
   "referenced_type" : "type-60",
   "self_type" : "type-59",
   "size" : 8,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "parser_state *",
   "name" : "parser_state *",
   "referenced_type" : "type-58",
   "self_type" : "type-65",
   "size" : 8,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_filter *",
   "name" : "sock_filter *",
   "referenced_type" : "type-20",
   "self_type" : "type-19",
   "size" : 8,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_filter *",
   "name" : "sock_filter *",
   "referenced_type" : "type-24",
   "self_type" : "type-23",
   "size" : 8,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_filter *",
   "name" : "sock_filter *",
   "referenced_type" : "type-30",
   "self_type" : "type-29",
   "size" : 8,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_filter *",
   "name" : "sock_filter *",
   "referenced_type" : "type-56",
   "self_type" : "type-55",
   "size" : 8,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_filter *",
   "name" : "sock_filter *",
   "referenced_type" : "type-64",
   "self_type" : "type-63",
   "size" : 8,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_filter *",
   "name" : "sock_filter *",
   "referenced_type" : "type-84",
   "self_type" : "type-83",
   "size" : 8,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_filter **",
   "name" : "sock_filter **",
   "referenced_type" : "type-29",
   "self_type" : "type-36",
   "size" : 8,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_filter **",
   "name" : "sock_filter **",
   "referenced_type" : "type-83",
   "self_type" : "type-85",
   "size" : 8,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_fprog *",
   "name" : "sock_fprog *",
   "referenced_type" : "type-28",
   "self_type" : "type-27",
   "size" : 8,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "sock_fprog *",
   "name" : "sock_fprog *",
   "referenced_type" : "type-70",
   "self_type" : "type-69",
   "size" : 8,
   "source_file" : "/external/minijail/syscall_filter.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned int *",
   "name" : "unsigned int *",
   "referenced_type" : "type-3",
   "self_type" : "type-71",
   "size" : 8,
   "source_file" : "/external/minijail/system.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "unsigned long *",
   "name" : "unsigned long *",
   "referenced_type" : "type-7",
   "self_type" : "type-73",
   "size" : 8,
   "source_file" : "/external/minijail/system.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-31",
   "self_type" : "type-46",
   "size" : 8,
   "source_file" : "/external/minijail/libminijail.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "char *const",
   "name" : "char *const",
   "referenced_type" : "type-44",
   "self_type" : "type-51",
   "size" : 8,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-12",
   "self_type" : "type-11",
   "size" : 1,
   "source_file" : "/external/minijail/bpf.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const minijail",
   "name" : "const minijail",
   "referenced_type" : "type-17",
   "self_type" : "type-16",
   "size" : 1344,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const minijail",
   "name" : "const minijail",
   "referenced_type" : "type-49",
   "self_type" : "type-48",
   "size" : 1344,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const sock_fprog",
   "name" : "const sock_fprog",
   "referenced_type" : "type-14",
   "self_type" : "type-13",
   "size" : 16,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const sock_fprog",
   "name" : "const sock_fprog",
   "referenced_type" : "type-42",
   "self_type" : "type-41",
   "size" : 16,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-3",
   "self_type" : "type-61",
   "size" : 4,
   "source_file" : "/external/minijail/libminijail.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-7",
   "self_type" : "type-38",
   "size" : 8,
   "source_file" : "/external/minijail/util.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "constant_entry const[]",
   "name" : "constant_entry const[]",
   "referenced_type" : "type-77",
   "self_type" : "type-78",
   "source_file" : "/external/minijail/libconstants.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "syscall_entry const[]",
   "name" : "syscall_entry const[]",
   "referenced_type" : "type-80",
   "self_type" : "type-81",
   "source_file" : "/external/minijail/libsyscalls.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "label",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "location",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "__bpf_label",
   "name" : "__bpf_label",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 16,
   "source_file" : "/external/minijail/bpf.h",
   "unique_id" : "__bpf_label"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "labels",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "bpf_labels",
   "name" : "bpf_labels",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 8200,
   "source_file" : "/external/minijail/bpf.h",
   "unique_id" : "bpf_labels"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "constant_entry",
   "name" : "constant_entry",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 16,
   "source_file" : "/external/minijail/libconstants.h",
   "unique_id" : "constant_entry"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "instrs",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "next",
     "field_offset" : 128,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "last",
     "field_offset" : 192,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "total_len",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "filter_block",
   "name" : "filter_block",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 40,
   "source_file" : "/external/minijail/syscall_filter.h",
   "unique_id" : "filter_block"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "filename",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "line_number",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "parser_state",
   "name" : "parser_state",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 16,
   "source_file" : "/external/minijail/syscall_filter.h",
   "unique_id" : "parser_state"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nr",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "arch",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "instruction_pointer",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "args",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "seccomp_data",
   "name" : "seccomp_data",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 64,
   "source_file" : "/external/minijail/bpf.h",
   "unique_id" : "seccomp_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "nr",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "syscall_entry",
   "name" : "syscall_entry",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 16,
   "source_file" : "/external/minijail/libsyscalls.h",
   "unique_id" : "syscall_entry"
  }
 ],
 "rvalue_reference_types" : []
}
