{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [29]",
   "name" : "char [29]",
   "referenced_type" : "type-33",
   "self_type" : "type-99",
   "size" : 29,
   "source_file" : "/external/libpng/pngstruct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [64]",
   "name" : "char [64]",
   "referenced_type" : "type-33",
   "self_type" : "type-155",
   "size" : 64,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "long [11]",
   "name" : "long [11]",
   "referenced_type" : "type-71",
   "self_type" : "type-70",
   "size" : 88,
   "source_file" : "/external/libpng/pngstruct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [1]",
   "name" : "unsigned char [1]",
   "referenced_type" : "type-2",
   "self_type" : "type-88",
   "size" : 1,
   "source_file" : "/external/libpng/pngstruct.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [512]",
   "name" : "unsigned char [512]",
   "referenced_type" : "type-2",
   "self_type" : "type-10",
   "size" : 512,
   "source_file" : "/external/libpng/pngpriv.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5]",
   "name" : "unsigned char [5]",
   "referenced_type" : "type-2",
   "self_type" : "type-44",
   "size" : 5,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [8]",
   "name" : "unsigned char [8]",
   "referenced_type" : "type-2",

   "name" : "const png_info_def",
   "referenced_type" : "type-27",
   "self_type" : "type-26",
   "size" : 360,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "is_restricted" : true,
   "linker_set_key" : "const png_info_def *restrict",
   "name" : "const png_info_def *restrict",
   "referenced_type" : "type-25",
   "self_type" : "type-50",
   "size" : 8,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const png_sPLT_struct",
   "name" : "const png_sPLT_struct",
   "referenced_type" : "type-46",
   "self_type" : "type-124",
   "size" : 32,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const png_struct_def",
   "name" : "const png_struct_def",
   "referenced_type" : "type-69",
   "self_type" : "type-144",
   "size" : 1136,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "is_restricted" : true,
   "linker_set_key" : "const png_struct_def *restrict",
   "name" : "const png_struct_def *restrict",
   "referenced_type" : "type-143",
   "self_type" : "type-145",
   "size" : 8,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const png_text_struct",
   "name" : "const png_text_struct",
   "referenced_type" : "type-36",
   "self_type" : "type-126",
   "size" : 56,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const png_time_struct",
   "name" : "const png_time_struct",
   "referenced_type" : "type-37",
   "self_type" : "type-147",
   "size" : 8,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const png_unknown_chunk_t",
   "name" : "const png_unknown_chunk_t",
   "referenced_type" : "type-43",
   "self_type" : "type-128",
   "size" : 32,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const png_xy",
   "name" : "const png_xy",
   "referenced_type" : "type-3",
   "self_type" : "type-14",
   "size" : 32,
   "source_file" : "/external/libpng/pngpriv.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const tm",
   "name" : "const tm",
   "referenced_type" : "type-133",
   "self_type" : "type-132",
   "size" : 56,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const tm",
   "name" : "const tm",
   "referenced_type" : "type-164",
   "self_type" : "type-163",
   "size" : 56,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-2",
   "self_type" : "type-110",
   "size" : 1,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-28",
   "self_type" : "type-120",
   "size" : 4,
   "source_file" : "/external/libpng/pngpriv.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-6",
   "self_type" : "type-118",
   "size" : 2,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-20",
   "self_type" : "type-66",
   "source_file" : "/external/libpng/pngpriv.h"
  },
  {
   "alignment" : 8,
   "is_restricted" : true,
   "linker_set_key" : "png_colorspace *restrict",
   "name" : "png_colorspace *restrict",
   "referenced_type" : "type-131",
   "self_type" : "type-130",
   "size" : 8,
   "source_file" : "/external/libpng/pngpriv.h"
  },
  {
   "alignment" : 8,
   "is_restricted" : true,
   "linker_set_key" : "png_info_def *restrict",
   "name" : "png_info_def *restrict",
   "referenced_type" : "type-96",
   "self_type" : "type-151",
   "size" : 8,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "is_restricted" : true,
   "linker_set_key" : "png_struct_def *restrict",
   "name" : "png_struct_def *restrict",
   "referenced_type" : "type-68",
   "self_type" : "type-142",
   "size" : 8,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "unsigned char *const",
   "name" : "unsigned char *const",
   "referenced_type" : "type-34",
   "self_type" : "type-121",
   "size" : 8,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[512]",
   "name" : "unsigned char const[512]",
   "referenced_type" : "type-10",
   "self_type" : "type-11",
   "size" : 512,
   "source_file" : "/external/libpng/pngpriv.h"
  },
  {
   "alignment" : 8,
   "is_restricted" : true,
   "linker_set_key" : "unsigned long *restrict",
   "name" : "unsigned long *restrict",
   "referenced_type" : "type-23",
   "self_type" : "type-141",
   "size" : 8,
   "source_file" : "/external/libpng/png.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "unsigned short const[256]",
   "name" : "unsigned short const[256]",
   "referenced_type" : "type-5",
   "self_type" : "type-7",
   "size" : 512,
   "source_file" : "/external/libpng/pngpriv.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "unsigned short const[512]",
   "name" : "unsigned short const[512]",
   "referenced_type" : "type-8",
   "self_type" : "type-9",
   "size" : 1024,
   "source_file" : "/external/libpng/pngpriv.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "red_X",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "red_Y",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "red_Z",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "green_X",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "green_Y",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "green_Z",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "blue_X",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "blue_Y",
     "field_offset" : 224,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "blue_Z",
     "field_offset" : 256,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "png_XYZ",
   "name" : "png_XYZ",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 36,
   "source_file" : "/external/libpng/pngstruct.h",
   "unique_id" : "png_XYZ"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "red",
     "field_offset" : 16,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "green",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "blue",
     "field_offset" : 48,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "gray",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "png_color_16_struct",
   "name" : "png_color_16_struct",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 10,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_color_16_struct"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "red",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "green",
     "field_offset" : 8,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "blue",
     "field_offset" : 16,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "gray",
     "field_offset" : 24,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "png_color_8_struct",
   "name" : "png_color_8_struct",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 5,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_color_8_struct"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "red",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "green",
     "field_offset" : 8,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "blue",
     "field_offset" : 16,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "png_color_struct",
   "name" : "png_color_struct",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 3,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_color_struct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gamma",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "end_points_xy",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "end_points_XYZ",
     "field_offset" : 288,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "rendering_intent",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "flags",
     "field_offset" : 592,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "png_colorspace",
   "name" : "png_colorspace",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 76,
   "source_file" : "/external/libpng/pngstruct.h",
   "unique_id" : "png_colorspace"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "output",
     "field_offset" : 64,
     "referenced_type" : "type-88"
    }
   ],
   "linker_set_key" : "png_compression_buffer",
   "name" : "png_compression_buffer",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 16,
   "source_file" : "/external/libpng/pngstruct.h",
   "unique_id" : "png_compression_buffer"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "png_ptr",
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "info_ptr",
     "field_offset" : 64,
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "error_buf",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "memory",
     "field_offset" : 192,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "size",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "for_write",
     "field_offset" : 320,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "owned_file",
     "field_offset" : 321,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "png_control",
   "name" : "png_control",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 48,
   "source_file" : "/external/libpng/pngpriv.h",
   "unique_id" : "png_control"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "opaque",
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "version",
     "field_offset" : 64,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "width",
     "field_offset" : 96,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "height",
     "field_offset" : 128,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "format",
     "field_offset" : 160,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "colormap_entries",
     "field_offset" : 224,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "warning_or_error",
     "field_offset" : 256,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "message",
     "field_offset" : 288,
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "png_image",
   "name" : "png_image",
   "referenced_type" : "type-152",
   "self_type" : "type-152",
   "size" : 104,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_image"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "valid",
     "field_offset" : 64,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "rowbytes",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "palette",
     "field_offset" : 192,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_palette",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "num_trans",
     "field_offset" : 272,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bit_depth",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "color_type",
     "field_offset" : 296,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "compression_type",
     "field_offset" : 304,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "filter_type",
     "field_offset" : 312,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "interlace_type",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channels",
     "field_offset" : 328,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pixel_depth",
     "field_offset" : 336,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "spare_byte",
     "field_offset" : 344,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "signature",
     "field_offset" : 352,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "colorspace",
     "field_offset" : 416,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "iccp_name",
     "field_offset" : 1024,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "iccp_profile",
     "field_offset" : 1088,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "iccp_proflen",
     "field_offset" : 1152,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "num_text",
     "field_offset" : 1184,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "max_text",
     "field_offset" : 1216,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "text",
     "field_offset" : 1280,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "mod_time",
     "field_offset" : 1344,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "sig_bit",
     "field_offset" : 1408,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "trans_alpha",
     "field_offset" : 1472,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "trans_color",
     "field_offset" : 1536,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "background",
     "field_offset" : 1616,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "x_offset",
     "field_offset" : 1696,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "y_offset",
     "field_offset" : 1728,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "offset_unit_type",
     "field_offset" : 1760,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "x_pixels_per_unit",
     "field_offset" : 1792,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "y_pixels_per_unit",
     "field_offset" : 1824,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "phys_unit_type",
     "field_offset" : 1856,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "num_exif",
     "field_offset" : 1888,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "exif",
     "field_offset" : 1920,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "eXIf_buf",
     "field_offset" : 1984,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "hist",
     "field_offset" : 2048,
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "pcal_purpose",
     "field_offset" : 2112,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pcal_X0",
     "field_offset" : 2176,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pcal_X1",
     "field_offset" : 2208,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pcal_units",
     "field_offset" : 2240,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pcal_params",
     "field_offset" : 2304,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "pcal_type",
     "field_offset" : 2368,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pcal_nparams",
     "field_offset" : 2376,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "free_me",
     "field_offset" : 2400,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "unknown_chunks",
     "field_offset" : 2432,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "unknown_chunks_num",
     "field_offset" : 2496,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "splt_palettes",
     "field_offset" : 2560,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "splt_palettes_num",
     "field_offset" : 2624,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "scal_unit",
     "field_offset" : 2656,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "scal_s_width",
     "field_offset" : 2688,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "scal_s_height",
     "field_offset" : 2752,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "row_pointers",
     "field_offset" : 2816,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "png_info_def",
   "name" : "png_info_def",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 360,
   "source_file" : "/external/libpng/pnginfo.h",
   "unique_id" : "png_info_def"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "rowbytes",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "color_type",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bit_depth",
     "field_offset" : 136,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channels",
     "field_offset" : 144,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pixel_depth",
     "field_offset" : 152,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "png_row_info_struct",
   "name" : "png_row_info_struct",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 24,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_row_info_struct"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "red",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "green",
     "field_offset" : 16,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "blue",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 48,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "frequency",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "png_sPLT_entry_struct",
   "name" : "png_sPLT_entry_struct",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 10,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_sPLT_entry_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "depth",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "entries",
     "field_offset" : 128,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "nentries",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "png_sPLT_struct",
   "name" : "png_sPLT_struct",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 32,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_sPLT_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "jmp_buf_local",
     "referenced_type" : "type-70"
    },
    {
     "field_name" : "longjmp_fn",
     "field_offset" : 704,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "jmp_buf_ptr",
     "field_offset" : 768,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "jmp_buf_size",
     "field_offset" : 832,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "error_fn",
     "field_offset" : 896,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "error_ptr",
     "field_offset" : 960,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "write_data_fn",
     "field_offset" : 1024,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "read_data_fn",
     "field_offset" : 1088,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "io_ptr",
     "field_offset" : 1152,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "read_user_transform_fn",
     "field_offset" : 1216,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "write_user_transform_fn",
     "field_offset" : 1280,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "user_transform_ptr",
     "field_offset" : 1344,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "user_transform_depth",
     "field_offset" : 1408,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "user_transform_channels",
     "field_offset" : 1416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mode",
     "field_offset" : 1440,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1472,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "transformations",
     "field_offset" : 1504,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "zowner",
     "field_offset" : 1536,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "zstream",
     "field_offset" : 1600,
     "referenced_type" : "type-85"
    },
    {
     "field_name" : "zbuffer_list",
     "field_offset" : 2496,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "zbuffer_size",
     "field_offset" : 2560,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "zlib_level",
     "field_offset" : 2592,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_method",
     "field_offset" : 2624,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_window_bits",
     "field_offset" : 2656,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_mem_level",
     "field_offset" : 2688,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_strategy",
     "field_offset" : 2720,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_text_level",
     "field_offset" : 2752,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_text_method",
     "field_offset" : 2784,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_text_window_bits",
     "field_offset" : 2816,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_text_mem_level",
     "field_offset" : 2848,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_text_strategy",
     "field_offset" : 2880,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_set_level",
     "field_offset" : 2912,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_set_method",
     "field_offset" : 2944,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_set_window_bits",
     "field_offset" : 2976,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_set_mem_level",
     "field_offset" : 3008,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "zlib_set_strategy",
     "field_offset" : 3040,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "width",
     "field_offset" : 3072,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "height",
     "field_offset" : 3104,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "num_rows",
     "field_offset" : 3136,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "usr_width",
     "field_offset" : 3168,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "rowbytes",
     "field_offset" : 3200,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "iwidth",
     "field_offset" : 3264,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "row_number",
     "field_offset" : 3296,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "chunk_name",
     "field_offset" : 3328,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "prev_row",
     "field_offset" : 3392,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "row_buf",
     "field_offset" : 3456,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "try_row",
     "field_offset" : 3520,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "tst_row",
     "field_offset" : 3584,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "info_rowbytes",
     "field_offset" : 3648,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "idat_size",
     "field_offset" : 3712,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "crc",
     "field_offset" : 3744,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "palette",
     "field_offset" : 3776,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_palette",
     "field_offset" : 3840,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "num_palette_max",
     "field_offset" : 3872,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "num_trans",
     "field_offset" : 3904,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "compression",
     "field_offset" : 3920,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "filter",
     "field_offset" : 3928,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "interlaced",
     "field_offset" : 3936,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pass",
     "field_offset" : 3944,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "do_filter",
     "field_offset" : 3952,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "color_type",
     "field_offset" : 3960,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bit_depth",
     "field_offset" : 3968,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "usr_bit_depth",
     "field_offset" : 3976,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pixel_depth",
     "field_offset" : 3984,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channels",
     "field_offset" : 3992,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "usr_channels",
     "field_offset" : 4000,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sig_bytes",
     "field_offset" : 4008,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maximum_pixel_depth",
     "field_offset" : 4016,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "transformed_pixel_depth",
     "field_offset" : 4024,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "zstream_start",
     "field_offset" : 4032,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "filler",
     "field_offset" : 4048,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "background_gamma_type",
     "field_offset" : 4064,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "background_gamma",
     "field_offset" : 4096,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "background",
     "field_offset" : 4128,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "background_1",
     "field_offset" : 4208,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "output_flush_fn",
     "field_offset" : 4288,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "flush_dist",
     "field_offset" : 4352,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "flush_rows",
     "field_offset" : 4384,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "gamma_shift",
     "field_offset" : 4416,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "screen_gamma",
     "field_offset" : 4448,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "gamma_table",
     "field_offset" : 4480,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "gamma_16_table",
     "field_offset" : 4544,
     "referenced_type" : "type-91"
    },
    {
     "field_name" : "gamma_from_1",
     "field_offset" : 4608,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "gamma_to_1",
     "field_offset" : 4672,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "gamma_16_from_1",
     "field_offset" : 4736,
     "referenced_type" : "type-91"
    },
    {
     "field_name" : "gamma_16_to_1",
     "field_offset" : 4800,
     "referenced_type" : "type-91"
    },
    {
     "field_name" : "sig_bit",
     "field_offset" : 4864,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "shift",
     "field_offset" : 4904,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "trans_alpha",
     "field_offset" : 4992,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "trans_color",
     "field_offset" : 5056,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "read_row_fn",
     "field_offset" : 5184,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "write_row_fn",
     "field_offset" : 5248,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "info_fn",
     "field_offset" : 5312,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "row_fn",
     "field_offset" : 5376,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "end_fn",
     "field_offset" : 5440,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "save_buffer_ptr",
     "field_offset" : 5504,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "save_buffer",
     "field_offset" : 5568,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "current_buffer_ptr",
     "field_offset" : 5632,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "current_buffer",
     "field_offset" : 5696,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "push_length",
     "field_offset" : 5760,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "skip_length",
     "field_offset" : 5792,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "save_buffer_size",
     "field_offset" : 5824,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "save_buffer_max",
     "field_offset" : 5888,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "buffer_size",
     "field_offset" : 5952,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "current_buffer_size",
     "field_offset" : 6016,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "process_mode",
     "field_offset" : 6080,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "cur_palette",
     "field_offset" : 6112,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "palette_lookup",
     "field_offset" : 6144,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "quantize_index",
     "field_offset" : 6208,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "options",
     "field_offset" : 6272,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "time_buffer",
     "field_offset" : 6304,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "free_me",
     "field_offset" : 6560,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "user_chunk_ptr",
     "field_offset" : 6592,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "read_user_chunk_fn",
     "field_offset" : 6656,
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "unknown_default",
     "field_offset" : 6720,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "num_chunk_list",
     "field_offset" : 6752,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "chunk_list",
     "field_offset" : 6784,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "rgb_to_gray_status",
     "field_offset" : 6848,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rgb_to_gray_coefficients_set",
     "field_offset" : 6856,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rgb_to_gray_red_coeff",
     "field_offset" : 6864,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "rgb_to_gray_green_coeff",
     "field_offset" : 6880,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "mng_features_permitted",
     "field_offset" : 6912,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "filter_type",
     "field_offset" : 6944,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mem_ptr",
     "field_offset" : 6976,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "malloc_fn",
     "field_offset" : 7040,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "free_fn",
     "field_offset" : 7104,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "big_row_buf",
     "field_offset" : 7168,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "quantize_sort",
     "field_offset" : 7232,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "index_to_palette",
     "field_offset" : 7296,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "palette_to_index",
     "field_offset" : 7360,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "compression_type",
     "field_offset" : 7424,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "user_width_max",
     "field_offset" : 7456,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "user_height_max",
     "field_offset" : 7488,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "user_chunk_cache_max",
     "field_offset" : 7520,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "user_chunk_malloc_max",
     "field_offset" : 7552,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "unknown_chunk",
     "field_offset" : 7616,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "old_big_row_buf_size",
     "field_offset" : 7872,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "read_buffer",
     "field_offset" : 7936,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "read_buffer_size",
     "field_offset" : 8000,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "IDAT_read_size",
     "field_offset" : 8064,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "io_state",
     "field_offset" : 8096,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "big_prev_row",
     "field_offset" : 8128,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "read_filter",
     "field_offset" : 8192,
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "colorspace",
     "field_offset" : 8448,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "png_struct_def",
   "name" : "png_struct_def",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 1136,
   "source_file" : "/external/libpng/pngstruct.h",
   "unique_id" : "png_struct_def"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "compression",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "key",
     "field_offset" : 64,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "text",
     "field_offset" : 128,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "text_length",
     "field_offset" : 192,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "itxt_length",
     "field_offset" : 256,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "lang",
     "field_offset" : 320,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "lang_key",
     "field_offset" : 384,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "png_text_struct",
   "name" : "png_text_struct",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 56,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_text_struct"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "year",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "month",
     "field_offset" : 16,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "day",
     "field_offset" : 24,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "hour",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minute",
     "field_offset" : 40,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "second",
     "field_offset" : 48,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "png_time_struct",
   "name" : "png_time_struct",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 8,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_time_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "location",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "png_unknown_chunk_t",
   "name" : "png_unknown_chunk_t",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 32,
   "source_file" : "/external/libpng/png.h",
   "unique_id" : "png_unknown_chunk_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "redx",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "redy",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "greenx",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "greeny",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bluex",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bluey",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "whitex",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "whitey",
     "field_offset" : 224,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "png_xy",
   "name" : "png_xy",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 32,
   "source_file" : "/external/libpng/pngstruct.h",
   "unique_id" : "png_xy"
  }
 ],
 "rvalue_reference_types" : []
}
