{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "bool [1]",
   "name" : "bool [1]",
   "referenced_type" : "type-20",
   "self_type" : "type-503",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [2]",
   "name" : "char [2]",
   "referenced_type" : "type-7",
   "self_type" : "type-141",
   "size" : 2,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/template_util.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [32]",
   "name" : "char [32]",
   "referenced_type" : "type-7",
   "self_type" : "type-108",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/strutil.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "double [1]",
   "name" : "double [1]",
   "referenced_type" : "type-104",
   "self_type" : "type-497",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float [1]",
   "name" : "float [1]",
   "referenced_type" : "type-102",
   "self_type" : "type-490",
   "size" : 4,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "linker_set_key" : "google::protobuf::internal::WireFormatLite::CppType []",
   "name" : "google::protobuf::internal::WireFormatLite::CppType []",
   "referenced_type" : "type-853",
   "self_type" : "type-856",

   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-4",
   "self_type" : "type-224",
   "size" : 4,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-19",
   "self_type" : "type-18",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/hash.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-100",
   "self_type" : "type-325",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-79",
   "self_type" : "type-239",
   "size" : 2,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-131",
   "self_type" : "type-172",
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/port.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "is_volatile" : true,
   "linker_set_key" : "const volatile int",
   "name" : "const volatile int",
   "referenced_type" : "type-1",
   "self_type" : "type-276",
   "size" : 4,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/atomicops.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "is_volatile" : true,
   "linker_set_key" : "const volatile long",
   "name" : "const volatile long",
   "referenced_type" : "type-35",
   "self_type" : "type-306",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/atomicops.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "google::protobuf::Arena *const",
   "name" : "google::protobuf::Arena *const",
   "referenced_type" : "type-297",
   "self_type" : "type-693",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/arena.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "google::protobuf::hash_map<std::pair<const google::protobuf::MessageLite *, int>, google::protobuf::internal::ExtensionInfo, google::protobuf::hash<std::pair<const google::protobuf::MessageLite *, int> >, std::equal_to<std::pair<const google::protobuf::MessageLite *, int> >, std::allocator<std::pair<const std::pair<const google::protobuf::MessageLite *, int>, google::protobuf::internal::ExtensionInfo> > > *const",
   "name" : "google::protobuf::hash_map<std::pair<const google::protobuf::MessageLite *, int>, google::protobuf::internal::ExtensionInfo, google::protobuf::hash<std::pair<const google::protobuf::MessageLite *, int> >, std::equal_to<std::pair<const google::protobuf::MessageLite *, int> >, std::allocator<std::pair<const std::pair<const google::protobuf::MessageLite *, int>, google::protobuf::internal::ExtensionInfo> > > *const",
   "referenced_type" : "type-657",
   "self_type" : "type-865",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/map_util.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "google::protobuf::internal::Mutex *const",
   "name" : "google::protobuf::internal::Mutex *const",
   "referenced_type" : "type-90",
   "self_type" : "type-89",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mutex.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "google::protobuf::internal::WireFormatLite::CppType const[]",
   "name" : "google::protobuf::internal::WireFormatLite::CppType const[]",
   "referenced_type" : "type-856",
   "self_type" : "type-857",
   "source_file" : "/external/protobuf/src/google/protobuf/wire_format_lite.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "google::protobuf::internal::WireFormatLite::WireType const[]",
   "name" : "google::protobuf::internal::WireFormatLite::WireType const[]",
   "referenced_type" : "type-858",
   "self_type" : "type-860",
   "source_file" : "/external/protobuf/src/google/protobuf/wire_format_lite.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "google::protobuf::io::ZeroCopyInputStream *const",
   "name" : "google::protobuf::io::ZeroCopyInputStream *const",
   "referenced_type" : "type-984",
   "self_type" : "type-1100",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "unsigned char *const",
   "name" : "unsigned char *const",
   "referenced_type" : "type-806",
   "self_type" : "type-959",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-275",
   "self_type" : "type-764",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-1",
   "self_type" : "type-270",
   "size" : 4,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/atomicops.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "volatile long",
   "name" : "volatile long",
   "referenced_type" : "type-35",
   "self_type" : "type-285",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/atomicops.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lifecycle_id_",
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "blocks_",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "hint_",
     "field_offset" : 128,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "cleanup_list_",
     "field_offset" : 192,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "owns_first_block_",
     "field_offset" : 256,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "blocks_lock_",
     "field_offset" : 320,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "hooks_cookie_",
     "field_offset" : 384,
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "options_",
     "field_offset" : 448,
     "referenced_type" : "type-290"
    }
   ],
   "linker_set_key" : "google::protobuf::Arena",
   "name" : "google::protobuf::Arena",
   "record_kind" : "class",
   "referenced_type" : "type-298",
   "self_type" : "type-298",
   "size" : 136,
   "source_file" : "/external/protobuf/src/google/protobuf/arena.h",
   "unique_id" : "_ZTSN6google8protobuf5ArenaE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "owner",
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "type-316"
    },
    {
     "field_name" : "pos",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "size",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "google::protobuf::Arena::Block",
   "name" : "google::protobuf::Arena::Block",
   "referenced_type" : "type-315",
   "self_type" : "type-315",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/arena.h",
   "unique_id" : "_ZTSN6google8protobuf5Arena5BlockE"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::Arena::InternalIsArenaConstructableHelper",
   "name" : "google::protobuf::Arena::InternalIsArenaConstructableHelper",
   "referenced_type" : "type-314",
   "self_type" : "type-314",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/arena.h",
   "unique_id" : "_ZTSN6google8protobuf5Arena34InternalIsArenaConstructableHelperE"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::Arena::InternalIsDestructorSkippableHelper",
   "name" : "google::protobuf::Arena::InternalIsDestructorSkippableHelper",
   "referenced_type" : "type-322",
   "self_type" : "type-322",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/arena.h",
   "unique_id" : "_ZTSN6google8protobuf5Arena35InternalIsDestructorSkippableHelperE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "elem",
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-313"
    },
    {
     "field_name" : "next",
     "field_offset" : 128,
     "referenced_type" : "type-324"
    }
   ],
   "linker_set_key" : "google::protobuf::Arena::Node",
   "name" : "google::protobuf::Arena::Node",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/arena.h",
   "unique_id" : "_ZTSN6google8protobuf5Arena4NodeE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "last_lifecycle_id_seen",
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "last_block_used_",
     "field_offset" : 64,
     "referenced_type" : "type-316"
    }
   ],
   "linker_set_key" : "google::protobuf::Arena::ThreadCache",
   "name" : "google::protobuf::Arena::ThreadCache",
   "referenced_type" : "type-321",
   "self_type" : "type-321",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/arena.h",
   "unique_id" : "_ZTSN6google8protobuf5Arena11ThreadCacheE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_block_size",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "max_block_size",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "initial_block",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "initial_block_size",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "block_alloc",
     "field_offset" : 256,
     "referenced_type" : "type-291"
    },
    {
     "field_name" : "block_dealloc",
     "field_offset" : 320,
     "referenced_type" : "type-293"
    },
    {
     "field_name" : "on_arena_init",
     "field_offset" : 384,
     "referenced_type" : "type-295"
    },
    {
     "field_name" : "on_arena_reset",
     "field_offset" : 448,
     "referenced_type" : "type-299"
    },
    {
     "field_name" : "on_arena_destruction",
     "field_offset" : 512,
     "referenced_type" : "type-299"
    },
    {
     "field_name" : "on_arena_allocation",
     "field_offset" : 576,
     "referenced_type" : "type-301"
    }
   ],
   "linker_set_key" : "google::protobuf::ArenaOptions",
   "name" : "google::protobuf::ArenaOptions",
   "referenced_type" : "type-290",
   "self_type" : "type-290",
   "size" : 80,
   "source_file" : "/external/protobuf/src/google/protobuf/arena.h",
   "unique_id" : "_ZTSN6google8protobuf12ArenaOptionsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::BigEndian",
   "name" : "google::protobuf::BigEndian",
   "record_kind" : "class",
   "referenced_type" : "type-328",
   "self_type" : "type-328",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/port.h",
   "unique_id" : "_ZTSN6google8protobuf9BigEndianE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::Closure",
   "name" : "google::protobuf::Closure",
   "record_kind" : "class",
   "referenced_type" : "type-225",
   "self_type" : "type-225",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/callback.h",
   "unique_id" : "_ZTSN6google8protobuf7ClosureE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7ClosureE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7ClosureD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7ClosureD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf7Closure3RunEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "state_",
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "google::protobuf::GoogleOnceDynamic",
   "name" : "google::protobuf::GoogleOnceDynamic",
   "record_kind" : "class",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/once.h",
   "unique_id" : "_ZTSN6google8protobuf17GoogleOnceDynamicE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::LogSilencer",
   "name" : "google::protobuf::LogSilencer",
   "record_kind" : "class",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/logging.h",
   "unique_id" : "_ZTSN6google8protobuf11LogSilencerE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<double>",
   "name" : "google::protobuf::MathLimits<double>",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<float>",
   "name" : "google::protobuf::MathLimits<float>",
   "referenced_type" : "type-243",
   "self_type" : "type-243",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<int>",
   "name" : "google::protobuf::MathLimits<int>",
   "referenced_type" : "type-232",
   "self_type" : "type-232",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<long double>",
   "name" : "google::protobuf::MathLimits<long double>",
   "referenced_type" : "type-251",
   "self_type" : "type-251",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-217" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIgEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<long long>",
   "name" : "google::protobuf::MathLimits<long long>",
   "referenced_type" : "type-236",
   "self_type" : "type-236",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<long>",
   "name" : "google::protobuf::MathLimits<long>",
   "referenced_type" : "type-233",
   "self_type" : "type-233",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-35" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<short>",
   "name" : "google::protobuf::MathLimits<short>",
   "referenced_type" : "type-230",
   "self_type" : "type-230",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-178" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<signed char>",
   "name" : "google::protobuf::MathLimits<signed char>",
   "referenced_type" : "type-228",
   "self_type" : "type-228",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-170" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIaEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<unsigned char>",
   "name" : "google::protobuf::MathLimits<unsigned char>",
   "referenced_type" : "type-237",
   "self_type" : "type-237",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<unsigned int>",
   "name" : "google::protobuf::MathLimits<unsigned int>",
   "referenced_type" : "type-240",
   "self_type" : "type-240",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<unsigned long long>",
   "name" : "google::protobuf::MathLimits<unsigned long long>",
   "referenced_type" : "type-242",
   "self_type" : "type-242",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<unsigned long>",
   "name" : "google::protobuf::MathLimits<unsigned long>",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::MathLimits<unsigned short>",
   "name" : "google::protobuf::MathLimits<unsigned short>",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mathlimits.h",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSN6google8protobuf10MathLimitsItEE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::MessageLite",
   "name" : "google::protobuf::MessageLite",
   "record_kind" : "class",
   "referenced_type" : "type-519",
   "self_type" : "type-519",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/message_lite.h",
   "unique_id" : "_ZTSN6google8protobuf11MessageLiteE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf11MessageLiteE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf11MessageLiteD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf11MessageLiteD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite11GetTypeNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite3NewEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite3NewEPNS0_5ArenaE"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite8GetArenaEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite20GetMaybeArenaPointerEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf11MessageLite5ClearEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite13IsInitializedEv"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite25InitializationErrorStringEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf11MessageLite21CheckTypeAndMergeFromERKS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf11MessageLite27MergePartialFromCodedStreamEPNS0_2io16CodedInputStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite8ByteSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite24SerializeWithCachedSizesEPNS0_2io17CodedOutputStreamE"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite31SerializeWithCachedSizesToArrayEPh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf11MessageLite13GetCachedSizeEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "rep_",
     "field_offset" : 64,
     "referenced_type" : "type-501"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<bool>",
   "name" : "google::protobuf::RepeatedField<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-500",
   "self_type" : "type-500",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIbEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "type-503"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<bool>::Rep",
   "name" : "google::protobuf::RepeatedField<bool>::Rep",
   "referenced_type" : "type-502",
   "self_type" : "type-502",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIbE3RepE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "rep_",
     "field_offset" : 64,
     "referenced_type" : "type-495"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<double>",
   "name" : "google::protobuf::RepeatedField<double>",
   "record_kind" : "class",
   "referenced_type" : "type-494",
   "self_type" : "type-494",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIdEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "type-497"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<double>::Rep",
   "name" : "google::protobuf::RepeatedField<double>::Rep",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIdE3RepE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "rep_",
     "field_offset" : 64,
     "referenced_type" : "type-488"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<float>",
   "name" : "google::protobuf::RepeatedField<float>",
   "record_kind" : "class",
   "referenced_type" : "type-487",
   "self_type" : "type-487",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIfEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "type-490"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<float>::Rep",
   "name" : "google::protobuf::RepeatedField<float>::Rep",
   "referenced_type" : "type-489",
   "self_type" : "type-489",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIfE3RepE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "rep_",
     "field_offset" : 64,
     "referenced_type" : "type-463"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<int>",
   "name" : "google::protobuf::RepeatedField<int>",
   "record_kind" : "class",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIiEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "type-465"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<int>::Rep",
   "name" : "google::protobuf::RepeatedField<int>::Rep",
   "referenced_type" : "type-464",
   "self_type" : "type-464",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIiE3RepE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "rep_",
     "field_offset" : 64,
     "referenced_type" : "type-469"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<long long>",
   "name" : "google::protobuf::RepeatedField<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-468",
   "self_type" : "type-468",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIxEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "type-471"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<long long>::Rep",
   "name" : "google::protobuf::RepeatedField<long long>::Rep",
   "referenced_type" : "type-470",
   "self_type" : "type-470",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIxE3RepE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "rep_",
     "field_offset" : 64,
     "referenced_type" : "type-475"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<unsigned int>",
   "name" : "google::protobuf::RepeatedField<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-474",
   "self_type" : "type-474",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIjEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "type-477"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<unsigned int>::Rep",
   "name" : "google::protobuf::RepeatedField<unsigned int>::Rep",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIjE3RepE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "current_size_",
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "rep_",
     "field_offset" : 64,
     "referenced_type" : "type-482"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<unsigned long long>",
   "name" : "google::protobuf::RepeatedField<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-481",
   "self_type" : "type-481",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIyEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "type-484"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedField<unsigned long long>::Rep",
   "name" : "google::protobuf::RepeatedField<unsigned long long>::Rep",
   "referenced_type" : "type-483",
   "self_type" : "type-483",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf13RepeatedFieldIyE3RepE"
  },
  {
   "access" : "protected",
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-675"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedPtrField<MessageLite *>::TypeHandler",
   "name" : "google::protobuf::RepeatedPtrField<MessageLite *>::TypeHandler",
   "record_kind" : "class",
   "referenced_type" : "type-759",
   "self_type" : "type-759",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf16RepeatedPtrFieldIPNS0_11MessageLiteEE11TypeHandlerE"
  },
  {
   "access" : "protected",
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-666"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedPtrField<MessageLite>::TypeHandler",
   "name" : "google::protobuf::RepeatedPtrField<MessageLite>::TypeHandler",
   "record_kind" : "class",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf16RepeatedPtrFieldINS0_11MessageLiteEE11TypeHandlerE"
  },
  {
   "access" : "protected",
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-756"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedPtrField<basic_string<char> >::TypeHandler",
   "name" : "google::protobuf::RepeatedPtrField<basic_string<char> >::TypeHandler",
   "record_kind" : "class",
   "referenced_type" : "type-755",
   "self_type" : "type-755",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf16RepeatedPtrFieldINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE11TypeHandlerE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-511"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedPtrField<google::protobuf::MessageLite *>",
   "name" : "google::protobuf::RepeatedPtrField<google::protobuf::MessageLite *>",
   "record_kind" : "class",
   "referenced_type" : "type-772",
   "self_type" : "type-772",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-602" ],
   "unique_id" : "_ZTSN6google8protobuf16RepeatedPtrFieldIPNS0_11MessageLiteEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-511"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedPtrField<google::protobuf::MessageLite>",
   "name" : "google::protobuf::RepeatedPtrField<google::protobuf::MessageLite>",
   "record_kind" : "class",
   "referenced_type" : "type-518",
   "self_type" : "type-518",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-519" ],
   "unique_id" : "_ZTSN6google8protobuf16RepeatedPtrFieldINS0_11MessageLiteEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-511"
    }
   ],
   "linker_set_key" : "google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "record_kind" : "class",
   "referenced_type" : "type-510",
   "self_type" : "type-510",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-515" ],
   "unique_id" : "_ZTSN6google8protobuf16RepeatedPtrFieldINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::ResultCallback<std::basic_string<char, std::char_traits<char>, std::allocator<char> > *>",
   "name" : "google::protobuf::ResultCallback<std::basic_string<char, std::char_traits<char>, std::allocator<char> > *>",
   "record_kind" : "class",
   "referenced_type" : "type-1142",
   "self_type" : "type-1142",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/callback.h",
   "template_args" : [ "type-1143" ],
   "unique_id" : "_ZTSN6google8protobuf14ResultCallbackIPNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf14ResultCallbackIPNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf14ResultCallbackIPNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf14ResultCallbackIPNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf14ResultCallbackIPNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEE3RunEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "length_",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "google::protobuf::StringPiece",
   "name" : "google::protobuf::StringPiece",
   "record_kind" : "class",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/stringpiece.h",
   "unique_id" : "_ZTSN6google8protobuf11StringPieceE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::hash<const char *>",
   "name" : "google::protobuf::hash<const char *>",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN6google8protobuf4hashIPKcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::hash<google::protobuf::StringPiece>",
   "name" : "google::protobuf::hash<google::protobuf::StringPiece>",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/stringpiece.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN6google8protobuf4hashINS0_11StringPieceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::hash<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::hash<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN6google8protobuf4hashINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::hash<std::pair<const google::protobuf::MessageLite *, int> >",
   "name" : "google::protobuf::hash<std::pair<const google::protobuf::MessageLite *, int> >",
   "referenced_type" : "type-631",
   "self_type" : "type-631",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "type-632" ],
   "unique_id" : "_ZTSN6google8protobuf4hashINSt3__14pairIPKNS0_11MessageLiteEiEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-640"
    }
   ],
   "linker_set_key" : "google::protobuf::hash_map<std::pair<const google::protobuf::MessageLite *, int>, google::protobuf::internal::ExtensionInfo, google::protobuf::hash<std::pair<const google::protobuf::MessageLite *, int> >, std::equal_to<std::pair<const google::protobuf::MessageLite *, int> >, std::allocator<std::pair<const std::pair<const google::protobuf::MessageLite *, int>, google::protobuf::internal::ExtensionInfo> > >",
   "name" : "google::protobuf::hash_map<std::pair<const google::protobuf::MessageLite *, int>, google::protobuf::internal::ExtensionInfo, google::protobuf::hash<std::pair<const google::protobuf::MessageLite *, int> >, std::equal_to<std::pair<const google::protobuf::MessageLite *, int> >, std::allocator<std::pair<const std::pair<const google::protobuf::MessageLite *, int>, google::protobuf::internal::ExtensionInfo> > >",
   "record_kind" : "class",
   "referenced_type" : "type-639",
   "self_type" : "type-639",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/hash.h",
   "template_args" : [ "type-641", "type-642", "type-631", "type-653", "type-654" ],
   "unique_id" : "_ZTSN6google8protobuf8hash_mapINSt3__14pairIPKNS0_11MessageLiteEiEENS0_8internal13ExtensionInfoENS0_4hashIS7_EENS2_8equal_toIS7_EENS2_9allocatorINS3_IKS7_S9_EEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "referenced_type" : "type-430"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::ArenaStringPtr",
   "name" : "google::protobuf::internal::ArenaStringPtr",
   "referenced_type" : "type-429",
   "self_type" : "type-429",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/arenastring.h",
   "unique_id" : "_ZTSN6google8protobuf8internal14ArenaStringPtrE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "has_amd_lock_mb_bug",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "has_sse2",
     "field_offset" : 8,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::AtomicOps_x86CPUFeatureStruct",
   "name" : "google::protobuf::internal::AtomicOps_x86CPUFeatureStruct",
   "referenced_type" : "type-318",
   "self_type" : "type-318",
   "size" : 2,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/atomicops_internals_x86_gcc.h",
   "unique_id" : "_ZTSN6google8protobuf8internal29AtomicOps_x86CPUFeatureStructE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-800"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "unknown_fields_",
     "field_offset" : 64,
     "referenced_type" : "type-809"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::CodedOutputStreamFieldSkipper",
   "name" : "google::protobuf::internal::CodedOutputStreamFieldSkipper",
   "record_kind" : "class",
   "referenced_type" : "type-862",
   "self_type" : "type-862",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/wire_format_lite.h",
   "unique_id" : "_ZTSN6google8protobuf8internal29CodedOutputStreamFieldSkipperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf8internal29CodedOutputStreamFieldSkipperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal29CodedOutputStreamFieldSkipperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal29CodedOutputStreamFieldSkipperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal29CodedOutputStreamFieldSkipper9SkipFieldEPNS0_2io16CodedInputStreamEj"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal29CodedOutputStreamFieldSkipper11SkipMessageEPNS0_2io16CodedInputStreamE"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal29CodedOutputStreamFieldSkipper15SkipUnknownEnumEii"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "year",
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "month",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "day",
     "field_offset" : 64,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "hour",
     "field_offset" : 96,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "minute",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "second",
     "field_offset" : 160,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::DateTime",
   "name" : "google::protobuf::internal::DateTime",
   "referenced_type" : "type-280",
   "self_type" : "type-280",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/time.h",
   "unique_id" : "_ZTSN6google8protobuf8internal8DateTimeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::ElementCopier<bool, true>",
   "name" : "google::protobuf::internal::ElementCopier<bool, true>",
   "referenced_type" : "type-749",
   "self_type" : "type-749",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal13ElementCopierIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::ElementCopier<double, true>",
   "name" : "google::protobuf::internal::ElementCopier<double, true>",
   "referenced_type" : "type-747",
   "self_type" : "type-747",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal13ElementCopierIdLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::ElementCopier<float, true>",
   "name" : "google::protobuf::internal::ElementCopier<float, true>",
   "referenced_type" : "type-745",
   "self_type" : "type-745",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal13ElementCopierIfLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::ElementCopier<int, true>",
   "name" : "google::protobuf::internal::ElementCopier<int, true>",
   "referenced_type" : "type-740",
   "self_type" : "type-740",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal13ElementCopierIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::ElementCopier<long long, true>",
   "name" : "google::protobuf::internal::ElementCopier<long long, true>",
   "referenced_type" : "type-742",
   "self_type" : "type-742",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal13ElementCopierIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::ElementCopier<unsigned int, true>",
   "name" : "google::protobuf::internal::ElementCopier<unsigned int, true>",
   "referenced_type" : "type-736",
   "self_type" : "type-736",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal13ElementCopierIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::ElementCopier<unsigned long long, true>",
   "name" : "google::protobuf::internal::ElementCopier<unsigned long long, true>",
   "referenced_type" : "type-738",
   "self_type" : "type-738",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal13ElementCopierIyLb1EEE"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::internal::ExtensionFinder",
   "name" : "google::protobuf::internal::ExtensionFinder",
   "record_kind" : "class",
   "referenced_type" : "type-778",
   "self_type" : "type-778",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal15ExtensionFinderE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf8internal15ExtensionFinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal15ExtensionFinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal15ExtensionFinderD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf8internal15ExtensionFinder4FindEiPNS1_13ExtensionInfoE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "is_repeated",
     "field_offset" : 8,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "is_packed",
     "field_offset" : 16,
     "referenced_type" : "type-20"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-643"
    },
    {
     "field_name" : "descriptor",
     "field_offset" : 192,
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::ExtensionInfo",
   "name" : "google::protobuf::internal::ExtensionInfo",
   "referenced_type" : "type-642",
   "self_type" : "type-642",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal13ExtensionInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "enum_validity_check",
     "referenced_type" : "type-644"
    },
    {
     "field_name" : "message_prototype",
     "referenced_type" : "type-648"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "google::protobuf::internal::ExtensionInfo::(anonymous union at external/protobuf/src/google/protobuf/extension_set.h:107:3) at external/protobuf/src/google/protobuf/extension_set.h:107:3",
   "name" : "google::protobuf::internal::ExtensionInfo::(anonymous union at external/protobuf/src/google/protobuf/extension_set.h:107:3) at external/protobuf/src/google/protobuf/extension_set.h:107:3",
   "record_kind" : "union",
   "referenced_type" : "type-643",
   "self_type" : "type-643",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal13ExtensionInfoUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "func",
     "referenced_type" : "type-645"
    },
    {
     "field_name" : "arg",
     "field_offset" : 64,
     "referenced_type" : "type-245"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::ExtensionInfo::EnumValidityCheck",
   "name" : "google::protobuf::internal::ExtensionInfo::EnumValidityCheck",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal13ExtensionInfo17EnumValidityCheckE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "extensions_",
     "referenced_type" : "type-783"
    },
    {
     "access" : "private",
     "field_name" : "arena_",
     "field_offset" : 192,
     "referenced_type" : "type-297"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::ExtensionSet",
   "name" : "google::protobuf::internal::ExtensionSet",
   "record_kind" : "class",
   "referenced_type" : "type-782",
   "self_type" : "type-782",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal12ExtensionSetE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "type-813"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "is_repeated",
     "field_offset" : 72,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "is_cleared",
     "field_offset" : 80,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "is_lazy",
     "field_offset" : 84,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "is_packed",
     "field_offset" : 88,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "cached_size",
     "field_offset" : 96,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "descriptor",
     "field_offset" : 128,
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::ExtensionSet::Extension",
   "name" : "google::protobuf::internal::ExtensionSet::Extension",
   "referenced_type" : "type-812",
   "self_type" : "type-812",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal12ExtensionSet9ExtensionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int32_value",
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "int64_value",
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "uint32_value",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "uint64_value",
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "float_value",
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "double_value",
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "bool_value",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "enum_value",
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "string_value",
     "referenced_type" : "type-597"
    },
    {
     "field_name" : "message_value",
     "referenced_type" : "type-602"
    },
    {
     "field_name" : "lazymessage_value",
     "referenced_type" : "type-811"
    },
    {
     "field_name" : "repeated_int32_value",
     "referenced_type" : "type-680"
    },
    {
     "field_name" : "repeated_int64_value",
     "referenced_type" : "type-681"
    },
    {
     "field_name" : "repeated_uint32_value",
     "referenced_type" : "type-682"
    },
    {
     "field_name" : "repeated_uint64_value",
     "referenced_type" : "type-683"
    },
    {
     "field_name" : "repeated_float_value",
     "referenced_type" : "type-684"
    },
    {
     "field_name" : "repeated_double_value",
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "repeated_bool_value",
     "referenced_type" : "type-686"
    },
    {
     "field_name" : "repeated_enum_value",
     "referenced_type" : "type-680"
    },
    {
     "field_name" : "repeated_string_value",
     "referenced_type" : "type-687"
    },
    {
     "field_name" : "repeated_message_value",
     "referenced_type" : "type-690"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "google::protobuf::internal::ExtensionSet::Extension::(anonymous union at external/protobuf/src/google/protobuf/extension_set.h:465:5) at external/protobuf/src/google/protobuf/extension_set.h:465:5",
   "name" : "google::protobuf::internal::ExtensionSet::Extension::(anonymous union at external/protobuf/src/google/protobuf/extension_set.h:465:5) at external/protobuf/src/google/protobuf/extension_set.h:465:5",
   "record_kind" : "union",
   "referenced_type" : "type-813",
   "self_type" : "type-813",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal12ExtensionSet9ExtensionUt_E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::internal::ExtensionSet::LazyMessageExtension",
   "name" : "google::protobuf::internal::ExtensionSet::LazyMessageExtension",
   "record_kind" : "class",
   "referenced_type" : "type-810",
   "self_type" : "type-810",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal12ExtensionSet20LazyMessageExtensionE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf8internal12ExtensionSet20LazyMessageExtensionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtensionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtensionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf8internal12ExtensionSet20LazyMessageExtension3NewEPNS0_5ArenaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf8internal12ExtensionSet20LazyMessageExtension10GetMessageERKNS0_11MessageLiteE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtension14MutableMessageERKNS0_11MessageLiteE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtension19SetAllocatedMessageEPNS0_11MessageLiteE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtension30UnsafeArenaSetAllocatedMessageEPNS0_11MessageLiteE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtension14ReleaseMessageERKNS0_11MessageLiteE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtension25UnsafeArenaReleaseMessageERKNS0_11MessageLiteE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf8internal12ExtensionSet20LazyMessageExtension13IsInitializedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf8internal12ExtensionSet20LazyMessageExtension8ByteSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf8internal12ExtensionSet20LazyMessageExtension9SpaceUsedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtension9MergeFromERKS3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtension5ClearEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf8internal12ExtensionSet20LazyMessageExtension11ReadMessageERKNS0_11MessageLiteEPNS0_2io16CodedInputStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf8internal12ExtensionSet20LazyMessageExtension12WriteMessageEiPNS0_2io17CodedOutputStreamE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf8internal12ExtensionSet20LazyMessageExtension19WriteMessageToArrayEiPh"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::internal::FieldSkipper",
   "name" : "google::protobuf::internal::FieldSkipper",
   "record_kind" : "class",
   "referenced_type" : "type-800",
   "self_type" : "type-800",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/wire_format_lite.h",
   "unique_id" : "_ZTSN6google8protobuf8internal12FieldSkipperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf8internal12FieldSkipperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal12FieldSkipperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal12FieldSkipperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal12FieldSkipper9SkipFieldEPNS0_2io16CodedInputStreamEj"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal12FieldSkipper11SkipMessageEPNS0_2io16CodedInputStreamE"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal12FieldSkipper15SkipUnknownEnumEii"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-225"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "function_",
     "field_offset" : 64,
     "referenced_type" : "type-247"
    },
    {
     "access" : "private",
     "field_name" : "self_deleting_",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::FunctionClosure0",
   "name" : "google::protobuf::internal::FunctionClosure0",
   "record_kind" : "class",
   "referenced_type" : "type-246",
   "self_type" : "type-246",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/callback.h",
   "unique_id" : "_ZTSN6google8protobuf8internal16FunctionClosure0E",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf8internal16FunctionClosure0E"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal16FunctionClosure0D1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal16FunctionClosure0D0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal16FunctionClosure03RunEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-778"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "containing_type_",
     "field_offset" : 64,
     "referenced_type" : "type-648"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::GeneratedExtensionFinder",
   "name" : "google::protobuf::internal::GeneratedExtensionFinder",
   "record_kind" : "class",
   "referenced_type" : "type-780",
   "self_type" : "type-780",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal24GeneratedExtensionFinderE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf8internal24GeneratedExtensionFinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal24GeneratedExtensionFinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf8internal24GeneratedExtensionFinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf8internal24GeneratedExtensionFinder4FindEiPNS1_13ExtensionInfoE"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::GenericTypeHandler<google::protobuf::Message>",
   "name" : "google::protobuf::internal::GenericTypeHandler<google::protobuf::Message>",
   "record_kind" : "class",
   "referenced_type" : "type-670",
   "self_type" : "type-670",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-671" ],
   "unique_id" : "_ZTSN6google8protobuf8internal18GenericTypeHandlerINS0_7MessageEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::GenericTypeHandler<google::protobuf::MessageLite *>",
   "name" : "google::protobuf::internal::GenericTypeHandler<google::protobuf::MessageLite *>",
   "record_kind" : "class",
   "referenced_type" : "type-675",
   "self_type" : "type-675",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-602" ],
   "unique_id" : "_ZTSN6google8protobuf8internal18GenericTypeHandlerIPNS0_11MessageLiteEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::GenericTypeHandler<google::protobuf::MessageLite>",
   "name" : "google::protobuf::internal::GenericTypeHandler<google::protobuf::MessageLite>",
   "record_kind" : "class",
   "referenced_type" : "type-666",
   "self_type" : "type-666",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-519" ],
   "unique_id" : "_ZTSN6google8protobuf8internal18GenericTypeHandlerINS0_11MessageLiteEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::GenericTypeHandler<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::GenericTypeHandler<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "record_kind" : "class",
   "referenced_type" : "type-668",
   "self_type" : "type-668",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-669" ],
   "unique_id" : "_ZTSN6google8protobuf8internal18GenericTypeHandlerINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::LogFinisher",
   "name" : "google::protobuf::internal::LogFinisher",
   "record_kind" : "class",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/logging.h",
   "unique_id" : "_ZTSN6google8protobuf8internal11LogFinisherE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "level_",
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "line_",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "message_",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::LogMessage",
   "name" : "google::protobuf::internal::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 48,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/logging.h",
   "unique_id" : "_ZTSN6google8protobuf8internal10LogMessageE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mInternal",
     "referenced_type" : "type-72"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::Mutex",
   "name" : "google::protobuf::internal::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mutex.h",
   "unique_id" : "_ZTSN6google8protobuf8internal5MutexE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mu_",
     "referenced_type" : "type-89"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::MutexLock",
   "name" : "google::protobuf::internal::MutexLock",
   "record_kind" : "class",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mutex.h",
   "unique_id" : "_ZTSN6google8protobuf8internal9MutexLockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mu_",
     "referenced_type" : "type-89"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::MutexLockMaybe",
   "name" : "google::protobuf::internal::MutexLockMaybe",
   "record_kind" : "class",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mutex.h",
   "unique_id" : "_ZTSN6google8protobuf8internal14MutexLockMaybeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::PrimitiveTypeTraits<bool>",
   "name" : "google::protobuf::internal::PrimitiveTypeTraits<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-827",
   "self_type" : "type-827",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal19PrimitiveTypeTraitsIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::PrimitiveTypeTraits<double>",
   "name" : "google::protobuf::internal::PrimitiveTypeTraits<double>",
   "record_kind" : "class",
   "referenced_type" : "type-826",
   "self_type" : "type-826",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal19PrimitiveTypeTraitsIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::PrimitiveTypeTraits<float>",
   "name" : "google::protobuf::internal::PrimitiveTypeTraits<float>",
   "record_kind" : "class",
   "referenced_type" : "type-825",
   "self_type" : "type-825",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal19PrimitiveTypeTraitsIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::PrimitiveTypeTraits<int>",
   "name" : "google::protobuf::internal::PrimitiveTypeTraits<int>",
   "record_kind" : "class",
   "referenced_type" : "type-821",
   "self_type" : "type-821",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal19PrimitiveTypeTraitsIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::PrimitiveTypeTraits<long long>",
   "name" : "google::protobuf::internal::PrimitiveTypeTraits<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-822",
   "self_type" : "type-822",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal19PrimitiveTypeTraitsIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::PrimitiveTypeTraits<unsigned int>",
   "name" : "google::protobuf::internal::PrimitiveTypeTraits<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-823",
   "self_type" : "type-823",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal19PrimitiveTypeTraitsIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::PrimitiveTypeTraits<unsigned long long>",
   "name" : "google::protobuf::internal::PrimitiveTypeTraits<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-824",
   "self_type" : "type-824",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal19PrimitiveTypeTraitsIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedMessageGenericTypeTraits",
   "name" : "google::protobuf::internal::RepeatedMessageGenericTypeTraits",
   "record_kind" : "class",
   "referenced_type" : "type-840",
   "self_type" : "type-840",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal32RepeatedMessageGenericTypeTraitsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedPrimitiveGenericTypeTraits",
   "name" : "google::protobuf::internal::RepeatedPrimitiveGenericTypeTraits",
   "record_kind" : "class",
   "referenced_type" : "type-837",
   "self_type" : "type-837",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal34RepeatedPrimitiveGenericTypeTraitsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<bool>",
   "name" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-836",
   "self_type" : "type-836",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal27RepeatedPrimitiveTypeTraitsIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<double>",
   "name" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<double>",
   "record_kind" : "class",
   "referenced_type" : "type-835",
   "self_type" : "type-835",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal27RepeatedPrimitiveTypeTraitsIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<float>",
   "name" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<float>",
   "record_kind" : "class",
   "referenced_type" : "type-834",
   "self_type" : "type-834",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal27RepeatedPrimitiveTypeTraitsIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<int>",
   "name" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<int>",
   "record_kind" : "class",
   "referenced_type" : "type-830",
   "self_type" : "type-830",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal27RepeatedPrimitiveTypeTraitsIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<long long>",
   "name" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<long long>",
   "record_kind" : "class",
   "referenced_type" : "type-831",
   "self_type" : "type-831",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal27RepeatedPrimitiveTypeTraitsIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<unsigned int>",
   "name" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-832",
   "self_type" : "type-832",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal27RepeatedPrimitiveTypeTraitsIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<unsigned long long>",
   "name" : "google::protobuf::internal::RepeatedPrimitiveTypeTraits<unsigned long long>",
   "record_kind" : "class",
   "referenced_type" : "type-833",
   "self_type" : "type-833",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal27RepeatedPrimitiveTypeTraitsIyEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "arena_",
     "referenced_type" : "type-297"
    },
    {
     "access" : "private",
     "field_name" : "current_size_",
     "field_offset" : 64,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_size_",
     "field_offset" : 96,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "rep_",
     "field_offset" : 128,
     "referenced_type" : "type-512"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::RepeatedPtrFieldBase",
   "name" : "google::protobuf::internal::RepeatedPtrFieldBase",
   "record_kind" : "class",
   "referenced_type" : "type-511",
   "self_type" : "type-511",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf8internal20RepeatedPtrFieldBaseE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "allocated_size",
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "elements",
     "field_offset" : 64,
     "referenced_type" : "type-514"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::RepeatedPtrFieldBase::Rep",
   "name" : "google::protobuf::internal::RepeatedPtrFieldBase::Rep",
   "referenced_type" : "type-513",
   "self_type" : "type-513",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf8internal20RepeatedPtrFieldBase3RepE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::RepeatedStringTypeTraits",
   "name" : "google::protobuf::internal::RepeatedStringTypeTraits",
   "record_kind" : "class",
   "referenced_type" : "type-839",
   "self_type" : "type-839",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal24RepeatedStringTypeTraitsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "word_",
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::SequenceNumber",
   "name" : "google::protobuf::internal::SequenceNumber",
   "record_kind" : "class",
   "referenced_type" : "type-335",
   "self_type" : "type-335",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/atomic_sequence_num.h",
   "unique_id" : "_ZTSN6google8protobuf8internal14SequenceNumberE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "refcount_",
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "weak_count_",
     "field_offset" : 32,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::SharedPtrControlBlock",
   "name" : "google::protobuf::internal::SharedPtrControlBlock",
   "record_kind" : "class",
   "referenced_type" : "type-951",
   "self_type" : "type-951",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/shared_ptr.h",
   "unique_id" : "_ZTSN6google8protobuf8internal21SharedPtrControlBlockE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::StringPiecePod",
   "name" : "google::protobuf::internal::StringPiecePod",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/stringpiece.h",
   "unique_id" : "_ZTSN6google8protobuf8internal14StringPiecePodE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-757"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::StringTypeHandler",
   "name" : "google::protobuf::internal::StringTypeHandler",
   "record_kind" : "class",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf8internal17StringTypeHandlerE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::StringTypeHandlerBase",
   "name" : "google::protobuf::internal::StringTypeHandlerBase",
   "record_kind" : "class",
   "referenced_type" : "type-757",
   "self_type" : "type-757",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "unique_id" : "_ZTSN6google8protobuf8internal21StringTypeHandlerBaseE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::StringTypeTraits",
   "name" : "google::protobuf::internal::StringTypeTraits",
   "record_kind" : "class",
   "referenced_type" : "type-838",
   "self_type" : "type-838",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/extension_set.h",
   "unique_id" : "_ZTSN6google8protobuf8internal16StringTypeTraitsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "key_",
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::ThreadLocalStorage<google::protobuf::Arena::ThreadCache>",
   "name" : "google::protobuf::internal::ThreadLocalStorage<google::protobuf::Arena::ThreadCache>",
   "record_kind" : "class",
   "referenced_type" : "type-329",
   "self_type" : "type-329",
   "size" : 4,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/mutex.h",
   "template_args" : [ "type-321" ],
   "unique_id" : "_ZTSN6google8protobuf8internal18ThreadLocalStorageINS0_5Arena11ThreadCacheEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::TypeImplementsMergeBehavior<google::protobuf::MessageLite>",
   "name" : "google::protobuf::internal::TypeImplementsMergeBehavior<google::protobuf::MessageLite>",
   "referenced_type" : "type-751",
   "self_type" : "type-751",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-519" ],
   "unique_id" : "_ZTSN6google8protobuf8internal27TypeImplementsMergeBehaviorINS0_11MessageLiteEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::TypeImplementsMergeBehavior<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::TypeImplementsMergeBehavior<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-752",
   "self_type" : "type-752",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/repeated_field.h",
   "template_args" : [ "type-753" ],
   "unique_id" : "_ZTSN6google8protobuf8internal27TypeImplementsMergeBehaviorINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::WireFormatLite",
   "name" : "google::protobuf::internal::WireFormatLite",
   "record_kind" : "class",
   "referenced_type" : "type-849",
   "self_type" : "type-849",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/wire_format_lite.h",
   "unique_id" : "_ZTSN6google8protobuf8internal14WireFormatLiteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::add_reference<long long>",
   "name" : "google::protobuf::internal::add_reference<long long>",
   "referenced_type" : "type-577",
   "self_type" : "type-577",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal13add_referenceIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::add_reference<unsigned long long>",
   "name" : "google::protobuf::internal::add_reference<unsigned long long>",
   "referenced_type" : "type-576",
   "self_type" : "type-576",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal13add_referenceIyEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "dummy",
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::big_",
   "name" : "google::protobuf::internal::big_",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 2,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/template_util.h",
   "unique_id" : "_ZTSN6google8protobuf8internal4big_E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_copy<bool>",
   "name" : "google::protobuf::internal::has_trivial_copy<bool>",
   "referenced_type" : "type-564",
   "self_type" : "type-564",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal16has_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-546"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_copy<double>",
   "name" : "google::protobuf::internal::has_trivial_copy<double>",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal16has_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_copy<float>",
   "name" : "google::protobuf::internal::has_trivial_copy<float>",
   "referenced_type" : "type-562",
   "self_type" : "type-562",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal16has_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-543"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_copy<int>",
   "name" : "google::protobuf::internal::has_trivial_copy<int>",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal16has_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-544"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_copy<long long>",
   "name" : "google::protobuf::internal::has_trivial_copy<long long>",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal16has_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-541"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_copy<unsigned int>",
   "name" : "google::protobuf::internal::has_trivial_copy<unsigned int>",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal16has_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-542"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_copy<unsigned long long>",
   "name" : "google::protobuf::internal::has_trivial_copy<unsigned long long>",
   "referenced_type" : "type-559",
   "self_type" : "type-559",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal16has_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-554"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<bool> >",
   "name" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<bool> >",
   "referenced_type" : "type-573",
   "self_type" : "type-573",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINS0_13RepeatedFieldIbEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-553"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<double> >",
   "name" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<double> >",
   "referenced_type" : "type-572",
   "self_type" : "type-572",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINS0_13RepeatedFieldIdEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-552"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<float> >",
   "name" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<float> >",
   "referenced_type" : "type-571",
   "self_type" : "type-571",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINS0_13RepeatedFieldIfEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-547"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<int> >",
   "name" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<int> >",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINS0_13RepeatedFieldIiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-549"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<long long> >",
   "name" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<long long> >",
   "referenced_type" : "type-568",
   "self_type" : "type-568",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINS0_13RepeatedFieldIxEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-550"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<unsigned int> >",
   "name" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<unsigned int> >",
   "referenced_type" : "type-569",
   "self_type" : "type-569",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINS0_13RepeatedFieldIjEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-551"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<unsigned long long> >",
   "name" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedField<unsigned long long> >",
   "referenced_type" : "type-570",
   "self_type" : "type-570",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINS0_13RepeatedFieldIyEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-557"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "name" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINS0_16RepeatedPtrFieldINS0_11MessageLiteEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "google::protobuf::internal::has_trivial_destructor<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-574",
   "self_type" : "type-574",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-539"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::has_trivial_destructor<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::has_trivial_destructor<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-565",
   "self_type" : "type-565",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-566" ],
   "unique_id" : "_ZTSN6google8protobuf8internal22has_trivial_destructorINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::integral_constant<bool, false>",
   "name" : "google::protobuf::internal::integral_constant<bool, false>",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/template_util.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17integral_constantIbLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::integral_constant<bool, true>",
   "name" : "google::protobuf::internal::integral_constant<bool, true>",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/template_util.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17integral_constantIbLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_convertible<google::protobuf::MessageLite *, google::protobuf::Message *>",
   "name" : "google::protobuf::internal::is_convertible<google::protobuf::MessageLite *, google::protobuf::Message *>",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-602", "type-599" ],
   "unique_id" : "_ZTSN6google8protobuf8internal14is_convertibleIPNS0_11MessageLiteEPNS0_7MessageEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_convertible<long long &, int>",
   "name" : "google::protobuf::internal::is_convertible<long long &, int>",
   "referenced_type" : "type-453",
   "self_type" : "type-453",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-454", "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal14is_convertibleIRxiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_convertible<std::basic_string<char, std::char_traits<char>, std::allocator<char> > *, google::protobuf::Message *>",
   "name" : "google::protobuf::internal::is_convertible<std::basic_string<char, std::char_traits<char>, std::allocator<char> > *, google::protobuf::Message *>",
   "referenced_type" : "type-438",
   "self_type" : "type-438",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-430", "type-439" ],
   "unique_id" : "_ZTSN6google8protobuf8internal14is_convertibleIPNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEPNS0_7MessageEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_convertible<unsigned long long &, int>",
   "name" : "google::protobuf::internal::is_convertible<unsigned long long &, int>",
   "referenced_type" : "type-447",
   "self_type" : "type-447",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-448", "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal14is_convertibleIRyiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-505"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<bool>",
   "name" : "google::protobuf::internal::is_enum<bool>",
   "referenced_type" : "type-504",
   "self_type" : "type-504",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-459"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<double>",
   "name" : "google::protobuf::internal::is_enum<double>",
   "referenced_type" : "type-458",
   "self_type" : "type-458",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-457"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<float>",
   "name" : "google::protobuf::internal::is_enum<float>",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-499"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<bool> >",
   "name" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<bool> >",
   "referenced_type" : "type-498",
   "self_type" : "type-498",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINS0_13RepeatedFieldIbEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-493"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<double> >",
   "name" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<double> >",
   "referenced_type" : "type-492",
   "self_type" : "type-492",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINS0_13RepeatedFieldIdEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-486"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<float> >",
   "name" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<float> >",
   "referenced_type" : "type-485",
   "self_type" : "type-485",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINS0_13RepeatedFieldIfEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-461"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<int> >",
   "name" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<int> >",
   "referenced_type" : "type-460",
   "self_type" : "type-460",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINS0_13RepeatedFieldIiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-467"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<long long> >",
   "name" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<long long> >",
   "referenced_type" : "type-466",
   "self_type" : "type-466",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINS0_13RepeatedFieldIxEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-473"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<unsigned int> >",
   "name" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<unsigned int> >",
   "referenced_type" : "type-472",
   "self_type" : "type-472",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINS0_13RepeatedFieldIjEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-480"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<unsigned long long> >",
   "name" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedField<unsigned long long> >",
   "referenced_type" : "type-479",
   "self_type" : "type-479",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINS0_13RepeatedFieldIyEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-517"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "name" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "referenced_type" : "type-516",
   "self_type" : "type-516",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINS0_16RepeatedPtrFieldINS0_11MessageLiteEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-509"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "google::protobuf::internal::is_enum<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-508",
   "self_type" : "type-508",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-450"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<int>",
   "name" : "google::protobuf::internal::is_enum<int>",
   "referenced_type" : "type-449",
   "self_type" : "type-449",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-452"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<long long>",
   "name" : "google::protobuf::internal::is_enum<long long>",
   "referenced_type" : "type-451",
   "self_type" : "type-451",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-909"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::is_enum<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-908",
   "self_type" : "type-908",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-911" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-914"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<unsigned int>",
   "name" : "google::protobuf::internal::is_enum<unsigned int>",
   "referenced_type" : "type-913",
   "self_type" : "type-913",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-446"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_enum<unsigned long long>",
   "name" : "google::protobuf::internal::is_enum<unsigned long long>",
   "referenced_type" : "type-915",
   "self_type" : "type-915",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_enumIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<bool>",
   "name" : "google::protobuf::internal::is_floating_point<bool>",
   "referenced_type" : "type-886",
   "self_type" : "type-886",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<double>",
   "name" : "google::protobuf::internal::is_floating_point<double>",
   "referenced_type" : "type-212",
   "self_type" : "type-212",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<float>",
   "name" : "google::protobuf::internal::is_floating_point<float>",
   "referenced_type" : "type-201",
   "self_type" : "type-201",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<bool> >",
   "name" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<bool> >",
   "referenced_type" : "type-885",
   "self_type" : "type-885",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINS0_13RepeatedFieldIbEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<double> >",
   "name" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<double> >",
   "referenced_type" : "type-884",
   "self_type" : "type-884",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINS0_13RepeatedFieldIdEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<float> >",
   "name" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<float> >",
   "referenced_type" : "type-883",
   "self_type" : "type-883",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINS0_13RepeatedFieldIfEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<int> >",
   "name" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<int> >",
   "referenced_type" : "type-879",
   "self_type" : "type-879",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINS0_13RepeatedFieldIiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<long long> >",
   "name" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<long long> >",
   "referenced_type" : "type-880",
   "self_type" : "type-880",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINS0_13RepeatedFieldIxEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<unsigned int> >",
   "name" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<unsigned int> >",
   "referenced_type" : "type-881",
   "self_type" : "type-881",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINS0_13RepeatedFieldIjEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<unsigned long long> >",
   "name" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedField<unsigned long long> >",
   "referenced_type" : "type-882",
   "self_type" : "type-882",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINS0_13RepeatedFieldIyEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "name" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "referenced_type" : "type-888",
   "self_type" : "type-888",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINS0_16RepeatedPtrFieldINS0_11MessageLiteEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "google::protobuf::internal::is_floating_point<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-887",
   "self_type" : "type-887",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<int>",
   "name" : "google::protobuf::internal::is_floating_point<int>",
   "referenced_type" : "type-877",
   "self_type" : "type-877",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<long double>",
   "name" : "google::protobuf::internal::is_floating_point<long double>",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-217" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointIgEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<long long>",
   "name" : "google::protobuf::internal::is_floating_point<long long>",
   "referenced_type" : "type-878",
   "self_type" : "type-878",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::is_floating_point<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-873",
   "self_type" : "type-873",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-874" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<unsigned int>",
   "name" : "google::protobuf::internal::is_floating_point<unsigned int>",
   "referenced_type" : "type-875",
   "self_type" : "type-875",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_floating_point<unsigned long long>",
   "name" : "google::protobuf::internal::is_floating_point<unsigned long long>",
   "referenced_type" : "type-876",
   "self_type" : "type-876",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal17is_floating_pointIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<bool>",
   "name" : "google::protobuf::internal::is_integral<bool>",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<char>",
   "name" : "google::protobuf::internal::is_integral<char>",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIcEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<double>",
   "name" : "google::protobuf::internal::is_integral<double>",
   "referenced_type" : "type-744",
   "self_type" : "type-744",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<float>",
   "name" : "google::protobuf::internal::is_integral<float>",
   "referenced_type" : "type-729",
   "self_type" : "type-729",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<bool> >",
   "name" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<bool> >",
   "referenced_type" : "type-870",
   "self_type" : "type-870",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINS0_13RepeatedFieldIbEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<double> >",
   "name" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<double> >",
   "referenced_type" : "type-859",
   "self_type" : "type-859",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINS0_13RepeatedFieldIdEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<float> >",
   "name" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<float> >",
   "referenced_type" : "type-843",
   "self_type" : "type-843",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINS0_13RepeatedFieldIfEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<int> >",
   "name" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<int> >",
   "referenced_type" : "type-765",
   "self_type" : "type-765",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINS0_13RepeatedFieldIiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<long long> >",
   "name" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<long long> >",
   "referenced_type" : "type-776",
   "self_type" : "type-776",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINS0_13RepeatedFieldIxEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<unsigned int> >",
   "name" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<unsigned int> >",
   "referenced_type" : "type-802",
   "self_type" : "type-802",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINS0_13RepeatedFieldIjEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<unsigned long long> >",
   "name" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedField<unsigned long long> >",
   "referenced_type" : "type-828",
   "self_type" : "type-828",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINS0_13RepeatedFieldIyEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "name" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "referenced_type" : "type-872",
   "self_type" : "type-872",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINS0_16RepeatedPtrFieldINS0_11MessageLiteEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "google::protobuf::internal::is_integral<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-871",
   "self_type" : "type-871",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<int>",
   "name" : "google::protobuf::internal::is_integral<int>",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<long long>",
   "name" : "google::protobuf::internal::is_integral<long long>",
   "referenced_type" : "type-723",
   "self_type" : "type-723",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<long>",
   "name" : "google::protobuf::internal::is_integral<long>",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-35" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<short>",
   "name" : "google::protobuf::internal::is_integral<short>",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-178" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<signed char>",
   "name" : "google::protobuf::internal::is_integral<signed char>",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-170" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIaEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::is_integral<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-709",
   "self_type" : "type-709",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<unsigned char>",
   "name" : "google::protobuf::internal::is_integral<unsigned char>",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<unsigned int>",
   "name" : "google::protobuf::internal::is_integral<unsigned int>",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<unsigned long long>",
   "name" : "google::protobuf::internal::is_integral<unsigned long long>",
   "referenced_type" : "type-717",
   "self_type" : "type-717",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<unsigned long>",
   "name" : "google::protobuf::internal::is_integral<unsigned long>",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<unsigned short>",
   "name" : "google::protobuf::internal::is_integral<unsigned short>",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralItEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_integral<wchar_t>",
   "name" : "google::protobuf::internal::is_integral<wchar_t>",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-174" ],
   "unique_id" : "_ZTSN6google8protobuf8internal11is_integralIwEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<bool>",
   "name" : "google::protobuf::internal::is_pod<bool>",
   "referenced_type" : "type-555",
   "self_type" : "type-555",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<double>",
   "name" : "google::protobuf::internal::is_pod<double>",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<float>",
   "name" : "google::protobuf::internal::is_pod<float>",
   "referenced_type" : "type-545",
   "self_type" : "type-545",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<bool> >",
   "name" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<bool> >",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINS0_13RepeatedFieldIbEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<double> >",
   "name" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<double> >",
   "referenced_type" : "type-553",
   "self_type" : "type-553",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINS0_13RepeatedFieldIdEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<float> >",
   "name" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<float> >",
   "referenced_type" : "type-552",
   "self_type" : "type-552",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINS0_13RepeatedFieldIfEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<int> >",
   "name" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<int> >",
   "referenced_type" : "type-547",
   "self_type" : "type-547",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINS0_13RepeatedFieldIiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<long long> >",
   "name" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<long long> >",
   "referenced_type" : "type-549",
   "self_type" : "type-549",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINS0_13RepeatedFieldIxEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<unsigned int> >",
   "name" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<unsigned int> >",
   "referenced_type" : "type-550",
   "self_type" : "type-550",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINS0_13RepeatedFieldIjEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<unsigned long long> >",
   "name" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedField<unsigned long long> >",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINS0_13RepeatedFieldIyEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "name" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINS0_16RepeatedPtrFieldINS0_11MessageLiteEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "google::protobuf::internal::is_pod<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<int>",
   "name" : "google::protobuf::internal::is_pod<int>",
   "referenced_type" : "type-543",
   "self_type" : "type-543",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<long long>",
   "name" : "google::protobuf::internal::is_pod<long long>",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::is_pod<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-539",
   "self_type" : "type-539",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-540" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<unsigned int>",
   "name" : "google::protobuf::internal::is_pod<unsigned int>",
   "referenced_type" : "type-541",
   "self_type" : "type-541",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pod<unsigned long long>",
   "name" : "google::protobuf::internal::is_pod<unsigned long long>",
   "referenced_type" : "type-542",
   "self_type" : "type-542",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal6is_podIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<bool>",
   "name" : "google::protobuf::internal::is_pointer<bool>",
   "referenced_type" : "type-905",
   "self_type" : "type-905",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<double>",
   "name" : "google::protobuf::internal::is_pointer<double>",
   "referenced_type" : "type-896",
   "self_type" : "type-896",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<float>",
   "name" : "google::protobuf::internal::is_pointer<float>",
   "referenced_type" : "type-895",
   "self_type" : "type-895",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<bool> >",
   "name" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<bool> >",
   "referenced_type" : "type-904",
   "self_type" : "type-904",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINS0_13RepeatedFieldIbEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<double> >",
   "name" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<double> >",
   "referenced_type" : "type-903",
   "self_type" : "type-903",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINS0_13RepeatedFieldIdEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<float> >",
   "name" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<float> >",
   "referenced_type" : "type-902",
   "self_type" : "type-902",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINS0_13RepeatedFieldIfEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<int> >",
   "name" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<int> >",
   "referenced_type" : "type-897",
   "self_type" : "type-897",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINS0_13RepeatedFieldIiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<long long> >",
   "name" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<long long> >",
   "referenced_type" : "type-898",
   "self_type" : "type-898",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINS0_13RepeatedFieldIxEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<unsigned int> >",
   "name" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<unsigned int> >",
   "referenced_type" : "type-899",
   "self_type" : "type-899",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINS0_13RepeatedFieldIjEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<unsigned long long> >",
   "name" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedField<unsigned long long> >",
   "referenced_type" : "type-901",
   "self_type" : "type-901",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINS0_13RepeatedFieldIyEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "name" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "referenced_type" : "type-907",
   "self_type" : "type-907",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINS0_16RepeatedPtrFieldINS0_11MessageLiteEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "google::protobuf::internal::is_pointer<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-906",
   "self_type" : "type-906",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<int>",
   "name" : "google::protobuf::internal::is_pointer<int>",
   "referenced_type" : "type-893",
   "self_type" : "type-893",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<long long>",
   "name" : "google::protobuf::internal::is_pointer<long long>",
   "referenced_type" : "type-894",
   "self_type" : "type-894",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::is_pointer<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-889",
   "self_type" : "type-889",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-890" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<unsigned int>",
   "name" : "google::protobuf::internal::is_pointer<unsigned int>",
   "referenced_type" : "type-891",
   "self_type" : "type-891",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_pointer<unsigned long long>",
   "name" : "google::protobuf::internal::is_pointer<unsigned long long>",
   "referenced_type" : "type-892",
   "self_type" : "type-892",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10is_pointerIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<bool>",
   "name" : "google::protobuf::internal::is_reference<bool>",
   "referenced_type" : "type-536",
   "self_type" : "type-536",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<double>",
   "name" : "google::protobuf::internal::is_reference<double>",
   "referenced_type" : "type-528",
   "self_type" : "type-528",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<float>",
   "name" : "google::protobuf::internal::is_reference<float>",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<bool> >",
   "name" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<bool> >",
   "referenced_type" : "type-535",
   "self_type" : "type-535",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINS0_13RepeatedFieldIbEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<double> >",
   "name" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<double> >",
   "referenced_type" : "type-534",
   "self_type" : "type-534",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINS0_13RepeatedFieldIdEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<float> >",
   "name" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<float> >",
   "referenced_type" : "type-533",
   "self_type" : "type-533",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINS0_13RepeatedFieldIfEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<int> >",
   "name" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<int> >",
   "referenced_type" : "type-529",
   "self_type" : "type-529",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINS0_13RepeatedFieldIiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<long long> >",
   "name" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<long long> >",
   "referenced_type" : "type-530",
   "self_type" : "type-530",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINS0_13RepeatedFieldIxEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<unsigned int> >",
   "name" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<unsigned int> >",
   "referenced_type" : "type-531",
   "self_type" : "type-531",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINS0_13RepeatedFieldIjEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<unsigned long long> >",
   "name" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedField<unsigned long long> >",
   "referenced_type" : "type-532",
   "self_type" : "type-532",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINS0_13RepeatedFieldIyEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "name" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "referenced_type" : "type-538",
   "self_type" : "type-538",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINS0_16RepeatedPtrFieldINS0_11MessageLiteEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "google::protobuf::internal::is_reference<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-537",
   "self_type" : "type-537",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<int>",
   "name" : "google::protobuf::internal::is_reference<int>",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<long long>",
   "name" : "google::protobuf::internal::is_reference<long long>",
   "referenced_type" : "type-525",
   "self_type" : "type-525",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::is_reference<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-520",
   "self_type" : "type-520",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-521" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<unsigned int>",
   "name" : "google::protobuf::internal::is_reference<unsigned int>",
   "referenced_type" : "type-522",
   "self_type" : "type-522",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_reference<unsigned long long>",
   "name" : "google::protobuf::internal::is_reference<unsigned long long>",
   "referenced_type" : "type-523",
   "self_type" : "type-523",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12is_referenceIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<bool, void>",
   "name" : "google::protobuf::internal::is_same<bool, void>",
   "referenced_type" : "type-593",
   "self_type" : "type-593",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameIbvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<double, void>",
   "name" : "google::protobuf::internal::is_same<double, void>",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameIdvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<float, void>",
   "name" : "google::protobuf::internal::is_same<float, void>",
   "referenced_type" : "type-584",
   "self_type" : "type-584",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameIfvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<bool>, void>",
   "name" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<bool>, void>",
   "referenced_type" : "type-592",
   "self_type" : "type-592",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINS0_13RepeatedFieldIbEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<double>, void>",
   "name" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<double>, void>",
   "referenced_type" : "type-591",
   "self_type" : "type-591",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINS0_13RepeatedFieldIdEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<float>, void>",
   "name" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<float>, void>",
   "referenced_type" : "type-590",
   "self_type" : "type-590",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINS0_13RepeatedFieldIfEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<int>, void>",
   "name" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<int>, void>",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINS0_13RepeatedFieldIiEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<long long>, void>",
   "name" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<long long>, void>",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINS0_13RepeatedFieldIxEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<unsigned int>, void>",
   "name" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<unsigned int>, void>",
   "referenced_type" : "type-588",
   "self_type" : "type-588",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINS0_13RepeatedFieldIjEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<unsigned long long>, void>",
   "name" : "google::protobuf::internal::is_same<google::protobuf::RepeatedField<unsigned long long>, void>",
   "referenced_type" : "type-589",
   "self_type" : "type-589",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINS0_13RepeatedFieldIyEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite>, void>",
   "name" : "google::protobuf::internal::is_same<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite>, void>",
   "referenced_type" : "type-595",
   "self_type" : "type-595",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINS0_16RepeatedPtrFieldINS0_11MessageLiteEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, void>",
   "name" : "google::protobuf::internal::is_same<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, void>",
   "referenced_type" : "type-594",
   "self_type" : "type-594",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<int, void>",
   "name" : "google::protobuf::internal::is_same<int, void>",
   "referenced_type" : "type-582",
   "self_type" : "type-582",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameIivEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<long long, void>",
   "name" : "google::protobuf::internal::is_same<long long, void>",
   "referenced_type" : "type-583",
   "self_type" : "type-583",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameIxvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, void>",
   "name" : "google::protobuf::internal::is_same<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, void>",
   "referenced_type" : "type-578",
   "self_type" : "type-578",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-579", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<unsigned int, void>",
   "name" : "google::protobuf::internal::is_same<unsigned int, void>",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameIjvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::is_same<unsigned long long, void>",
   "name" : "google::protobuf::internal::is_same<unsigned long long, void>",
   "referenced_type" : "type-581",
   "self_type" : "type-581",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100", "type-131" ],
   "unique_id" : "_ZTSN6google8protobuf8internal7is_sameIyvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "array_",
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::scoped_array<char>",
   "name" : "google::protobuf::internal::scoped_array<char>",
   "record_kind" : "class",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/scoped_ptr.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12scoped_arrayIcEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "array_",
     "referenced_type" : "type-806"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::scoped_array<unsigned char>",
   "name" : "google::protobuf::internal::scoped_array<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-971",
   "self_type" : "type-971",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/scoped_ptr.h",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSN6google8protobuf8internal12scoped_arrayIhEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "referenced_type" : "type-965"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::scoped_ptr<google::protobuf::ResultCallback<std::basic_string<char, std::char_traits<char>, std::allocator<char> > *> >",
   "name" : "google::protobuf::internal::scoped_ptr<google::protobuf::ResultCallback<std::basic_string<char, std::char_traits<char>, std::allocator<char> > *> >",
   "record_kind" : "class",
   "referenced_type" : "type-964",
   "self_type" : "type-964",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/scoped_ptr.h",
   "template_args" : [ "type-967" ],
   "unique_id" : "_ZTSN6google8protobuf8internal10scoped_ptrINS0_14ResultCallbackIPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::ConvertHelper<google::protobuf::MessageLite *, google::protobuf::Message *>",
   "name" : "google::protobuf::internal::type_traits_internal::ConvertHelper<google::protobuf::MessageLite *, google::protobuf::Message *>",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-602", "type-599" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal13ConvertHelperIPNS0_11MessageLiteEPNS0_7MessageEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::ConvertHelper<long long &, int>",
   "name" : "google::protobuf::internal::type_traits_internal::ConvertHelper<long long &, int>",
   "referenced_type" : "type-624",
   "self_type" : "type-624",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-454", "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal13ConvertHelperIRxiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::ConvertHelper<std::basic_string<char, std::char_traits<char>, std::allocator<char> > *, google::protobuf::Message *>",
   "name" : "google::protobuf::internal::type_traits_internal::ConvertHelper<std::basic_string<char, std::char_traits<char>, std::allocator<char> > *, google::protobuf::Message *>",
   "referenced_type" : "type-441",
   "self_type" : "type-441",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-430", "type-439" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal13ConvertHelperIPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEPNS0_7MessageEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::ConvertHelper<unsigned long long &, int>",
   "name" : "google::protobuf::internal::type_traits_internal::ConvertHelper<unsigned long long &, int>",
   "referenced_type" : "type-623",
   "self_type" : "type-623",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-448", "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal13ConvertHelperIRyiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<bool>",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<bool>",
   "referenced_type" : "type-620",
   "self_type" : "type-620",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<double>",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<double>",
   "referenced_type" : "type-611",
   "self_type" : "type-611",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<float>",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<float>",
   "referenced_type" : "type-610",
   "self_type" : "type-610",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<bool> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<bool> >",
   "referenced_type" : "type-619",
   "self_type" : "type-619",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINS0_13RepeatedFieldIbEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<double> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<double> >",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINS0_13RepeatedFieldIdEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<float> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<float> >",
   "referenced_type" : "type-616",
   "self_type" : "type-616",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINS0_13RepeatedFieldIfEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<int> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<int> >",
   "referenced_type" : "type-612",
   "self_type" : "type-612",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINS0_13RepeatedFieldIiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<long long> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<long long> >",
   "referenced_type" : "type-613",
   "self_type" : "type-613",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINS0_13RepeatedFieldIxEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<unsigned int> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<unsigned int> >",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINS0_13RepeatedFieldIjEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<unsigned long long> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedField<unsigned long long> >",
   "referenced_type" : "type-615",
   "self_type" : "type-615",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINS0_13RepeatedFieldIyEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "referenced_type" : "type-622",
   "self_type" : "type-622",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINS0_16RepeatedPtrFieldINS0_11MessageLiteEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<int>",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<int>",
   "referenced_type" : "type-608",
   "self_type" : "type-608",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<long long>",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<long long>",
   "referenced_type" : "type-609",
   "self_type" : "type-609",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-603",
   "self_type" : "type-603",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionINSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<unsigned int>",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<unsigned int>",
   "referenced_type" : "type-605",
   "self_type" : "type-605",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_class_or_union<unsigned long long>",
   "name" : "google::protobuf::internal::type_traits_internal::is_class_or_union<unsigned long long>",
   "referenced_type" : "type-606",
   "self_type" : "type-606",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal17is_class_or_unionIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-453"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<false, long long>",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<false, long long>",
   "referenced_type" : "type-452",
   "self_type" : "type-452",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-98" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb0ExEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-447"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<false, unsigned long long>",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<false, unsigned long long>",
   "referenced_type" : "type-446",
   "self_type" : "type-446",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-100" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb0EyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, bool>",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, bool>",
   "referenced_type" : "type-505",
   "self_type" : "type-505",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1EbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, double>",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, double>",
   "referenced_type" : "type-459",
   "self_type" : "type-459",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1EdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, float>",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, float>",
   "referenced_type" : "type-457",
   "self_type" : "type-457",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-102" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1EfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<bool> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<bool> >",
   "referenced_type" : "type-499",
   "self_type" : "type-499",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-500" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENS0_13RepeatedFieldIbEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<double> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<double> >",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-494" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENS0_13RepeatedFieldIdEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<float> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<float> >",
   "referenced_type" : "type-486",
   "self_type" : "type-486",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENS0_13RepeatedFieldIfEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<int> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<int> >",
   "referenced_type" : "type-461",
   "self_type" : "type-461",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-462" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENS0_13RepeatedFieldIiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<long long> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<long long> >",
   "referenced_type" : "type-467",
   "self_type" : "type-467",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-468" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENS0_13RepeatedFieldIxEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<unsigned int> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<unsigned int> >",
   "referenced_type" : "type-473",
   "self_type" : "type-473",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-474" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENS0_13RepeatedFieldIjEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<unsigned long long> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedField<unsigned long long> >",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-481" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENS0_13RepeatedFieldIyEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedPtrField<google::protobuf::MessageLite> >",
   "referenced_type" : "type-517",
   "self_type" : "type-517",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-518" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENS0_16RepeatedPtrFieldINS0_11MessageLiteEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, google::protobuf::RepeatedPtrField<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-509",
   "self_type" : "type-509",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-510" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENS0_16RepeatedPtrFieldINSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, int>",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, int>",
   "referenced_type" : "type-450",
   "self_type" : "type-450",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-1" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1EiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, std::basic_string<char, std::char_traits<char>, std::allocator<char> > >",
   "referenced_type" : "type-909",
   "self_type" : "type-909",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-910" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1ENSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, unsigned int>",
   "name" : "google::protobuf::internal::type_traits_internal::is_enum_impl<true, unsigned int>",
   "referenced_type" : "type-914",
   "self_type" : "type-914",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/type_traits.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN6google8protobuf8internal20type_traits_internal12is_enum_implILb1EjEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-957"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 64,
     "referenced_type" : "type-956"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "block_size_",
     "field_offset" : 160,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 192,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "last_returned_size_",
     "field_offset" : 224,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "google::protobuf::io::ArrayInputStream",
   "name" : "google::protobuf::io::ArrayInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-955",
   "self_type" : "type-955",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "unique_id" : "_ZTSN6google8protobuf2io16ArrayInputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io16ArrayInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStream4NextEPPKvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io16ArrayInputStream4SkipEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io16ArrayInputStream9ByteCountEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-926"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 64,
     "referenced_type" : "type-959"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "block_size_",
     "field_offset" : 160,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 192,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "last_returned_size_",
     "field_offset" : 224,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "google::protobuf::io::ArrayOutputStream",
   "name" : "google::protobuf::io::ArrayOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-958",
   "self_type" : "type-958",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "unique_id" : "_ZTSN6google8protobuf2io17ArrayOutputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io17ArrayOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io17ArrayOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io17ArrayOutputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io17ArrayOutputStream4NextEPPvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io17ArrayOutputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io17ArrayOutputStream9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "type-227"
    },
    {
     "access" : "private",
     "field_name" : "buffer_end_",
     "field_offset" : 64,
     "referenced_type" : "type-227"
    },
    {
     "access" : "private",
     "field_name" : "input_",
     "field_offset" : 128,
     "referenced_type" : "type-792"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_read_",
     "field_offset" : 192,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "overflow_bytes_",
     "field_offset" : 224,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "last_tag_",
     "field_offset" : 256,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "legitimate_message_end_",
     "field_offset" : 288,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "aliasing_enabled_",
     "field_offset" : 296,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "current_limit_",
     "field_offset" : 320,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_after_limit_",
     "field_offset" : 352,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_limit_",
     "field_offset" : 384,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_warning_threshold_",
     "field_offset" : 416,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "recursion_budget_",
     "field_offset" : 448,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "recursion_limit_",
     "field_offset" : 480,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "extension_pool_",
     "field_offset" : 512,
     "referenced_type" : "type-794"
    },
    {
     "access" : "private",
     "field_name" : "extension_factory_",
     "field_offset" : 576,
     "referenced_type" : "type-797"
    }
   ],
   "linker_set_key" : "google::protobuf::io::CodedInputStream",
   "name" : "google::protobuf::io::CodedInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-790",
   "self_type" : "type-790",
   "size" : 80,
   "source_file" : "/external/protobuf/src/google/protobuf/io/coded_stream.h",
   "unique_id" : "_ZTSN6google8protobuf2io16CodedInputStreamE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "output_",
     "referenced_type" : "type-804"
    },
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 64,
     "referenced_type" : "type-806"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "total_bytes_",
     "field_offset" : 160,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "had_error_",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "aliasing_enabled_",
     "field_offset" : 200,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "google::protobuf::io::CodedOutputStream",
   "name" : "google::protobuf::io::CodedOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-803",
   "self_type" : "type-803",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/io/coded_stream.h",
   "unique_id" : "_ZTSN6google8protobuf2io17CodedOutputStreamE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::io::CodedOutputStream::StaticVarintSize32<11>",
   "name" : "google::protobuf::io::CodedOutputStream::StaticVarintSize32<11>",
   "referenced_type" : "type-1030",
   "self_type" : "type-1030",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/io/coded_stream.h",
   "unique_id" : "_ZTSN6google8protobuf2io17CodedOutputStream18StaticVarintSize32ILj11EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::io::CodedOutputStream::StaticVarintSize32<12>",
   "name" : "google::protobuf::io::CodedOutputStream::StaticVarintSize32<12>",
   "referenced_type" : "type-1031",
   "self_type" : "type-1031",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/io/coded_stream.h",
   "unique_id" : "_ZTSN6google8protobuf2io17CodedOutputStream18StaticVarintSize32ILj12EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::io::CodedOutputStream::StaticVarintSize32<16>",
   "name" : "google::protobuf::io::CodedOutputStream::StaticVarintSize32<16>",
   "referenced_type" : "type-1032",
   "self_type" : "type-1032",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/io/coded_stream.h",
   "unique_id" : "_ZTSN6google8protobuf2io17CodedOutputStream18StaticVarintSize32ILj16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::io::CodedOutputStream::StaticVarintSize32<26>",
   "name" : "google::protobuf::io::CodedOutputStream::StaticVarintSize32<26>",
   "referenced_type" : "type-1033",
   "self_type" : "type-1033",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/io/coded_stream.h",
   "unique_id" : "_ZTSN6google8protobuf2io17CodedOutputStream18StaticVarintSize32ILj26EEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-957"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "streams_",
     "field_offset" : 64,
     "referenced_type" : "type-1099"
    },
    {
     "access" : "private",
     "field_name" : "stream_count_",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "bytes_retired_",
     "field_offset" : 192,
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "google::protobuf::io::ConcatenatingInputStream",
   "name" : "google::protobuf::io::ConcatenatingInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1098",
   "self_type" : "type-1098",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io24ConcatenatingInputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io24ConcatenatingInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io24ConcatenatingInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io24ConcatenatingInputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io24ConcatenatingInputStream4NextEPPKvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io24ConcatenatingInputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io24ConcatenatingInputStream4SkipEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io24ConcatenatingInputStream9ByteCountEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::io::CopyingInputStream",
   "name" : "google::protobuf::io::CopyingInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-968",
   "self_type" : "type-968",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "unique_id" : "_ZTSN6google8protobuf2io18CopyingInputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io18CopyingInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18CopyingInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18CopyingInputStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io18CopyingInputStream4ReadEPvi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18CopyingInputStream4SkipEi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-957"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "copying_stream_",
     "field_offset" : 64,
     "referenced_type" : "type-970"
    },
    {
     "access" : "private",
     "field_name" : "owns_copying_stream_",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "failed_",
     "field_offset" : 136,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 192,
     "referenced_type" : "type-98"
    },
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 256,
     "referenced_type" : "type-971"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 320,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "buffer_used_",
     "field_offset" : 352,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "backup_bytes_",
     "field_offset" : 384,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "google::protobuf::io::CopyingInputStreamAdaptor",
   "name" : "google::protobuf::io::CopyingInputStreamAdaptor",
   "record_kind" : "class",
   "referenced_type" : "type-969",
   "self_type" : "type-969",
   "size" : 56,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "unique_id" : "_ZTSN6google8protobuf2io25CopyingInputStreamAdaptorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io25CopyingInputStreamAdaptorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptor4NextEPPKvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptor6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io25CopyingInputStreamAdaptor4SkipEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io25CopyingInputStreamAdaptor9ByteCountEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::io::CopyingOutputStream",
   "name" : "google::protobuf::io::CopyingOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-974",
   "self_type" : "type-974",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "unique_id" : "_ZTSN6google8protobuf2io19CopyingOutputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io19CopyingOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19CopyingOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19CopyingOutputStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io19CopyingOutputStream5WriteEPKvi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-926"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "copying_stream_",
     "field_offset" : 64,
     "referenced_type" : "type-976"
    },
    {
     "access" : "private",
     "field_name" : "owns_copying_stream_",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "failed_",
     "field_offset" : 136,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 192,
     "referenced_type" : "type-98"
    },
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 256,
     "referenced_type" : "type-971"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 320,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "buffer_used_",
     "field_offset" : 352,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "google::protobuf::io::CopyingOutputStreamAdaptor",
   "name" : "google::protobuf::io::CopyingOutputStreamAdaptor",
   "record_kind" : "class",
   "referenced_type" : "type-975",
   "self_type" : "type-975",
   "size" : 48,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "unique_id" : "_ZTSN6google8protobuf2io26CopyingOutputStreamAdaptorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io26CopyingOutputStreamAdaptorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io26CopyingOutputStreamAdaptorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io26CopyingOutputStreamAdaptorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io26CopyingOutputStreamAdaptor4NextEPPvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io26CopyingOutputStreamAdaptor6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io26CopyingOutputStreamAdaptor9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-957"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "copying_input_",
     "field_offset" : 64,
     "referenced_type" : "type-1071"
    },
    {
     "access" : "private",
     "field_name" : "impl_",
     "field_offset" : 256,
     "referenced_type" : "type-969"
    }
   ],
   "linker_set_key" : "google::protobuf::io::FileInputStream",
   "name" : "google::protobuf::io::FileInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1070",
   "self_type" : "type-1070",
   "size" : 88,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io15FileInputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io15FileInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io15FileInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io15FileInputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io15FileInputStream4NextEPPKvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io15FileInputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io15FileInputStream4SkipEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io15FileInputStream9ByteCountEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-968"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "file_",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "close_on_delete_",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "is_closed_",
     "field_offset" : 104,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "errno_",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "access" : "private",
     "field_name" : "previous_seek_failed_",
     "field_offset" : 160,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "google::protobuf::io::FileInputStream::CopyingFileInputStream",
   "name" : "google::protobuf::io::FileInputStream::CopyingFileInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1071",
   "self_type" : "type-1071",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io15FileInputStream22CopyingFileInputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io15FileInputStream22CopyingFileInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io15FileInputStream22CopyingFileInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io15FileInputStream22CopyingFileInputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io15FileInputStream22CopyingFileInputStream4ReadEPvi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io15FileInputStream22CopyingFileInputStream4SkipEi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-926"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "copying_output_",
     "field_offset" : 64,
     "referenced_type" : "type-1077"
    },
    {
     "access" : "private",
     "field_name" : "impl_",
     "field_offset" : 256,
     "referenced_type" : "type-975"
    }
   ],
   "linker_set_key" : "google::protobuf::io::FileOutputStream",
   "name" : "google::protobuf::io::FileOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1076",
   "self_type" : "type-1076",
   "size" : 80,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io16FileOutputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io16FileOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io16FileOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io16FileOutputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io16FileOutputStream4NextEPPvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io16FileOutputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io16FileOutputStream9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-974"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "file_",
     "field_offset" : 64,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "close_on_delete_",
     "field_offset" : 96,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "is_closed_",
     "field_offset" : 104,
     "referenced_type" : "type-20"
    },
    {
     "access" : "private",
     "field_name" : "errno_",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "google::protobuf::io::FileOutputStream::CopyingFileOutputStream",
   "name" : "google::protobuf::io::FileOutputStream::CopyingFileOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1077",
   "self_type" : "type-1077",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io16FileOutputStream23CopyingFileOutputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io16FileOutputStream23CopyingFileOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io16FileOutputStream23CopyingFileOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io16FileOutputStream23CopyingFileOutputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io16FileOutputStream23CopyingFileOutputStream5WriteEPKvi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-957"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "copying_input_",
     "field_offset" : 64,
     "referenced_type" : "type-1083"
    },
    {
     "access" : "private",
     "field_name" : "impl_",
     "field_offset" : 192,
     "referenced_type" : "type-969"
    }
   ],
   "linker_set_key" : "google::protobuf::io::IstreamInputStream",
   "name" : "google::protobuf::io::IstreamInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1082",
   "self_type" : "type-1082",
   "size" : 80,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io18IstreamInputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io18IstreamInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18IstreamInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18IstreamInputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18IstreamInputStream4NextEPPKvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18IstreamInputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18IstreamInputStream4SkipEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io18IstreamInputStream9ByteCountEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-968"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "input_",
     "field_offset" : 64,
     "referenced_type" : "type-1084"
    }
   ],
   "linker_set_key" : "google::protobuf::io::IstreamInputStream::CopyingIstreamInputStream",
   "name" : "google::protobuf::io::IstreamInputStream::CopyingIstreamInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1083",
   "self_type" : "type-1083",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io18IstreamInputStream25CopyingIstreamInputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io18IstreamInputStream25CopyingIstreamInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18IstreamInputStream25CopyingIstreamInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18IstreamInputStream25CopyingIstreamInputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18IstreamInputStream25CopyingIstreamInputStream4ReadEPvi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18CopyingInputStream4SkipEi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-961"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "callback_",
     "field_offset" : 128,
     "referenced_type" : "type-963"
    },
    {
     "access" : "private",
     "field_name" : "string_is_set_",
     "field_offset" : 192,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "google::protobuf::io::LazyStringOutputStream",
   "name" : "google::protobuf::io::LazyStringOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-962",
   "self_type" : "type-962",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "unique_id" : "_ZTSN6google8protobuf2io22LazyStringOutputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io22LazyStringOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io22LazyStringOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io22LazyStringOutputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io22LazyStringOutputStream4NextEPPvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18StringOutputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io22LazyStringOutputStream9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-957"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "input_",
     "field_offset" : 64,
     "referenced_type" : "type-984"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 128,
     "referenced_type" : "type-98"
    },
    {
     "access" : "private",
     "field_name" : "prior_bytes_read_",
     "field_offset" : 192,
     "referenced_type" : "type-98"
    }
   ],
   "linker_set_key" : "google::protobuf::io::LimitingInputStream",
   "name" : "google::protobuf::io::LimitingInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1104",
   "self_type" : "type-1104",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io19LimitingInputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io19LimitingInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStream4NextEPPKvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io19LimitingInputStream4SkipEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io19LimitingInputStream9ByteCountEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-926"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "copying_output_",
     "field_offset" : 64,
     "referenced_type" : "type-1091"
    },
    {
     "access" : "private",
     "field_name" : "impl_",
     "field_offset" : 192,
     "referenced_type" : "type-975"
    }
   ],
   "linker_set_key" : "google::protobuf::io::OstreamOutputStream",
   "name" : "google::protobuf::io::OstreamOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1090",
   "self_type" : "type-1090",
   "size" : 72,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io19OstreamOutputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io19OstreamOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19OstreamOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19OstreamOutputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io19OstreamOutputStream4NextEPPvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io19OstreamOutputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io19OstreamOutputStream9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-974"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "output_",
     "field_offset" : 64,
     "referenced_type" : "type-1092"
    }
   ],
   "linker_set_key" : "google::protobuf::io::OstreamOutputStream::CopyingOstreamOutputStream",
   "name" : "google::protobuf::io::OstreamOutputStream::CopyingOstreamOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-1091",
   "self_type" : "type-1091",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl.h",
   "unique_id" : "_ZTSN6google8protobuf2io19OstreamOutputStream26CopyingOstreamOutputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io19OstreamOutputStream26CopyingOstreamOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19OstreamOutputStream26CopyingOstreamOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19OstreamOutputStream26CopyingOstreamOutputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io19OstreamOutputStream26CopyingOstreamOutputStream5WriteEPKvi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-926"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "target_",
     "field_offset" : 64,
     "referenced_type" : "type-928"
    }
   ],
   "linker_set_key" : "google::protobuf::io::StringOutputStream",
   "name" : "google::protobuf::io::StringOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-961",
   "self_type" : "type-961",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream_impl_lite.h",
   "unique_id" : "_ZTSN6google8protobuf2io18StringOutputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io18StringOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18StringOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io18StringOutputStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18StringOutputStream4NextEPPvPi"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io18StringOutputStream6BackUpEi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io18StringOutputStream9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::io::ZeroCopyInputStream",
   "name" : "google::protobuf::io::ZeroCopyInputStream",
   "record_kind" : "class",
   "referenced_type" : "type-957",
   "self_type" : "type-957",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream.h",
   "unique_id" : "_ZTSN6google8protobuf2io19ZeroCopyInputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io19ZeroCopyInputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStream4NextEPPKvPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStream6BackUpEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io19ZeroCopyInputStream4SkipEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf2io19ZeroCopyInputStream9ByteCountEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::io::ZeroCopyOutputStream",
   "name" : "google::protobuf::io::ZeroCopyOutputStream",
   "record_kind" : "class",
   "referenced_type" : "type-926",
   "self_type" : "type-926",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/io/zero_copy_stream.h",
   "unique_id" : "_ZTSN6google8protobuf2io20ZeroCopyOutputStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf2io20ZeroCopyOutputStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream4NextEPPvPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream6BackUpEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream9ByteCountEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf2io20ZeroCopyOutputStream15WriteAliasedRawEPKvi"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf2io20ZeroCopyOutputStream14AllowsAliasingEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::streq",
   "name" : "google::protobuf::streq",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/hash.h",
   "unique_id" : "_ZTSN6google8protobuf5streqE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "piece_data_",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "piece_size_",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "digits",
     "field_offset" : 128,
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "google::protobuf::strings::AlphaNum",
   "name" : "google::protobuf::strings::AlphaNum",
   "referenced_type" : "type-107",
   "self_type" : "type-107",
   "size" : 48,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/strutil.h",
   "unique_id" : "_ZTSN6google8protobuf7strings8AlphaNumE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "input_",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "google::protobuf::strings::ArrayByteSource",
   "name" : "google::protobuf::strings::ArrayByteSource",
   "record_kind" : "class",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/bytestream.h",
   "unique_id" : "_ZTSN6google8protobuf7strings15ArrayByteSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7strings15ArrayByteSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings15ArrayByteSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings15ArrayByteSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf7strings15ArrayByteSource9AvailableEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings15ArrayByteSource4PeekEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings15ArrayByteSource4SkipEm"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings10ByteSource6CopyToEPNS1_8ByteSinkEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::strings::ByteSink",
   "name" : "google::protobuf::strings::ByteSink",
   "record_kind" : "class",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/bytestream.h",
   "unique_id" : "_ZTSN6google8protobuf7strings8ByteSinkE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7strings8ByteSinkE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings8ByteSinkD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings8ByteSinkD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf7strings8ByteSink6AppendEPKcm"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings8ByteSink5FlushEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "google::protobuf::strings::ByteSource",
   "name" : "google::protobuf::strings::ByteSource",
   "record_kind" : "class",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/bytestream.h",
   "unique_id" : "_ZTSN6google8protobuf7strings10ByteSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7strings10ByteSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings10ByteSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings10ByteSourceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6google8protobuf7strings10ByteSource9AvailableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf7strings10ByteSource4PeekEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6google8protobuf7strings10ByteSource4SkipEm"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings10ByteSource6CopyToEPNS1_8ByteSinkEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "outbuf_",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 128,
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "overflowed_",
     "field_offset" : 256,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "google::protobuf::strings::CheckedArrayByteSink",
   "name" : "google::protobuf::strings::CheckedArrayByteSink",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 40,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/bytestream.h",
   "unique_id" : "_ZTSN6google8protobuf7strings20CheckedArrayByteSinkE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7strings20CheckedArrayByteSinkE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings20CheckedArrayByteSinkD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings20CheckedArrayByteSinkD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings20CheckedArrayByteSink6AppendEPKcm"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings8ByteSink5FlushEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "buf_",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "google::protobuf::strings::GrowingArrayByteSink",
   "name" : "google::protobuf::strings::GrowingArrayByteSink",
   "record_kind" : "class",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/bytestream.h",
   "unique_id" : "_ZTSN6google8protobuf7strings20GrowingArrayByteSinkE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7strings20GrowingArrayByteSinkE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings20GrowingArrayByteSinkD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings20GrowingArrayByteSinkD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings20GrowingArrayByteSink6AppendEPKcm"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings8ByteSink5FlushEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "spec",
     "field_offset" : 64,
     "referenced_type" : "type-105"
    }
   ],
   "linker_set_key" : "google::protobuf::strings::Hex",
   "name" : "google::protobuf::strings::Hex",
   "referenced_type" : "type-106",
   "self_type" : "type-106",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/strutil.h",
   "unique_id" : "_ZTSN6google8protobuf7strings3HexE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-36"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "source_",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "google::protobuf::strings::LimitByteSource",
   "name" : "google::protobuf::strings::LimitByteSource",
   "record_kind" : "class",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 24,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/bytestream.h",
   "unique_id" : "_ZTSN6google8protobuf7strings15LimitByteSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7strings15LimitByteSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings15LimitByteSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings15LimitByteSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6google8protobuf7strings15LimitByteSource9AvailableEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings15LimitByteSource4PeekEv"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings15LimitByteSource4SkipEm"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings15LimitByteSource6CopyToEPNS1_8ByteSinkEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "google::protobuf::strings::NullByteSink",
   "name" : "google::protobuf::strings::NullByteSink",
   "record_kind" : "class",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 8,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/bytestream.h",
   "unique_id" : "_ZTSN6google8protobuf7strings12NullByteSinkE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7strings12NullByteSinkE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings12NullByteSinkD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings12NullByteSinkD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings12NullByteSink6AppendEPKcm"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings8ByteSink5FlushEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dest_",
     "field_offset" : 64,
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "google::protobuf::strings::StringByteSink",
   "name" : "google::protobuf::strings::StringByteSink",
   "record_kind" : "class",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/bytestream.h",
   "unique_id" : "_ZTSN6google8protobuf7strings14StringByteSinkE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7strings14StringByteSinkE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings14StringByteSinkD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings14StringByteSinkD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings14StringByteSink6AppendEPKcm"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings8ByteSink5FlushEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dest_",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "google::protobuf::strings::UncheckedArrayByteSink",
   "name" : "google::protobuf::strings::UncheckedArrayByteSink",
   "record_kind" : "class",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/bytestream.h",
   "unique_id" : "_ZTSN6google8protobuf7strings22UncheckedArrayByteSinkE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6google8protobuf7strings22UncheckedArrayByteSinkE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings22UncheckedArrayByteSinkD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6google8protobuf7strings22UncheckedArrayByteSinkD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings22UncheckedArrayByteSink6AppendEPKcm"
    },
    {
     "mangled_component_name" : "_ZN6google8protobuf7strings8ByteSink5FlushEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "lo_",
     "referenced_type" : "type-100"
    },
    {
     "access" : "private",
     "field_name" : "hi_",
     "field_offset" : 64,
     "referenced_type" : "type-100"
    }
   ],
   "linker_set_key" : "google::protobuf::uint128",
   "name" : "google::protobuf::uint128",
   "record_kind" : "class",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/int128.h",
   "unique_id" : "_ZTSN6google8protobuf7uint128E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hi",
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "lo",
     "field_offset" : 64,
     "referenced_type" : "type-100"
    }
   ],
   "linker_set_key" : "google::protobuf::uint128_pod",
   "name" : "google::protobuf::uint128_pod",
   "referenced_type" : "type-116",
   "self_type" : "type-116",
   "size" : 16,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/int128.h",
   "unique_id" : "_ZTSN6google8protobuf11uint128_podE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "error_code_",
     "referenced_type" : "type-80"
    },
    {
     "access" : "private",
     "field_name" : "error_message_",
     "field_offset" : 64,
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "google::protobuf::util::Status",
   "name" : "google::protobuf::util::Status",
   "record_kind" : "class",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 32,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/status.h",
   "unique_id" : "_ZTSN6google8protobuf4util6StatusE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "google::protobuf::util::internal::StatusOrHelper",
   "name" : "google::protobuf::util::internal::StatusOrHelper",
   "record_kind" : "class",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 1,
   "source_file" : "/external/protobuf/src/google/protobuf/stubs/statusor.h",
   "unique_id" : "_ZTSN6google8protobuf4util8internal14StatusOrHelperE"
  }
 ],
 "rvalue_reference_types" : []
}
