{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "OMX_AUDIO_CHANNELTYPE [16]",
   "name" : "OMX_AUDIO_CHANNELTYPE [16]",
   "referenced_type" : "type-1638",
   "self_type" : "type-1643",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h"
  },
  {
   "linker_set_key" : "OMX_COMPONENTREGISTERTYPE []",
   "name" : "OMX_COMPONENTREGISTERTYPE []",
   "referenced_type" : "type-1503",
   "self_type" : "type-1516",
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "android::AMessage::Item [64]",
   "name" : "android::AMessage::Item [64]",
   "referenced_type" : "type-266",
   "self_type" : "type-265",
   "size" : 2560,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::MediaImage2::PlaneInfo [4]",
   "name" : "android::MediaImage2::PlaneInfo [4]",
   "referenced_type" : "type-2429",
   "self_type" : "type-2428",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::MediaImage::PlaneInfo [3]",
   "name" : "android::MediaImage::PlaneInfo [3]",
   "referenced_type" : "type-2423",
   "self_type" : "type-2422",
   "size" : 60,

   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-7658",
   "self_type" : "type-7657",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-7669",
   "self_type" : "type-7668",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "name" : "const std::vector<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)>, std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *> > *)> > >",
   "referenced_type" : "type-861",
   "self_type" : "type-860",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-4386",
   "self_type" : "type-4385",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-4514",
   "self_type" : "type-4513",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-7001",
   "self_type" : "type-7000",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-7135",
   "self_type" : "type-7134",
   "size" : 24,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-92",
   "self_type" : "type-100",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-144",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-11",
   "self_type" : "type-145",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-94",
   "self_type" : "type-102",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-500",
   "self_type" : "type-2524",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-9",
   "self_type" : "type-13",
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-95",
   "self_type" : "type-893",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-4",
   "self_type" : "type-1258",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBalance",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_BALANCETYPE",
   "name" : "OMX_AUDIO_CONFIG_BALANCETYPE",
   "referenced_type" : "type-2189",
   "self_type" : "type-2189",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_BALANCETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nBass",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_BASSTYPE",
   "name" : "OMX_AUDIO_CONFIG_BASSTYPE",
   "referenced_type" : "type-2193",
   "self_type" : "type-2193",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_BASSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE",
   "referenced_type" : "type-2191",
   "self_type" : "type-2191",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_CHANNELMUTETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 160,
     "referenced_type" : "type-1474"
    },
    {
     "field_name" : "bIsMIDI",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE",
   "referenced_type" : "type-2188",
   "self_type" : "type-2188",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_CHANNELVOLUMETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "sDelay",
     "field_offset" : 128,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "sModulationRate",
     "field_offset" : 224,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "nModulationDepth",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFeedback",
     "field_offset" : 352,
     "referenced_type" : "type-1473"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_CHORUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_CHORUSTYPE",
   "referenced_type" : "type-2199",
   "self_type" : "type-2199",
   "size" : 56,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_CHORUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eEchoCancelation",
     "field_offset" : 96,
     "referenced_type" : "type-2201"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE",
   "referenced_type" : "type-2202",
   "self_type" : "type-2202",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_ECHOCANCELATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "sBandIndex",
     "field_offset" : 128,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "sCenterFreq",
     "field_offset" : 224,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "sBandLevel",
     "field_offset" : 320,
     "referenced_type" : "type-1474"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "name" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE",
   "referenced_type" : "type-2196",
   "self_type" : "type-2196",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_EQUALIZERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bLoudness",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "name" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE",
   "referenced_type" : "type-2192",
   "self_type" : "type-2192",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_LOUDNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sPitchTransposition",
     "field_offset" : 96,
     "referenced_type" : "type-1474"
    },
    {
     "field_name" : "sPlayBackRate",
     "field_offset" : 192,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "sTempo",
     "field_offset" : 288,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "nMaxPolyphony",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumRepeat",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStopTime",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannelMuteMask",
     "field_offset" : 480,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nChannelSoloMask",
     "field_offset" : 496,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nTrack0031MuteMask",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTrack3263MuteMask",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTrack0031SoloMask",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTrack3263SoloMask",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE",
   "referenced_type" : "type-2160",
   "self_type" : "type-2160",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDICONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMidiEventSize",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMidiEvents",
     "field_offset" : 128,
     "referenced_type" : "type-1572"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE",
   "referenced_type" : "type-2138",
   "self_type" : "type-2138",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDIIMMEDIATEEVENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nData",
     "field_offset" : 160,
     "referenced_type" : "type-1572"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE",
   "referenced_type" : "type-2186",
   "self_type" : "type-2186",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTDATATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMetaEventType",
     "field_offset" : 128,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "nMetaEventSize",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTrack",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE",
   "referenced_type" : "type-2185",
   "self_type" : "type-2185",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDIMETAEVENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannel",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIDProgram",
     "field_offset" : 128,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nIDSoundBank",
     "field_offset" : 144,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nUserSoundBankIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE",
   "referenced_type" : "type-2149",
   "self_type" : "type-2149",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDISOUNDBANKPROGRAMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumTracks",
     "field_offset" : 96,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nDuration",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPosition",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bVibra",
     "field_offset" : 192,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nNumMetaEvents",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumActiveVoices",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eMIDIPlayBackState",
     "field_offset" : 288,
     "referenced_type" : "type-2170"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "name" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE",
   "referenced_type" : "type-2175",
   "self_type" : "type-2175",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MIDISTATUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bMute",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_MUTETYPE",
   "name" : "OMX_AUDIO_CONFIG_MUTETYPE",
   "referenced_type" : "type-2190",
   "self_type" : "type-2190",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_MUTETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bNoiseReduction",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE",
   "referenced_type" : "type-2203",
   "self_type" : "type-2203",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_NOISEREDUCTIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "sRoomLevel",
     "field_offset" : 128,
     "referenced_type" : "type-1474"
    },
    {
     "field_name" : "sRoomHighFreqLevel",
     "field_offset" : 224,
     "referenced_type" : "type-1474"
    },
    {
     "field_name" : "sReflectionsLevel",
     "field_offset" : 320,
     "referenced_type" : "type-1474"
    },
    {
     "field_name" : "sReflectionsDelay",
     "field_offset" : 416,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "sReverbLevel",
     "field_offset" : 512,
     "referenced_type" : "type-1474"
    },
    {
     "field_name" : "sReverbDelay",
     "field_offset" : 608,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "sDecayTime",
     "field_offset" : 704,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "nDecayHighFreqRatio",
     "field_offset" : 800,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "nDensity",
     "field_offset" : 896,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDiffusion",
     "field_offset" : 928,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sReferenceHighFreq",
     "field_offset" : 960,
     "referenced_type" : "type-1473"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "name" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE",
   "referenced_type" : "type-2200",
   "self_type" : "type-2200",
   "size" : 132,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_REVERBERATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eWideningType",
     "field_offset" : 128,
     "referenced_type" : "type-2197"
    },
    {
     "field_name" : "nStereoWidening",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "name" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE",
   "referenced_type" : "type-2198",
   "self_type" : "type-2198",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_STEREOWIDENINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nTreble",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_TREBLETYPE",
   "name" : "OMX_AUDIO_CONFIG_TREBLETYPE",
   "referenced_type" : "type-2194",
   "self_type" : "type-2194",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_TREBLETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bLinear",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "sVolume",
     "field_offset" : 128,
     "referenced_type" : "type-1474"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_CONFIG_VOLUMETYPE",
   "name" : "OMX_AUDIO_CONFIG_VOLUMETYPE",
   "referenced_type" : "type-2187",
   "self_type" : "type-2187",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_CONFIG_VOLUMETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameLength",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAACtools",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAACERtools",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eAACProfile",
     "field_offset" : 320,
     "referenced_type" : "type-1675"
    },
    {
     "field_name" : "eAACStreamFormat",
     "field_offset" : 352,
     "referenced_type" : "type-1671"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 384,
     "referenced_type" : "type-1652"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_AACPROFILETYPE",
   "name" : "OMX_AUDIO_PARAM_AACPROFILETYPE",
   "referenced_type" : "type-1681",
   "self_type" : "type-1681",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_AACPROFILETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitsPerSample",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_ADPCMTYPE",
   "name" : "OMX_AUDIO_PARAM_ADPCMTYPE",
   "referenced_type" : "type-1791",
   "self_type" : "type-1791",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_ADPCMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eAMRBandMode",
     "field_offset" : 160,
     "referenced_type" : "type-1883"
    },
    {
     "field_name" : "eAMRDTXMode",
     "field_offset" : 192,
     "referenced_type" : "type-1896"
    },
    {
     "field_name" : "eAMRFrameFormat",
     "field_offset" : 224,
     "referenced_type" : "type-1873"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_AMRTYPE",
   "name" : "OMX_AUDIO_PARAM_AMRTYPE",
   "referenced_type" : "type-1907",
   "self_type" : "type-1907",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_AMRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "type-2017"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_EVRCTYPE",
   "name" : "OMX_AUDIO_PARAM_EVRCTYPE",
   "referenced_type" : "type-2049",
   "self_type" : "type-2049",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_EVRCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nCompressionLevel",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_FLACTYPE",
   "name" : "OMX_AUDIO_PARAM_FLACTYPE",
   "referenced_type" : "type-1704",
   "self_type" : "type-1704",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_FLACTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-1804"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 192,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_G723TYPE",
   "name" : "OMX_AUDIO_PARAM_G723TYPE",
   "referenced_type" : "type-1814",
   "self_type" : "type-1814",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_G723TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eG726Mode",
     "field_offset" : 128,
     "referenced_type" : "type-1824"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_G726TYPE",
   "name" : "OMX_AUDIO_PARAM_G726TYPE",
   "referenced_type" : "type-1837",
   "self_type" : "type-1837",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_G726TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eBitType",
     "field_offset" : 160,
     "referenced_type" : "type-1847"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_G729TYPE",
   "name" : "OMX_AUDIO_PARAM_G729TYPE",
   "referenced_type" : "type-1857",
   "self_type" : "type-1857",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_G729TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_GSMEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMEFRTYPE",
   "referenced_type" : "type-1940",
   "self_type" : "type-1940",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_GSMEFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_GSMFRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMFRTYPE",
   "referenced_type" : "type-1918",
   "self_type" : "type-1918",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_GSMFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_GSMHRTYPE",
   "name" : "OMX_AUDIO_PARAM_GSMHRTYPE",
   "referenced_type" : "type-1929",
   "self_type" : "type-1929",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_GSMHRTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDLSIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDLSSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pDLSData",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "eMidiSoundBank",
     "field_offset" : 256,
     "referenced_type" : "type-2105"
    },
    {
     "field_name" : "eMidiSoundBankLayout",
     "field_offset" : 288,
     "referenced_type" : "type-2117"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "name" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE",
   "referenced_type" : "type-2127",
   "self_type" : "type-2127",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_MIDILOADUSERSOUNDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFileSize",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sMaxPolyphony",
     "field_offset" : 128,
     "referenced_type" : "type-1473"
    },
    {
     "field_name" : "bLoadDefaultSound",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eMidiFormat",
     "field_offset" : 256,
     "referenced_type" : "type-2083"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_MIDITYPE",
   "name" : "OMX_AUDIO_PARAM_MIDITYPE",
   "referenced_type" : "type-2094",
   "self_type" : "type-2094",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_MIDITYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 224,
     "referenced_type" : "type-1652"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 256,
     "referenced_type" : "type-1657"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_MP3TYPE",
   "name" : "OMX_AUDIO_PARAM_MP3TYPE",
   "referenced_type" : "type-1666",
   "self_type" : "type-1666",
   "size" : 36,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_MP3TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eNumData",
     "field_offset" : 128,
     "referenced_type" : "type-1468"
    },
    {
     "field_name" : "eEndian",
     "field_offset" : 160,
     "referenced_type" : "type-1462"
    },
    {
     "field_name" : "bInterleaved",
     "field_offset" : 192,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nBitPerSample",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ePCMMode",
     "field_offset" : 288,
     "referenced_type" : "type-1632"
    },
    {
     "field_name" : "eChannelMapping",
     "field_offset" : 320,
     "referenced_type" : "type-1643"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PCMMODETYPE",
   "name" : "OMX_AUDIO_PARAM_PCMMODETYPE",
   "referenced_type" : "type-1642",
   "self_type" : "type-1642",
   "size" : 104,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PCMMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PDCEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCEFRTYPE",
   "referenced_type" : "type-1995",
   "self_type" : "type-1995",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PDCEFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PDCFRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCFRTYPE",
   "referenced_type" : "type-1984",
   "self_type" : "type-1984",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PDCFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PDCHRTYPE",
   "name" : "OMX_AUDIO_PARAM_PDCHRTYPE",
   "referenced_type" : "type-2006",
   "self_type" : "type-2006",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PDCHRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 128,
     "referenced_type" : "type-1619"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_AUDIO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-1628",
   "self_type" : "type-1628",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "type-2017"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_QCELP13TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP13TYPE",
   "referenced_type" : "type-2038",
   "self_type" : "type-2038",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_QCELP13TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 160,
     "referenced_type" : "type-2017"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_QCELP8TYPE",
   "name" : "OMX_AUDIO_PARAM_QCELP8TYPE",
   "referenced_type" : "type-2027",
   "self_type" : "type-2027",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_QCELP8TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitsPerFrame",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSamplePerFrame",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nCouplingQuantBits",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nCouplingStartRegion",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumRegions",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 320,
     "referenced_type" : "type-1748"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_RATYPE",
   "name" : "OMX_AUDIO_PARAM_RATYPE",
   "referenced_type" : "type-1758",
   "self_type" : "type-1758",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_RATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBlocks",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSubbands",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitPool",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableBitrate",
     "field_offset" : 288,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eChannelMode",
     "field_offset" : 320,
     "referenced_type" : "type-1652"
    },
    {
     "field_name" : "eSBCAllocType",
     "field_offset" : 352,
     "referenced_type" : "type-1771"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_SBCTYPE",
   "name" : "OMX_AUDIO_PARAM_SBCTYPE",
   "referenced_type" : "type-1781",
   "self_type" : "type-1781",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_SBCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCDMARate",
     "field_offset" : 128,
     "referenced_type" : "type-2017"
    },
    {
     "field_name" : "bRATE_REDUCon",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bNoiseSuppressor",
     "field_offset" : 288,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bPostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_SMVTYPE",
   "name" : "OMX_AUDIO_PARAM_SMVTYPE",
   "referenced_type" : "type-2061",
   "self_type" : "type-2061",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_SMVTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAEFRTYPE",
   "referenced_type" : "type-1973",
   "self_type" : "type-1973",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_TDMAEFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDTX",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bHiPassFilter",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_TDMAFRTYPE",
   "name" : "OMX_AUDIO_PARAM_TDMAFRTYPE",
   "referenced_type" : "type-1962",
   "self_type" : "type-1962",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_TDMAFRTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMinBitRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxBitRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSampleRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAudioBandWidth",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQuality",
     "field_offset" : 288,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bManaged",
     "field_offset" : 320,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bDownmix",
     "field_offset" : 352,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_VORBISTYPE",
   "name" : "OMX_AUDIO_PARAM_VORBISTYPE",
   "referenced_type" : "type-1693",
   "self_type" : "type-1693",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_VORBISTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nChannels",
     "field_offset" : 96,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 160,
     "referenced_type" : "type-1715"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 192,
     "referenced_type" : "type-1725"
    },
    {
     "field_name" : "nSamplingRate",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBlockAlign",
     "field_offset" : 256,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nEncodeOptions",
     "field_offset" : 272,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nSuperBlockAlign",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PARAM_WMATYPE",
   "name" : "OMX_AUDIO_PARAM_WMATYPE",
   "referenced_type" : "type-1738",
   "self_type" : "type-1738",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PARAM_WMATYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-254"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eEncoding",
     "field_offset" : 160,
     "referenced_type" : "type-1619"
    }
   ],
   "linker_set_key" : "OMX_AUDIO_PORTDEFINITIONTYPE",
   "name" : "OMX_AUDIO_PORTDEFINITIONTYPE",
   "referenced_type" : "type-1623",
   "self_type" : "type-1623",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Audio.h",
   "unique_id" : "OMX_AUDIO_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_BS32",
   "name" : "OMX_BS32",
   "referenced_type" : "type-1474",
   "self_type" : "type-1474",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_BS32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nValue",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMin",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMax",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_BU32",
   "name" : "OMX_BU32",
   "referenced_type" : "type-1473",
   "self_type" : "type-1473",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_BU32"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "pBuffer",
     "field_offset" : 64,
     "referenced_type" : "type-91"
    },
    {
     "field_name" : "nAllocLen",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFilledLen",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pAppPrivate",
     "field_offset" : 256,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pPlatformPrivate",
     "field_offset" : 320,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pInputPortPrivate",
     "field_offset" : 384,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pOutputPortPrivate",
     "field_offset" : 448,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "hMarkTargetComponent",
     "field_offset" : 512,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 576,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "nTickCount",
     "field_offset" : 640,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTimeStamp",
     "field_offset" : 704,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "nFlags",
     "field_offset" : 768,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nOutputPortIndex",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nInputPortIndex",
     "field_offset" : 832,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_BUFFERHEADERTYPE",
   "name" : "OMX_BUFFERHEADERTYPE",
   "referenced_type" : "type-1541",
   "self_type" : "type-1541",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_BUFFERHEADERTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EventHandler",
     "referenced_type" : "type-1595"
    },
    {
     "field_name" : "EmptyBufferDone",
     "field_offset" : 64,
     "referenced_type" : "type-1597"
    },
    {
     "field_name" : "FillBufferDone",
     "field_offset" : 128,
     "referenced_type" : "type-1597"
    }
   ],
   "linker_set_key" : "OMX_CALLBACKTYPE",
   "name" : "OMX_CALLBACKTYPE",
   "referenced_type" : "type-1594",
   "self_type" : "type-1594",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_CALLBACKTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pName",
     "referenced_type" : "type-124"
    },
    {
     "field_name" : "pInitialize",
     "field_offset" : 64,
     "referenced_type" : "type-1504"
    }
   ],
   "linker_set_key" : "OMX_COMPONENTREGISTERTYPE",
   "name" : "OMX_COMPONENTREGISTERTYPE",
   "referenced_type" : "type-1503",
   "self_type" : "type-1503",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_COMPONENTREGISTERTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "pComponentPrivate",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pApplicationPrivate",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "GetComponentVersion",
     "field_offset" : 192,
     "referenced_type" : "type-2362"
    },
    {
     "field_name" : "SendCommand",
     "field_offset" : 256,
     "referenced_type" : "type-2366"
    },
    {
     "field_name" : "GetParameter",
     "field_offset" : 320,
     "referenced_type" : "type-2368"
    },
    {
     "field_name" : "SetParameter",
     "field_offset" : 384,
     "referenced_type" : "type-2368"
    },
    {
     "field_name" : "GetConfig",
     "field_offset" : 448,
     "referenced_type" : "type-2368"
    },
    {
     "field_name" : "SetConfig",
     "field_offset" : 512,
     "referenced_type" : "type-2368"
    },
    {
     "field_name" : "GetExtensionIndex",
     "field_offset" : 576,
     "referenced_type" : "type-2370"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 640,
     "referenced_type" : "type-2373"
    },
    {
     "field_name" : "ComponentTunnelRequest",
     "field_offset" : 704,
     "referenced_type" : "type-2376"
    },
    {
     "field_name" : "UseBuffer",
     "field_offset" : 768,
     "referenced_type" : "type-2379"
    },
    {
     "field_name" : "AllocateBuffer",
     "field_offset" : 832,
     "referenced_type" : "type-2382"
    },
    {
     "field_name" : "FreeBuffer",
     "field_offset" : 896,
     "referenced_type" : "type-2384"
    },
    {
     "field_name" : "EmptyThisBuffer",
     "field_offset" : 960,
     "referenced_type" : "type-2386"
    },
    {
     "field_name" : "FillThisBuffer",
     "field_offset" : 1024,
     "referenced_type" : "type-2386"
    },
    {
     "field_name" : "SetCallbacks",
     "field_offset" : 1088,
     "referenced_type" : "type-2388"
    },
    {
     "field_name" : "ComponentDeInit",
     "field_offset" : 1152,
     "referenced_type" : "type-1504"
    },
    {
     "field_name" : "UseEGLImage",
     "field_offset" : 1216,
     "referenced_type" : "type-2391"
    },
    {
     "field_name" : "ComponentRoleEnum",
     "field_offset" : 1280,
     "referenced_type" : "type-2393"
    }
   ],
   "linker_set_key" : "OMX_COMPONENTTYPE",
   "name" : "OMX_COMPONENTTYPE",
   "referenced_type" : "type-2361",
   "self_type" : "type-2361",
   "size" : 168,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_COMPONENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBacklight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTimeout",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BACKLIGHTTYPE",
   "name" : "OMX_CONFIG_BACKLIGHTTYPE",
   "referenced_type" : "type-2231",
   "self_type" : "type-2231",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_BACKLIGHTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BOOLEANTYPE",
   "name" : "OMX_CONFIG_BOOLEANTYPE",
   "referenced_type" : "type-2345",
   "self_type" : "type-2345",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_BOOLEANTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBrightness",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "name" : "OMX_CONFIG_BRIGHTNESSTYPE",
   "referenced_type" : "type-2230",
   "self_type" : "type-2230",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_BRIGHTNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bContinuous",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bFrameLimited",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nFrameLimit",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CAPTUREMODETYPE",
   "name" : "OMX_CONFIG_CAPTUREMODETYPE",
   "referenced_type" : "type-2246",
   "self_type" : "type-2246",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_CAPTUREMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nRGBAlphaConstant",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eColorBlend",
     "field_offset" : 128,
     "referenced_type" : "type-2214"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORBLENDTYPE",
   "name" : "OMX_CONFIG_COLORBLENDTYPE",
   "referenced_type" : "type-2215",
   "self_type" : "type-2215",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORBLENDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "xColorMatrix",
     "field_offset" : 96,
     "referenced_type" : "type-2206"
    },
    {
     "field_name" : "xColorOffset",
     "field_offset" : 384,
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "name" : "OMX_CONFIG_COLORCONVERSIONTYPE",
   "referenced_type" : "type-2205",
   "self_type" : "type-2205",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORCONVERSIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bColorEnhancement",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nCustomizedU",
     "field_offset" : 128,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "nCustomizedV",
     "field_offset" : 136,
     "referenced_type" : "type-92"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "name" : "OMX_CONFIG_COLORENHANCEMENTTYPE",
   "referenced_type" : "type-2212",
   "self_type" : "type-2212",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORENHANCEMENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nARGBColor",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nARGBMask",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_COLORKEYTYPE",
   "name" : "OMX_CONFIG_COLORKEYTYPE",
   "referenced_type" : "type-2213",
   "self_type" : "type-2213",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_COLORKEYTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumNodes",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE",
   "referenced_type" : "type-2355",
   "self_type" : "type-2355",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_CONTAINERNODECOUNTTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nParentNodeID",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNodeIndex",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNodeID",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cNodeName",
     "field_offset" : 192,
     "referenced_type" : "type-254"
    },
    {
     "field_name" : "bIsLeafType",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTAINERNODEIDTYPE",
   "name" : "OMX_CONFIG_CONTAINERNODEIDTYPE",
   "referenced_type" : "type-2359",
   "self_type" : "type-2359",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_CONTAINERNODEIDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nContrast",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_CONTRASTTYPE",
   "name" : "OMX_CONFIG_CONTRASTTYPE",
   "referenced_type" : "type-2229",
   "self_type" : "type-2229",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_CONTRASTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eDither",
     "field_offset" : 96,
     "referenced_type" : "type-2243"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_DITHERTYPE",
   "name" : "OMX_CONFIG_DITHERTYPE",
   "referenced_type" : "type-2244",
   "self_type" : "type-2244",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_DITHERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eExposureControl",
     "field_offset" : 96,
     "referenced_type" : "type-2226"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "name" : "OMX_CONFIG_EXPOSURECONTROLTYPE",
   "referenced_type" : "type-2227",
   "self_type" : "type-2227",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_EXPOSURECONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eMetering",
     "field_offset" : 96,
     "referenced_type" : "type-2247"
    },
    {
     "field_name" : "xEVCompensation",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nApertureFNumber",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bAutoAperture",
     "field_offset" : 192,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nShutterSpeedMsec",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bAutoShutterSpeed",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nSensitivity",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bAutoSensitivity",
     "field_offset" : 320,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "name" : "OMX_CONFIG_EXPOSUREVALUETYPE",
   "referenced_type" : "type-2248",
   "self_type" : "type-2248",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_EXPOSUREVALUETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bCenter",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bLeft",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bRight",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bTop",
     "field_offset" : 192,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bBottom",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bTopLeft",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bTopRight",
     "field_offset" : 288,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bBottomLeft",
     "field_offset" : 320,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bBottomRight",
     "field_offset" : 352,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "name" : "OMX_CONFIG_FOCUSREGIONTYPE",
   "referenced_type" : "type-2250",
   "self_type" : "type-2250",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_FOCUSREGIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "xEncodeFramerate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FRAMERATETYPE",
   "name" : "OMX_CONFIG_FRAMERATETYPE",
   "referenced_type" : "type-2291",
   "self_type" : "type-2291",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_FRAMERATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bStab",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_FRAMESTABTYPE",
   "name" : "OMX_CONFIG_FRAMESTABTYPE",
   "referenced_type" : "type-2223",
   "self_type" : "type-2223",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_FRAMESTABTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nGamma",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_GAMMATYPE",
   "name" : "OMX_CONFIG_GAMMATYPE",
   "referenced_type" : "type-2232",
   "self_type" : "type-2232",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_GAMMATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eImageFilter",
     "field_offset" : 96,
     "referenced_type" : "type-2210"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "name" : "OMX_CONFIG_IMAGEFILTERTYPE",
   "referenced_type" : "type-2211",
   "self_type" : "type-2211",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_IMAGEFILTERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "IntraRefreshVOP",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "name" : "OMX_CONFIG_INTRAREFRESHVOPTYPE",
   "referenced_type" : "type-2292",
   "self_type" : "type-2292",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_INTRAREFRESHVOPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nLightness",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_LIGHTNESSTYPE",
   "name" : "OMX_CONFIG_LIGHTNESSTYPE",
   "referenced_type" : "type-2235",
   "self_type" : "type-2235",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_LIGHTNESSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nErrMapSize",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "ErrMap",
     "field_offset" : 128,
     "referenced_type" : "type-1572"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "name" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE",
   "referenced_type" : "type-2293",
   "self_type" : "type-2293",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_MACROBLOCKERRORMAPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "name" : "OMX_CONFIG_MBERRORREPORTINGTYPE",
   "referenced_type" : "type-2295",
   "self_type" : "type-2295",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_CONFIG_MBERRORREPORTINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "type-2351"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMetadataItemCount",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "name" : "OMX_CONFIG_METADATAITEMCOUNTTYPE",
   "referenced_type" : "type-2353",
   "self_type" : "type-2353",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_METADATAITEMCOUNTTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "eScopeMode",
     "field_offset" : 64,
     "referenced_type" : "type-2351"
    },
    {
     "field_name" : "nScopeSpecifier",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMetadataItemIndex",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eSearchMode",
     "field_offset" : 160,
     "referenced_type" : "type-2352"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 192,
     "referenced_type" : "type-2350"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 224,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 232,
     "referenced_type" : "type-1530"
    },
    {
     "field_name" : "eValueCharset",
     "field_offset" : 1280,
     "referenced_type" : "type-2350"
    },
    {
     "field_name" : "sLanguageCountry",
     "field_offset" : 1344,
     "referenced_type" : "type-254"
    },
    {
     "field_name" : "nValueMaxSize",
     "field_offset" : 1408,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nValueSizeUsed",
     "field_offset" : 1440,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nValue",
     "field_offset" : 1472,
     "referenced_type" : "type-1572"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_METADATAITEMTYPE",
   "name" : "OMX_CONFIG_METADATAITEMTYPE",
   "referenced_type" : "type-2354",
   "self_type" : "type-2354",
   "size" : 192,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_CONFIG_METADATAITEMTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eMirror",
     "field_offset" : 96,
     "referenced_type" : "type-2218"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_MIRRORTYPE",
   "name" : "OMX_CONFIG_MIRRORTYPE",
   "referenced_type" : "type-2219",
   "self_type" : "type-2219",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_MIRRORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDepth",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAlpha",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_PLANEBLENDTYPE",
   "name" : "OMX_CONFIG_PLANEBLENDTYPE",
   "referenced_type" : "type-2236",
   "self_type" : "type-2236",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_PLANEBLENDTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nX",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nY",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_POINTTYPE",
   "name" : "OMX_CONFIG_POINTTYPE",
   "referenced_type" : "type-2220",
   "self_type" : "type-2220",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_POINTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nLeft",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nTop",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_RECTTYPE",
   "name" : "OMX_CONFIG_RECTTYPE",
   "referenced_type" : "type-2221",
   "self_type" : "type-2221",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_RECTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nRotation",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_ROTATIONTYPE",
   "name" : "OMX_CONFIG_ROTATIONTYPE",
   "referenced_type" : "type-2217",
   "self_type" : "type-2217",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_ROTATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSaturation",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_SATURATIONTYPE",
   "name" : "OMX_CONFIG_SATURATIONTYPE",
   "referenced_type" : "type-2233",
   "self_type" : "type-2233",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_SATURATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "xWidth",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "xHeight",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_SCALEFACTORTYPE",
   "name" : "OMX_CONFIG_SCALEFACTORTYPE",
   "referenced_type" : "type-2209",
   "self_type" : "type-2209",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_SCALEFACTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eEffect",
     "field_offset" : 96,
     "referenced_type" : "type-2238"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "name" : "OMX_CONFIG_TRANSITIONEFFECTTYPE",
   "referenced_type" : "type-2239",
   "self_type" : "type-2239",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_TRANSITIONEFFECTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eWhiteBalControl",
     "field_offset" : 96,
     "referenced_type" : "type-2224"
    }
   ],
   "linker_set_key" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "name" : "OMX_CONFIG_WHITEBALCONTROLTYPE",
   "referenced_type" : "type-2225",
   "self_type" : "type-2225",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_CONFIG_WHITEBALCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nWidth",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nHeight",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_FRAMESIZETYPE",
   "name" : "OMX_FRAMESIZETYPE",
   "referenced_type" : "type-2216",
   "self_type" : "type-2216",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_FRAMESIZETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFocusControl",
     "field_offset" : 96,
     "referenced_type" : "type-2308"
    },
    {
     "field_name" : "nFocusSteps",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFocusStepIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "name" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE",
   "referenced_type" : "type-2309",
   "self_type" : "type-2309",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_CONFIG_FOCUSCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFlashControl",
     "field_offset" : 96,
     "referenced_type" : "type-2305"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "name" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE",
   "referenced_type" : "type-2307",
   "self_type" : "type-2307",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_FLASHCONTROLTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eHuffmanTable",
     "field_offset" : 96,
     "referenced_type" : "type-2314"
    },
    {
     "field_name" : "nNumberOfHuffmanCodeOfLength",
     "field_offset" : 128,
     "referenced_type" : "type-2316"
    },
    {
     "field_name" : "nHuffmanTable",
     "field_offset" : 256,
     "referenced_type" : "type-2317"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE",
   "referenced_type" : "type-2315",
   "self_type" : "type-2315",
   "size" : 288,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_HUFFMANTTABLETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "type-2302"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "type-2204"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "name" : "OMX_IMAGE_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-2304",
   "self_type" : "type-2304",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQFactor",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_QFACTORTYPE",
   "name" : "OMX_IMAGE_PARAM_QFACTORTYPE",
   "referenced_type" : "type-2310",
   "self_type" : "type-2310",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_QFACTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eQuantizationTable",
     "field_offset" : 96,
     "referenced_type" : "type-2311"
    },
    {
     "field_name" : "nQuantizationMatrix",
     "field_offset" : 128,
     "referenced_type" : "type-2313"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "name" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE",
   "referenced_type" : "type-2312",
   "self_type" : "type-2312",
   "size" : 80,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PARAM_QUANTIZATIONTABLETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-254"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 288,
     "referenced_type" : "type-2302"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 320,
     "referenced_type" : "type-2204"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 384,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "OMX_IMAGE_PORTDEFINITIONTYPE",
   "name" : "OMX_IMAGE_PORTDEFINITIONTYPE",
   "referenced_type" : "type-2303",
   "self_type" : "type-2303",
   "size" : 56,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Image.h",
   "unique_id" : "OMX_IMAGE_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hMarkTargetComponent",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pMarkData",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "OMX_MARKTYPE",
   "name" : "OMX_MARKTYPE",
   "referenced_type" : "type-1480",
   "self_type" : "type-1480",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_MARKTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "bEnablePM",
     "field_offset" : 64,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_OTHER_CONFIG_POWERTYPE",
   "name" : "OMX_OTHER_CONFIG_POWERTYPE",
   "referenced_type" : "type-2332",
   "self_type" : "type-2332",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_CONFIG_POWERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    }
   ],
   "linker_set_key" : "OMX_OTHER_CONFIG_STATSTYPE",
   "name" : "OMX_OTHER_CONFIG_STATSTYPE",
   "referenced_type" : "type-2333",
   "self_type" : "type-2333",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_CONFIG_STATSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eType",
     "field_offset" : 96,
     "referenced_type" : "type-1559"
    },
    {
     "field_name" : "nDataSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "type-1572"
    }
   ],
   "linker_set_key" : "OMX_OTHER_EXTRADATATYPE",
   "name" : "OMX_OTHER_EXTRADATATYPE",
   "referenced_type" : "type-1571",
   "self_type" : "type-1571",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_OTHER_EXTRADATATYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 128,
     "referenced_type" : "type-2319"
    }
   ],
   "linker_set_key" : "OMX_OTHER_PARAM_PORTFORMATTYPE",
   "name" : "OMX_OTHER_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-2336",
   "self_type" : "type-2336",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "eFormat",
     "referenced_type" : "type-2319"
    }
   ],
   "linker_set_key" : "OMX_OTHER_PORTDEFINITIONTYPE",
   "name" : "OMX_OTHER_PORTDEFINITIONTYPE",
   "referenced_type" : "type-2334",
   "self_type" : "type-2334",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_OTHER_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eBufferSupplier",
     "field_offset" : 96,
     "referenced_type" : "type-1600"
    }
   ],
   "linker_set_key" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "name" : "OMX_PARAM_BUFFERSUPPLIERTYPE",
   "referenced_type" : "type-1608",
   "self_type" : "type-1608",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PARAM_BUFFERSUPPLIERTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "cRole",
     "field_offset" : 64,
     "referenced_type" : "type-1530"
    }
   ],
   "linker_set_key" : "OMX_PARAM_COMPONENTROLETYPE",
   "name" : "OMX_PARAM_COMPONENTROLETYPE",
   "referenced_type" : "type-1529",
   "self_type" : "type-1529",
   "size" : 136,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PARAM_COMPONENTROLETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "hPipe",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "OMX_PARAM_CONTENTPIPETYPE",
   "name" : "OMX_PARAM_CONTENTPIPETYPE",
   "referenced_type" : "type-2348",
   "self_type" : "type-2348",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_CONTENTPIPETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "contentURI",
     "field_offset" : 64,
     "referenced_type" : "type-1572"
    }
   ],
   "linker_set_key" : "OMX_PARAM_CONTENTURITYPE",
   "name" : "OMX_PARAM_CONTENTURITYPE",
   "referenced_type" : "type-2347",
   "self_type" : "type-2347",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_CONTENTURITYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eUnitType",
     "field_offset" : 96,
     "referenced_type" : "type-2240"
    },
    {
     "field_name" : "eEncapsulationType",
     "field_offset" : 128,
     "referenced_type" : "type-2241"
    }
   ],
   "linker_set_key" : "OMX_PARAM_DATAUNITTYPE",
   "name" : "OMX_PARAM_DATAUNITTYPE",
   "referenced_type" : "type-2242",
   "self_type" : "type-2242",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_DATAUNITTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bDeblocking",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_PARAM_DEBLOCKINGTYPE",
   "name" : "OMX_PARAM_DEBLOCKINGTYPE",
   "referenced_type" : "type-2222",
   "self_type" : "type-2222",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_DEBLOCKINGTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFocusStatus",
     "field_offset" : 96,
     "referenced_type" : "type-2251"
    },
    {
     "field_name" : "bCenterStatus",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bLeftStatus",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bRightStatus",
     "field_offset" : 192,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bTopStatus",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bBottomStatus",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bTopLeftStatus",
     "field_offset" : 288,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bTopRightStatus",
     "field_offset" : 320,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bBottomLeftStatus",
     "field_offset" : 352,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bBottomRightStatus",
     "field_offset" : 384,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "name" : "OMX_PARAM_FOCUSSTATUSTYPE",
   "referenced_type" : "type-2252",
   "self_type" : "type-2252",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_FOCUSSTATUSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnable",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nInterleavePortIndex",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PARAM_INTERLEAVETYPE",
   "name" : "OMX_PARAM_INTERLEAVETYPE",
   "referenced_type" : "type-2237",
   "self_type" : "type-2237",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_INTERLEAVETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMacroblocks",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PARAM_MACROBLOCKSTYPE",
   "name" : "OMX_PARAM_MACROBLOCKSTYPE",
   "referenced_type" : "type-2297",
   "self_type" : "type-2297",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_PARAM_MACROBLOCKSTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "bAllKeys",
     "field_offset" : 64,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eKeyCharset",
     "field_offset" : 96,
     "referenced_type" : "type-2350"
    },
    {
     "field_name" : "nKeySizeUsed",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nKey",
     "field_offset" : 160,
     "referenced_type" : "type-1530"
    },
    {
     "field_name" : "nLanguageCountrySizeUsed",
     "field_offset" : 1184,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nLanguageCountry",
     "field_offset" : 1216,
     "referenced_type" : "type-1530"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 2240,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_PARAM_METADATAFILTERTYPE",
   "name" : "OMX_PARAM_METADATAFILTERTYPE",
   "referenced_type" : "type-2360",
   "self_type" : "type-2360",
   "size" : 284,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_METADATAFILTERTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eDir",
     "field_offset" : 96,
     "referenced_type" : "type-1456"
    },
    {
     "field_name" : "nBufferCountActual",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBufferCountMin",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBufferSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnabled",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bPopulated",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eDomain",
     "field_offset" : 288,
     "referenced_type" : "type-2337"
    },
    {
     "field_name" : "format",
     "field_offset" : 320,
     "referenced_type" : "type-2339"
    },
    {
     "field_name" : "bBuffersContiguous",
     "field_offset" : 832,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nBufferAlignment",
     "field_offset" : 864,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PARAM_PORTDEFINITIONTYPE",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE",
   "referenced_type" : "type-2338",
   "self_type" : "type-2338",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "audio",
     "referenced_type" : "type-1623"
    },
    {
     "field_name" : "video",
     "referenced_type" : "type-2254"
    },
    {
     "field_name" : "image",
     "referenced_type" : "type-2303"
    },
    {
     "field_name" : "other",
     "referenced_type" : "type-2334"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5",
   "name" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5",
   "record_kind" : "union",
   "referenced_type" : "type-2339",
   "self_type" : "type-2339",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_PORTDEFINITIONTYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h:95:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bOneShot",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "sFrameSize",
     "field_offset" : 160,
     "referenced_type" : "type-2216"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SENSORMODETYPE",
   "name" : "OMX_PARAM_SENSORMODETYPE",
   "referenced_type" : "type-2228",
   "self_type" : "type-2228",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_IVCommon.h",
   "unique_id" : "OMX_PARAM_SENSORMODETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "ePolicy",
     "field_offset" : 64,
     "referenced_type" : "type-2341"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "name" : "OMX_PARAM_SUSPENSIONPOLICYTYPE",
   "referenced_type" : "type-2342",
   "self_type" : "type-2342",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_SUSPENSIONPOLICYTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "type-2343"
    }
   ],
   "linker_set_key" : "OMX_PARAM_SUSPENSIONTYPE",
   "name" : "OMX_PARAM_SUSPENSIONTYPE",
   "referenced_type" : "type-2344",
   "self_type" : "type-2344",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_SUSPENSIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nU32",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PARAM_U32TYPE",
   "name" : "OMX_PARAM_U32TYPE",
   "referenced_type" : "type-2340",
   "self_type" : "type-2340",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_PARAM_U32TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPorts",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStartPortNumber",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PORT_PARAM_TYPE",
   "name" : "OMX_PORT_PARAM_TYPE",
   "referenced_type" : "type-1584",
   "self_type" : "type-1584",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PORT_PARAM_TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nGroupPriority",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nGroupID",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_PRIORITYMGMTTYPE",
   "name" : "OMX_PRIORITYMGMTTYPE",
   "referenced_type" : "type-1522",
   "self_type" : "type-1522",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_PRIORITYMGMTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "bResourceConcealmentForbidden",
     "field_offset" : 64,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_RESOURCECONCEALMENTTYPE",
   "name" : "OMX_RESOURCECONCEALMENTTYPE",
   "referenced_type" : "type-2349",
   "self_type" : "type-2349",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Component.h",
   "unique_id" : "OMX_RESOURCECONCEALMENTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "eClock",
     "field_offset" : 64,
     "referenced_type" : "type-2325"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "name" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE",
   "referenced_type" : "type-2331",
   "self_type" : "type-2331",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_ACTIVEREFCLOCKTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "eState",
     "field_offset" : 64,
     "referenced_type" : "type-2326"
    },
    {
     "field_name" : "nStartTime",
     "field_offset" : 128,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "nWaitMask",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "name" : "OMX_TIME_CONFIG_CLOCKSTATETYPE",
   "referenced_type" : "type-2330",
   "self_type" : "type-2330",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_CLOCKSTATETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pClientPrivate",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 192,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 256,
     "referenced_type" : "type-156"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "name" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE",
   "referenced_type" : "type-2327",
   "self_type" : "type-2327",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_MEDIATIMEREQUESTTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_SCALETYPE",
   "name" : "OMX_TIME_CONFIG_SCALETYPE",
   "referenced_type" : "type-2329",
   "self_type" : "type-2329",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_SCALETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "eType",
     "field_offset" : 64,
     "referenced_type" : "type-2320"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_SEEKMODETYPE",
   "name" : "OMX_TIME_CONFIG_SEEKMODETYPE",
   "referenced_type" : "type-2321",
   "self_type" : "type-2321",
   "size" : 12,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_SEEKMODETYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTimestamp",
     "field_offset" : 128,
     "referenced_type" : "type-156"
    }
   ],
   "linker_set_key" : "OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "name" : "OMX_TIME_CONFIG_TIMESTAMPTYPE",
   "referenced_type" : "type-2322",
   "self_type" : "type-2322",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_CONFIG_TIMESTAMPTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nClientPrivate",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eUpdateType",
     "field_offset" : 96,
     "referenced_type" : "type-2323"
    },
    {
     "field_name" : "nMediaTimestamp",
     "field_offset" : 128,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "nOffset",
     "field_offset" : 192,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "nWallTimeAtMediaTime",
     "field_offset" : 256,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "xScale",
     "field_offset" : 320,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "eState",
     "field_offset" : 352,
     "referenced_type" : "type-2326"
    }
   ],
   "linker_set_key" : "OMX_TIME_MEDIATIMETYPE",
   "name" : "OMX_TIME_MEDIATIMETYPE",
   "referenced_type" : "type-2328",
   "self_type" : "type-2328",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Other.h",
   "unique_id" : "OMX_TIME_MEDIATIMETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTunnelFlags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eSupplier",
     "field_offset" : 32,
     "referenced_type" : "type-1600"
    }
   ],
   "linker_set_key" : "OMX_TUNNELSETUPTYPE",
   "name" : "OMX_TUNNELSETUPTYPE",
   "referenced_type" : "type-1614",
   "self_type" : "type-1614",
   "size" : 8,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Core.h",
   "unique_id" : "OMX_TUNNELSETUPTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s",
     "referenced_type" : "type-1484"
    },
    {
     "field_name" : "nVersion",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VERSIONTYPE",
   "name" : "OMX_VERSIONTYPE",
   "record_kind" : "union",
   "referenced_type" : "type-1483",
   "self_type" : "type-1483",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_VERSIONTYPE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nVersionMajor",
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "nVersionMinor",
     "field_offset" : 8,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "nRevision",
     "field_offset" : 16,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "nStep",
     "field_offset" : 24,
     "referenced_type" : "type-92"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5",
   "name" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5",
   "referenced_type" : "type-1484",
   "self_type" : "type-1484",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h",
   "unique_id" : "OMX_VERSIONTYPE::(anonymous struct at frameworks/native/headers/media_plugin/media/openmax/OMX_Types.h:376:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIDRPeriod",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "name" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD",
   "referenced_type" : "type-2300",
   "self_type" : "type-2300",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_AVCINTRAPERIOD"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nEncodeBitrate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "name" : "OMX_VIDEO_CONFIG_BITRATETYPE",
   "referenced_type" : "type-2290",
   "self_type" : "type-2290",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_BITRATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNaluBytes",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_CONFIG_NALSIZE",
   "name" : "OMX_VIDEO_CONFIG_NALSIZE",
   "referenced_type" : "type-2301",
   "self_type" : "type-2301",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_CONFIG_NALSIZE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumSliceGroups",
     "field_offset" : 96,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "nSliceGroupMapType",
     "field_offset" : 104,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "eSliceMode",
     "field_offset" : 128,
     "referenced_type" : "type-2298"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "name" : "OMX_VIDEO_PARAM_AVCSLICEFMO",
   "referenced_type" : "type-2299",
   "self_type" : "type-2299",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_AVCSLICEFMO"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bUseHadamard",
     "field_offset" : 192,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nRefFrames",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nRefIdx10ActiveMinus1",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nRefIdx11ActiveMinus1",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableUEP",
     "field_offset" : 320,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bEnableFMO",
     "field_offset" : 352,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bEnableASO",
     "field_offset" : 384,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bEnableRS",
     "field_offset" : 416,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 448,
     "referenced_type" : "type-2284"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 480,
     "referenced_type" : "type-2286"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bFrameMBsOnly",
     "field_offset" : 544,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bMBAFF",
     "field_offset" : 576,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bEntropyCodingCABAC",
     "field_offset" : 608,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bWeightedPPrediction",
     "field_offset" : 640,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nWeightedBipredicitonMode",
     "field_offset" : 672,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bconstIpred",
     "field_offset" : 704,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bDirect8x8Inference",
     "field_offset" : 736,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bDirectSpatialTemporal",
     "field_offset" : 768,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nCabacInitIdc",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eLoopFilterMode",
     "field_offset" : 832,
     "referenced_type" : "type-2287"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_AVCTYPE",
   "name" : "OMX_VIDEO_PARAM_AVCTYPE",
   "referenced_type" : "type-2288",
   "self_type" : "type-2288",
   "size" : 108,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_AVCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eControlRate",
     "field_offset" : 96,
     "referenced_type" : "type-2258"
    },
    {
     "field_offset" : 128,
     "referenced_type" : "type-2260"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE",
   "referenced_type" : "type-2259",
   "self_type" : "type-2259",
   "size" : 20,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_BITRATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nTargetBitrate",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQualityFactor",
     "referenced_type" : "type-2"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5",
   "name" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5) at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5",
   "record_kind" : "union",
   "referenced_type" : "type-2260",
   "self_type" : "type-2260",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_BITRATETYPE::(anonymous union at frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h:269:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableHEC",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bEnableResync",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nResynchMarkerSpacing",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableDataPartitioning",
     "field_offset" : 192,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bEnableRVLC",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "name" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE",
   "referenced_type" : "type-2266",
   "self_type" : "type-2266",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_ERRORCORRECTIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "type-2268"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "type-2269"
    },
    {
     "field_name" : "bPLUSPTYPEAllowed",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bForceRoundingTypeToZero",
     "field_offset" : 288,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nPictureHeaderRepetition",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nGOBHeaderInterval",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_H263TYPE",
   "name" : "OMX_VIDEO_PARAM_H263TYPE",
   "referenced_type" : "type-2272",
   "self_type" : "type-2272",
   "size" : 48,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_H263TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eRefreshMode",
     "field_offset" : 96,
     "referenced_type" : "type-2264"
    },
    {
     "field_name" : "nAirMBs",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nAirRef",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nCirMBs",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "name" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE",
   "referenced_type" : "type-2265",
   "self_type" : "type-2265",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_INTRAREFRESHTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eAccuracy",
     "field_offset" : 96,
     "referenced_type" : "type-2262"
    },
    {
     "field_name" : "bUnrestrictedMVs",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bFourMV",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "sXSearchRange",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "sYSearchRange",
     "field_offset" : 224,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "name" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE",
   "referenced_type" : "type-2263",
   "self_type" : "type-2263",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MOTIONVECTORTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 160,
     "referenced_type" : "type-2273"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 192,
     "referenced_type" : "type-2274"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG2TYPE",
   "referenced_type" : "type-2275",
   "self_type" : "type-2275",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MPEG2TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSliceHeaderSpacing",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bSVH",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bGov",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nPFrames",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBFrames",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIDCVLCThreshold",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bACPred",
     "field_offset" : 288,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nMaxPacketSize",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nTimeIncRes",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 384,
     "referenced_type" : "type-2276"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 416,
     "referenced_type" : "type-2277"
    },
    {
     "field_name" : "nAllowedPictureTypes",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nHeaderExtension",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bReversibleVLC",
     "field_offset" : 512,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "name" : "OMX_VIDEO_PARAM_MPEG4TYPE",
   "referenced_type" : "type-2278",
   "self_type" : "type-2278",
   "size" : 68,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_MPEG4TYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nIndex",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 128,
     "referenced_type" : "type-2253"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 160,
     "referenced_type" : "type-2204"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "name" : "OMX_VIDEO_PARAM_PORTFORMATTYPE",
   "referenced_type" : "type-2255",
   "self_type" : "type-2255",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_PORTFORMATTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eProfile",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eLevel",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nProfileIndex",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "name" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE",
   "referenced_type" : "type-2289",
   "self_type" : "type-2289",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_PROFILELEVELTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQpI",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQpP",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nQpB",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "name" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE",
   "referenced_type" : "type-2256",
   "self_type" : "type-2256",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_QUANTIZATIONTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "type-2281"
    },
    {
     "field_name" : "nBitsPerPixel",
     "field_offset" : 128,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nPaddedWidth",
     "field_offset" : 144,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nPaddedHeight",
     "field_offset" : 160,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "nFrameRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitstreamFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitstreamVersion",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nMaxEncodeFrameSize",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnablePostFilter",
     "field_offset" : 320,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bEnableTemporalInterpolation",
     "field_offset" : 352,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bEnableLatencyMode",
     "field_offset" : 384,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_RVTYPE",
   "name" : "OMX_VIDEO_PARAM_RVTYPE",
   "referenced_type" : "type-2283",
   "self_type" : "type-2283",
   "size" : 52,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_RVTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "b16x16",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "b16x8",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "b8x16",
     "field_offset" : 160,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "b8x8",
     "field_offset" : 192,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "b8x4",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "b4x8",
     "field_offset" : 256,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "b4x4",
     "field_offset" : 288,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "name" : "OMX_VIDEO_PARAM_VBSMCTYPE",
   "referenced_type" : "type-2267",
   "self_type" : "type-2267",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_VBSMCTYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bEnableVFU",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nFirstGOB",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFirstMB",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nNumMBs",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "name" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE",
   "referenced_type" : "type-2257",
   "self_type" : "type-2257",
   "size" : 28,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_VIDEOFASTUPDATETYPE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "eFormat",
     "field_offset" : 96,
     "referenced_type" : "type-2279"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PARAM_WMVTYPE",
   "name" : "OMX_VIDEO_PARAM_WMVTYPE",
   "referenced_type" : "type-2280",
   "self_type" : "type-2280",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PARAM_WMVTYPE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cMIMEType",
     "referenced_type" : "type-254"
    },
    {
     "field_name" : "pNativeRender",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nBitrate",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "xFramerate",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bFlagErrorConcealment",
     "field_offset" : 320,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "eCompressionFormat",
     "field_offset" : 352,
     "referenced_type" : "type-2253"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 384,
     "referenced_type" : "type-2204"
    },
    {
     "field_name" : "pNativeWindow",
     "field_offset" : 448,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "name" : "OMX_VIDEO_PORTDEFINITIONTYPE",
   "referenced_type" : "type-2254",
   "self_type" : "type-2254",
   "size" : 64,
   "source_file" : "/frameworks/native/headers/media_plugin/media/openmax/OMX_Video.h",
   "unique_id" : "OMX_VIDEO_PORTDEFINITIONTYPE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1167"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "d_",
     "field_offset" : 64,
     "referenced_type" : "type-1198"
    },
    {
     "access" : "private",
     "field_name" : "s_",
     "field_offset" : 128,
     "referenced_type" : "type-1199"
    }
   ],
   "linker_set_key" : "Renamer",
   "name" : "Renamer",
   "record_kind" : "class",
   "referenced_type" : "type-1197",
   "self_type" : "type-1197",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSZN7android14ReferenceMover15move_referencesINS_13GraphicBufferEEEvPNS_2spIT_EEPKS5_mE7Renamer",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIZN7android14ReferenceMover15move_referencesINS_13GraphicBufferEEEvPNS_2spIT_EEPKS5_mE7Renamer"
    },
    {
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_13GraphicBufferEEEvPNS_2spIT_EEPKS5_mENK7RenamerclEm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_13GraphicBufferEEEvPNS_2spIT_EEPKS5_mEN7RenamerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_13GraphicBufferEEEvPNS_2spIT_EEPKS5_mEN7RenamerD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::AData<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::AData<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1043",
   "self_type" : "type-1043",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AData.h",
   "unique_id" : "_ZTSN7android5ADataIJilmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ADebug",
   "name" : "android::ADebug",
   "referenced_type" : "type-2285",
   "self_type" : "type-2285",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ADebug.h",
   "unique_id" : "_ZTSN7android6ADebugE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-54"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mID",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 192,
     "referenced_type" : "type-246"
    },
    {
     "access" : "private",
     "field_name" : "mVerboseStats",
     "field_offset" : 320,
     "referenced_type" : "type-95"
    },
    {
     "access" : "private",
     "field_name" : "mMessageCounter",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMessages",
     "field_offset" : 384,
     "referenced_type" : "type-140"
    }
   ],
   "linker_set_key" : "android::AHandler",
   "name" : "android::AHandler",
   "referenced_type" : "type-264",
   "self_type" : "type-264",
   "size" : 88,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AHandler.h",
   "unique_id" : "_ZTSN7android8AHandlerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8AHandlerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AHandlerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AHandlerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8AHandler17onMessageReceivedERKNS_2spINS_8AMessageEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-264"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTarget",
     "field_offset" : 704,
     "referenced_type" : "type-564"
    }
   ],
   "linker_set_key" : "android::AHandlerReflector<android::GraphicBufferSource>",
   "name" : "android::AHandlerReflector<android::GraphicBufferSource>",
   "referenced_type" : "type-583",
   "self_type" : "type-583",
   "size" : 104,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AHandlerReflector.h",
   "template_args" : [ "type-566" ],
   "unique_id" : "_ZTSN7android17AHandlerReflectorINS_19GraphicBufferSourceEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android17AHandlerReflectorINS_19GraphicBufferSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android17AHandlerReflectorINS_19GraphicBufferSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android17AHandlerReflectorINS_19GraphicBufferSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android17AHandlerReflectorINS_19GraphicBufferSourceEE17onMessageReceivedERKNS_2spINS_8AMessageEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-54"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 128,
     "referenced_type" : "type-249"
    },
    {
     "access" : "private",
     "field_name" : "mQueueChangedCondition",
     "field_offset" : 448,
     "referenced_type" : "type-251"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 832,
     "referenced_type" : "type-253"
    },
    {
     "access" : "private",
     "field_name" : "mEventQueue",
     "field_offset" : 1024,
     "referenced_type" : "type-255"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 1152,
     "referenced_type" : "type-274"
    },
    {
     "access" : "private",
     "field_name" : "mRunningLocally",
     "field_offset" : 1216,
     "referenced_type" : "type-95"
    },
    {
     "access" : "private",
     "field_name" : "mRepliesLock",
     "field_offset" : 1248,
     "referenced_type" : "type-249"
    },
    {
     "access" : "private",
     "field_name" : "mRepliesCondition",
     "field_offset" : 1568,
     "referenced_type" : "type-251"
    }
   ],
   "linker_set_key" : "android::ALooper",
   "name" : "android::ALooper",
   "referenced_type" : "type-248",
   "self_type" : "type-248",
   "size" : 248,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ALooper.h",
   "unique_id" : "_ZTSN7android7ALooperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7ALooperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ALooperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7ALooperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mWhenUs",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-259"
    }
   ],
   "linker_set_key" : "android::ALooper::Event",
   "name" : "android::ALooper::Event",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ALooper.h",
   "unique_id" : "_ZTSN7android7ALooper5EventE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-54"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mWhat",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mTarget",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mHandler",
     "field_offset" : 192,
     "referenced_type" : "type-262"
    },
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 320,
     "referenced_type" : "type-246"
    },
    {
     "access" : "private",
     "field_name" : "mItems",
     "field_offset" : 448,
     "referenced_type" : "type-265"
    },
    {
     "access" : "private",
     "field_name" : "mNumItems",
     "field_offset" : 20928,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::AMessage",
   "name" : "android::AMessage",
   "referenced_type" : "type-261",
   "self_type" : "type-261",
   "size" : 2624,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8AMessageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AMessageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8AMessageD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "u",
     "referenced_type" : "type-267"
    },
    {
     "field_name" : "mName",
     "field_offset" : 128,
     "referenced_type" : "type-124"
    },
    {
     "field_name" : "mNameLength",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "mType",
     "field_offset" : 256,
     "referenced_type" : "type-273"
    }
   ],
   "linker_set_key" : "android::AMessage::Item",
   "name" : "android::AMessage::Item",
   "referenced_type" : "type-266",
   "self_type" : "type-266",
   "size" : 40,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessage4ItemE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int32Value",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "int64Value",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "sizeValue",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "floatValue",
     "referenced_type" : "type-268"
    },
    {
     "field_name" : "doubleValue",
     "referenced_type" : "type-269"
    },
    {
     "field_name" : "ptrValue",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "refValue",
     "referenced_type" : "type-270"
    },
    {
     "field_name" : "stringValue",
     "referenced_type" : "type-271"
    },
    {
     "field_name" : "rectValue",
     "referenced_type" : "type-272"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::AMessage::Item::(anonymous union at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9) at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9",
   "name" : "android::AMessage::Item::(anonymous union at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9) at frameworks/av/media/libstagefright/include/media/stagefright/foundation/AMessage.h:277:9",
   "record_kind" : "union",
   "referenced_type" : "type-267",
   "self_type" : "type-267",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessage4ItemUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mLeft",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "mTop",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "mRight",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "mBottom",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::AMessage::Rect",
   "name" : "android::AMessage::Rect",
   "referenced_type" : "type-272",
   "self_type" : "type-272",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android8AMessage4RectE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-54"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 128,
     "referenced_type" : "type-246"
    },
    {
     "access" : "private",
     "field_name" : "mReply",
     "field_offset" : 256,
     "referenced_type" : "type-259"
    },
    {
     "access" : "private",
     "field_name" : "mReplied",
     "field_offset" : 320,
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "android::AReplyToken",
   "name" : "android::AReplyToken",
   "referenced_type" : "type-1044",
   "self_type" : "type-1044",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android11AReplyTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AReplyTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mData",
     "referenced_type" : "type-254"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "mAllocSize",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::AString",
   "name" : "android::AString",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AString.h",
   "unique_id" : "_ZTSN7android7AStringE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-53"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 64,
     "referenced_type" : "type-70"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "android::BBinder",
   "name" : "android::BBinder",
   "record_kind" : "class",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android7BBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-78"
    },
    {
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IConsumerListener>",
   "name" : "android::BnInterface<android::IConsumerListener>",
   "record_kind" : "class",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_17IConsumerListenerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener12onDisconnectEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener16onFrameAvailableERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameReplacedERKNS_10BufferItemE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener17onBuffersReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener23onSidebandStreamChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener24addAndGetFrameTimestampsEPKNS_19NewFrameEventsEntryEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_17IConsumerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IConsumerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn16_NK7android11BnInterfaceINS_17IConsumerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-68"
    },
    {
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IGraphicBufferConsumer>",
   "name" : "android::BnInterface<android::IGraphicBufferConsumer>",
   "record_kind" : "class",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_22IGraphicBufferConsumerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_22IGraphicBufferConsumerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer13acquireBufferEPNS_10BufferItemElm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer13releaseBufferEimPvS1_RKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer15consumerConnectERKNS_2spINS_17IConsumerListenerEEEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18consumerDisconnectEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18getReleasedBuffersEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer20setDefaultBufferSizeEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer17setMaxBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer25setMaxAcquiredBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer15setConsumerNameERKNS_7String8E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer22setDefaultBufferFormatEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer25setDefaultBufferDataSpaceE19android_dataspace_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer20setConsumerUsageBitsEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer22setConsumerIsProtectedEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer16setTransformHintEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferConsumer17getSidebandStreamEPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer19getOccupancyHistoryEbPNSt3__16vectorINS_16OccupancyTracker7SegmentENS1_9allocatorIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18discardFreeBuffersEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferConsumer9dumpStateERKNS_7String8EPS1_"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferConsumerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_22IGraphicBufferConsumerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-74"
    },
    {
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IGraphicBufferProducer>",
   "name" : "android::BnInterface<android::IGraphicBufferProducer>",
   "record_kind" : "class",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-75" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_22IGraphicBufferProducerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_22IGraphicBufferProducerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13requestBufferEiPNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13dequeueBufferEPiPNS_2spINS_5FenceEEEjjimPmPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer16detachNextBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer11queueBufferEiRKNS0_16QueueBufferInputEPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12cancelBufferEiRKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer5queryEiPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer7connectERKNS_2spINS_17IProducerListenerEEEibPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer10disconnectEiNS0_14DisconnectModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setSidebandStreamERKNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allocateBuffersEjjim"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer15getConsumerNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setSharedBufferModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14setAutoRefreshEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setDequeueTimeoutEl"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setLegacyBufferDropEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19getLastQueuedBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEEPf"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer18getFrameTimestampsEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer11getUniqueIdEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer16getConsumerUsageEPm"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14exportToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferProducerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_22IGraphicBufferProducerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-83"
    },
    {
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IProducerListener>",
   "name" : "android::BnInterface<android::IProducerListener>",
   "record_kind" : "class",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_17IProducerListenerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ProducerListener16onBufferReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ProducerListener18needsReleaseNotifyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ProducerListener18onBuffersDiscardedERKNSt3__16vectorIiNS1_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android17IProducerListener13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_17IProducerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IProducerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IProducerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IProducerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IProducerListenerEEE"
    },
    {
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IProducerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn16_NK7android11BnInterfaceINS_17IProducerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1100"
    },
    {
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::ISurfaceComposer>",
   "name" : "android::BnInterface<android::ISurfaceComposer>",
   "record_kind" : "class",
   "referenced_type" : "type-1099",
   "self_type" : "type-1099",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1101" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_16ISurfaceComposerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_16ISurfaceComposerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16ISurfaceComposerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16ISurfaceComposerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16ISurfaceComposerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_16ISurfaceComposerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer16createConnectionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer28createDisplayEventConnectionENS0_11VsyncSourceENS0_13ConfigChangedE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer13createDisplayERKNS_7String8Eb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer14destroyDisplayERKNS_2spINS_7IBinderEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer21getPhysicalDisplayIdsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer23getPhysicalDisplayTokenEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer19setTransactionStateERKNS_6VectorINS_13ComposerStateEEERKNS1_INS_12DisplayStateEEEjRKNS_2spINS_7IBinderEEERKNS_19InputWindowCommandsElRKNS_14client_cache_tERKNSt3__16vectorINS_17ListenerCallbacksENSL_9allocatorISN_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer12bootFinishedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer26authenticateSurfaceTextureERKNS_2spINS_22IGraphicBufferProducerEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer27getSupportedFrameTimestampsEPNSt3__16vectorINS_10FrameEventENS1_9allocatorIS3_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer12setPowerModeERKNS_2spINS_7IBinderEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer17getDisplayConfigsERKNS_2spINS_7IBinderEEEPNS_6VectorINS_11DisplayInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer15getDisplayStatsERKNS_2spINS_7IBinderEEEPNS_15DisplayStatInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer15getActiveConfigERKNS_2spINS_7IBinderEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer15setActiveConfigERKNS_2spINS_7IBinderEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer20getDisplayColorModesERKNS_2spINS_7IBinderEEEPNS_6VectorINS_8hardware8graphics6common4V1_29ColorModeEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer25getDisplayNativePrimariesERKNS_2spINS_7IBinderEEERNS_2ui16DisplayPrimariesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer18getActiveColorModeERKNS_2spINS_7IBinderEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer18setActiveColorModeERKNS_2spINS_7IBinderEEENS_8hardware8graphics6common4V1_29ColorModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer13captureScreenERKNS_2spINS_7IBinderEEEPNS1_INS_13GraphicBufferEEERbNS_8hardware8graphics6common4V1_29DataspaceENSD_11PixelFormatENS_4RectEjjbNS0_8RotationEb"
    },
    {
     "mangled_component_name" : "_ZN7android16ISurfaceComposer13captureScreenERKNS_2spINS_7IBinderEEEPNS1_INS_13GraphicBufferEEENS_4RectEjjbNS0_8RotationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer13captureScreenEmPNS_8hardware8graphics6common4V1_29DataspaceEPNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer13captureLayersERKNS_2spINS_7IBinderEEEPNS1_INS_13GraphicBufferEEENS_8hardware8graphics6common4V1_29DataspaceENSC_11PixelFormatERKNS_4RectERKNSt3__113unordered_setIS3_NS0_6SpHashIS2_EENSI_8equal_toIS3_EENSI_9allocatorIS3_EEEEfb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer24clearAnimationFrameStatsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer22getAnimationFrameStatsEPNS_10FrameStatsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer18getHdrCapabilitiesERKNS_2spINS_7IBinderEEEPNS_15HdrCapabilitiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer21enableVSyncInjectionsEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer11injectVSyncEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer17getLayerDebugInfoEPNSt3__16vectorINS_14LayerDebugInfoENS1_9allocatorIS3_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer18getColorManagementEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer24getCompositionPreferenceEPNS_8hardware8graphics6common4V1_29DataspaceEPNS4_11PixelFormatES6_S8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer37getDisplayedContentSamplingAttributesERKNS_2spINS_7IBinderEEEPNS_8hardware8graphics6common4V1_211PixelFormatEPNS9_9DataspaceEPh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer32setDisplayContentSamplingEnabledERKNS_2spINS_7IBinderEEEbhm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer25getDisplayedContentSampleERKNS_2spINS_7IBinderEEEmmPNS_19DisplayedFrameStatsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer26getProtectedContentSupportEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer18isWideColorDisplayERKNS_2spINS_7IBinderEEEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer25addRegionSamplingListenerERKNS_4RectERKNS_2spINS_7IBinderEEERKNS4_INS_23IRegionSamplingListenerEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer28removeRegionSamplingListenerERKNS_2spINS_23IRegionSamplingListenerEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer24setAllowedDisplayConfigsERKNS_2spINS_7IBinderEEERKNSt3__16vectorIiNS6_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer24getAllowedDisplayConfigsERKNS_2spINS_7IBinderEEEPNSt3__16vectorIiNS6_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer27getDisplayBrightnessSupportERKNS_2spINS_7IBinderEEEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ISurfaceComposer20setDisplayBrightnessERKNS_2spINS_7IBinderEEEf"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ISurfaceComposer15notifyPowerHintEi"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16ISurfaceComposerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_16ISurfaceComposerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_16ISurfaceComposerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_16ISurfaceComposerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_16ISurfaceComposerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_16ISurfaceComposerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_16ISurfaceComposerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_16ISurfaceComposerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_16ISurfaceComposerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1036"
    },
    {
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::ITransactionCompletedListener>",
   "name" : "android::BnInterface<android::ITransactionCompletedListener>",
   "record_kind" : "class",
   "referenced_type" : "type-1035",
   "self_type" : "type-1035",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1037" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_29ITransactionCompletedListenerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_29ITransactionCompletedListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_29ITransactionCompletedListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_29ITransactionCompletedListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_29ITransactionCompletedListenerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_29ITransactionCompletedListenerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android29ITransactionCompletedListener22onTransactionCompletedENS_13ListenerStatsE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_29ITransactionCompletedListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_29ITransactionCompletedListenerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_29ITransactionCompletedListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_29ITransactionCompletedListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_29ITransactionCompletedListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_29ITransactionCompletedListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_29ITransactionCompletedListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_29ITransactionCompletedListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_29ITransactionCompletedListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1500"
    },
    {
     "referenced_type" : "type-50"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IConsumerListener>",
   "name" : "android::BpInterface<android::IConsumerListener>",
   "record_kind" : "class",
   "referenced_type" : "type-1499",
   "self_type" : "type-1499",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1501" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_17IConsumerListenerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener12onDisconnectEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener16onFrameAvailableERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameReplacedERKNS_10BufferItemE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener17onBuffersReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener23onSidebandStreamChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener24addAndGetFrameTimestampsEPKNS_19NewFrameEventsEntryEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "mangled_component_name" : "_ZNK7android17IConsumerListener22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BpInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BpInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1630"
    },
    {
     "referenced_type" : "type-50"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IGraphicBufferConsumer>",
   "name" : "android::BpInterface<android::IGraphicBufferConsumer>",
   "record_kind" : "class",
   "referenced_type" : "type-1629",
   "self_type" : "type-1629",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1631" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_22IGraphicBufferConsumerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_22IGraphicBufferConsumerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IGraphicBufferConsumer22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer13acquireBufferEPNS_10BufferItemElm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer13releaseBufferEimPvS1_RKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer15consumerConnectERKNS_2spINS_17IConsumerListenerEEEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18consumerDisconnectEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18getReleasedBuffersEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer20setDefaultBufferSizeEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer17setMaxBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer25setMaxAcquiredBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer15setConsumerNameERKNS_7String8E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer22setDefaultBufferFormatEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer25setDefaultBufferDataSpaceE19android_dataspace_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer20setConsumerUsageBitsEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer22setConsumerIsProtectedEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer16setTransformHintEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferConsumer17getSidebandStreamEPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer19getOccupancyHistoryEbPNSt3__16vectorINS_16OccupancyTracker7SegmentENS1_9allocatorIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18discardFreeBuffersEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferConsumer9dumpStateERKNS_7String8EPS1_"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4327"
    },
    {
     "referenced_type" : "type-50"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IGraphicBufferProducer>",
   "name" : "android::BpInterface<android::IGraphicBufferProducer>",
   "record_kind" : "class",
   "referenced_type" : "type-4326",
   "self_type" : "type-4326",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-4328" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_22IGraphicBufferProducerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_22IGraphicBufferProducerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13requestBufferEiPNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13dequeueBufferEPiPNS_2spINS_5FenceEEEjjimPmPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer16detachNextBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer11queueBufferEiRKNS0_16QueueBufferInputEPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12cancelBufferEiRKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer5queryEiPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer7connectERKNS_2spINS_17IProducerListenerEEEibPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer10disconnectEiNS0_14DisconnectModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setSidebandStreamERKNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allocateBuffersEjjim"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer15getConsumerNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setSharedBufferModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14setAutoRefreshEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setDequeueTimeoutEl"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setLegacyBufferDropEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19getLastQueuedBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEEPf"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer18getFrameTimestampsEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer11getUniqueIdEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer16getConsumerUsageEPm"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14exportToParcelEPNS_6ParcelE"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4489"
    },
    {
     "referenced_type" : "type-50"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IProducerListener>",
   "name" : "android::BpInterface<android::IProducerListener>",
   "record_kind" : "class",
   "referenced_type" : "type-4488",
   "self_type" : "type-4488",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-4490" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_17IProducerListenerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ProducerListener16onBufferReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ProducerListener18needsReleaseNotifyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ProducerListener18onBuffersDiscardedERKNSt3__16vectorIiNS1_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android17IProducerListener13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android17IProducerListener22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_17IProducerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BpInterfaceINS_17IProducerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BpInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BpInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BpInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-54"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 64,
     "referenced_type" : "type-51"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 128,
     "referenced_type" : "type-58"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 192,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "android::BpRefBase",
   "name" : "android::BpRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android9BpRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mRange",
     "referenced_type" : "type-2434"
    },
    {
     "field_name" : "mPrimaries",
     "field_offset" : 32,
     "referenced_type" : "type-2435"
    },
    {
     "field_name" : "mTransfer",
     "field_offset" : 64,
     "referenced_type" : "type-2436"
    },
    {
     "field_name" : "mMatrixCoeffs",
     "field_offset" : 96,
     "referenced_type" : "type-2437"
    }
   ],
   "linker_set_key" : "android::ColorAspects",
   "name" : "android::ColorAspects",
   "referenced_type" : "type-2433",
   "self_type" : "type-2433",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android12ColorAspectsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ColorUtils",
   "name" : "android::ColorUtils",
   "referenced_type" : "type-1188",
   "self_type" : "type-1188",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/ColorUtils.h",
   "unique_id" : "_ZTSN7android10ColorUtilsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-2695",
   "self_type" : "type-2695",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "android::ComponentWrapper",
   "name" : "android::ComponentWrapper",
   "referenced_type" : "type-569",
   "self_type" : "type-569",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/bqhelper/include/media/stagefright/bqhelper/ComponentWrapper.h",
   "unique_id" : "_ZTSN7android16ComponentWrapperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ComponentWrapperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16ComponentWrapperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16ComponentWrapperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ComponentWrapper12submitBufferEiRKNS_2spINS_13GraphicBufferEEEli"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ComponentWrapper9submitEosEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ComponentWrapper24dispatchDataSpaceChangedEiii"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-252"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-251",
   "self_type" : "type-251",
   "size" : 48,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bTunneled",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nAudioHwSync",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSidebandWindow",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "android::ConfigureVideoTunnelModeParams",
   "name" : "android::ConfigureVideoTunnelModeParams",
   "referenced_type" : "type-2431",
   "self_type" : "type-2431",
   "size" : 32,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android30ConfigureVideoTunnelModeParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bRequestingDataSpace",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "bDataSpaceChanged",
     "field_offset" : 128,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "nPixelFormat",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nDataSpace",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sAspects",
     "field_offset" : 224,
     "referenced_type" : "type-2433"
    }
   ],
   "linker_set_key" : "android::DescribeColorAspectsParams",
   "name" : "android::DescribeColorAspectsParams",
   "referenced_type" : "type-2432",
   "self_type" : "type-2432",
   "size" : 44,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android26DescribeColorAspectsParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 64,
     "referenced_type" : "type-2204"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bUsingNativeBuffers",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "sMediaImage",
     "field_offset" : 256,
     "referenced_type" : "type-2426"
    }
   ],
   "linker_set_key" : "android::DescribeColorFormat2Params",
   "name" : "android::DescribeColorFormat2Params",
   "referenced_type" : "type-2425",
   "self_type" : "type-2425",
   "size" : 136,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android26DescribeColorFormat2ParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "eColorFormat",
     "field_offset" : 64,
     "referenced_type" : "type-2204"
    },
    {
     "field_name" : "nFrameWidth",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nFrameHeight",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nStride",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nSliceHeight",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bUsingNativeBuffers",
     "field_offset" : 224,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "sMediaImage",
     "field_offset" : 256,
     "referenced_type" : "type-2420"
    }
   ],
   "linker_set_key" : "android::DescribeColorFormatParams",
   "name" : "android::DescribeColorFormatParams",
   "referenced_type" : "type-2419",
   "self_type" : "type-2419",
   "size" : 112,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android25DescribeColorFormatParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nParamSize",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nParamSizeUsed",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nValue",
     "field_offset" : 160,
     "referenced_type" : "type-1572"
    }
   ],
   "linker_set_key" : "android::DescribeHDR10PlusInfoParams",
   "name" : "android::DescribeHDR10PlusInfoParams",
   "referenced_type" : "type-2445",
   "self_type" : "type-2445",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android27DescribeHDR10PlusInfoParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sInfo",
     "field_offset" : 96,
     "referenced_type" : "type-2440"
    }
   ],
   "linker_set_key" : "android::DescribeHDRStaticInfoParams",
   "name" : "android::DescribeHDRStaticInfoParams",
   "referenced_type" : "type-2439",
   "self_type" : "type-2439",
   "size" : 40,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android27DescribeHDRStaticInfoParamsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "enable",
     "field_offset" : 96,
     "referenced_type" : "type-1301"
    }
   ],
   "linker_set_key" : "android::EnableAndroidNativeBuffersParams",
   "name" : "android::EnableAndroidNativeBuffersParams",
   "referenced_type" : "type-2400",
   "self_type" : "type-2400",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android32EnableAndroidNativeBuffersParamsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSharedFd",
     "referenced_type" : "type-1203"
    }
   ],
   "linker_set_key" : "android::FileDescriptor",
   "name" : "android::FileDescriptor",
   "referenced_type" : "type-1202",
   "self_type" : "type-1202",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/FileDescriptor.h",
   "unique_id" : "_ZTSN7android14FileDescriptorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFd",
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::FileDescriptor::Autoclose",
   "name" : "android::FileDescriptor::Autoclose",
   "referenced_type" : "type-1211",
   "self_type" : "type-1211",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/FileDescriptor.h",
   "unique_id" : "_ZTSN7android14FileDescriptor9AutocloseE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::BufferItem>",
   "name" : "android::Flattenable<android::BufferItem>",
   "record_kind" : "class",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-23" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_10BufferItemEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::Fence>",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_5FenceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FenceTime::Snapshot>",
   "name" : "android::Flattenable<android::FenceTime::Snapshot>",
   "record_kind" : "class",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-20" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_9FenceTime8SnapshotEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FrameEventHistoryDelta>",
   "name" : "android::Flattenable<android::FrameEventHistoryDelta>",
   "record_kind" : "class",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_22FrameEventHistoryDeltaEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::FrameEventsDelta>",
   "name" : "android::Flattenable<android::FrameEventsDelta>",
   "record_kind" : "class",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_16FrameEventsDeltaEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::GraphicBuffer>",
   "name" : "android::Flattenable<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_13GraphicBufferEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferInput>",
   "name" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferInput>",
   "record_kind" : "class",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_22IGraphicBufferProducer16QueueBufferInputEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferOutput>",
   "name" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferOutput>",
   "record_kind" : "class",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-36" ],
   "unique_id" : "_ZTSN7android11FlattenableINS_22IGraphicBufferProducer17QueueBufferOutputEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::FlattenableUtils",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "unique_id" : "_ZTSN7android16FlattenableUtilsE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-54"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDesiredMinTimeUs",
     "field_offset" : 128,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mMinIntervalUs",
     "field_offset" : 192,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::FrameDropper",
   "name" : "android::FrameDropper",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libstagefright/bqhelper/include/media/stagefright/bqhelper/FrameDropper.h",
   "unique_id" : "_ZTSN7android12FrameDropperE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12FrameDropperE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12FrameDropperD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12FrameDropperD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nSize",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nVersion",
     "field_offset" : 32,
     "referenced_type" : "type-1483"
    },
    {
     "field_name" : "nPortIndex",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nUsage",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::GetAndroidNativeBufferUsageParams",
   "name" : "android::GetAndroidNativeBufferUsageParams",
   "referenced_type" : "type-2417",
   "self_type" : "type-2417",
   "size" : 16,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/HardwareAPI.h",
   "unique_id" : "_ZTSN7android33GetAndroidNativeBufferUsageParamsE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-54"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mConsumerProxy",
     "field_offset" : 128,
     "referenced_type" : "type-473"
    },
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 192,
     "referenced_type" : "type-249"
    },
    {
     "access" : "private",
     "field_name" : "mInitCheck",
     "field_offset" : 512,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mBufferSlots",
     "field_offset" : 576,
     "referenced_type" : "type-148"
    },
    {
     "access" : "private",
     "field_name" : "mAvailableBuffers",
     "field_offset" : 896,
     "referenced_type" : "type-197"
    },
    {
     "access" : "private",
     "field_name" : "mNumAvailableUnacquiredBuffers",
     "field_offset" : 1024,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mNumOutstandingAcquires",
     "field_offset" : 1056,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mFreeCodecBuffers",
     "field_offset" : 1088,
     "referenced_type" : "type-220"
    },
    {
     "access" : "private",
     "field_name" : "mSubmittedCodecBuffers",
     "field_offset" : 1216,
     "referenced_type" : "type-162"
    },
    {
     "access" : "private",
     "field_name" : "mEndOfStream",
     "field_offset" : 1536,
     "referenced_type" : "type-95"
    },
    {
     "access" : "private",
     "field_name" : "mEndOfStreamSent",
     "field_offset" : 1544,
     "referenced_type" : "type-95"
    },
    {
     "access" : "private",
     "field_name" : "mLastDataspace",
     "field_offset" : 1568,
     "referenced_type" : "type-173"
    },
    {
     "access" : "private",
     "field_name" : "mDefaultColorAspectsPacked",
     "field_offset" : 1600,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mComponent",
     "field_offset" : 1664,
     "referenced_type" : "type-567"
    },
    {
     "access" : "private",
     "field_name" : "mExecuting",
     "field_offset" : 1728,
     "referenced_type" : "type-95"
    },
    {
     "access" : "private",
     "field_name" : "mSuspended",
     "field_offset" : 1736,
     "referenced_type" : "type-95"
    },
    {
     "access" : "private",
     "field_name" : "mLastFrameTimestampUs",
     "field_offset" : 1792,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mProducer",
     "field_offset" : 1856,
     "referenced_type" : "type-570"
    },
    {
     "access" : "private",
     "field_name" : "mConsumer",
     "field_offset" : 1920,
     "referenced_type" : "type-574"
    },
    {
     "access" : "private",
     "field_name" : "mStopTimeUs",
     "field_offset" : 1984,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mLastActionTimeUs",
     "field_offset" : 2048,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mActionQueue",
     "field_offset" : 2112,
     "referenced_type" : "type-242"
    },
    {
     "access" : "private",
     "field_name" : "mSkipFramesBeforeNs",
     "field_offset" : 2240,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mFrameDropper",
     "field_offset" : 2304,
     "referenced_type" : "type-578"
    },
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 2368,
     "referenced_type" : "type-322"
    },
    {
     "access" : "private",
     "field_name" : "mReflector",
     "field_offset" : 2432,
     "referenced_type" : "type-581"
    },
    {
     "access" : "private",
     "field_name" : "mFrameRepeatIntervalUs",
     "field_offset" : 2496,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mRepeatLastFrameGeneration",
     "field_offset" : 2560,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mOutstandingFrameRepeatCount",
     "field_offset" : 2592,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mFrameRepeatBlockedOnCodecBuffer",
     "field_offset" : 2624,
     "referenced_type" : "type-95"
    },
    {
     "access" : "private",
     "field_name" : "mLatestBuffer",
     "field_offset" : 2688,
     "referenced_type" : "type-171"
    },
    {
     "access" : "private",
     "field_name" : "mFps",
     "field_offset" : 2944,
     "referenced_type" : "type-269"
    },
    {
     "access" : "private",
     "field_name" : "mCaptureFps",
     "field_offset" : 3008,
     "referenced_type" : "type-269"
    },
    {
     "access" : "private",
     "field_name" : "mBaseCaptureUs",
     "field_offset" : 3072,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mBaseFrameUs",
     "field_offset" : 3136,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mFrameCount",
     "field_offset" : 3200,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mPrevCaptureUs",
     "field_offset" : 3264,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mPrevFrameUs",
     "field_offset" : 3328,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mInputBufferTimeOffsetUs",
     "field_offset" : 3392,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::GraphicBufferSource",
   "name" : "android::GraphicBufferSource",
   "record_kind" : "class",
   "referenced_type" : "type-566",
   "self_type" : "type-566",
   "size" : 432,
   "source_file" : "/frameworks/av/media/libstagefright/bqhelper/include/media/stagefright/bqhelper/GraphicBufferSource.h",
   "unique_id" : "_ZTSN7android19GraphicBufferSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19GraphicBufferSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19GraphicBufferSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19GraphicBufferSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mAction",
     "referenced_type" : "type-225"
    },
    {
     "field_name" : "mActionTimeUs",
     "field_offset" : 64,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::GraphicBufferSource::ActionItem",
   "name" : "android::GraphicBufferSource::ActionItem",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/bqhelper/include/media/stagefright/bqhelper/GraphicBufferSource.h",
   "unique_id" : "_ZTSN7android19GraphicBufferSource10ActionItemE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mBuffer",
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "mTimestampNs",
     "field_offset" : 128,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "mDataspace",
     "field_offset" : 192,
     "referenced_type" : "type-173"
    }
   ],
   "linker_set_key" : "android::GraphicBufferSource::VideoBuffer",
   "name" : "android::GraphicBufferSource::VideoBuffer",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libstagefright/bqhelper/include/media/stagefright/bqhelper/GraphicBufferSource.h",
   "unique_id" : "_ZTSN7android19GraphicBufferSource11VideoBufferE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mID",
     "referenced_type" : "type-2441"
    },
    {
     "field_offset" : 8,
     "referenced_type" : "type-2442"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo",
   "name" : "android::HDRStaticInfo",
   "referenced_type" : "type-2440",
   "self_type" : "type-2440",
   "size" : 25,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "sType1",
     "referenced_type" : "type-2443"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "name" : "android::HDRStaticInfo::(anonymous union at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5) at frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h:216:5",
   "record_kind" : "union",
   "referenced_type" : "type-2442",
   "self_type" : "type-2442",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfoUt_E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "y",
     "field_offset" : 16,
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Primaries1",
   "name" : "android::HDRStaticInfo::Primaries1",
   "referenced_type" : "type-2444",
   "self_type" : "type-2444",
   "size" : 4,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo10Primaries1E"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "mR",
     "referenced_type" : "type-2444"
    },
    {
     "field_name" : "mG",
     "field_offset" : 32,
     "referenced_type" : "type-2444"
    },
    {
     "field_name" : "mB",
     "field_offset" : 64,
     "referenced_type" : "type-2444"
    },
    {
     "field_name" : "mW",
     "field_offset" : 96,
     "referenced_type" : "type-2444"
    },
    {
     "field_name" : "mMaxDisplayLuminance",
     "field_offset" : 128,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "mMinDisplayLuminance",
     "field_offset" : 144,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "mMaxContentLightLevel",
     "field_offset" : 160,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "mMaxFrameAverageLightLevel",
     "field_offset" : 176,
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "android::HDRStaticInfo::Type1",
   "name" : "android::HDRStaticInfo::Type1",
   "referenced_type" : "type-2443",
   "self_type" : "type-2443",
   "size" : 24,
   "source_file" : "/frameworks/native/headers/media_plugin/media/hardware/VideoAPI.h",
   "unique_id" : "_ZTSN7android13HDRStaticInfo5Type1E"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "android::IBinder",
   "name" : "android::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder13isBinderAliveEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder10pingBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder11linkToDeathERKNS_2spINS0_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder13unlinkToDeathERKNS_2wpINS0_14DeathRecipientEEEPvjPS3_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "android::IBinder::DeathRecipient",
   "name" : "android::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipient10binderDiedERKNS_2wpIS0_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "android::IInterface",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-648",
   "self_type" : "type-648",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "unique_id" : "_ZTSN7android10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mProcess",
     "referenced_type" : "type-1261"
    },
    {
     "access" : "private",
     "field_name" : "mPendingStrongDerefs",
     "field_offset" : 64,
     "referenced_type" : "type-1208"
    },
    {
     "access" : "private",
     "field_name" : "mPendingWeakDerefs",
     "field_offset" : 384,
     "referenced_type" : "type-1212"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteStrongDerefs",
     "field_offset" : 704,
     "referenced_type" : "type-1213"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteWeakDerefs",
     "field_offset" : 1024,
     "referenced_type" : "type-1212"
    },
    {
     "access" : "private",
     "field_name" : "mIn",
     "field_offset" : 1344,
     "referenced_type" : "type-90"
    },
    {
     "access" : "private",
     "field_name" : "mOut",
     "field_offset" : 2304,
     "referenced_type" : "type-90"
    },
    {
     "access" : "private",
     "field_name" : "mLastError",
     "field_offset" : 3264,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mCallingPid",
     "field_offset" : 3296,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mCallingSid",
     "field_offset" : 3328,
     "referenced_type" : "type-124"
    },
    {
     "access" : "private",
     "field_name" : "mCallingUid",
     "field_offset" : 3392,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mWorkSource",
     "field_offset" : 3424,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mPropagateWorkSource",
     "field_offset" : 3456,
     "referenced_type" : "type-95"
    },
    {
     "access" : "private",
     "field_name" : "mStrictModePolicy",
     "field_offset" : 3488,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mLastTransactionBinderFlags",
     "field_offset" : 3520,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mIPCThreadStateBase",
     "field_offset" : 3584,
     "referenced_type" : "type-1267"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 3648,
     "referenced_type" : "type-1259"
    }
   ],
   "linker_set_key" : "android::IPCThreadState",
   "name" : "android::IPCThreadState",
   "record_kind" : "class",
   "referenced_type" : "type-1260",
   "self_type" : "type-1260",
   "size" : 464,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IPCThreadState.h",
   "unique_id" : "_ZTSN7android14IPCThreadStateE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-1204"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-1242",
   "self_type" : "type-1242",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-1243", "type-796" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-1358"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-1370",
   "self_type" : "type-1370",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-1243", "type-1371" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-163"
    }
   ],
   "linker_set_key" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::AcquiredBuffer> >",
   "name" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::AcquiredBuffer> >",
   "record_kind" : "class",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-4", "type-167" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource14AcquiredBufferEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-149"
    }
   ],
   "linker_set_key" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::CachedBuffer> >",
   "name" : "android::KeyedVector<int, std::shared_ptr<android::GraphicBufferSource::CachedBuffer> >",
   "record_kind" : "class",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-4", "type-153" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIiNSt3__110shared_ptrINS_19GraphicBufferSource12CachedBufferEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "android::KeyedVector<unsigned int, unsigned int>",
   "name" : "android::KeyedVector<unsigned int, unsigned int>",
   "record_kind" : "class",
