{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned long",
   "name" : "unsigned long",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 8
  },
  {
   "linker_set_key" : "void",
   "name" : "void",
   "referenced_type" : "type-40",
   "self_type" : "type-40"
  }
 ],
 "elf_functions" :
 [
  {
   "name" : "_ZN7android20MediaCodecsXmlParser12parseXmlPathERKNSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEE"
  },
  {
   "name" : "_ZN7android20MediaCodecsXmlParser25parseXmlFilesInSearchDirsERKNSt3__16vectorINS1_12basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEENS6_IS8_EEEESC_"
  },
  {
   "name" : "_ZN7android20MediaCodecsXmlParser4Impl12parseXmlPathERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEE"
  },
  {

   "linker_set_key" : "const android::MediaCodecsXmlParser",
   "name" : "const android::MediaCodecsXmlParser",
   "referenced_type" : "type-1",
   "self_type" : "type-13",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-38",
   "self_type" : "type-37",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const char *const",
   "name" : "const char *const",
   "referenced_type" : "type-36",
   "self_type" : "type-39",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-34",
   "self_type" : "type-33",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::CodecProperties, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::CodecProperties> > >",
   "name" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::CodecProperties, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::CodecProperties> > >",
   "referenced_type" : "type-17",
   "self_type" : "type-16",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::RoleProperties, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::RoleProperties> > >",
   "name" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::RoleProperties, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, android::MediaCodecsXmlParser::RoleProperties> > >",
   "referenced_type" : "type-20",
   "self_type" : "type-19",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > >",
   "name" : "const std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > >",
   "referenced_type" : "type-12",
   "self_type" : "type-11",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::vector<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "name" : "const std::vector<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::allocator<std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >",
   "referenced_type" : "type-31",
   "self_type" : "type-30",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::MediaCodecsXmlParser",
   "name" : "android::MediaCodecsXmlParser",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h",
   "unique_id" : "_ZTSN7android20MediaCodecsXmlParserE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "isEncoder",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "order",
     "field_offset" : 64,
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "quirkSet",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "domainSet",
     "field_offset" : 320,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "variantSet",
     "field_offset" : 512,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "typeMap",
     "field_offset" : 704,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "aliases",
     "field_offset" : 896,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "rank",
     "field_offset" : 1088,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "android::MediaCodecsXmlParser::CodecProperties",
   "name" : "android::MediaCodecsXmlParser::CodecProperties",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 160,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h",
   "unique_id" : "_ZTSN7android20MediaCodecsXmlParser15CodecPropertiesE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "attributeList",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android::MediaCodecsXmlParser::NodeInfo",
   "name" : "android::MediaCodecsXmlParser::NodeInfo",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h",
   "unique_id" : "_ZTSN7android20MediaCodecsXmlParser8NodeInfoE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "isEncoder",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "nodeList",
     "field_offset" : 256,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::MediaCodecsXmlParser::RoleProperties",
   "name" : "android::MediaCodecsXmlParser::RoleProperties",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 56,
   "source_file" : "/frameworks/av/media/libstagefright/xmlparser/include/media/stagefright/xmlparser/MediaCodecsXmlParser.h",
   "unique_id" : "_ZTSN7android20MediaCodecsXmlParser14RolePropertiesE"
  }
 ],
 "rvalue_reference_types" : []
}
