{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA0_h",
   "name" : "unsigned char [0]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA0_h",
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA100_c",
   "name" : "char [100]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA100_c",
   "size" : 100,
   "source_file" : "/hardware/libhardware/include/hardware/power.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_c",
   "name" : "char [128]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA128_c",
   "size" : 128,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA12_j",
   "name" : "unsigned int [12]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA12_j",
   "size" : 48,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA16_10audio_gain",
   "name" : "audio_gain [16]",
   "referenced_type" : "_ZTI10audio_gain",
   "self_type" : "_ZTIA16_10audio_gain",
   "size" : 512,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,

   "name" : "const XADynamicInterfaceManagementItf_ *const",
   "referenced_type" : "_ZTIPK32XADynamicInterfaceManagementItf_",
   "self_type" : "_ZTIKPK32XADynamicInterfaceManagementItf_",
   "size" : 4,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPK33SLAndroidAutomaticGainControlItf_",
   "name" : "const SLAndroidAutomaticGainControlItf_ *const",
   "referenced_type" : "_ZTIPK33SLAndroidAutomaticGainControlItf_",
   "self_type" : "_ZTIKPK33SLAndroidAutomaticGainControlItf_",
   "size" : 4,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPK37SLAndroidAcousticEchoCancellationItf_",
   "name" : "const SLAndroidAcousticEchoCancellationItf_ *const",
   "referenced_type" : "_ZTIPK37SLAndroidAcousticEchoCancellationItf_",
   "self_type" : "_ZTIKPK37SLAndroidAcousticEchoCancellationItf_",
   "size" : 4,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPK9XARDSItf_",
   "name" : "const XARDSItf_ *const",
   "referenced_type" : "_ZTIPK9XARDSItf_",
   "self_type" : "_ZTIKPK9XARDSItf_",
   "size" : 4,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7IBinderE",
   "name" : "android::IBinder *const",
   "referenced_type" : "_ZTIPN7android7IBinderE",
   "self_type" : "_ZTIKPN7android7IBinderE",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVb",
   "name" : "volatile bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIVb",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetPlayState",
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_jE"
    },
    {
     "field_name" : "GetPlayState",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_PjE"
    },
    {
     "field_name" : "GetDuration",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_PjE"
    },
    {
     "field_name" : "GetPosition",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_PjE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_PFvS3_PvjES4_E"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_jE"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_PjE"
    },
    {
     "field_name" : "SetMarkerPosition",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_jE"
    },
    {
     "field_name" : "ClearMarkerPosition",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_E"
    },
    {
     "field_name" : "GetMarkerPosition",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_PjE"
    },
    {
     "field_name" : "SetPositionUpdatePeriod",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_jE"
    },
    {
     "field_name" : "GetPositionUpdatePeriod",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK10SLPlayItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI10SLPlayItf_",
   "name" : "SLPlayItf_",
   "referenced_type" : "_ZTI10SLPlayItf_",
   "self_type" : "_ZTI10SLPlayItf_",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetPosition",
     "referenced_type" : "_ZTIPFjPKPK10SLSeekItf_jjE"
    },
    {
     "field_name" : "SetLoop",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK10SLSeekItf_jjjE"
    },
    {
     "field_name" : "GetLoop",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK10SLSeekItf_PjS4_S4_E"
    }
   ],
   "linker_set_key" : "_ZTI10SLSeekItf_",
   "name" : "SLSeekItf_",
   "referenced_type" : "_ZTI10SLSeekItf_",
   "self_type" : "_ZTI10SLSeekItf_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetPlayState",
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_jE"
    },
    {
     "field_name" : "GetPlayState",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_PjE"
    },
    {
     "field_name" : "GetDuration",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_PjE"
    },
    {
     "field_name" : "GetPosition",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_PjE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_PFvS3_PvjES4_E"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_jE"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_PjE"
    },
    {
     "field_name" : "SetMarkerPosition",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_jE"
    },
    {
     "field_name" : "ClearMarkerPosition",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_E"
    },
    {
     "field_name" : "GetMarkerPosition",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_PjE"
    },
    {
     "field_name" : "SetPositionUpdatePeriod",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_jE"
    },
    {
     "field_name" : "GetPositionUpdatePeriod",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK10XAPlayItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI10XAPlayItf_",
   "name" : "XAPlayItf_",
   "referenced_type" : "_ZTI10XAPlayItf_",
   "self_type" : "_ZTI10XAPlayItf_",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetPosition",
     "referenced_type" : "_ZTIPFjPKPK10XASeekItf_jjE"
    },
    {
     "field_name" : "SetLoop",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK10XASeekItf_jjjE"
    },
    {
     "field_name" : "GetLoop",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK10XASeekItf_PjS4_S4_E"
    }
   ],
   "linker_set_key" : "_ZTI10XASeekItf_",
   "name" : "XASeekItf_",
   "referenced_type" : "_ZTI10XASeekItf_",
   "self_type" : "_ZTI10XASeekItf_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI10_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI10_jintArray",
   "self_type" : "_ZTI10_jintArray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "min_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max_value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "default_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "step_value",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "min_ramp_ms",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_ramp_ms",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10audio_gain",
   "name" : "audio_gain",
   "referenced_type" : "_ZTI10audio_gain",
   "self_type" : "_ZTI10audio_gain",
   "size" : 32,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "_ZTI17audio_port_role_t"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI17audio_port_type_t"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA128_c"
    },
    {
     "field_name" : "num_sample_rates",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sample_rates",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "field_name" : "num_channel_masks",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_masks",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "field_name" : "num_formats",
     "field_offset" : 3232,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "formats",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIA32_14audio_format_t"
    },
    {
     "field_name" : "num_gains",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gains",
     "field_offset" : 4320,
     "referenced_type" : "_ZTIA16_10audio_gain"
    },
    {
     "field_name" : "active_config",
     "field_offset" : 8416,
     "referenced_type" : "_ZTI17audio_port_config"
    },
    {
     "field_name" : "ext",
     "field_offset" : 10144,
     "referenced_type" : "_ZTIN10audio_portUt_E"
    }
   ],
   "linker_set_key" : "_ZTI10audio_port",
   "name" : "audio_port",
   "referenced_type" : "_ZTI10audio_port",
   "self_type" : "_ZTI10audio_port",
   "size" : 1308,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pLocator",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pFormat",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI11SLDataSink_",
   "name" : "SLDataSink_",
   "referenced_type" : "_ZTI11SLDataSink_",
   "self_type" : "_ZTI11SLDataSink_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetPitch",
     "referenced_type" : "_ZTIPFjPKPK11SLPitchItf_sE"
    },
    {
     "field_name" : "GetPitch",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK11SLPitchItf_PsE"
    },
    {
     "field_name" : "GetPitchCapabilities",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK11SLPitchItf_PsS4_E"
    }
   ],
   "linker_set_key" : "_ZTI11SLPitchItf_",
   "name" : "SLPitchItf_",
   "referenced_type" : "_ZTI11SLPitchItf_",
   "self_type" : "_ZTI11SLPitchItf_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Vibrate",
     "referenced_type" : "_ZTIPFjPKPK11SLVibraItf_jE"
    },
    {
     "field_name" : "IsVibrating",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK11SLVibraItf_PjE"
    },
    {
     "field_name" : "SetFrequency",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK11SLVibraItf_jE"
    },
    {
     "field_name" : "GetFrequency",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK11SLVibraItf_PjE"
    },
    {
     "field_name" : "SetIntensity",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK11SLVibraItf_sE"
    },
    {
     "field_name" : "GetIntensity",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK11SLVibraItf_PsE"
    }
   ],
   "linker_set_key" : "_ZTI11SLVibraItf_",
   "name" : "SLVibraItf_",
   "referenced_type" : "_ZTI11SLVibraItf_",
   "self_type" : "_ZTI11SLVibraItf_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pLocator",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pFormat",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI11XADataSink_",
   "name" : "XADataSink_",
   "referenced_type" : "_ZTI11XADataSink_",
   "self_type" : "_ZTI11XADataSink_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetFreqRange",
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_hE"
    },
    {
     "field_name" : "GetFreqRange",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_PhE"
    },
    {
     "field_name" : "IsFreqRangeSupported",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_hPjE"
    },
    {
     "field_name" : "GetFreqRangeProperties",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_hPjS4_S4_E"
    },
    {
     "field_name" : "SetFrequency",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_jE"
    },
    {
     "field_name" : "CancelSetFrequency",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_E"
    },
    {
     "field_name" : "GetFrequency",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_PjE"
    },
    {
     "field_name" : "SetSquelch",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_jE"
    },
    {
     "field_name" : "GetSquelch",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_PjE"
    },
    {
     "field_name" : "SetStereoMode",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_jE"
    },
    {
     "field_name" : "GetStereoMode",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_PjE"
    },
    {
     "field_name" : "GetSignalStrength",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_PjE"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_jE"
    },
    {
     "field_name" : "StopSeeking",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_E"
    },
    {
     "field_name" : "GetNumberOfPresets",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_PjE"
    },
    {
     "field_name" : "SetPreset",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_jjhjPKhE"
    },
    {
     "field_name" : "GetPreset",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_jPjPhS4_S5_PtE"
    },
    {
     "field_name" : "RegisterRadioCallback",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFjPKPK11XARadioItf_PFvS3_PvjjjES4_E"
    }
   ],
   "linker_set_key" : "_ZTI11XARadioItf_",
   "name" : "XARadioItf_",
   "referenced_type" : "_ZTI11XARadioItf_",
   "self_type" : "_ZTI11XARadioItf_",
   "size" : 72,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Vibrate",
     "referenced_type" : "_ZTIPFjPKPK11XAVibraItf_jE"
    },
    {
     "field_name" : "IsVibrating",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK11XAVibraItf_PjE"
    },
    {
     "field_name" : "SetFrequency",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK11XAVibraItf_jE"
    },
    {
     "field_name" : "GetFrequency",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK11XAVibraItf_PjE"
    },
    {
     "field_name" : "SetIntensity",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK11XAVibraItf_sE"
    },
    {
     "field_name" : "GetIntensity",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK11XAVibraItf_PsE"
    }
   ],
   "linker_set_key" : "_ZTI11XAVibraItf_",
   "name" : "XAVibraItf_",
   "referenced_type" : "_ZTI11XAVibraItf_",
   "self_type" : "_ZTI11XAVibraItf_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jbyteArray",
   "self_type" : "_ZTI11_jbyteArray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jcharArray",
   "self_type" : "_ZTI11_jcharArray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jlongArray",
   "self_type" : "_ZTI11_jlongArray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI11_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jthrowable",
   "self_type" : "_ZTI11_jthrowable",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_sources",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sources",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA16_17audio_port_config"
    },
    {
     "field_name" : "num_sinks",
     "field_offset" : 27712,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sinks",
     "field_offset" : 27744,
     "referenced_type" : "_ZTIA16_17audio_port_config"
    }
   ],
   "linker_set_key" : "_ZTI11audio_patch",
   "name" : "audio_patch",
   "referenced_type" : "_ZTI11audio_patch",
   "self_type" : "_ZTI11audio_patch",
   "size" : 6924,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "module",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP11hw_module_t"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA12_j"
    },
    {
     "field_name" : "close",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFiP11hw_device_tE"
    }
   ],
   "linker_set_key" : "_ZTI11hw_device_t",
   "name" : "hw_device_t",
   "referenced_type" : "_ZTI11hw_device_t",
   "self_type" : "_ZTI11hw_device_t",
   "size" : 64,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "module_api_version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hal_api_version",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "author",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "methods",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP19hw_module_methods_t"
    },
    {
     "field_name" : "dso",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA25_j"
    }
   ],
   "linker_set_key" : "_ZTI11hw_module_t",
   "name" : "hw_module_t",
   "referenced_type" : "_ZTI11hw_module_t",
   "self_type" : "_ZTI11hw_module_t",
   "size" : 128,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "_ZTI12JavaVMOption",
   "self_type" : "_ZTI12JavaVMOption",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "CreateLEDDevice",
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_jjPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateVibraDevice",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_jjPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateAudioPlayer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_P13SLDataSource_P11SLDataSink_jPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateAudioRecorder",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_P13SLDataSource_P11SLDataSink_jPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateMidiPlayer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_P13SLDataSource_SB_P11SLDataSink_SD_SD_jPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateListener",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_jPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "Create3DGroup",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_jPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateOutputMix",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_jPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateMetadataExtractor",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_P13SLDataSource_jPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateExtensionObject",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PPKPK12SLObjectItf_PvjjPKPK14SLInterfaceID_PKjE"
    },
    {
     "field_name" : "QueryNumSupportedInterfaces",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_jPjE"
    },
    {
     "field_name" : "QuerySupportedInterfaces",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_jjPPK14SLInterfaceID_E"
    },
    {
     "field_name" : "QueryNumSupportedExtensions",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PjE"
    },
    {
     "field_name" : "QuerySupportedExtension",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_jPhPsE"
    },
    {
     "field_name" : "IsExtensionSupported",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFjPKPK12SLEngineItf_PKhPjE"
    }
   ],
   "linker_set_key" : "_ZTI12SLEngineItf_",
   "name" : "SLEngineItf_",
   "referenced_type" : "_ZTI12SLEngineItf_",
   "self_type" : "_ZTI12SLEngineItf_",
   "size" : 60,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Realize",
     "referenced_type" : "_ZTIPFjPKPK12SLObjectItf_jE"
    },
    {
     "field_name" : "Resume",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK12SLObjectItf_jE"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK12SLObjectItf_PjE"
    },
    {
     "field_name" : "GetInterface",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK12SLObjectItf_PK14SLInterfaceID_PvE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK12SLObjectItf_PFvS3_PKvjjjPvES6_E"
    },
    {
     "field_name" : "AbortAsyncOperation",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvPKPK12SLObjectItf_E"
    },
    {
     "field_name" : "Destroy",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvPKPK12SLObjectItf_E"
    },
    {
     "field_name" : "SetPriority",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK12SLObjectItf_ijE"
    },
    {
     "field_name" : "GetPriority",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK12SLObjectItf_PiPjE"
    },
    {
     "field_name" : "SetLossOfControlInterfaces",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK12SLObjectItf_sPPK14SLInterfaceID_jE"
    }
   ],
   "linker_set_key" : "_ZTI12SLObjectItf_",
   "name" : "SLObjectItf_",
   "referenced_type" : "_ZTI12SLObjectItf_",
   "self_type" : "_ZTI12SLObjectItf_",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetRecordState",
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_jE"
    },
    {
     "field_name" : "GetRecordState",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_PjE"
    },
    {
     "field_name" : "SetDurationLimit",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_jE"
    },
    {
     "field_name" : "GetPosition",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_PjE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_PFvS3_PvjES4_E"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_jE"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_PjE"
    },
    {
     "field_name" : "SetMarkerPosition",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_jE"
    },
    {
     "field_name" : "ClearMarkerPosition",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_E"
    },
    {
     "field_name" : "GetMarkerPosition",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_PjE"
    },
    {
     "field_name" : "SetPositionUpdatePeriod",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_jE"
    },
    {
     "field_name" : "GetPositionUpdatePeriod",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK12SLRecordItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI12SLRecordItf_",
   "name" : "SLRecordItf_",
   "referenced_type" : "_ZTI12SLRecordItf_",
   "self_type" : "_ZTI12SLRecordItf_",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetVolumeLevel",
     "referenced_type" : "_ZTIPFjPKPK12SLVolumeItf_sE"
    },
    {
     "field_name" : "GetVolumeLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK12SLVolumeItf_PsE"
    },
    {
     "field_name" : "GetMaxVolumeLevel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK12SLVolumeItf_PsE"
    },
    {
     "field_name" : "SetMute",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK12SLVolumeItf_jE"
    },
    {
     "field_name" : "GetMute",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK12SLVolumeItf_PjE"
    },
    {
     "field_name" : "EnableStereoPosition",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK12SLVolumeItf_jE"
    },
    {
     "field_name" : "IsEnabledStereoPosition",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK12SLVolumeItf_PjE"
    },
    {
     "field_name" : "SetStereoPosition",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK12SLVolumeItf_sE"
    },
    {
     "field_name" : "GetStereoPosition",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK12SLVolumeItf_PsE"
    }
   ],
   "linker_set_key" : "_ZTI12SLVolumeItf_",
   "name" : "SLVolumeItf_",
   "referenced_type" : "_ZTI12SLVolumeItf_",
   "self_type" : "_ZTI12SLVolumeItf_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "RegisterCallback",
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PFvS3_PvjjES4_E"
    },
    {
     "field_name" : "SetFlashMode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jE"
    },
    {
     "field_name" : "GetFlashMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjE"
    },
    {
     "field_name" : "IsFlashReady",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjE"
    },
    {
     "field_name" : "SetFocusMode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jijE"
    },
    {
     "field_name" : "GetFocusMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjPiS4_E"
    },
    {
     "field_name" : "SetFocusRegionPattern",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jjjE"
    },
    {
     "field_name" : "GetFocusRegionPattern",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjS4_S4_E"
    },
    {
     "field_name" : "GetFocusRegionPositions",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjP21XAFocusPointPosition_E"
    },
    {
     "field_name" : "GetFocusModeStatus",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjS4_S4_E"
    },
    {
     "field_name" : "SetMeteringMode",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jE"
    },
    {
     "field_name" : "GetMeteringMode",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjE"
    },
    {
     "field_name" : "SetExposureMode",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jjE"
    },
    {
     "field_name" : "GetExposureMode",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjS4_E"
    },
    {
     "field_name" : "SetISOSensitivity",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jjE"
    },
    {
     "field_name" : "GetISOSensitivity",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjS4_E"
    },
    {
     "field_name" : "SetAperture",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jjE"
    },
    {
     "field_name" : "GetAperture",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjS4_E"
    },
    {
     "field_name" : "SetShutterSpeed",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jjE"
    },
    {
     "field_name" : "GetShutterSpeed",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjS4_E"
    },
    {
     "field_name" : "SetWhiteBalance",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jjE"
    },
    {
     "field_name" : "GetWhiteBalance",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjS4_E"
    },
    {
     "field_name" : "SetAutoLocks",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_jE"
    },
    {
     "field_name" : "GetAutoLocks",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PjE"
    },
    {
     "field_name" : "SetZoom",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_sjjjE"
    },
    {
     "field_name" : "GetZoom",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPFjPKPK12XACameraItf_PsPjE"
    }
   ],
   "linker_set_key" : "_ZTI12XACameraItf_",
   "name" : "XACameraItf_",
   "referenced_type" : "_ZTI12XACameraItf_",
   "self_type" : "_ZTI12XACameraItf_",
   "size" : 104,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "CreateCameraDevice",
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PPKPK12XAObjectItf_jjPKPK14XAInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateRadioDevice",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PPKPK12XAObjectItf_jPKPK14XAInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateLEDDevice",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PPKPK12XAObjectItf_jjPKPK14XAInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateVibraDevice",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PPKPK12XAObjectItf_jjPKPK14XAInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateMediaPlayer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PPKPK12XAObjectItf_P13XADataSource_SB_P11XADataSink_SD_SD_SD_jPKPK14XAInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateMediaRecorder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PPKPK12XAObjectItf_P13XADataSource_SB_P11XADataSink_jPKPK14XAInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateOutputMix",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PPKPK12XAObjectItf_jPKPK14XAInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateMetadataExtractor",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PPKPK12XAObjectItf_P13XADataSource_jPKPK14XAInterfaceID_PKjE"
    },
    {
     "field_name" : "CreateExtensionObject",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PPKPK12XAObjectItf_PvjjPKPK14XAInterfaceID_PKjE"
    },
    {
     "field_name" : "GetImplementationInfo",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PjS4_S4_PKhE"
    },
    {
     "field_name" : "QuerySupportedProfiles",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PsE"
    },
    {
     "field_name" : "QueryNumSupportedInterfaces",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_jPjE"
    },
    {
     "field_name" : "QuerySupportedInterfaces",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_jjPPK14XAInterfaceID_E"
    },
    {
     "field_name" : "QueryNumSupportedExtensions",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PjE"
    },
    {
     "field_name" : "QuerySupportedExtension",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_jPhPsE"
    },
    {
     "field_name" : "IsExtensionSupported",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PKhPjE"
    },
    {
     "field_name" : "QueryLEDCapabilities",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PjS4_P16XALEDDescriptor_E"
    },
    {
     "field_name" : "QueryVibraCapabilities",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFjPKPK12XAEngineItf_PjS4_P18XAVibraDescriptor_E"
    }
   ],
   "linker_set_key" : "_ZTI12XAEngineItf_",
   "name" : "XAEngineItf_",
   "referenced_type" : "_ZTI12XAEngineItf_",
   "self_type" : "_ZTI12XAEngineItf_",
   "size" : 72,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Realize",
     "referenced_type" : "_ZTIPFjPKPK12XAObjectItf_jE"
    },
    {
     "field_name" : "Resume",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK12XAObjectItf_jE"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK12XAObjectItf_PjE"
    },
    {
     "field_name" : "GetInterface",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK12XAObjectItf_PK14XAInterfaceID_PvE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK12XAObjectItf_PFvS3_PKvjjjPvES6_E"
    },
    {
     "field_name" : "AbortAsyncOperation",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvPKPK12XAObjectItf_E"
    },
    {
     "field_name" : "Destroy",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvPKPK12XAObjectItf_E"
    },
    {
     "field_name" : "SetPriority",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK12XAObjectItf_ijE"
    },
    {
     "field_name" : "GetPriority",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK12XAObjectItf_PiPjE"
    },
    {
     "field_name" : "SetLossOfControlInterfaces",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK12XAObjectItf_sPPK14XAInterfaceID_jE"
    }
   ],
   "linker_set_key" : "_ZTI12XAObjectItf_",
   "name" : "XAObjectItf_",
   "referenced_type" : "_ZTI12XAObjectItf_",
   "self_type" : "_ZTI12XAObjectItf_",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetRecordState",
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_jE"
    },
    {
     "field_name" : "GetRecordState",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_PjE"
    },
    {
     "field_name" : "SetDurationLimit",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_jE"
    },
    {
     "field_name" : "GetPosition",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_PjE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_PFvS3_PvjES4_E"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_jE"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_PjE"
    },
    {
     "field_name" : "SetMarkerPosition",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_jE"
    },
    {
     "field_name" : "ClearMarkerPosition",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_E"
    },
    {
     "field_name" : "GetMarkerPosition",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_PjE"
    },
    {
     "field_name" : "SetPositionUpdatePeriod",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_jE"
    },
    {
     "field_name" : "GetPositionUpdatePeriod",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK12XARecordItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI12XARecordItf_",
   "name" : "XARecordItf_",
   "referenced_type" : "_ZTI12XARecordItf_",
   "self_type" : "_ZTI12XARecordItf_",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "width",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12XARectangle_",
   "name" : "XARectangle_",
   "referenced_type" : "_ZTI12XARectangle_",
   "self_type" : "_ZTI12XARectangle_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetVolumeLevel",
     "referenced_type" : "_ZTIPFjPKPK12XAVolumeItf_sE"
    },
    {
     "field_name" : "GetVolumeLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK12XAVolumeItf_PsE"
    },
    {
     "field_name" : "GetMaxVolumeLevel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK12XAVolumeItf_PsE"
    },
    {
     "field_name" : "SetMute",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK12XAVolumeItf_jE"
    },
    {
     "field_name" : "GetMute",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK12XAVolumeItf_PjE"
    },
    {
     "field_name" : "EnableStereoPosition",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK12XAVolumeItf_jE"
    },
    {
     "field_name" : "IsEnabledStereoPosition",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK12XAVolumeItf_PjE"
    },
    {
     "field_name" : "SetStereoPosition",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK12XAVolumeItf_sE"
    },
    {
     "field_name" : "GetStereoPosition",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK12XAVolumeItf_PsE"
    }
   ],
   "linker_set_key" : "_ZTI12XAVolumeItf_",
   "name" : "XAVolumeItf_",
   "referenced_type" : "_ZTI12XAVolumeItf_",
   "self_type" : "_ZTI12XAVolumeItf_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12_jfloatArray",
   "self_type" : "_ZTI12_jfloatArray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12_jshortArray",
   "self_type" : "_ZTI12_jshortArray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sample_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "offload_info",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20audio_offload_info_t"
    },
    {
     "field_name" : "frame_count",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12audio_config",
   "name" : "audio_config",
   "referenced_type" : "_ZTI12audio_config",
   "self_type" : "_ZTI12audio_config",
   "size" : 88,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "timeLow",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "timeMid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "timeHiAndVersion",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "clockSeq",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA6_h"
    }
   ],
   "linker_set_key" : "_ZTI12audio_uuid_s",
   "name" : "audio_uuid_s",
   "referenced_type" : "_ZTI12audio_uuid_s",
   "self_type" : "_ZTI12audio_uuid_s",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI11hw_module_t"
    },
    {
     "field_name" : "init",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFvP12power_moduleE"
    },
    {
     "field_name" : "setInteractive",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIPFvP12power_moduleiE"
    },
    {
     "field_name" : "powerHint",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFvP12power_module12power_hint_tPvE"
    },
    {
     "field_name" : "setFeature",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIPFvP12power_module9feature_tiE"
    },
    {
     "field_name" : "get_platform_low_power_stats",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFiP12power_moduleP34power_state_platform_sleep_state_tE"
    },
    {
     "field_name" : "get_number_of_platform_modes",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIPFiP12power_moduleE"
    },
    {
     "field_name" : "get_voter_list",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFiP12power_modulePjE"
    }
   ],
   "linker_set_key" : "_ZTI12power_module",
   "name" : "power_module",
   "referenced_type" : "_ZTI12power_module",
   "self_type" : "_ZTI12power_module",
   "size" : 156,
   "source_file" : "/hardware/libhardware/include/hardware/power.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI21android_native_base_t"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "minSwapInterval",
     "field_offset" : 288,
     "referenced_type" : "_ZTIKi"
    },
    {
     "field_name" : "maxSwapInterval",
     "field_offset" : 320,
     "referenced_type" : "_ZTIKi"
    },
    {
     "field_name" : "xdpi",
     "field_offset" : 352,
     "referenced_type" : "_ZTIKf"
    },
    {
     "field_name" : "ydpi",
     "field_offset" : 384,
     "referenced_type" : "_ZTIKf"
    },
    {
     "field_name" : "oem",
     "field_offset" : 416,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "setSwapInterval",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFiP13ANativeWindowiE"
    },
    {
     "field_name" : "dequeueBuffer_DEPRECATED",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFiP13ANativeWindowPP19ANativeWindowBufferE"
    },
    {
     "field_name" : "lockBuffer_DEPRECATED",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferE"
    },
    {
     "field_name" : "queueBuffer_DEPRECATED",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferE"
    },
    {
     "field_name" : "query",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFiPK13ANativeWindowiPiE"
    },
    {
     "field_name" : "perform",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFiP13ANativeWindowizE"
    },
    {
     "field_name" : "cancelBuffer_DEPRECATED",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferE"
    },
    {
     "field_name" : "dequeueBuffer",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFiP13ANativeWindowPP19ANativeWindowBufferPiE"
    },
    {
     "field_name" : "queueBuffer",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferiE"
    },
    {
     "field_name" : "cancelBuffer",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferiE"
    }
   ],
   "linker_set_key" : "_ZTI13ANativeWindow",
   "name" : "ANativeWindow",
   "referenced_type" : "_ZTI13ANativeWindow",
   "self_type" : "_ZTI13ANativeWindow",
   "size" : 108,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pLocator",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pFormat",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI13SLDataSource_",
   "name" : "SLDataSource_",
   "referenced_type" : "_ZTI13SLDataSource_",
   "self_type" : "_ZTI13SLDataSource_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pLocator",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pFormat",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI13XADataSource_",
   "name" : "XADataSource_",
   "referenced_type" : "_ZTI13XADataSource_",
   "self_type" : "_ZTI13XADataSource_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13_jdoubleArray",
   "self_type" : "_ZTI13_jdoubleArray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13_jobjectArray",
   "self_type" : "_ZTI13_jobjectArray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 56,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12JavaVMOption"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI14JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "_ZTI14JavaVMInitArgs",
   "self_type" : "_ZTI14JavaVMInitArgs",
   "size" : 16,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Commit",
     "referenced_type" : "_ZTIPFjPKPK14SL3DCommitItf_E"
    },
    {
     "field_name" : "SetDeferred",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK14SL3DCommitItf_jE"
    }
   ],
   "linker_set_key" : "_ZTI14SL3DCommitItf_",
   "name" : "SL3DCommitItf_",
   "referenced_type" : "_ZTI14SL3DCommitItf_",
   "self_type" : "_ZTI14SL3DCommitItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetHeadRelative",
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_jE"
    },
    {
     "field_name" : "GetHeadRelative",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_PjE"
    },
    {
     "field_name" : "SetRolloffDistances",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_iiE"
    },
    {
     "field_name" : "GetRolloffDistances",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_PiS4_E"
    },
    {
     "field_name" : "SetRolloffMaxDistanceMute",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_jE"
    },
    {
     "field_name" : "GetRolloffMaxDistanceMute",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_PjE"
    },
    {
     "field_name" : "SetRolloffFactor",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_sE"
    },
    {
     "field_name" : "GetRolloffFactor",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_PsE"
    },
    {
     "field_name" : "SetRoomRolloffFactor",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_sE"
    },
    {
     "field_name" : "GetRoomRolloffFactor",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_PsE"
    },
    {
     "field_name" : "SetRolloffModel",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_hE"
    },
    {
     "field_name" : "GetRolloffModel",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_PhE"
    },
    {
     "field_name" : "SetCone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_iisE"
    },
    {
     "field_name" : "GetCone",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFjPKPK14SL3DSourceItf_PiS4_PsE"
    }
   ],
   "linker_set_key" : "_ZTI14SL3DSourceItf_",
   "name" : "SL3DSourceItf_",
   "referenced_type" : "_ZTI14SL3DSourceItf_",
   "self_type" : "_ZTI14SL3DSourceItf_",
   "size" : 56,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "time_low",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "time_mid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "time_hi_and_version",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "clock_seq",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA6_h"
    }
   ],
   "linker_set_key" : "_ZTI14SLInterfaceID_",
   "name" : "SLInterfaceID_",
   "referenced_type" : "_ZTI14SLInterfaceID_",
   "self_type" : "_ZTI14SLInterfaceID_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ActivateLEDArray",
     "referenced_type" : "_ZTIPFjPKPK14SLLEDArrayItf_jE"
    },
    {
     "field_name" : "IsLEDArrayActivated",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK14SLLEDArrayItf_PjE"
    },
    {
     "field_name" : "SetColor",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK14SLLEDArrayItf_hPK6SLHSL_E"
    },
    {
     "field_name" : "GetColor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK14SLLEDArrayItf_hP6SLHSL_E"
    }
   ],
   "linker_set_key" : "_ZTI14SLLEDArrayItf_",
   "name" : "SLLEDArrayItf_",
   "referenced_type" : "_ZTI14SLLEDArrayItf_",
   "self_type" : "_ZTI14SLLEDArrayItf_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetDuration",
     "referenced_type" : "_ZTIPFjPKPK14SLMIDITimeItf_PjE"
    },
    {
     "field_name" : "SetPosition",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK14SLMIDITimeItf_jE"
    },
    {
     "field_name" : "GetPosition",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK14SLMIDITimeItf_PjE"
    },
    {
     "field_name" : "SetLoopPoints",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK14SLMIDITimeItf_jjE"
    },
    {
     "field_name" : "GetLoopPoints",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK14SLMIDITimeItf_PjS4_E"
    }
   ],
   "linker_set_key" : "_ZTI14SLMIDITimeItf_",
   "name" : "SLMIDITimeItf_",
   "referenced_type" : "_ZTI14SLMIDITimeItf_",
   "self_type" : "_ZTI14SLMIDITimeItf_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetChannelMute",
     "referenced_type" : "_ZTIPFjPKPK14SLMuteSoloItf_hjE"
    },
    {
     "field_name" : "GetChannelMute",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK14SLMuteSoloItf_hPjE"
    },
    {
     "field_name" : "SetChannelSolo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK14SLMuteSoloItf_hjE"
    },
    {
     "field_name" : "GetChannelSolo",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK14SLMuteSoloItf_hPjE"
    },
    {
     "field_name" : "GetNumChannels",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK14SLMuteSoloItf_PhE"
    }
   ],
   "linker_set_key" : "_ZTI14SLMuteSoloItf_",
   "name" : "SLMuteSoloItf_",
   "referenced_type" : "_ZTI14SLMuteSoloItf_",
   "self_type" : "_ZTI14SLMuteSoloItf_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "time_low",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "time_mid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "time_hi_and_version",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "clock_seq",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA6_h"
    }
   ],
   "linker_set_key" : "_ZTI14XAInterfaceID_",
   "name" : "XAInterfaceID_",
   "referenced_type" : "_ZTI14XAInterfaceID_",
   "self_type" : "_ZTI14XAInterfaceID_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ActivateLEDArray",
     "referenced_type" : "_ZTIPFjPKPK14XALEDArrayItf_jE"
    },
    {
     "field_name" : "IsLEDArrayActivated",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK14XALEDArrayItf_PjE"
    },
    {
     "field_name" : "SetColor",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK14XALEDArrayItf_hPK6XAHSL_E"
    },
    {
     "field_name" : "GetColor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK14XALEDArrayItf_hP6XAHSL_E"
    }
   ],
   "linker_set_key" : "_ZTI14XALEDArrayItf_",
   "name" : "XALEDArrayItf_",
   "referenced_type" : "_ZTI14XALEDArrayItf_",
   "self_type" : "_ZTI14XALEDArrayItf_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "InitiateSnapshot",
     "referenced_type" : "_ZTIPFjPKPK14XASnapshotItf_jjj11XADataSink_PFvS3_PvEPFvS3_S5_jPKS4_ES5_E"
    },
    {
     "field_name" : "TakeSnapshot",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK14XASnapshotItf_E"
    },
    {
     "field_name" : "CancelSnapshot",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK14XASnapshotItf_E"
    },
    {
     "field_name" : "ReleaseBuffers",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK14XASnapshotItf_P11XADataSink_E"
    },
    {
     "field_name" : "GetMaxPicsPerBurst",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK14XASnapshotItf_PjE"
    },
    {
     "field_name" : "GetBurstFPSRange",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK14XASnapshotItf_PjS4_E"
    },
    {
     "field_name" : "SetShutterFeedback",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK14XASnapshotItf_jE"
    },
    {
     "field_name" : "GetShutterFeedback",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK14XASnapshotItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI14XASnapshotItf_",
   "name" : "XASnapshotItf_",
   "referenced_type" : "_ZTI14XASnapshotItf_",
   "self_type" : "_ZTI14XASnapshotItf_",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI14_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14_jbooleanArray",
   "self_type" : "_ZTI14_jbooleanArray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "frameCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN14audio_buffer_sUt_E"
    }
   ],
   "linker_set_key" : "_ZTI14audio_buffer_s",
   "name" : "audio_buffer_s",
   "referenced_type" : "_ZTI14audio_buffer_s",
   "self_type" : "_ZTI14audio_buffer_s",
   "size" : 8,
   "source_file" : "/system/media/audio/include/system/audio_effect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input",
     "referenced_type" : "_ZTI19audio_input_flags_t"
    },
    {
     "field_name" : "output",
     "referenced_type" : "_ZTI20audio_output_flags_t"
    }
   ],
   "linker_set_key" : "_ZTI14audio_io_flags",
   "name" : "audio_io_flags",
   "record_kind" : "union",
   "referenced_type" : "_ZTI14audio_io_flags",
   "self_type" : "_ZTI14audio_io_flags",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "status",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "psize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vsize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA_c"
    }
   ],
   "linker_set_key" : "_ZTI14effect_param_s",
   "name" : "effect_param_s",
   "referenced_type" : "_ZTI14effect_param_s",
   "self_type" : "_ZTI14effect_param_s",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio_effect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "_ZTI15JNINativeMethod",
   "self_type" : "_ZTI15JNINativeMethod",
   "size" : 12,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetVelocityCartesian",
     "referenced_type" : "_ZTIPFjPKPK15SL3DDopplerItf_PK8SLVec3D_E"
    },
    {
     "field_name" : "SetVelocitySpherical",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK15SL3DDopplerItf_iiiE"
    },
    {
     "field_name" : "GetVelocityCartesian",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK15SL3DDopplerItf_P8SLVec3D_E"
    },
    {
     "field_name" : "SetDopplerFactor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK15SL3DDopplerItf_sE"
    },
    {
     "field_name" : "GetDopplerFactor",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK15SL3DDopplerItf_PsE"
    }
   ],
   "linker_set_key" : "_ZTI15SL3DDopplerItf_",
   "name" : "SL3DDopplerItf_",
   "referenced_type" : "_ZTI15SL3DDopplerItf_",
   "self_type" : "_ZTI15SL3DDopplerItf_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "_ZTIPFjPKPK15SLBassBoostItf_jE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK15SLBassBoostItf_PjE"
    },
    {
     "field_name" : "SetStrength",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK15SLBassBoostItf_sE"
    },
    {
     "field_name" : "GetRoundedStrength",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK15SLBassBoostItf_PsE"
    },
    {
     "field_name" : "IsStrengthSupported",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK15SLBassBoostItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI15SLBassBoostItf_",
   "name" : "SLBassBoostItf_",
   "referenced_type" : "_ZTI15SLBassBoostItf_",
   "self_type" : "_ZTI15SLBassBoostItf_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "feature",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15SLEngineOption_",
   "name" : "SLEngineOption_",
   "referenced_type" : "_ZTI15SLEngineOption_",
   "self_type" : "_ZTI15SLEngineOption_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_jE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_PjE"
    },
    {
     "field_name" : "GetNumberOfBands",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_PtE"
    },
    {
     "field_name" : "GetBandLevelRange",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_PsS4_E"
    },
    {
     "field_name" : "SetBandLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_tsE"
    },
    {
     "field_name" : "GetBandLevel",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_tPsE"
    },
    {
     "field_name" : "GetCenterFreq",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_tPjE"
    },
    {
     "field_name" : "GetBandFreqRange",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_tPjS4_E"
    },
    {
     "field_name" : "GetBand",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_jPtE"
    },
    {
     "field_name" : "GetCurrentPreset",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_PtE"
    },
    {
     "field_name" : "UsePreset",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_tE"
    },
    {
     "field_name" : "GetNumberOfPresets",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_PtE"
    },
    {
     "field_name" : "GetPresetName",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFjPKPK15SLEqualizerItf_tPPKhE"
    }
   ],
   "linker_set_key" : "_ZTI15SLEqualizerItf_",
   "name" : "SLEqualizerItf_",
   "referenced_type" : "_ZTI15SLEqualizerItf_",
   "self_type" : "_ZTI15SLEqualizerItf_",
   "size" : 52,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetTicksPerQuarterNote",
     "referenced_type" : "_ZTIPFjPKPK15SLMIDITempoItf_jE"
    },
    {
     "field_name" : "GetTicksPerQuarterNote",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK15SLMIDITempoItf_PjE"
    },
    {
     "field_name" : "SetMicrosecondsPerQuarterNote",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK15SLMIDITempoItf_jE"
    },
    {
     "field_name" : "GetMicrosecondsPerQuarterNote",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK15SLMIDITempoItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI15SLMIDITempoItf_",
   "name" : "SLMIDITempoItf_",
   "referenced_type" : "_ZTI15SLMIDITempoItf_",
   "self_type" : "_ZTI15SLMIDITempoItf_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "langCountry",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI15SLMetadataInfo_",
   "name" : "SLMetadataInfo_",
   "referenced_type" : "_ZTI15SLMetadataInfo_",
   "self_type" : "_ZTI15SLMetadataInfo_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetDestinationOutputDeviceIDs",
     "referenced_type" : "_ZTIPFjPKPK15SLOutputMixItf_PiPjE"
    },
    {
     "field_name" : "RegisterDeviceChangeCallback",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK15SLOutputMixItf_PFvS3_PvES4_E"
    },
    {
     "field_name" : "ReRoute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK15SLOutputMixItf_iPjE"
    }
   ],
   "linker_set_key" : "_ZTI15SLOutputMixItf_",
   "name" : "SLOutputMixItf_",
   "referenced_type" : "_ZTI15SLOutputMixItf_",
   "self_type" : "_ZTI15SLOutputMixItf_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetRate",
     "referenced_type" : "_ZTIPFjPKPK15SLRatePitchItf_sE"
    },
    {
     "field_name" : "GetRate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK15SLRatePitchItf_PsE"
    },
    {
     "field_name" : "GetRatePitchCapabilities",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK15SLRatePitchItf_PsS4_E"
    }
   ],
   "linker_set_key" : "_ZTI15SLRatePitchItf_",
   "name" : "SLRatePitchItf_",
   "referenced_type" : "_ZTI15SLRatePitchItf_",
   "self_type" : "_ZTI15SLRatePitchItf_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "feature",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15XAEngineOption_",
   "name" : "XAEngineOption_",
   "referenced_type" : "_ZTI15XAEngineOption_",
   "self_type" : "_ZTI15XAEngineOption_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_jE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_PjE"
    },
    {
     "field_name" : "GetNumberOfBands",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_PtE"
    },
    {
     "field_name" : "GetBandLevelRange",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_PsS4_E"
    },
    {
     "field_name" : "SetBandLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_tsE"
    },
    {
     "field_name" : "GetBandLevel",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_tPsE"
    },
    {
     "field_name" : "GetCenterFreq",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_tPjE"
    },
    {
     "field_name" : "GetBandFreqRange",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_tPjS4_E"
    },
    {
     "field_name" : "GetBand",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_jPtE"
    },
    {
     "field_name" : "GetCurrentPreset",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_PtE"
    },
    {
     "field_name" : "UsePreset",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_tE"
    },
    {
     "field_name" : "GetNumberOfPresets",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_PtE"
    },
    {
     "field_name" : "GetPresetName",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFjPKPK15XAEqualizerItf_tPPKhE"
    }
   ],
   "linker_set_key" : "_ZTI15XAEqualizerItf_",
   "name" : "XAEqualizerItf_",
   "referenced_type" : "_ZTI15XAEqualizerItf_",
   "self_type" : "_ZTI15XAEqualizerItf_",
   "size" : 52,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "langCountry",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA16_Kh"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI15XAMetadataInfo_",
   "name" : "XAMetadataInfo_",
   "referenced_type" : "_ZTI15XAMetadataInfo_",
   "self_type" : "_ZTI15XAMetadataInfo_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetDestinationOutputDeviceIDs",
     "referenced_type" : "_ZTIPFjPKPK15XAOutputMixItf_PiPjE"
    },
    {
     "field_name" : "RegisterDeviceChangeCallback",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK15XAOutputMixItf_PFvS3_PvES4_E"
    },
    {
     "field_name" : "ReRoute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK15XAOutputMixItf_iPjE"
    }
   ],
   "linker_set_key" : "_ZTI15XAOutputMixItf_",
   "name" : "XAOutputMixItf_",
   "referenced_type" : "_ZTI15XAOutputMixItf_",
   "self_type" : "_ZTI15XAOutputMixItf_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTI14audio_buffer_s"
    },
    {
     "field_name" : "samplingRate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bufferProvider",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17buffer_provider_s"
    },
    {
     "field_name" : "format",
     "field_offset" : 224,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "accessMode",
     "field_offset" : 232,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "mask",
     "field_offset" : 240,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI15buffer_config_s",
   "name" : "buffer_config_s",
   "referenced_type" : "_ZTI15buffer_config_s",
   "self_type" : "_ZTI15buffer_config_s",
   "size" : 32,
   "source_file" : "/system/media/audio/include/system/audio_effect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "inputCfg",
     "referenced_type" : "_ZTI15buffer_config_s"
    },
    {
     "field_name" : "outputCfg",
     "field_offset" : 256,
     "referenced_type" : "_ZTI15buffer_config_s"
    }
   ],
   "linker_set_key" : "_ZTI15effect_config_s",
   "name" : "effect_config_s",
   "referenced_type" : "_ZTI15effect_config_s",
   "self_type" : "_ZTI15effect_config_s",
   "size" : 64,
   "source_file" : "/system/media/audio/include/system/audio_effect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "group",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI16JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "_ZTI16JavaVMAttachArgs",
   "self_type" : "_ZTI16JavaVMAttachArgs",
   "size" : 12,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Set3DGroup",
     "referenced_type" : "_ZTIPFjPKPK16SL3DGroupingItf_PKPK12SLObjectItf_E"
    },
    {
     "field_name" : "Get3DGroup",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK16SL3DGroupingItf_PPKPK12SLObjectItf_E"
    }
   ],
   "linker_set_key" : "_ZTI16SL3DGroupingItf_",
   "name" : "SL3DGroupingItf_",
   "referenced_type" : "_ZTI16SL3DGroupingItf_",
   "self_type" : "_ZTI16SL3DGroupingItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetLocationCartesian",
     "referenced_type" : "_ZTIPFjPKPK16SL3DLocationItf_PK8SLVec3D_E"
    },
    {
     "field_name" : "SetLocationSpherical",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK16SL3DLocationItf_iiiE"
    },
    {
     "field_name" : "Move",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK16SL3DLocationItf_PK8SLVec3D_E"
    },
    {
     "field_name" : "GetLocationCartesian",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK16SL3DLocationItf_P8SLVec3D_E"
    },
    {
     "field_name" : "SetOrientationVectors",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK16SL3DLocationItf_PK8SLVec3D_S6_E"
    },
    {
     "field_name" : "SetOrientationAngles",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK16SL3DLocationItf_iiiE"
    },
    {
     "field_name" : "Rotate",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK16SL3DLocationItf_iPK8SLVec3D_E"
    },
    {
     "field_name" : "GetOrientationVectors",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK16SL3DLocationItf_P8SLVec3D_S5_E"
    }
   ],
   "linker_set_key" : "_ZTI16SL3DLocationItf_",
   "name" : "SL3DLocationItf_",
   "referenced_type" : "_ZTI16SL3DLocationItf_",
   "self_type" : "_ZTI16SL3DLocationItf_",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "EnableEffectSend",
     "referenced_type" : "_ZTIPFjPKPK16SLEffectSendItf_PKvjsE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK16SLEffectSendItf_PKvPjE"
    },
    {
     "field_name" : "SetDirectLevel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK16SLEffectSendItf_sE"
    },
    {
     "field_name" : "GetDirectLevel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK16SLEffectSendItf_PsE"
    },
    {
     "field_name" : "SetSendLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK16SLEffectSendItf_PKvsE"
    },
    {
     "field_name" : "GetSendLevel",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK16SLEffectSendItf_PKvPsE"
    }
   ],
   "linker_set_key" : "_ZTI16SLEffectSendItf_",
   "name" : "SLEffectSendItf_",
   "referenced_type" : "_ZTI16SLEffectSendItf_",
   "self_type" : "_ZTI16SLEffectSendItf_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ledCount",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "primaryLED",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "colorMask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16SLLEDDescriptor_",
   "name" : "SLLEDDescriptor_",
   "referenced_type" : "_ZTI16SLLEDDescriptor_",
   "self_type" : "_ZTI16SLLEDDescriptor_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "EnterCriticalSection",
     "referenced_type" : "_ZTIPFjPKPK16SLThreadSyncItf_E"
    },
    {
     "field_name" : "ExitCriticalSection",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK16SLThreadSyncItf_E"
    }
   ],
   "linker_set_key" : "_ZTI16SLThreadSyncItf_",
   "name" : "SLThreadSyncItf_",
   "referenced_type" : "_ZTI16SLThreadSyncItf_",
   "self_type" : "_ZTI16SLThreadSyncItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encoderId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "compressionLevel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "colorFormat",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16XAImageSettings_",
   "name" : "XAImageSettings_",
   "referenced_type" : "_ZTI16XAImageSettings_",
   "self_type" : "_ZTI16XAImageSettings_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ledCount",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "primaryLED",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "colorMask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16XALEDDescriptor_",
   "name" : "XALEDDescriptor_",
   "referenced_type" : "_ZTI16XALEDDescriptor_",
   "self_type" : "_ZTI16XALEDDescriptor_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "EnterCriticalSection",
     "referenced_type" : "_ZTIPFjPKPK16XAThreadSyncItf_E"
    },
    {
     "field_name" : "ExitCriticalSection",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK16XAThreadSyncItf_E"
    }
   ],
   "linker_set_key" : "_ZTI16XAThreadSyncItf_",
   "name" : "XAThreadSyncItf_",
   "referenced_type" : "_ZTI16XAThreadSyncItf_",
   "self_type" : "_ZTI16XAThreadSyncItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encoderId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "frameRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rateControl",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "levelSetting",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keyFrameInterval",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16XAVideoSettings_",
   "name" : "XAVideoSettings_",
   "referenced_type" : "_ZTI16XAVideoSettings_",
   "self_type" : "_ZTI16XAVideoSettings_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "main_channels",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "aux_channels",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16channel_config_s",
   "name" : "channel_config_s",
   "referenced_type" : "_ZTI16channel_config_s",
   "self_type" : "_ZTI16channel_config_s",
   "size" : 8,
   "source_file" : "/system/media/audio/include/system/audio_effect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Enqueue",
     "referenced_type" : "_ZTIPFjPKPK17SLBufferQueueItf_PKvjE"
    },
    {
     "field_name" : "Clear",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK17SLBufferQueueItf_E"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK17SLBufferQueueItf_P19SLBufferQueueState_E"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK17SLBufferQueueItf_PFvS3_PvES4_E"
    }
   ],
   "linker_set_key" : "_ZTI17SLBufferQueueItf_",
   "name" : "SLBufferQueueItf_",
   "referenced_type" : "_ZTI17SLBufferQueueItf_",
   "self_type" : "_ZTI17SLBufferQueueItf_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numChannels",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplesPerSec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "containerSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "endianness",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17SLDataFormat_PCM_",
   "name" : "SLDataFormat_PCM_",
   "referenced_type" : "_ZTI17SLDataFormat_PCM_",
   "self_type" : "_ZTI17SLDataFormat_PCM_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SendMessage",
     "referenced_type" : "_ZTIPFjPKPK17SLMIDIMessageItf_PKhjE"
    },
    {
     "field_name" : "RegisterMetaEventCallback",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK17SLMIDIMessageItf_PFvS3_PvhjPKhjtES4_E"
    },
    {
     "field_name" : "RegisterMIDIMessageCallback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK17SLMIDIMessageItf_PFvS3_PvhjPKhjtES4_E"
    },
    {
     "field_name" : "AddMIDIMessageCallbackFilter",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK17SLMIDIMessageItf_jE"
    },
    {
     "field_name" : "ClearMIDIMessageCallbackFilter",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK17SLMIDIMessageItf_E"
    }
   ],
   "linker_set_key" : "_ZTI17SLMIDIMessageItf_",
   "name" : "SLMIDIMessageItf_",
   "referenced_type" : "_ZTI17SLMIDIMessageItf_",
   "self_type" : "_ZTI17SLMIDIMessageItf_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "_ZTIPFjPKPK17SLVirtualizerItf_jE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK17SLVirtualizerItf_PjE"
    },
    {
     "field_name" : "SetStrength",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK17SLVirtualizerItf_sE"
    },
    {
     "field_name" : "GetRoundedStrength",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK17SLVirtualizerItf_PsE"
    },
    {
     "field_name" : "IsStrengthSupported",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK17SLVirtualizerItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI17SLVirtualizerItf_",
   "name" : "SLVirtualizerItf_",
   "referenced_type" : "_ZTI17SLVirtualizerItf_",
   "self_type" : "_ZTI17SLVirtualizerItf_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numChannels",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplesPerSec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "containerSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "endianness",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17XADataFormat_PCM_",
   "name" : "XADataFormat_PCM_",
   "referenced_type" : "_ZTI17XADataFormat_PCM_",
   "self_type" : "_ZTI17XADataFormat_PCM_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sample_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14audio_format_t"
    }
   ],
   "linker_set_key" : "_ZTI17audio_config_base",
   "name" : "audio_config_base",
   "referenced_type" : "_ZTI17audio_config_base",
   "self_type" : "_ZTI17audio_config_base",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "values",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA32_i"
    },
    {
     "field_name" : "ramp_duration_ms",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17audio_gain_config",
   "name" : "audio_gain_config",
   "referenced_type" : "_ZTI17audio_gain_config",
   "self_type" : "_ZTI17audio_gain_config",
   "size" : 144,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "_ZTI17audio_port_role_t"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI17audio_port_type_t"
    },
    {
     "field_name" : "config_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "gain",
     "field_offset" : 224,
     "referenced_type" : "_ZTI17audio_gain_config"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1376,
     "referenced_type" : "_ZTI14audio_io_flags"
    },
    {
     "field_name" : "ext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIN17audio_port_configUt_E"
    }
   ],
   "linker_set_key" : "_ZTI17audio_port_config",
   "name" : "audio_port_config",
   "referenced_type" : "_ZTI17audio_port_config",
   "self_type" : "_ZTI17audio_port_config",
   "size" : 216,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "getBuffer",
     "referenced_type" : "_ZTIPFiPvP14audio_buffer_sE"
    },
    {
     "field_name" : "releaseBuffer",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiPvP14audio_buffer_sE"
    },
    {
     "field_name" : "cookie",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI17buffer_provider_s",
   "name" : "buffer_provider_s",
   "referenced_type" : "_ZTI17buffer_provider_s",
   "self_type" : "_ZTI17buffer_provider_s",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio_effect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP7_JavaVMPPviE"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    }
   ],
   "linker_set_key" : "_ZTI18JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "_ZTI18JNIInvokeInterface",
   "self_type" : "_ZTI18JNIInvokeInterface",
   "size" : 32,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP7_JNIEnvE"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcP8_jobjectPKaiE"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcE"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDhE"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvS0_E"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassS2_E"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP11_jthrowableE"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPKcE"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFP11_jthrowableP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvP7_JNIEnvPKcE"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectS2_E"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 864,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 928,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 992,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassE"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDzE"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 1312,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 1824,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 1888,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 1952,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 2016,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 2272,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 2400,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 2464,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 2528,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 2592,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 2656,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 2720,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 2784,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 2848,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 2912,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 2976,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 3040,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P9_jfieldIDE"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 3104,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 3168,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 3232,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 3296,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDS2_E"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 3360,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDhE"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDaE"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 3424,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDtE"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDsE"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 3488,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDiE"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDxE"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 3552,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDfE"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDdE"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 3616,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 3680,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 3744,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 3808,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 3872,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 3936,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 4000,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 4064,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 4256,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 4320,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 4384,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 4448,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 4512,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 4576,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 4640,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 4704,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 4768,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 4800,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 4832,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 4864,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 4896,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 4928,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDP8_jobjectE"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 4960,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 4992,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDaE"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 5024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDtE"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 5056,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDsE"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 5088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDiE"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 5120,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDxE"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 5152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDfE"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDdE"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 5216,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKtiE"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 5248,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 5280,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 5312,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 5344,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKcE"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 5376,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 5408,
     "referenced_type" : "_ZTIPFPKcP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKcE"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 5472,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jarrayE"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIPFP13_jobjectArrayP7_JNIEnviP7_jclassP8_jobjectE"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 5536,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP13_jobjectArrayiE"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jobjectArrayiP8_jobjectE"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 5600,
     "referenced_type" : "_ZTIPFP14_jbooleanArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPFP11_jbyteArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 5664,
     "referenced_type" : "_ZTIPFP11_jcharArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPFP12_jshortArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 5728,
     "referenced_type" : "_ZTIPFP10_jintArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIPFP11_jlongArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 5792,
     "referenced_type" : "_ZTIPFP12_jfloatArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIPFP13_jdoubleArrayP7_JNIEnviE"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 5856,
     "referenced_type" : "_ZTIPFPhP7_JNIEnvP14_jbooleanArrayS_E"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIPFPaP7_JNIEnvP11_jbyteArrayPhE"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 5920,
     "referenced_type" : "_ZTIPFPtP7_JNIEnvP11_jcharArrayPhE"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIPFPsP7_JNIEnvP12_jshortArrayPhE"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 5984,
     "referenced_type" : "_ZTIPFPiP7_JNIEnvP10_jintArrayPhE"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPFPxP7_JNIEnvP11_jlongArrayPhE"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 6048,
     "referenced_type" : "_ZTIPFPfP7_JNIEnvP12_jfloatArrayPhE"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIPFPdP7_JNIEnvP13_jdoubleArrayPhE"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 6112,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayPhiE"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayPaiE"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 6176,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayPtiE"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayPsiE"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 6240,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayPiiE"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayPxiE"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 6304,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayPfiE"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayPdiE"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 6368,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPhE"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPaE"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 6432,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPtE"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPsE"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 6496,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPiE"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPxE"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 6560,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPfE"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPdE"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 6624,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPKhE"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPKaE"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 6688,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPKtE"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPKsE"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 6752,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPKiE"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPKxE"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 6816,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPKfE"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 6848,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPKdE"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 6880,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPK15JNINativeMethodiE"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 6944,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 7008,
     "referenced_type" : "_ZTIPFiP7_JNIEnvPP7_JavaVME"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPtE"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 7072,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPcE"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 7104,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP7_jarrayPhE"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 7136,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jarrayPviE"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 7168,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 7200,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 7232,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 7264,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIPFhP7_JNIEnvE"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 7328,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvPvxE"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 7360,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 7392,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 7424,
     "referenced_type" : "_ZTIPF14jobjectRefTypeP7_JNIEnvP8_jobjectE"
    }
   ],
   "linker_set_key" : "_ZTI18JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "_ZTI18JNINativeInterface",
   "self_type" : "_ZTI18JNINativeInterface",
   "size" : 932,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetEncoderSettings",
     "referenced_type" : "_ZTIPFjPKPK18SLAudioEncoderItf_P23SLAudioEncoderSettings_E"
    },
    {
     "field_name" : "GetEncoderSettings",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18SLAudioEncoderItf_P23SLAudioEncoderSettings_E"
    }
   ],
   "linker_set_key" : "_ZTI18SLAudioEncoderItf_",
   "name" : "SLAudioEncoderItf_",
   "referenced_type" : "_ZTI18SLAudioEncoderItf_",
   "self_type" : "_ZTI18SLAudioEncoderItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mimeType",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "containerType",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18SLDataFormat_MIME_",
   "name" : "SLDataFormat_MIME_",
   "referenced_type" : "_ZTI18SLDataFormat_MIME_",
   "self_type" : "_ZTI18SLDataFormat_MIME_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "URI",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTI18SLDataLocator_URI_",
   "name" : "SLDataLocator_URI_",
   "referenced_type" : "_ZTI18SLDataLocator_URI_",
   "self_type" : "_ZTI18SLDataLocator_URI_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetVolumeScale",
     "referenced_type" : "_ZTIPFjPKPK18SLDeviceVolumeItf_jPiS4_PjE"
    },
    {
     "field_name" : "SetVolume",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18SLDeviceVolumeItf_jiE"
    },
    {
     "field_name" : "GetVolume",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK18SLDeviceVolumeItf_jPiE"
    }
   ],
   "linker_set_key" : "_ZTI18SLDeviceVolumeItf_",
   "name" : "SLDeviceVolumeItf_",
   "referenced_type" : "_ZTI18SLDeviceVolumeItf_",
   "self_type" : "_ZTI18SLDeviceVolumeItf_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetChannelMute",
     "referenced_type" : "_ZTIPFjPKPK18SLMIDIMuteSoloItf_hjE"
    },
    {
     "field_name" : "GetChannelMute",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18SLMIDIMuteSoloItf_hPjE"
    },
    {
     "field_name" : "SetChannelSolo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK18SLMIDIMuteSoloItf_hjE"
    },
    {
     "field_name" : "GetChannelSolo",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK18SLMIDIMuteSoloItf_hPjE"
    },
    {
     "field_name" : "GetTrackCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK18SLMIDIMuteSoloItf_PtE"
    },
    {
     "field_name" : "SetTrackMute",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK18SLMIDIMuteSoloItf_tjE"
    },
    {
     "field_name" : "GetTrackMute",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK18SLMIDIMuteSoloItf_tPjE"
    },
    {
     "field_name" : "SetTrackSolo",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK18SLMIDIMuteSoloItf_tjE"
    },
    {
     "field_name" : "GetTrackSolo",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK18SLMIDIMuteSoloItf_tPjE"
    }
   ],
   "linker_set_key" : "_ZTI18SLMIDIMuteSoloItf_",
   "name" : "SLMIDIMuteSoloItf_",
   "referenced_type" : "_ZTI18SLMIDIMuteSoloItf_",
   "self_type" : "_ZTI18SLMIDIMuteSoloItf_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetRate",
     "referenced_type" : "_ZTIPFjPKPK18SLPlaybackRateItf_sE"
    },
    {
     "field_name" : "GetRate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18SLPlaybackRateItf_PsE"
    },
    {
     "field_name" : "SetPropertyConstraints",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK18SLPlaybackRateItf_jE"
    },
    {
     "field_name" : "GetProperties",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK18SLPlaybackRateItf_PjE"
    },
    {
     "field_name" : "GetCapabilitiesOfRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK18SLPlaybackRateItf_sPjE"
    },
    {
     "field_name" : "GetRateRange",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK18SLPlaybackRateItf_hPsS4_S4_PjE"
    }
   ],
   "linker_set_key" : "_ZTI18SLPlaybackRateItf_",
   "name" : "SLPlaybackRateItf_",
   "referenced_type" : "_ZTI18SLPlaybackRateItf_",
   "self_type" : "_ZTI18SLPlaybackRateItf_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetPreset",
     "referenced_type" : "_ZTIPFjPKPK18SLPresetReverbItf_tE"
    },
    {
     "field_name" : "GetPreset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18SLPresetReverbItf_PtE"
    }
   ],
   "linker_set_key" : "_ZTI18SLPresetReverbItf_",
   "name" : "SLPresetReverbItf_",
   "referenced_type" : "_ZTI18SLPresetReverbItf_",
   "self_type" : "_ZTI18SLPresetReverbItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "supportsFrequency",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "supportsIntensity",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minFrequency",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFrequency",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18SLVibraDescriptor_",
   "name" : "SLVibraDescriptor_",
   "referenced_type" : "_ZTI18SLVibraDescriptor_",
   "self_type" : "_ZTI18SLVibraDescriptor_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetEncoderSettings",
     "referenced_type" : "_ZTIPFjPKPK18XAAudioEncoderItf_P23XAAudioEncoderSettings_E"
    },
    {
     "field_name" : "GetEncoderSettings",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18XAAudioEncoderItf_P23XAAudioEncoderSettings_E"
    }
   ],
   "linker_set_key" : "_ZTI18XAAudioEncoderItf_",
   "name" : "XAAudioEncoderItf_",
   "referenced_type" : "_ZTI18XAAudioEncoderItf_",
   "self_type" : "_ZTI18XAAudioEncoderItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mimeType",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "containerType",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18XADataFormat_MIME_",
   "name" : "XADataFormat_MIME_",
   "referenced_type" : "_ZTI18XADataFormat_MIME_",
   "self_type" : "_ZTI18XADataFormat_MIME_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "URI",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPh"
    }
   ],
   "linker_set_key" : "_ZTI18XADataLocator_URI_",
   "name" : "XADataLocator_URI_",
   "referenced_type" : "_ZTI18XADataLocator_URI_",
   "self_type" : "_ZTI18XADataLocator_URI_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetVolumeScale",
     "referenced_type" : "_ZTIPFjPKPK18XADeviceVolumeItf_jPiS4_PjE"
    },
    {
     "field_name" : "SetVolume",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18XADeviceVolumeItf_jiE"
    },
    {
     "field_name" : "GetVolume",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK18XADeviceVolumeItf_jPiE"
    }
   ],
   "linker_set_key" : "_ZTI18XADeviceVolumeItf_",
   "name" : "XADeviceVolumeItf_",
   "referenced_type" : "_ZTI18XADeviceVolumeItf_",
   "self_type" : "_ZTI18XADeviceVolumeItf_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "QuerySupportedImageEffects",
     "referenced_type" : "_ZTIPFjPKPK18XAImageEffectsItf_jPjE"
    },
    {
     "field_name" : "EnableImageEffect",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18XAImageEffectsItf_jE"
    },
    {
     "field_name" : "DisableImageEffect",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK18XAImageEffectsItf_jE"
    },
    {
     "field_name" : "IsImageEffectEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK18XAImageEffectsItf_jPjE"
    }
   ],
   "linker_set_key" : "_ZTI18XAImageEffectsItf_",
   "name" : "XAImageEffectsItf_",
   "referenced_type" : "_ZTI18XAImageEffectsItf_",
   "self_type" : "_ZTI18XAImageEffectsItf_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetImageSettings",
     "referenced_type" : "_ZTIPFjPKPK18XAImageEncoderItf_PK16XAImageSettings_E"
    },
    {
     "field_name" : "GetImageSettings",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18XAImageEncoderItf_P16XAImageSettings_E"
    },
    {
     "field_name" : "GetSizeEstimate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK18XAImageEncoderItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI18XAImageEncoderItf_",
   "name" : "XAImageEncoderItf_",
   "referenced_type" : "_ZTI18XAImageEncoderItf_",
   "self_type" : "_ZTI18XAImageEncoderItf_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetRate",
     "referenced_type" : "_ZTIPFjPKPK18XAPlaybackRateItf_sE"
    },
    {
     "field_name" : "GetRate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18XAPlaybackRateItf_PsE"
    },
    {
     "field_name" : "SetPropertyConstraints",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK18XAPlaybackRateItf_jE"
    },
    {
     "field_name" : "GetProperties",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK18XAPlaybackRateItf_PjE"
    },
    {
     "field_name" : "GetCapabilitiesOfRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK18XAPlaybackRateItf_sPjE"
    },
    {
     "field_name" : "GetRateRange",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK18XAPlaybackRateItf_hPsS4_S4_PjE"
    }
   ],
   "linker_set_key" : "_ZTI18XAPlaybackRateItf_",
   "name" : "XAPlaybackRateItf_",
   "referenced_type" : "_ZTI18XAPlaybackRateItf_",
   "self_type" : "_ZTI18XAPlaybackRateItf_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "supportsFrequency",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "supportsIntensity",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minFrequency",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFrequency",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18XAVibraDescriptor_",
   "name" : "XAVibraDescriptor_",
   "referenced_type" : "_ZTI18XAVibraDescriptor_",
   "self_type" : "_ZTI18XAVibraDescriptor_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetVideoSettings",
     "referenced_type" : "_ZTIPFjPKPK18XAVideoEncoderItf_P16XAVideoSettings_E"
    },
    {
     "field_name" : "GetVideoSettings",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK18XAVideoEncoderItf_P16XAVideoSettings_E"
    }
   ],
   "linker_set_key" : "_ZTI18XAVideoEncoderItf_",
   "name" : "XAVideoEncoderItf_",
   "referenced_type" : "_ZTI18XAVideoEncoderItf_",
   "self_type" : "_ZTI18XAVideoEncoderItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "content_type",
     "referenced_type" : "_ZTI20audio_content_type_t"
    },
    {
     "field_name" : "usage",
     "field_offset" : 32,
     "referenced_type" : "_ZTI13audio_usage_t"
    },
    {
     "field_name" : "source",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14audio_source_t"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI18audio_attributes_t",
   "name" : "audio_attributes_t",
   "referenced_type" : "_ZTI18audio_attributes_t",
   "self_type" : "_ZTI18audio_attributes_t",
   "size" : 272,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "handle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "latency_class",
     "field_offset" : 64,
     "referenced_type" : "_ZTI25audio_mix_latency_class_t"
    }
   ],
   "linker_set_key" : "_ZTI18audio_port_mix_ext",
   "name" : "audio_port_mix_ext",
   "referenced_type" : "_ZTI18audio_port_mix_ext",
   "self_type" : "_ZTI18audio_port_mix_ext",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI21android_native_base_t"
    },
    {
     "field_name" : "width",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 448,
     "referenced_type" : "_ZTIA1_Pv"
    },
    {
     "field_name" : "handle",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPK13native_handle"
    },
    {
     "field_name" : "usage",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA6_Pv"
    }
   ],
   "linker_set_key" : "_ZTI19ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "_ZTI19ANativeWindowBuffer",
   "self_type" : "_ZTI19ANativeWindowBuffer",
   "size" : 96,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetSize",
     "referenced_type" : "_ZTIPFjPKPK19SL3DMacroscopicItf_iiiE"
    },
    {
     "field_name" : "GetSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK19SL3DMacroscopicItf_PiS4_S4_E"
    },
    {
     "field_name" : "SetOrientationAngles",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK19SL3DMacroscopicItf_iiiE"
    },
    {
     "field_name" : "SetOrientationVectors",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK19SL3DMacroscopicItf_PK8SLVec3D_S6_E"
    },
    {
     "field_name" : "Rotate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK19SL3DMacroscopicItf_iPK8SLVec3D_E"
    },
    {
     "field_name" : "GetOrientationVectors",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK19SL3DMacroscopicItf_P8SLVec3D_S5_E"
    }
   ],
   "linker_set_key" : "_ZTI19SL3DMacroscopicItf_",
   "name" : "SL3DMacroscopicItf_",
   "referenced_type" : "_ZTI19SL3DMacroscopicItf_",
   "self_type" : "_ZTI19SL3DMacroscopicItf_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "CreateEffect",
     "referenced_type" : "_ZTIPFjPKPK19SLAndroidEffectItf_PK14SLInterfaceID_E"
    },
    {
     "field_name" : "ReleaseEffect",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK19SLAndroidEffectItf_PK14SLInterfaceID_E"
    },
    {
     "field_name" : "SetEnabled",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK19SLAndroidEffectItf_PK14SLInterfaceID_jE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK19SLAndroidEffectItf_PK14SLInterfaceID_PjE"
    },
    {
     "field_name" : "SendCommand",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK19SLAndroidEffectItf_PK14SLInterfaceID_jjPvPjS7_E"
    }
   ],
   "linker_set_key" : "_ZTI19SLAndroidEffectItf_",
   "name" : "SLAndroidEffectItf_",
   "referenced_type" : "_ZTI19SLAndroidEffectItf_",
   "self_type" : "_ZTI19SLAndroidEffectItf_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "playIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19SLBufferQueueState_",
   "name" : "SLBufferQueueState_",
   "referenced_type" : "_ZTI19SLBufferQueueState_",
   "self_type" : "_ZTI19SLBufferQueueState_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetSource",
     "referenced_type" : "_ZTIPFjPKPK19SLDynamicSourceItf_P13SLDataSource_E"
    }
   ],
   "linker_set_key" : "_ZTI19SLDynamicSourceItf_",
   "name" : "SLDynamicSourceItf_",
   "referenced_type" : "_ZTI19SLDynamicSourceItf_",
   "self_type" : "_ZTI19SLDynamicSourceItf_",
   "size" : 4,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "RegisterVisualizationCallback",
     "referenced_type" : "_ZTIPFjPKPK19SLVisualizationItf_PFvPvPKhS6_jES4_jE"
    },
    {
     "field_name" : "GetMaxRate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK19SLVisualizationItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI19SLVisualizationItf_",
   "name" : "SLVisualizationItf_",
   "referenced_type" : "_ZTI19SLVisualizationItf_",
   "self_type" : "_ZTI19SLVisualizationItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "maxWidth",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxHeight",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "orientation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "featuresSupported",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exposureModesSupported",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flashModesSupported",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "focusModesSupported",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "meteringModesSupported",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "whiteBalanceModesSupported",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19XACameraDescriptor_",
   "name" : "XACameraDescriptor_",
   "referenced_type" : "_ZTI19XACameraDescriptor_",
   "self_type" : "_ZTI19XACameraDescriptor_",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetSource",
     "referenced_type" : "_ZTIPFjPKPK19XADynamicSourceItf_P13XADataSource_E"
    }
   ],
   "linker_set_key" : "_ZTI19XADynamicSourceItf_",
   "name" : "XADynamicSourceItf_",
   "referenced_type" : "_ZTI19XADynamicSourceItf_",
   "self_type" : "_ZTI19XADynamicSourceItf_",
   "size" : 4,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetBrightness",
     "referenced_type" : "_ZTIPFjPKPK19XAImageControlsItf_jE"
    },
    {
     "field_name" : "GetBrightness",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK19XAImageControlsItf_PjE"
    },
    {
     "field_name" : "SetContrast",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK19XAImageControlsItf_iE"
    },
    {
     "field_name" : "GetContrast",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK19XAImageControlsItf_PiE"
    },
    {
     "field_name" : "SetGamma",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK19XAImageControlsItf_sE"
    },
    {
     "field_name" : "GetGamma",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK19XAImageControlsItf_PsE"
    },
    {
     "field_name" : "GetSupportedGammaSettings",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK19XAImageControlsItf_PsS4_PjPS4_E"
    }
   ],
   "linker_set_key" : "_ZTI19XAImageControlsItf_",
   "name" : "XAImageControlsItf_",
   "referenced_type" : "_ZTI19XAImageControlsItf_",
   "self_type" : "_ZTI19XAImageControlsItf_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 12,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "time_nanoseconds",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "position_frames",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI19audio_mmap_position",
   "name" : "audio_mmap_position",
   "referenced_type" : "_ZTI19audio_mmap_position",
   "self_type" : "_ZTI19audio_mmap_position",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mSpeed",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "mPitch",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "mStretchMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI32audio_timestretch_stretch_mode_t"
    },
    {
     "field_name" : "mFallbackMode",
     "field_offset" : 96,
     "referenced_type" : "_ZTI33audio_timestretch_fallback_mode_t"
    }
   ],
   "linker_set_key" : "_ZTI19audio_playback_rate",
   "name" : "audio_playback_rate",
   "referenced_type" : "_ZTI19audio_playback_rate",
   "self_type" : "_ZTI19audio_playback_rate",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI12audio_uuid_s"
    },
    {
     "field_name" : "uuid",
     "field_offset" : 128,
     "referenced_type" : "_ZTI12audio_uuid_s"
    },
    {
     "field_name" : "apiVersion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cpuLoad",
     "field_offset" : 320,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "memoryUsage",
     "field_offset" : 336,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "name",
     "field_offset" : 352,
     "referenced_type" : "_ZTIA64_c"
    },
    {
     "field_name" : "implementor",
     "field_offset" : 864,
     "referenced_type" : "_ZTIA64_c"
    }
   ],
   "linker_set_key" : "_ZTI19effect_descriptor_s",
   "name" : "effect_descriptor_s",
   "referenced_type" : "_ZTI19effect_descriptor_s",
   "self_type" : "_ZTI19effect_descriptor_s",
   "size" : 172,
   "source_file" : "/system/media/audio/include/system/audio_effect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "open",
     "referenced_type" : "_ZTIPFiPK11hw_module_tPKcPP11hw_device_tE"
    }
   ],
   "linker_set_key" : "_ZTI19hw_module_methods_t",
   "name" : "hw_module_methods_t",
   "referenced_type" : "_ZTI19hw_module_methods_t",
   "self_type" : "_ZTI19hw_module_methods_t",
   "size" : 4,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIA100_c"
    },
    {
     "field_name" : "total_time_in_msec_voted_for_since_boot",
     "field_offset" : 832,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "total_number_of_times_voted_since_boot",
     "field_offset" : 896,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI19power_state_voter_t",
   "name" : "power_state_voter_t",
   "referenced_type" : "_ZTI19power_state_voter_t",
   "self_type" : "_ZTI19power_state_voter_t",
   "size" : 120,
   "source_file" : "/hardware/libhardware/include/hardware/power.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI20AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "referenced_type" : "_ZTI20AHardwareBuffer_Desc",
   "self_type" : "_ZTI20AHardwareBuffer_Desc",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA6_j"
    }
   ],
   "linker_set_key" : "_ZTI20ANativeWindow_Buffer",
   "name" : "ANativeWindow_Buffer",
   "referenced_type" : "_ZTI20ANativeWindow_Buffer",
   "self_type" : "_ZTI20ANativeWindow_Buffer",
   "size" : 44,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/native_window.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "itemKey",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "itemSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "itemData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA0_h"
    }
   ],
   "linker_set_key" : "_ZTI20SLAndroidBufferItem_",
   "name" : "SLAndroidBufferItem_",
   "referenced_type" : "_ZTI20SLAndroidBufferItem_",
   "self_type" : "_ZTI20SLAndroidBufferItem_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetPrefetchStatus",
     "referenced_type" : "_ZTIPFjPKPK20SLPrefetchStatusItf_PjE"
    },
    {
     "field_name" : "GetFillLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK20SLPrefetchStatusItf_PsE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK20SLPrefetchStatusItf_PFvS3_PvjES4_E"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK20SLPrefetchStatusItf_jE"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK20SLPrefetchStatusItf_PjE"
    },
    {
     "field_name" : "SetFillUpdatePeriod",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK20SLPrefetchStatusItf_sE"
    },
    {
     "field_name" : "GetFillUpdatePeriod",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK20SLPrefetchStatusItf_PsE"
    }
   ],
   "linker_set_key" : "_ZTI20SLPrefetchStatusItf_",
   "name" : "SLPrefetchStatusItf_",
   "referenced_type" : "_ZTI20SLPrefetchStatusItf_",
   "self_type" : "_ZTI20SLPrefetchStatusItf_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "itemKey",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "itemSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "itemData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA0_h"
    }
   ],
   "linker_set_key" : "_ZTI20XAAndroidBufferItem_",
   "name" : "XAAndroidBufferItem_",
   "referenced_type" : "_ZTI20XAAndroidBufferItem_",
   "self_type" : "_ZTI20XAAndroidBufferItem_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetPrefetchStatus",
     "referenced_type" : "_ZTIPFjPKPK20XAPrefetchStatusItf_PjE"
    },
    {
     "field_name" : "GetFillLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK20XAPrefetchStatusItf_PsE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK20XAPrefetchStatusItf_PFvS3_PvjES4_E"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK20XAPrefetchStatusItf_jE"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK20XAPrefetchStatusItf_PjE"
    },
    {
     "field_name" : "SetFillUpdatePeriod",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK20XAPrefetchStatusItf_sE"
    },
    {
     "field_name" : "GetFillUpdatePeriod",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK20XAPrefetchStatusItf_PsE"
    }
   ],
   "linker_set_key" : "_ZTI20XAPrefetchStatusItf_",
   "name" : "XAPrefetchStatusItf_",
   "referenced_type" : "_ZTI20XAPrefetchStatusItf_",
   "self_type" : "_ZTI20XAPrefetchStatusItf_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "stream_type",
     "field_offset" : 128,
     "referenced_type" : "_ZTI19audio_stream_type_t"
    },
    {
     "field_name" : "bit_rate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "duration_us",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "has_video",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "is_streaming",
     "field_offset" : 264,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "bit_width",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offload_buffer_size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usage",
     "field_offset" : 352,
     "referenced_type" : "_ZTI13audio_usage_t"
    },
    {
     "field_name" : "encapsulation_mode",
     "field_offset" : 384,
     "referenced_type" : "_ZTI26audio_encapsulation_mode_t"
    },
    {
     "field_name" : "content_id",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sync_id",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20audio_offload_info_t",
   "name" : "audio_offload_info_t",
   "referenced_type" : "_ZTI20audio_offload_info_t",
   "self_type" : "_ZTI20audio_offload_info_t",
   "size" : 64,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "referenced_type" : "_ZTI21AHardwareBuffer_Plane",
   "self_type" : "_ZTI21AHardwareBuffer_Plane",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "width",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21XAFocusPointPosition_",
   "name" : "XAFocusPointPosition_",
   "referenced_type" : "_ZTI21XAFocusPointPosition_",
   "self_type" : "_ZTI21XAFocusPointPosition_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_Pv"
    },
    {
     "field_name" : "incRef",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvP21android_native_base_tE"
    },
    {
     "field_name" : "decRef",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFvP21android_native_base_tE"
    }
   ],
   "linker_set_key" : "_ZTI21android_native_base_t",
   "name" : "android_native_base_t",
   "referenced_type" : "_ZTI21android_native_base_t",
   "self_type" : "_ZTI21android_native_base_t",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI21android_native_rect_t",
   "name" : "android_native_rect_t",
   "referenced_type" : "_ZTI21android_native_rect_t",
   "self_type" : "_ZTI21android_native_rect_t",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTI21audio_port_device_ext",
   "name" : "audio_port_device_ext",
   "referenced_type" : "_ZTI21audio_port_device_ext",
   "self_type" : "_ZTI21audio_port_device_ext",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "source",
     "referenced_type" : "_ZTI14audio_source_t"
    },
    {
     "field_name" : "gain",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "dest_device",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dest_device_address",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTI21record_track_metadata",
   "name" : "record_track_metadata",
   "referenced_type" : "_ZTI21record_track_metadata",
   "self_type" : "_ZTI21record_track_metadata",
   "size" : 44,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_21AHardwareBuffer_Plane"
    }
   ],
   "linker_set_key" : "_ZTI22AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "referenced_type" : "_ZTI22AHardwareBuffer_Planes",
   "self_type" : "_ZTI22AHardwareBuffer_Planes",
   "size" : 52,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAddress",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22SLDataLocator_Address_",
   "name" : "SLDataLocator_Address_",
   "referenced_type" : "_ZTI22SLDataLocator_Address_",
   "self_type" : "_ZTI22SLDataLocator_Address_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetConfiguration",
     "referenced_type" : "_ZTIPFjPKPK22XAConfigExtensionsItf_PKhjPKvE"
    },
    {
     "field_name" : "GetConfiguration",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK22XAConfigExtensionsItf_PKhPjPvE"
    }
   ],
   "linker_set_key" : "_ZTI22XAConfigExtensionsItf_",
   "name" : "XAConfigExtensionsItf_",
   "referenced_type" : "_ZTI22XAConfigExtensionsItf_",
   "self_type" : "_ZTI22XAConfigExtensionsItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "colorFormat",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "width",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22XADataFormat_RawImage_",
   "name" : "XADataFormat_RawImage_",
   "referenced_type" : "_ZTI22XADataFormat_RawImage_",
   "self_type" : "_ZTI22XADataFormat_RawImage_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAddress",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22XADataLocator_Address_",
   "name" : "XADataLocator_Address_",
   "referenced_type" : "_ZTI22XADataLocator_Address_",
   "self_type" : "_ZTI22XADataLocator_Address_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shared_memory_address",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "shared_memory_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "buffer_size_frames",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "burst_size_frames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22audio_mmap_buffer_flag"
    }
   ],
   "linker_set_key" : "_ZTI22audio_mmap_buffer_info",
   "name" : "audio_mmap_buffer_info",
   "referenced_type" : "_ZTI22audio_mmap_buffer_info",
   "self_type" : "_ZTI22audio_mmap_buffer_info",
   "size" : 20,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI15audio_session_t"
    }
   ],
   "linker_set_key" : "_ZTI22audio_port_session_ext",
   "name" : "audio_port_session_ext",
   "referenced_type" : "_ZTI22audio_port_session_ext",
   "self_type" : "_ZTI22audio_port_session_ext",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "isOffload",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "ioHandle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI22effect_offload_param_s",
   "name" : "effect_offload_param_s",
   "referenced_type" : "_ZTI22effect_offload_param_s",
   "self_type" : "_ZTI22effect_offload_param_s",
   "size" : 8,
   "source_file" : "/system/media/audio/include/system/audio_effect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "EnableEffectSend",
     "referenced_type" : "_ZTIPFjPKPK23SLAndroidEffectSendItf_PK14SLInterfaceID_jsE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK23SLAndroidEffectSendItf_PK14SLInterfaceID_PjE"
    },
    {
     "field_name" : "SetDirectLevel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK23SLAndroidEffectSendItf_sE"
    },
    {
     "field_name" : "GetDirectLevel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK23SLAndroidEffectSendItf_PsE"
    },
    {
     "field_name" : "SetSendLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK23SLAndroidEffectSendItf_PK14SLInterfaceID_sE"
    },
    {
     "field_name" : "GetSendLevel",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK23SLAndroidEffectSendItf_PK14SLInterfaceID_PsE"
    }
   ],
   "linker_set_key" : "_ZTI23SLAndroidEffectSendItf_",
   "name" : "SLAndroidEffectSendItf_",
   "referenced_type" : "_ZTI23SLAndroidEffectSendItf_",
   "self_type" : "_ZTI23SLAndroidEffectSendItf_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxChannels",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minBitsPerSample",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxBitsPerSample",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSampleRatesSupported",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "numSampleRatesSupported",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minBitRate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxBitRate",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "isBitrateRangeContinuous",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pBitratesSupported",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "numBitratesSupported",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "modeSetting",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23SLAudioCodecDescriptor_",
   "name" : "SLAudioCodecDescriptor_",
   "referenced_type" : "_ZTI23SLAudioCodecDescriptor_",
   "self_type" : "_ZTI23SLAudioCodecDescriptor_",
   "size" : 60,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encoderId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channelsIn",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channelsOut",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rateControl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "levelSetting",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "streamFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "encodeOptions",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blockAlignment",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23SLAudioEncoderSettings_",
   "name" : "SLAudioEncoderSettings_",
   "referenced_type" : "_ZTI23SLAudioEncoderSettings_",
   "self_type" : "_ZTI23SLAudioEncoderSettings_",
   "size" : 52,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "deviceName",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "deviceConnection",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "deviceScope",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "deviceLocation",
     "field_offset" : 64,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "isForTelephony",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplingRatesSupported",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "numOfSamplingRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "maxChannels",
     "field_offset" : 272,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI23SLAudioInputDescriptor_",
   "name" : "SLAudioInputDescriptor_",
   "referenced_type" : "_ZTI23SLAudioInputDescriptor_",
   "self_type" : "_ZTI23SLAudioInputDescriptor_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "deviceType",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "deviceID",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "device",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKPK12SLObjectItf_"
    }
   ],
   "linker_set_key" : "_ZTI23SLDataLocator_IODevice_",
   "name" : "SLDataLocator_IODevice_",
   "referenced_type" : "_ZTI23SLDataLocator_IODevice_",
   "self_type" : "_ZTI23SLDataLocator_IODevice_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "outputMix",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKPK12SLObjectItf_"
    }
   ],
   "linker_set_key" : "_ZTI23SLDataLocator_OutputMix",
   "name" : "SLDataLocator_OutputMix",
   "referenced_type" : "_ZTI23SLDataLocator_OutputMix",
   "self_type" : "_ZTI23SLDataLocator_OutputMix",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetMode",
     "referenced_type" : "_ZTIPFjPKPK23SLMetadataTraversalItf_jE"
    },
    {
     "field_name" : "GetChildCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK23SLMetadataTraversalItf_PjE"
    },
    {
     "field_name" : "GetChildMIMETypeSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK23SLMetadataTraversalItf_jPjE"
    },
    {
     "field_name" : "GetChildInfo",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK23SLMetadataTraversalItf_jPiPjjPhE"
    },
    {
     "field_name" : "SetActiveNode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK23SLMetadataTraversalItf_jE"
    }
   ],
   "linker_set_key" : "_ZTI23SLMetadataTraversalItf_",
   "name" : "SLMetadataTraversalItf_",
   "referenced_type" : "_ZTI23SLMetadataTraversalItf_",
   "self_type" : "_ZTI23SLMetadataTraversalItf_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxChannels",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minBitsPerSample",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxBitsPerSample",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSampleRatesSupported",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "numSampleRatesSupported",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minBitRate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxBitRate",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "isBitrateRangeContinuous",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pBitratesSupported",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "numBitratesSupported",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "modeSetting",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23XAAudioCodecDescriptor_",
   "name" : "XAAudioCodecDescriptor_",
   "referenced_type" : "_ZTI23XAAudioCodecDescriptor_",
   "self_type" : "_ZTI23XAAudioCodecDescriptor_",
   "size" : 60,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encoderId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channelsIn",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channelsOut",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rateControl",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "levelSetting",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "streamFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "encodeOptions",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blockAlignment",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23XAAudioEncoderSettings_",
   "name" : "XAAudioEncoderSettings_",
   "referenced_type" : "_ZTI23XAAudioEncoderSettings_",
   "self_type" : "_ZTI23XAAudioEncoderSettings_",
   "size" : 52,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "deviceName",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "deviceConnection",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "deviceScope",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "deviceLocation",
     "field_offset" : 64,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "isForTelephony",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplingRatesSupported",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "numOfSamplingRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "maxChannels",
     "field_offset" : 272,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI23XAAudioInputDescriptor_",
   "name" : "XAAudioInputDescriptor_",
   "referenced_type" : "_ZTI23XAAudioInputDescriptor_",
   "self_type" : "_ZTI23XAAudioInputDescriptor_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "deviceType",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "deviceID",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "device",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKPK12XAObjectItf_"
    }
   ],
   "linker_set_key" : "_ZTI23XADataLocator_IODevice_",
   "name" : "XADataLocator_IODevice_",
   "referenced_type" : "_ZTI23XADataLocator_IODevice_",
   "self_type" : "_ZTI23XADataLocator_IODevice_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "outputMix",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKPK12XAObjectItf_"
    }
   ],
   "linker_set_key" : "_ZTI23XADataLocator_OutputMix",
   "name" : "XADataLocator_OutputMix",
   "referenced_type" : "_ZTI23XADataLocator_OutputMix",
   "self_type" : "_ZTI23XADataLocator_OutputMix",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxWidth",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxHeight",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23XAImageCodecDescriptor_",
   "name" : "XAImageCodecDescriptor_",
   "referenced_type" : "_ZTI23XAImageCodecDescriptor_",
   "self_type" : "_ZTI23XAImageCodecDescriptor_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "CreateChildNode",
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataInsertionItf_ijPhPiE"
    },
    {
     "field_name" : "GetSupportedKeysCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataInsertionItf_iPjS4_S4_E"
    },
    {
     "field_name" : "GetKeySize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataInsertionItf_ijPjE"
    },
    {
     "field_name" : "GetKey",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataInsertionItf_ijjP15XAMetadataInfo_E"
    },
    {
     "field_name" : "GetFreeKeysEncoding",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataInsertionItf_ijPjE"
    },
    {
     "field_name" : "InsertMetadataItem",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataInsertionItf_iP15XAMetadataInfo_S5_jE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataInsertionItf_PFvS3_PvP15XAMetadataInfo_S6_ijES4_E"
    }
   ],
   "linker_set_key" : "_ZTI23XAMetadataInsertionItf_",
   "name" : "XAMetadataInsertionItf_",
   "referenced_type" : "_ZTI23XAMetadataInsertionItf_",
   "self_type" : "_ZTI23XAMetadataInsertionItf_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetMode",
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataTraversalItf_jE"
    },
    {
     "field_name" : "GetChildCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataTraversalItf_PjE"
    },
    {
     "field_name" : "GetChildMIMETypeSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataTraversalItf_jPjE"
    },
    {
     "field_name" : "GetChildInfo",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataTraversalItf_jPiPjjPhE"
    },
    {
     "field_name" : "SetActiveNode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK23XAMetadataTraversalItf_jE"
    }
   ],
   "linker_set_key" : "_ZTI23XAMetadataTraversalItf_",
   "name" : "XAMetadataTraversalItf_",
   "referenced_type" : "_ZTI23XAMetadataTraversalItf_",
   "self_type" : "_ZTI23XAMetadataTraversalItf_",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "QueryMediaContainerInformation",
     "referenced_type" : "_ZTIPFjPKPK23XAStreamInformationItf_P28XAMediaContainerInformation_E"
    },
    {
     "field_name" : "QueryStreamType",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK23XAStreamInformationItf_jPjE"
    },
    {
     "field_name" : "QueryStreamInformation",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK23XAStreamInformationItf_jPvE"
    },
    {
     "field_name" : "QueryStreamName",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK23XAStreamInformationItf_jPtPhE"
    },
    {
     "field_name" : "RegisterStreamChangeCallback",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK23XAStreamInformationItf_PFvS3_jjPvS4_ES4_E"
    },
    {
     "field_name" : "QueryActiveStreams",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK23XAStreamInformationItf_PjS4_E"
    },
    {
     "field_name" : "SetActiveStream",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK23XAStreamInformationItf_jjjE"
    }
   ],
   "linker_set_key" : "_ZTI23XAStreamInformationItf_",
   "name" : "XAStreamInformationItf_",
   "referenced_type" : "_ZTI23XAStreamInformationItf_",
   "self_type" : "_ZTI23XAStreamInformationItf_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxWidth",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxHeight",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFrameRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxBitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rateControlSupported",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "levelSetting",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23XAVideoCodecDescriptor_",
   "name" : "XAVideoCodecDescriptor_",
   "referenced_type" : "_ZTI23XAVideoCodecDescriptor_",
   "self_type" : "_ZTI23XAVideoCodecDescriptor_",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "usage",
     "referenced_type" : "_ZTI13audio_usage_t"
    },
    {
     "field_name" : "content_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTI20audio_content_type_t"
    },
    {
     "field_name" : "gain",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI23playback_track_metadata",
   "name" : "playback_track_metadata",
   "referenced_type" : "_ZTI23playback_track_metadata",
   "self_type" : "_ZTI23playback_track_metadata",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "RegisterCallback",
     "referenced_type" : "_ZTIPFjPKPK24SLAndroidBufferQueueItf_PFjS3_PvS4_S4_jjPK20SLAndroidBufferItem_jES4_E"
    },
    {
     "field_name" : "Clear",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK24SLAndroidBufferQueueItf_E"
    },
    {
     "field_name" : "Enqueue",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK24SLAndroidBufferQueueItf_PvS4_jPK20SLAndroidBufferItem_jE"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK24SLAndroidBufferQueueItf_P26SLAndroidBufferQueueState_E"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK24SLAndroidBufferQueueItf_jE"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK24SLAndroidBufferQueueItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI24SLAndroidBufferQueueItf_",
   "name" : "SLAndroidBufferQueueItf_",
   "referenced_type" : "_ZTI24SLAndroidBufferQueueItf_",
   "self_type" : "_ZTI24SLAndroidBufferQueueItf_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "profileSetting",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "modeSetting",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24SLAudioCodecProfileMode_",
   "name" : "SLAudioCodecProfileMode_",
   "referenced_type" : "_ZTI24SLAudioCodecProfileMode_",
   "self_type" : "_ZTI24SLAudioCodecProfileMode_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pDeviceName",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "deviceConnection",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "deviceScope",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "deviceLocation",
     "field_offset" : 64,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "isForTelephony",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplingRatesSupported",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "numOfSamplingRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "maxChannels",
     "field_offset" : 272,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI24SLAudioOutputDescriptor_",
   "name" : "SLAudioOutputDescriptor_",
   "referenced_type" : "_ZTI24SLAudioOutputDescriptor_",
   "self_type" : "_ZTI24SLAudioOutputDescriptor_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "length",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI24SLDataLocator_AndroidFD_",
   "name" : "SLDataLocator_AndroidFD_",
   "referenced_type" : "_ZTI24SLDataLocator_AndroidFD_",
   "self_type" : "_ZTI24SLDataLocator_AndroidFD_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "QuerySupportedProfiles",
     "referenced_type" : "_ZTIPFjPKPK24SLEngineCapabilitiesItf_PtE"
    },
    {
     "field_name" : "QueryAvailableVoices",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK24SLEngineCapabilitiesItf_tPsPjS4_E"
    },
    {
     "field_name" : "QueryNumberOfMIDISynthesizers",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK24SLEngineCapabilitiesItf_PsE"
    },
    {
     "field_name" : "QueryAPIVersion",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK24SLEngineCapabilitiesItf_PsS4_S4_E"
    },
    {
     "field_name" : "QueryLEDCapabilities",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK24SLEngineCapabilitiesItf_PjS4_P16SLLEDDescriptor_E"
    },
    {
     "field_name" : "QueryVibraCapabilities",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK24SLEngineCapabilitiesItf_PjS4_P18SLVibraDescriptor_E"
    },
    {
     "field_name" : "IsThreadSafe",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK24SLEngineCapabilitiesItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI24SLEngineCapabilitiesItf_",
   "name" : "SLEngineCapabilitiesItf_",
   "referenced_type" : "_ZTI24SLEngineCapabilitiesItf_",
   "self_type" : "_ZTI24SLEngineCapabilitiesItf_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetItemCount",
     "referenced_type" : "_ZTIPFjPKPK24SLMetadataExtractionItf_PjE"
    },
    {
     "field_name" : "GetKeySize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK24SLMetadataExtractionItf_jPjE"
    },
    {
     "field_name" : "GetKey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK24SLMetadataExtractionItf_jjP15SLMetadataInfo_E"
    },
    {
     "field_name" : "GetValueSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK24SLMetadataExtractionItf_jPjE"
    },
    {
     "field_name" : "GetValue",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK24SLMetadataExtractionItf_jjP15SLMetadataInfo_E"
    },
    {
     "field_name" : "AddKeyFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK24SLMetadataExtractionItf_jPKvjPKhjhE"
    },
    {
     "field_name" : "ClearKeyFilter",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK24SLMetadataExtractionItf_E"
    }
   ],
   "linker_set_key" : "_ZTI24SLMetadataExtractionItf_",
   "name" : "SLMetadataExtractionItf_",
   "referenced_type" : "_ZTI24SLMetadataExtractionItf_",
   "self_type" : "_ZTI24SLMetadataExtractionItf_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "RegisterCallback",
     "referenced_type" : "_ZTIPFjPKPK24XAAndroidBufferQueueItf_PFjS3_PvS4_S4_jjPK20XAAndroidBufferItem_jES4_E"
    },
    {
     "field_name" : "Clear",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK24XAAndroidBufferQueueItf_E"
    },
    {
     "field_name" : "Enqueue",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK24XAAndroidBufferQueueItf_PvS4_jPK20XAAndroidBufferItem_jE"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK24XAAndroidBufferQueueItf_P26XAAndroidBufferQueueState_E"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK24XAAndroidBufferQueueItf_jE"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK24XAAndroidBufferQueueItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI24XAAndroidBufferQueueItf_",
   "name" : "XAAndroidBufferQueueItf_",
   "referenced_type" : "_ZTI24XAAndroidBufferQueueItf_",
   "self_type" : "_ZTI24XAAndroidBufferQueueItf_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pDeviceName",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "deviceConnection",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "deviceScope",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "deviceLocation",
     "field_offset" : 64,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "isForTelephony",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplingRatesSupported",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "numOfSamplingRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "maxChannels",
     "field_offset" : 272,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI24XAAudioOutputDescriptor_",
   "name" : "XAAudioOutputDescriptor_",
   "referenced_type" : "_ZTI24XAAudioOutputDescriptor_",
   "self_type" : "_ZTI24XAAudioOutputDescriptor_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetCameraCapabilities",
     "referenced_type" : "_ZTIPFjPKPK24XACameraCapabilitiesItf_PjS4_P19XACameraDescriptor_E"
    },
    {
     "field_name" : "QueryFocusRegionPatterns",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK24XACameraCapabilitiesItf_jPjS4_S4_S4_E"
    },
    {
     "field_name" : "GetSupportedAutoLocks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK24XACameraCapabilitiesItf_jPjPS4_E"
    },
    {
     "field_name" : "GetSupportedFocusManualSettings",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK24XACameraCapabilitiesItf_jjPiS4_PjPS4_E"
    },
    {
     "field_name" : "GetSupportedISOSensitivitySettings",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK24XACameraCapabilitiesItf_jPjS4_S4_PS4_E"
    },
    {
     "field_name" : "GetSupportedApertureManualSettings",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK24XACameraCapabilitiesItf_jPjS4_S4_PS4_E"
    },
    {
     "field_name" : "GetSupportedShutterSpeedManualSettings",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK24XACameraCapabilitiesItf_jPjS4_S4_PS4_E"
    },
    {
     "field_name" : "GetSupportedWhiteBalanceManualSettings",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK24XACameraCapabilitiesItf_jPjS4_S4_PS4_E"
    },
    {
     "field_name" : "GetSupportedZoomSettings",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK24XACameraCapabilitiesItf_jjjPsPjPS4_S5_E"
    }
   ],
   "linker_set_key" : "_ZTI24XACameraCapabilitiesItf_",
   "name" : "XACameraCapabilitiesItf_",
   "referenced_type" : "_ZTI24XACameraCapabilitiesItf_",
   "self_type" : "_ZTI24XACameraCapabilitiesItf_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "length",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI24XADataLocator_AndroidFD_",
   "name" : "XADataLocator_AndroidFD_",
   "referenced_type" : "_ZTI24XADataLocator_AndroidFD_",
   "self_type" : "_ZTI24XADataLocator_AndroidFD_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "channels",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tracks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bankType",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "langCountry",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "duration",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24XAMIDIStreamInformation_",
   "name" : "XAMIDIStreamInformation_",
   "referenced_type" : "_ZTI24XAMIDIStreamInformation_",
   "self_type" : "_ZTI24XAMIDIStreamInformation_",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetItemCount",
     "referenced_type" : "_ZTIPFjPKPK24XAMetadataExtractionItf_PjE"
    },
    {
     "field_name" : "GetKeySize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK24XAMetadataExtractionItf_jPjE"
    },
    {
     "field_name" : "GetKey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK24XAMetadataExtractionItf_jjP15XAMetadataInfo_E"
    },
    {
     "field_name" : "GetValueSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK24XAMetadataExtractionItf_jPjE"
    },
    {
     "field_name" : "GetValue",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK24XAMetadataExtractionItf_jjP15XAMetadataInfo_E"
    },
    {
     "field_name" : "AddKeyFilter",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK24XAMetadataExtractionItf_jPKvjPKhjhE"
    },
    {
     "field_name" : "ClearKeyFilter",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK24XAMetadataExtractionItf_E"
    }
   ],
   "linker_set_key" : "_ZTI24XAMetadataExtractionItf_",
   "name" : "XAMetadataExtractionItf_",
   "referenced_type" : "_ZTI24XAMetadataExtractionItf_",
   "self_type" : "_ZTI24XAMetadataExtractionItf_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numBuffers",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25SLDataLocator_BufferQueue",
   "name" : "SLDataLocator_BufferQueue",
   "referenced_type" : "_ZTI25SLDataLocator_BufferQueue",
   "self_type" : "_ZTI25SLDataLocator_BufferQueue",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetRoomLevel",
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_sE"
    },
    {
     "field_name" : "GetRoomLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PsE"
    },
    {
     "field_name" : "SetRoomHFLevel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_sE"
    },
    {
     "field_name" : "GetRoomHFLevel",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PsE"
    },
    {
     "field_name" : "SetDecayTime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_jE"
    },
    {
     "field_name" : "GetDecayTime",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PjE"
    },
    {
     "field_name" : "SetDecayHFRatio",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_sE"
    },
    {
     "field_name" : "GetDecayHFRatio",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PsE"
    },
    {
     "field_name" : "SetReflectionsLevel",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_sE"
    },
    {
     "field_name" : "GetReflectionsLevel",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PsE"
    },
    {
     "field_name" : "SetReflectionsDelay",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_jE"
    },
    {
     "field_name" : "GetReflectionsDelay",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PjE"
    },
    {
     "field_name" : "SetReverbLevel",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_sE"
    },
    {
     "field_name" : "GetReverbLevel",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PsE"
    },
    {
     "field_name" : "SetReverbDelay",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_jE"
    },
    {
     "field_name" : "GetReverbDelay",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PjE"
    },
    {
     "field_name" : "SetDiffusion",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_sE"
    },
    {
     "field_name" : "GetDiffusion",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PsE"
    },
    {
     "field_name" : "SetDensity",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_sE"
    },
    {
     "field_name" : "GetDensity",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PsE"
    },
    {
     "field_name" : "SetEnvironmentalReverbProperties",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_PK30SLEnvironmentalReverbSettings_E"
    },
    {
     "field_name" : "GetEnvironmentalReverbProperties",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFjPKPK25SLEnvironmentalReverbItf_P30SLEnvironmentalReverbSettings_E"
    }
   ],
   "linker_set_key" : "_ZTI25SLEnvironmentalReverbItf_",
   "name" : "SLEnvironmentalReverbItf_",
   "referenced_type" : "_ZTI25SLEnvironmentalReverbItf_",
   "self_type" : "_ZTI25SLEnvironmentalReverbItf_",
   "size" : 88,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channels",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "langCountry",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "duration",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25XAAudioStreamInformation_",
   "name" : "XAAudioStreamInformation_",
   "referenced_type" : "_ZTI25XAAudioStreamInformation_",
   "self_type" : "_ZTI25XAAudioStreamInformation_",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "presentationDuration",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25XAImageStreamInformation_",
   "name" : "XAImageStreamInformation_",
   "referenced_type" : "_ZTI25XAImageStreamInformation_",
   "self_type" : "_ZTI25XAImageStreamInformation_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetRotation",
     "referenced_type" : "_ZTIPFjPKPK25XAVideoPostProcessingItf_iE"
    },
    {
     "field_name" : "IsArbitraryRotationSupported",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK25XAVideoPostProcessingItf_PjE"
    },
    {
     "field_name" : "SetScaleOptions",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK25XAVideoPostProcessingItf_jjjE"
    },
    {
     "field_name" : "SetSourceRectangle",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK25XAVideoPostProcessingItf_PK12XARectangle_E"
    },
    {
     "field_name" : "SetDestinationRectangle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK25XAVideoPostProcessingItf_PK12XARectangle_E"
    },
    {
     "field_name" : "SetMirror",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK25XAVideoPostProcessingItf_jE"
    },
    {
     "field_name" : "Commit",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK25XAVideoPostProcessingItf_E"
    }
   ],
   "linker_set_key" : "_ZTI25XAVideoPostProcessingItf_",
   "name" : "XAVideoPostProcessingItf_",
   "referenced_type" : "_ZTI25XAVideoPostProcessingItf_",
   "self_type" : "_ZTI25XAVideoPostProcessingItf_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "frameRate",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "duration",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25XAVideoStreamInformation_",
   "name" : "XAVideoStreamInformation_",
   "referenced_type" : "_ZTI25XAVideoStreamInformation_",
   "self_type" : "_ZTI25XAVideoStreamInformation_",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "handle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usecase",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN25audio_port_config_mix_extUt_E"
    }
   ],
   "linker_set_key" : "_ZTI25audio_port_config_mix_ext",
   "name" : "audio_port_config_mix_ext",
   "referenced_type" : "_ZTI25audio_port_config_mix_ext",
   "self_type" : "_ZTI25audio_port_config_mix_ext",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "index",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26SLAndroidBufferQueueState_",
   "name" : "SLAndroidBufferQueueState_",
   "referenced_type" : "_ZTI26SLAndroidBufferQueueState_",
   "self_type" : "_ZTI26SLAndroidBufferQueueState_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetConfiguration",
     "referenced_type" : "_ZTIPFjPKPK26SLAndroidConfigurationItf_PKhPKvjE"
    },
    {
     "field_name" : "GetConfiguration",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK26SLAndroidConfigurationItf_PKhPjPvE"
    },
    {
     "field_name" : "AcquireJavaProxy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK26SLAndroidConfigurationItf_jPP8_jobjectE"
    },
    {
     "field_name" : "ReleaseJavaProxy",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK26SLAndroidConfigurationItf_jE"
    }
   ],
   "linker_set_key" : "_ZTI26SLAndroidConfigurationItf_",
   "name" : "SLAndroidConfigurationItf_",
   "referenced_type" : "_ZTI26SLAndroidConfigurationItf_",
   "self_type" : "_ZTI26SLAndroidConfigurationItf_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "index",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26XAAndroidBufferQueueState_",
   "name" : "XAAndroidBufferQueueState_",
   "referenced_type" : "_ZTI26XAAndroidBufferQueueState_",
   "self_type" : "_ZTI26XAAndroidBufferQueueState_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "VendorStreamInfo",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI26XAVendorStreamInformation_",
   "name" : "XAVendorStreamInformation_",
   "referenced_type" : "_ZTI26XAVendorStreamInformation_",
   "self_type" : "_ZTI26XAVendorStreamInformation_",
   "size" : 4,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numChannels",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "containerSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "endianness",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "representation",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27SLAndroidDataFormat_PCM_EX_",
   "name" : "SLAndroidDataFormat_PCM_EX_",
   "referenced_type" : "_ZTI27SLAndroidDataFormat_PCM_EX_",
   "self_type" : "_ZTI27SLAndroidDataFormat_PCM_EX_",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI27audio_microphone_coordinate",
   "name" : "audio_microphone_coordinate",
   "referenced_type" : "_ZTI27audio_microphone_coordinate",
   "self_type" : "_ZTI27audio_microphone_coordinate",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hWindow",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "hDisplay",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI28XADataLocator_NativeDisplay_",
   "name" : "XADataLocator_NativeDisplay_",
   "referenced_type" : "_ZTI28XADataLocator_NativeDisplay_",
   "self_type" : "_ZTI28XADataLocator_NativeDisplay_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "containerType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mediaDuration",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numStreams",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28XAMediaContainerInformation_",
   "name" : "XAMediaContainerInformation_",
   "referenced_type" : "_ZTI28XAMediaContainerInformation_",
   "self_type" : "_ZTI28XAMediaContainerInformation_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTI28audio_port_config_device_ext",
   "name" : "audio_port_config_device_ext",
   "referenced_type" : "_ZTI28audio_port_config_device_ext",
   "self_type" : "_ZTI28audio_port_config_device_ext",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "_ZTIPFjPKPK29SLAndroidNoiseSuppressionItf_jE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK29SLAndroidNoiseSuppressionItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI29SLAndroidNoiseSuppressionItf_",
   "name" : "SLAndroidNoiseSuppressionItf_",
   "referenced_type" : "_ZTI29SLAndroidNoiseSuppressionItf_",
   "self_type" : "_ZTI29SLAndroidNoiseSuppressionItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tpqn",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numBuffers",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI29SLDataLocator_MIDIBufferQueue",
   "name" : "SLDataLocator_MIDIBufferQueue",
   "referenced_type" : "_ZTI29SLDataLocator_MIDIBufferQueue",
   "self_type" : "_ZTI29SLDataLocator_MIDIBufferQueue",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layer",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ty",
     "field_offset" : 112,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "bitrate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "langCountry",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "duration",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI29XATimedTextStreamInformation_",
   "name" : "XATimedTextStreamInformation_",
   "referenced_type" : "_ZTI29XATimedTextStreamInformation_",
   "self_type" : "_ZTI29XATimedTextStreamInformation_",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI15audio_session_t"
    }
   ],
   "linker_set_key" : "_ZTI29audio_port_config_session_ext",
   "name" : "audio_port_config_session_ext",
   "referenced_type" : "_ZTI29audio_port_config_session_ext",
   "self_type" : "_ZTI29audio_port_config_session_ext",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Enqueue",
     "referenced_type" : "_ZTIPFjPKPK30SLAndroidSimpleBufferQueueItf_PKvjE"
    },
    {
     "field_name" : "Clear",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK30SLAndroidSimpleBufferQueueItf_E"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK30SLAndroidSimpleBufferQueueItf_P32SLAndroidSimpleBufferQueueState_E"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK30SLAndroidSimpleBufferQueueItf_PFvS3_PvES4_E"
    }
   ],
   "linker_set_key" : "_ZTI30SLAndroidSimpleBufferQueueItf_",
   "name" : "SLAndroidSimpleBufferQueueItf_",
   "referenced_type" : "_ZTI30SLAndroidSimpleBufferQueueItf_",
   "self_type" : "_ZTI30SLAndroidSimpleBufferQueueItf_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetAudioDecoders",
     "referenced_type" : "_ZTIPFjPKPK30SLAudioDecoderCapabilitiesItf_PjS4_E"
    },
    {
     "field_name" : "GetAudioDecoderCapabilities",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK30SLAudioDecoderCapabilitiesItf_jPjP23SLAudioCodecDescriptor_E"
    }
   ],
   "linker_set_key" : "_ZTI30SLAudioDecoderCapabilitiesItf_",
   "name" : "SLAudioDecoderCapabilitiesItf_",
   "referenced_type" : "_ZTI30SLAudioDecoderCapabilitiesItf_",
   "self_type" : "_ZTI30SLAudioDecoderCapabilitiesItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetAudioEncoders",
     "referenced_type" : "_ZTIPFjPKPK30SLAudioEncoderCapabilitiesItf_PjS4_E"
    },
    {
     "field_name" : "GetAudioEncoderCapabilities",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK30SLAudioEncoderCapabilitiesItf_jPjP23SLAudioCodecDescriptor_E"
    }
   ],
   "linker_set_key" : "_ZTI30SLAudioEncoderCapabilitiesItf_",
   "name" : "SLAudioEncoderCapabilitiesItf_",
   "referenced_type" : "_ZTI30SLAudioEncoderCapabilitiesItf_",
   "self_type" : "_ZTI30SLAudioEncoderCapabilitiesItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "roomLevel",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "roomHFLevel",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "decayTime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "decayHFRatio",
     "field_offset" : 64,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "reflectionsLevel",
     "field_offset" : 80,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "reflectionsDelay",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reverbLevel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "reverbDelay",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "diffusion",
     "field_offset" : 192,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "density",
     "field_offset" : 208,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI30SLEnvironmentalReverbSettings_",
   "name" : "SLEnvironmentalReverbSettings_",
   "referenced_type" : "_ZTI30SLEnvironmentalReverbSettings_",
   "self_type" : "_ZTI30SLEnvironmentalReverbSettings_",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetAudioDecoders",
     "referenced_type" : "_ZTIPFjPKPK30XAAudioDecoderCapabilitiesItf_PjS4_E"
    },
    {
     "field_name" : "GetAudioDecoderCapabilities",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK30XAAudioDecoderCapabilitiesItf_jPjP23XAAudioCodecDescriptor_E"
    }
   ],
   "linker_set_key" : "_ZTI30XAAudioDecoderCapabilitiesItf_",
   "name" : "XAAudioDecoderCapabilitiesItf_",
   "referenced_type" : "_ZTI30XAAudioDecoderCapabilitiesItf_",
   "self_type" : "_ZTI30XAAudioDecoderCapabilitiesItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetAudioEncoders",
     "referenced_type" : "_ZTIPFjPKPK30XAAudioEncoderCapabilitiesItf_PjS4_E"
    },
    {
     "field_name" : "GetAudioEncoderCapabilities",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK30XAAudioEncoderCapabilitiesItf_jPjP23XAAudioCodecDescriptor_E"
    }
   ],
   "linker_set_key" : "_ZTI30XAAudioEncoderCapabilitiesItf_",
   "name" : "XAAudioEncoderCapabilitiesItf_",
   "referenced_type" : "_ZTI30XAAudioEncoderCapabilitiesItf_",
   "self_type" : "_ZTI30XAAudioEncoderCapabilitiesItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetImageDecoderCapabilities",
     "referenced_type" : "_ZTIPFjPKPK30XAImageDecoderCapabilitiesItf_PjP23XAImageCodecDescriptor_E"
    },
    {
     "field_name" : "QueryColorFormats",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK30XAImageDecoderCapabilitiesItf_PjS4_E"
    }
   ],
   "linker_set_key" : "_ZTI30XAImageDecoderCapabilitiesItf_",
   "name" : "XAImageDecoderCapabilitiesItf_",
   "referenced_type" : "_ZTI30XAImageDecoderCapabilitiesItf_",
   "self_type" : "_ZTI30XAImageDecoderCapabilitiesItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetImageEncoderCapabilities",
     "referenced_type" : "_ZTIPFjPKPK30XAImageEncoderCapabilitiesItf_PjP23XAImageCodecDescriptor_E"
    },
    {
     "field_name" : "QueryColorFormats",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK30XAImageEncoderCapabilitiesItf_PjS4_E"
    }
   ],
   "linker_set_key" : "_ZTI30XAImageEncoderCapabilitiesItf_",
   "name" : "XAImageEncoderCapabilitiesItf_",
   "referenced_type" : "_ZTI30XAImageEncoderCapabilitiesItf_",
   "self_type" : "_ZTI30XAImageEncoderCapabilitiesItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetVideoDecoders",
     "referenced_type" : "_ZTIPFjPKPK30XAVideoDecoderCapabilitiesItf_PjS4_E"
    },
    {
     "field_name" : "GetVideoDecoderCapabilities",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK30XAVideoDecoderCapabilitiesItf_jPjP23XAVideoCodecDescriptor_E"
    }
   ],
   "linker_set_key" : "_ZTI30XAVideoDecoderCapabilitiesItf_",
   "name" : "XAVideoDecoderCapabilitiesItf_",
   "referenced_type" : "_ZTI30XAVideoDecoderCapabilitiesItf_",
   "self_type" : "_ZTI30XAVideoDecoderCapabilitiesItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetVideoEncoders",
     "referenced_type" : "_ZTIPFjPKPK30XAVideoEncoderCapabilitiesItf_PjS4_E"
    },
    {
     "field_name" : "GetVideoEncoderCapabilities",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK30XAVideoEncoderCapabilitiesItf_jPjP23XAVideoCodecDescriptor_E"
    }
   ],
   "linker_set_key" : "_ZTI30XAVideoEncoderCapabilitiesItf_",
   "name" : "XAVideoEncoderCapabilitiesItf_",
   "referenced_type" : "_ZTI30XAVideoEncoderCapabilitiesItf_",
   "self_type" : "_ZTI30XAVideoEncoderCapabilitiesItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "QueryNumEffects",
     "referenced_type" : "_ZTIPFjPKPK31SLAndroidEffectCapabilitiesItf_PjE"
    },
    {
     "field_name" : "QueryEffect",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK31SLAndroidEffectCapabilitiesItf_jPPK14SLInterfaceID_S7_PhPtE"
    }
   ],
   "linker_set_key" : "_ZTI31SLAndroidEffectCapabilitiesItf_",
   "name" : "SLAndroidEffectCapabilitiesItf_",
   "referenced_type" : "_ZTI31SLAndroidEffectCapabilitiesItf_",
   "self_type" : "_ZTI31SLAndroidEffectCapabilitiesItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetAvailableAudioInputs",
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_PiPjE"
    },
    {
     "field_name" : "QueryAudioInputCapabilities",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_jP23SLAudioInputDescriptor_E"
    },
    {
     "field_name" : "RegisterAvailableAudioInputsChangedCallback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_PFvS3_PvjijES4_E"
    },
    {
     "field_name" : "GetAvailableAudioOutputs",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_PiPjE"
    },
    {
     "field_name" : "QueryAudioOutputCapabilities",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_jP24SLAudioOutputDescriptor_E"
    },
    {
     "field_name" : "RegisterAvailableAudioOutputsChangedCallback",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_PFvS3_PvjijES4_E"
    },
    {
     "field_name" : "RegisterDefaultDeviceIDMapChangedCallback",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_PFvS3_PvjiES4_E"
    },
    {
     "field_name" : "GetAssociatedAudioInputs",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_jPiPjE"
    },
    {
     "field_name" : "GetAssociatedAudioOutputs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_jPiPjE"
    },
    {
     "field_name" : "GetDefaultAudioDevices",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_jPiPjE"
    },
    {
     "field_name" : "QuerySampleFormatsSupported",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK31SLAudioIODeviceCapabilitiesItf_jjPiS4_E"
    }
   ],
   "linker_set_key" : "_ZTI31SLAudioIODeviceCapabilitiesItf_",
   "name" : "SLAudioIODeviceCapabilitiesItf_",
   "referenced_type" : "_ZTI31SLAudioIODeviceCapabilitiesItf_",
   "self_type" : "_ZTI31SLAudioIODeviceCapabilitiesItf_",
   "size" : 44,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "GetAvailableAudioInputs",
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_PiPjE"
    },
    {
     "field_name" : "QueryAudioInputCapabilities",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_jP23XAAudioInputDescriptor_E"
    },
    {
     "field_name" : "RegisterAvailableAudioInputsChangedCallback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_PFvS3_PvjijES4_E"
    },
    {
     "field_name" : "GetAvailableAudioOutputs",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_PiPjE"
    },
    {
     "field_name" : "QueryAudioOutputCapabilities",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_jP24XAAudioOutputDescriptor_E"
    },
    {
     "field_name" : "RegisterAvailableAudioOutputsChangedCallback",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_PFvS3_PvjijES4_E"
    },
    {
     "field_name" : "RegisterDefaultDeviceIDMapChangedCallback",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_PFvS3_PvjiES4_E"
    },
    {
     "field_name" : "GetAssociatedAudioInputs",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_jPiPjE"
    },
    {
     "field_name" : "GetAssociatedAudioOutputs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_jPiPjE"
    },
    {
     "field_name" : "GetDefaultAudioDevices",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_jPiPjE"
    },
    {
     "field_name" : "QuerySampleFormatsSupported",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK31XAAudioIODeviceCapabilitiesItf_jjPiS4_E"
    }
   ],
   "linker_set_key" : "_ZTI31XAAudioIODeviceCapabilitiesItf_",
   "name" : "XAAudioIODeviceCapabilitiesItf_",
   "referenced_type" : "_ZTI31XAAudioIODeviceCapabilitiesItf_",
   "self_type" : "_ZTI31XAAudioIODeviceCapabilitiesItf_",
   "size" : 44,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "index",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32SLAndroidSimpleBufferQueueState_",
   "name" : "SLAndroidSimpleBufferQueueState_",
   "referenced_type" : "_ZTI32SLAndroidSimpleBufferQueueState_",
   "self_type" : "_ZTI32SLAndroidSimpleBufferQueueState_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "AddInterface",
     "referenced_type" : "_ZTIPFjPKPK32SLDynamicInterfaceManagementItf_PK14SLInterfaceID_jE"
    },
    {
     "field_name" : "RemoveInterface",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK32SLDynamicInterfaceManagementItf_PK14SLInterfaceID_E"
    },
    {
     "field_name" : "ResumeInterface",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK32SLDynamicInterfaceManagementItf_PK14SLInterfaceID_jE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK32SLDynamicInterfaceManagementItf_PFvS3_PvjjPK14SLInterfaceID_ES4_E"
    }
   ],
   "linker_set_key" : "_ZTI32SLDynamicInterfaceManagementItf_",
   "name" : "SLDynamicInterfaceManagementItf_",
   "referenced_type" : "_ZTI32SLDynamicInterfaceManagementItf_",
   "self_type" : "_ZTI32SLDynamicInterfaceManagementItf_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "AddInterface",
     "referenced_type" : "_ZTIPFjPKPK32XADynamicInterfaceManagementItf_PK14XAInterfaceID_jE"
    },
    {
     "field_name" : "RemoveInterface",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK32XADynamicInterfaceManagementItf_PK14XAInterfaceID_E"
    },
    {
     "field_name" : "ResumeInterface",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK32XADynamicInterfaceManagementItf_PK14XAInterfaceID_jE"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK32XADynamicInterfaceManagementItf_PFvS3_PvjjPK14XAInterfaceID_ES4_E"
    }
   ],
   "linker_set_key" : "_ZTI32XADynamicInterfaceManagementItf_",
   "name" : "XADynamicInterfaceManagementItf_",
   "referenced_type" : "_ZTI32XADynamicInterfaceManagementItf_",
   "self_type" : "_ZTI32XADynamicInterfaceManagementItf_",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "_ZTIPFjPKPK33SLAndroidAutomaticGainControlItf_jE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK33SLAndroidAutomaticGainControlItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI33SLAndroidAutomaticGainControlItf_",
   "name" : "SLAndroidAutomaticGainControlItf_",
   "referenced_type" : "_ZTI33SLAndroidAutomaticGainControlItf_",
   "self_type" : "_ZTI33SLAndroidAutomaticGainControlItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numBuffers",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33SLDataLocator_AndroidBufferQueue_",
   "name" : "SLDataLocator_AndroidBufferQueue_",
   "referenced_type" : "_ZTI33SLDataLocator_AndroidBufferQueue_",
   "self_type" : "_ZTI33SLDataLocator_AndroidBufferQueue_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numBuffers",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33XADataLocator_AndroidBufferQueue_",
   "name" : "XADataLocator_AndroidBufferQueue_",
   "referenced_type" : "_ZTI33XADataLocator_AndroidBufferQueue_",
   "self_type" : "_ZTI33XADataLocator_AndroidBufferQueue_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device_id",
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "id",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "device",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "address",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "channel_mapping",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA30_34audio_microphone_channel_mapping_t"
    },
    {
     "field_name" : "location",
     "field_offset" : 1536,
     "referenced_type" : "_ZTI27audio_microphone_location_t"
    },
    {
     "field_name" : "group",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "index_in_the_group",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sensitivity",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "max_spl",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "min_spl",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "directionality",
     "field_offset" : 1728,
     "referenced_type" : "_ZTI33audio_microphone_directionality_t"
    },
    {
     "field_name" : "num_frequency_responses",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "frequency_responses",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIA2_A256_f"
    },
    {
     "field_name" : "geometric_location",
     "field_offset" : 18176,
     "referenced_type" : "_ZTI27audio_microphone_coordinate"
    },
    {
     "field_name" : "orientation",
     "field_offset" : 18272,
     "referenced_type" : "_ZTI27audio_microphone_coordinate"
    }
   ],
   "linker_set_key" : "_ZTI33audio_microphone_characteristic_t",
   "name" : "audio_microphone_characteristic_t",
   "referenced_type" : "_ZTI33audio_microphone_characteristic_t",
   "self_type" : "_ZTI33audio_microphone_characteristic_t",
   "size" : 2296,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIA100_c"
    },
    {
     "field_name" : "residency_in_msec_since_boot",
     "field_offset" : 832,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "total_transitions",
     "field_offset" : 896,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "supported_only_in_suspend",
     "field_offset" : 960,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "number_of_voters",
     "field_offset" : 992,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "voters",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIP19power_state_voter_t"
    }
   ],
   "linker_set_key" : "_ZTI34power_state_platform_sleep_state_t",
   "name" : "power_state_platform_sleep_state_t",
   "referenced_type" : "_ZTI34power_state_platform_sleep_state_t",
   "self_type" : "_ZTI34power_state_platform_sleep_state_t",
   "size" : 136,
   "source_file" : "/hardware/libhardware/include/hardware/power.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "_ZTIPFjPKPK37SLAndroidAcousticEchoCancellationItf_jE"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK37SLAndroidAcousticEchoCancellationItf_PjE"
    }
   ],
   "linker_set_key" : "_ZTI37SLAndroidAcousticEchoCancellationItf_",
   "name" : "SLAndroidAcousticEchoCancellationItf_",
   "referenced_type" : "_ZTI37SLAndroidAcousticEchoCancellationItf_",
   "self_type" : "_ZTI37SLAndroidAcousticEchoCancellationItf_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numBuffers",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI38SLDataLocator_AndroidSimpleBufferQueue",
   "name" : "SLDataLocator_AndroidSimpleBufferQueue",
   "referenced_type" : "_ZTI38SLDataLocator_AndroidSimpleBufferQueue",
   "self_type" : "_ZTI38SLDataLocator_AndroidSimpleBufferQueue",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5ARect",
   "name" : "ARect",
   "referenced_type" : "_ZTI5ARect",
   "self_type" : "_ZTI5ARect",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP5cnode"
    },
    {
     "field_name" : "first_child",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP5cnode"
    },
    {
     "field_name" : "last_child",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP5cnode"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "value",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI5cnode",
   "name" : "cnode",
   "referenced_type" : "_ZTI5cnode",
   "self_type" : "_ZTI5cnode",
   "size" : 20,
   "source_file" : "/system/core/libcutils/include/cutils/config_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hue",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "saturation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "lightness",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI6SLHSL_",
   "name" : "SLHSL_",
   "referenced_type" : "_ZTI6SLHSL_",
   "self_type" : "_ZTI6SLHSL_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hue",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "saturation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "lightness",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI6XAHSL_",
   "name" : "XAHSL_",
   "referenced_type" : "_ZTI6XAHSL_",
   "self_type" : "_ZTI6XAHSL_",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "b",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "c",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "i",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "j",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "d",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "l",
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI6jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6jvalue",
   "self_type" : "_ZTI6jvalue",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNINativeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "_ZTI7_JNIEnv",
   "self_type" : "_ZTI7_JNIEnv",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNIInvokeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "_ZTI7_JavaVM",
   "self_type" : "_ZTI7_JavaVM",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI7_jarray",
   "self_type" : "_ZTI7_jarray",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "_ZTI7_jclass",
   "self_type" : "_ZTI7_jclass",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8SLVec3D_",
   "name" : "SLVec3D_",
   "referenced_type" : "_ZTI8SLVec3D_",
   "self_type" : "_ZTI8SLVec3D_",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI8_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8_jobject",
   "self_type" : "_ZTI8_jobject",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI8_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8_jstring",
   "self_type" : "_ZTI8_jstring",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "QueryRDSSignal",
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PjE"
    },
    {
     "field_name" : "GetProgrammeServiceName",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PhE"
    },
    {
     "field_name" : "GetRadioText",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PhE"
    },
    {
     "field_name" : "GetRadioTextPlus",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_hPhS4_S4_E"
    },
    {
     "field_name" : "GetProgrammeType",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PjE"
    },
    {
     "field_name" : "GetProgrammeTypeString",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_jPhE"
    },
    {
     "field_name" : "GetProgrammeIdentificationCode",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PsE"
    },
    {
     "field_name" : "GetClockTime",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PyE"
    },
    {
     "field_name" : "GetTrafficAnnouncement",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PjE"
    },
    {
     "field_name" : "GetTrafficProgramme",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PjE"
    },
    {
     "field_name" : "SeekByProgrammeType",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_jjE"
    },
    {
     "field_name" : "SeekTrafficAnnouncement",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_jE"
    },
    {
     "field_name" : "SeekTrafficProgramme",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_jE"
    },
    {
     "field_name" : "SetAutomaticSwitching",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_jE"
    },
    {
     "field_name" : "GetAutomaticSwitching",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PjE"
    },
    {
     "field_name" : "SetAutomaticTrafficAnnouncement",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_jE"
    },
    {
     "field_name" : "GetAutomaticTrafficAnnouncement",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PjE"
    },
    {
     "field_name" : "GetODAGroup",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_tPFvPKPK11XARadioItf_PvjstES9_E"
    },
    {
     "field_name" : "SubscribeODAGroup",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_sjE"
    },
    {
     "field_name" : "UnsubscribeODAGroup",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_sE"
    },
    {
     "field_name" : "ListODAGroupSubscriptions",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PsPjE"
    },
    {
     "field_name" : "RegisterRDSCallback",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PFvS3_PvthES4_E"
    },
    {
     "field_name" : "RegisterODADataCallback",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFjPKPK9XARDSItf_PFvS3_PvsyES4_E"
    }
   ],
   "linker_set_key" : "_ZTI9XARDSItf_",
   "name" : "XARDSItf_",
   "referenced_type" : "_ZTI9XARDSItf_",
   "self_type" : "_ZTI9XARDSItf_",
   "size" : 92,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "_ZTI21audio_port_device_ext"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "_ZTI18audio_port_mix_ext"
    },
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI22audio_port_session_ext"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10audio_portUt_E",
   "name" : "audio_port::(anonymous union at system/media/audio/include/system/audio.h:562:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10audio_portUt_E",
   "self_type" : "_ZTIN10audio_portUt_E",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "raw",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "f32",
     "referenced_type" : "_ZTIPf"
    },
    {
     "field_name" : "s32",
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "s16",
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "u8",
     "referenced_type" : "_ZTIPh"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN14audio_buffer_sUt_E",
   "name" : "audio_buffer_s::(anonymous union at system/media/audio/include/system/audio_effect.h:451:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN14audio_buffer_sUt_E",
   "self_type" : "_ZTIN14audio_buffer_sUt_E",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio_effect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "_ZTI28audio_port_config_device_ext"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "_ZTI25audio_port_config_mix_ext"
    },
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI29audio_port_config_session_ext"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN17audio_port_configUt_E",
   "name" : "audio_port_config::(anonymous union at system/media/audio/include/system/audio.h:511:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN17audio_port_configUt_E",
   "self_type" : "_ZTIN17audio_port_configUt_E",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "_ZTI19audio_stream_type_t"
    },
    {
     "field_name" : "source",
     "referenced_type" : "_ZTI14audio_source_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN25audio_port_config_mix_extUt_E",
   "name" : "audio_port_config_mix_ext::(anonymous union at system/media/audio/include/system/audio.h:484:5)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN25audio_port_config_mix_extUt_E",
   "self_type" : "_ZTIN25audio_port_config_mix_extUt_E",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16vectorIN7android2spINS1_9AudioGainEEENS_9allocatorIS4_EEEE"
    },
    {
     "referenced_type" : "_ZTIN7android10ParcelableE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10AudioGainsE",
   "name" : "android::AudioGains",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10AudioGainsE",
   "self_type" : "_ZTIN7android10AudioGainsE",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaudiofoundation/include/media/AudioGain.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioGainsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioGainsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioGainsD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android10AudioGains13writeToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android10AudioGains14readFromParcelEPKNS_6ParcelE"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMetricsItem",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android12mediametrics4ItemENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10AudioTrack12MediaMetricsE",
   "name" : "android::AudioTrack::MediaMetrics",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10AudioTrack12MediaMetricsE",
   "self_type" : "_ZTIN7android10AudioTrack12MediaMetricsE",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTrack.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7IBinder14DeathRecipientE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAudioTrack",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android2wpINS_10AudioTrackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10AudioTrack13DeathNotifierE",
   "name" : "android::AudioTrack::DeathNotifier",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10AudioTrack13DeathNotifierE",
   "self_type" : "_ZTIN7android10AudioTrack13DeathNotifierE",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTrack.h",
   "vtable_components" :
   [
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrack13DeathNotifierE"
    },
    {
     "mangled_component_name" : "_ZN7android10AudioTrack13DeathNotifier10binderDiedERKNS_2wpINS_7IBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrack13DeathNotifierD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrack13DeathNotifierD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -12,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -12,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrack13DeathNotifierE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10AudioTrack13DeathNotifierD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10AudioTrack13DeathNotifierD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android6ThreadE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mReceiver",
     "field_offset" : 288,
     "referenced_type" : "_ZTIRN7android10AudioTrackE"
    },
    {
     "access" : "private",
     "field_name" : "mMyLock",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mMyCond",
     "field_offset" : 352,
     "referenced_type" : "_ZTIN7android9ConditionE"
    },
    {
     "access" : "private",
     "field_name" : "mPaused",
     "field_offset" : 384,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPausedInt",
     "field_offset" : 392,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPausedNs",
     "field_offset" : 448,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "mIgnoreNextPausedInt",
     "field_offset" : 512,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android10AudioTrack16AudioTrackThreadE",
   "name" : "android::AudioTrack::AudioTrackThread",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10AudioTrack16AudioTrackThreadE",
   "self_type" : "_ZTIN7android10AudioTrack16AudioTrackThreadE",
   "size" : 80,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTrack.h",
   "vtable_components" :
   [
    {
     "component_value" : 68,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrack16AudioTrackThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrack16AudioTrackThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrack16AudioTrackThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android10AudioTrack16AudioTrackThread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "mangled_component_name" : "_ZN7android10AudioTrack16AudioTrackThread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -68,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -68,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrack16AudioTrackThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10AudioTrack16AudioTrackThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10AudioTrack16AudioTrackThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android5media20BnAudioTrackCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAudioTrackCbLock",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mCallback",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN7android2wpINS_5media19IAudioTrackCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10AudioTrack18AudioTrackCallbackE",
   "name" : "android::AudioTrack::AudioTrackCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10AudioTrack18AudioTrackCallbackE",
   "self_type" : "_ZTIN7android10AudioTrack18AudioTrackCallbackE",
   "size" : 36,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTrack.h",
   "vtable_components" :
   [
    {
     "component_value" : 28,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrack18AudioTrackCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrack18AudioTrackCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrack18AudioTrackCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media19IAudioTrackCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_5media19IAudioTrackCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android10AudioTrack18AudioTrackCallback20onCodecFormatChangedERKNSt3__16vectorIhNS2_9allocatorIhEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media19IAudioTrackCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android5media20BnAudioTrackCallback10onTransactEjRKNS_6ParcelEPS2_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrack18AudioTrackCallbackE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_5media19IAudioTrackCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_5media19IAudioTrackCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10AudioTrack18AudioTrackCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10AudioTrack18AudioTrackCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android5media20BnAudioTrackCallback10onTransactEjRKNS_6ParcelEPS2_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrack18AudioTrackCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10AudioTrack18AudioTrackCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10AudioTrack18AudioTrackCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "frameCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android10AudioTrack6BufferUt_E"
    },
    {
     "field_name" : "sequence",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10AudioTrack6BufferE",
   "name" : "android::AudioTrack::Buffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10AudioTrack6BufferE",
   "self_type" : "_ZTIN7android10AudioTrack6BufferE",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTrack.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "raw",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "i16",
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "i8",
     "referenced_type" : "_ZTIPa"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android10AudioTrack6BufferUt_E",
   "name" : "android::AudioTrack::Buffer::(anonymous union at frameworks/av/media/libaudioclient/include/media/AudioTrack.h:108:9)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7android10AudioTrack6BufferUt_E",
   "self_type" : "_ZTIN7android10AudioTrack6BufferUt_E",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTrack.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11AudioSystem19AudioDeviceCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mAudioTrack",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2spINS_11IAudioTrackEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mCblkMemory",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android2spINS_7IMemoryEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mCblk",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPN7android18audio_track_cblk_tE"
    },
    {
     "access" : "protected",
     "field_name" : "mOutput",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mAudioTrackThread",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2spINS_10AudioTrack16AudioTrackThreadEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mThreadCanCallJava",
     "field_offset" : 224,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mVolume",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA2_f"
    },
    {
     "access" : "protected",
     "field_name" : "mSendLevel",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    },
    {
     "access" : "protected",
     "field_name" : "mSampleRate",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mOriginalSampleRate",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mPlaybackRate",
     "field_offset" : 416,
     "referenced_type" : "_ZTI19audio_playback_rate"
    },
    {
     "access" : "protected",
     "field_name" : "mMaxRequiredSpeed",
     "field_offset" : 544,
     "referenced_type" : "_ZTIf"
    },
    {
     "access" : "protected",
     "field_name" : "mFrameCount",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mReqFrameCount",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mAfLatency",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mAfFrameCount",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mAfSampleRate",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mFormat",
     "field_offset" : 736,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "access" : "protected",
     "field_name" : "mStreamType",
     "field_offset" : 768,
     "referenced_type" : "_ZTI19audio_stream_type_t"
    },
    {
     "access" : "protected",
     "field_name" : "mChannelCount",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mChannelMask",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mSharedBuffer",
     "field_offset" : 864,
     "referenced_type" : "_ZTIN7android2spINS_7IMemoryEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mTransfer",
     "field_offset" : 896,
     "referenced_type" : "_ZTIN7android10AudioTrack13transfer_typeE"
    },
    {
     "access" : "protected",
     "field_name" : "mOffloadInfoCopy",
     "field_offset" : 960,
     "referenced_type" : "_ZTI20audio_offload_info_t"
    },
    {
     "access" : "protected",
     "field_name" : "mOffloadInfo",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPK20audio_offload_info_t"
    },
    {
     "access" : "protected",
     "field_name" : "mAttributes",
     "field_offset" : 1504,
     "referenced_type" : "_ZTI18audio_attributes_t"
    },
    {
     "access" : "protected",
     "field_name" : "mFrameSize",
     "field_offset" : 3680,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mStatus",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mLatency",
     "field_offset" : 3744,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mState",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIN7android10AudioTrack5StateE"
    },
    {
     "access" : "protected",
     "field_name" : "mCbf",
     "field_offset" : 3808,
     "referenced_type" : "_ZTIPFviPvS_E"
    },
    {
     "access" : "protected",
     "field_name" : "mUserData",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "protected",
     "field_name" : "mNotificationFramesReq",
     "field_offset" : 3872,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mNotificationsPerBufferReq",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mNotificationFramesAct",
     "field_offset" : 3936,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mRefreshRemaining",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mLoopCount",
     "field_offset" : 4000,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mLoopStart",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mLoopEnd",
     "field_offset" : 4064,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mLoopCountNotified",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mRemainingFrames",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mRetryOnPartialBuffer",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mObservedSequence",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mMarkerPosition",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIN7android6ModuloIjEE"
    },
    {
     "access" : "protected",
     "field_name" : "mMarkerReached",
     "field_offset" : 4256,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mNewPosition",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIN7android6ModuloIjEE"
    },
    {
     "access" : "protected",
     "field_name" : "mUpdatePeriod",
     "field_offset" : 4320,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mServer",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIN7android6ModuloIjEE"
    },
    {
     "access" : "protected",
     "field_name" : "mPosition",
     "field_offset" : 4384,
     "referenced_type" : "_ZTIN7android6ModuloIjEE"
    },
    {
     "access" : "protected",
     "field_name" : "mReleased",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIN7android6ModuloIjEE"
    },
    {
     "access" : "protected",
     "field_name" : "mStartFromZeroUs",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "protected",
     "field_name" : "mStartNs",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "protected",
     "field_name" : "mStartEts",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIN7android17ExtendedTimestampE"
    },
    {
     "access" : "protected",
     "field_name" : "mStartTs",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIN7android14AudioTimestampE"
    },
    {
     "access" : "protected",
     "field_name" : "mPreviousTimestampValid",
     "field_offset" : 5536,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mTimestampStartupGlitchReported",
     "field_offset" : 5544,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mTimestampRetrogradePositionReported",
     "field_offset" : 5552,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mTimestampRetrogradeTimeReported",
     "field_offset" : 5560,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mTimestampStallReported",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "protected",
     "field_name" : "mTimestampStaleTimeReported",
     "field_offset" : 5576,
