{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA16_12VkMemoryHeap",
   "name" : "VkMemoryHeap [16]",
   "referenced_type" : "_ZTI12VkMemoryHeap",
   "self_type" : "_ZTIA16_12VkMemoryHeap",
   "size" : 256,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA16_h",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA16_y",
   "name" : "unsigned long long [16]",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIA16_y",
   "size" : 128,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA256_c",
   "name" : "char [256]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA256_c",
   "size" : 256,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2_10VkOffset3D",
   "name" : "VkOffset3D [2]",
   "referenced_type" : "_ZTI10VkOffset3D",
   "self_type" : "_ZTIA2_10VkOffset3D",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2_f",
   "name" : "float [2]",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIA2_f",

   "name" : "const VkPipelineDepthStencilStateCreateInfo",
   "referenced_type" : "_ZTI37VkPipelineDepthStencilStateCreateInfo",
   "self_type" : "_ZTIK37VkPipelineDepthStencilStateCreateInfo",
   "size" : 96,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK37VkPipelineTessellationStateCreateInfo",
   "name" : "const VkPipelineTessellationStateCreateInfo",
   "referenced_type" : "_ZTI37VkPipelineTessellationStateCreateInfo",
   "self_type" : "_ZTIK37VkPipelineTessellationStateCreateInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK38VkPhysicalDeviceSparseImageFormatInfo2",
   "name" : "const VkPhysicalDeviceSparseImageFormatInfo2",
   "referenced_type" : "_ZTI38VkPhysicalDeviceSparseImageFormatInfo2",
   "self_type" : "_ZTIK38VkPhysicalDeviceSparseImageFormatInfo2",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK38VkPipelineInputAssemblyStateCreateInfo",
   "name" : "const VkPipelineInputAssemblyStateCreateInfo",
   "referenced_type" : "_ZTI38VkPipelineInputAssemblyStateCreateInfo",
   "self_type" : "_ZTIK38VkPipelineInputAssemblyStateCreateInfo",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK38VkPipelineRasterizationStateCreateInfo",
   "name" : "const VkPipelineRasterizationStateCreateInfo",
   "referenced_type" : "_ZTI38VkPipelineRasterizationStateCreateInfo",
   "self_type" : "_ZTIK38VkPipelineRasterizationStateCreateInfo",
   "size" : 52,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK41VkVertexInputBindingDivisorDescriptionEXT",
   "name" : "const VkVertexInputBindingDivisorDescriptionEXT",
   "referenced_type" : "_ZTI41VkVertexInputBindingDivisorDescriptionEXT",
   "self_type" : "_ZTIK41VkVertexInputBindingDivisorDescriptionEXT",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK43VkMemoryGetAndroidHardwareBufferInfoANDROID",
   "name" : "const VkMemoryGetAndroidHardwareBufferInfoANDROID",
   "referenced_type" : "_ZTI43VkMemoryGetAndroidHardwareBufferInfoANDROID",
   "self_type" : "_ZTIK43VkMemoryGetAndroidHardwareBufferInfoANDROID",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8VkFormat",
   "name" : "const VkFormat",
   "referenced_type" : "_ZTI8VkFormat",
   "self_type" : "_ZTIK8VkFormat",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8VkRect2D",
   "name" : "const VkRect2D",
   "referenced_type" : "_ZTI8VkRect2D",
   "self_type" : "_ZTIK8VkRect2D",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP17VkCommandBuffer_T",
   "name" : "VkCommandBuffer_T *const",
   "referenced_type" : "_ZTIP17VkCommandBuffer_T",
   "self_type" : "_ZTIKP17VkCommandBuffer_T",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP18VkPhysicalDevice_T",
   "name" : "VkPhysicalDevice_T *const",
   "referenced_type" : "_ZTIP18VkPhysicalDevice_T",
   "self_type" : "_ZTIKP18VkPhysicalDevice_T",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIKPKc",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10VkExtent2D",
   "name" : "VkExtent2D",
   "referenced_type" : "_ZTI10VkExtent2D",
   "self_type" : "_ZTI10VkExtent2D",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depth",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10VkExtent3D",
   "name" : "VkExtent3D",
   "referenced_type" : "_ZTI10VkExtent3D",
   "self_type" : "_ZTI10VkExtent3D",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10VkOffset2D",
   "name" : "VkOffset2D",
   "referenced_type" : "_ZTI10VkOffset2D",
   "self_type" : "_ZTI10VkOffset2D",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10VkOffset3D",
   "name" : "VkOffset3D",
   "referenced_type" : "_ZTI10VkOffset3D",
   "self_type" : "_ZTI10VkOffset3D",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "width",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minDepth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxDepth",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI10VkViewport",
   "name" : "VkViewport",
   "referenced_type" : "_ZTI10VkViewport",
   "self_type" : "_ZTI10VkViewport",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rect",
     "referenced_type" : "_ZTI8VkRect2D"
    },
    {
     "field_name" : "baseArrayLayer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11VkClearRect",
   "name" : "VkClearRect",
   "referenced_type" : "_ZTI11VkClearRect",
   "self_type" : "_ZTI11VkClearRect",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "srcSubresource",
     "referenced_type" : "_ZTI24VkImageSubresourceLayers"
    },
    {
     "field_name" : "srcOffsets",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA2_10VkOffset3D"
    },
    {
     "field_name" : "dstSubresource",
     "field_offset" : 320,
     "referenced_type" : "_ZTI24VkImageSubresourceLayers"
    },
    {
     "field_name" : "dstOffsets",
     "field_offset" : 448,
     "referenced_type" : "_ZTIA2_10VkOffset3D"
    }
   ],
   "linker_set_key" : "_ZTI11VkImageBlit",
   "name" : "VkImageBlit",
   "referenced_type" : "_ZTI11VkImageBlit",
   "self_type" : "_ZTI11VkImageBlit",
   "size" : 80,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "srcSubresource",
     "referenced_type" : "_ZTI24VkImageSubresourceLayers"
    },
    {
     "field_name" : "srcOffset",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10VkOffset3D"
    },
    {
     "field_name" : "dstSubresource",
     "field_offset" : 224,
     "referenced_type" : "_ZTI24VkImageSubresourceLayers"
    },
    {
     "field_name" : "dstOffset",
     "field_offset" : 352,
     "referenced_type" : "_ZTI10VkOffset3D"
    },
    {
     "field_name" : "extent",
     "field_offset" : 448,
     "referenced_type" : "_ZTI10VkExtent3D"
    }
   ],
   "linker_set_key" : "_ZTI11VkImageCopy",
   "name" : "VkImageCopy",
   "referenced_type" : "_ZTI11VkImageCopy",
   "self_type" : "_ZTI11VkImageCopy",
   "size" : 68,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "srcOffset",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dstOffset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI12VkBufferCopy",
   "name" : "VkBufferCopy",
   "referenced_type" : "_ZTI12VkBufferCopy",
   "self_type" : "_ZTI12VkBufferCopy",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "color",
     "referenced_type" : "_ZTI17VkClearColorValue"
    },
    {
     "field_name" : "depthStencil",
     "referenced_type" : "_ZTI24VkClearDepthStencilValue"
    }
   ],
   "linker_set_key" : "_ZTI12VkClearValue",
   "name" : "VkClearValue",
   "record_kind" : "union",
   "referenced_type" : "_ZTI12VkClearValue",
   "self_type" : "_ZTI12VkClearValue",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "geometryType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16VkGeometryTypeNV"
    },
    {
     "field_name" : "geometry",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16VkGeometryDataNV"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12VkGeometryNV",
   "name" : "VkGeometryNV",
   "referenced_type" : "_ZTI12VkGeometryNV",
   "self_type" : "_ZTI12VkGeometryNV",
   "size" : 144,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12VkMemoryHeap",
   "name" : "VkMemoryHeap",
   "referenced_type" : "_ZTI12VkMemoryHeap",
   "self_type" : "_ZTI12VkMemoryHeap",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "propertyFlags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "heapIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12VkMemoryType",
   "name" : "VkMemoryType",
   "referenced_type" : "_ZTI12VkMemoryType",
   "self_type" : "_ZTI12VkMemoryType",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "waitSemaphoreCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pWaitSemaphores",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKy"
    },
    {
     "field_name" : "pWaitDstStageMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "commandBufferCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pCommandBuffers",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKP17VkCommandBuffer_T"
    },
    {
     "field_name" : "signalSemaphoreCount",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSignalSemaphores",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKy"
    }
   ],
   "linker_set_key" : "_ZTI12VkSubmitInfo",
   "name" : "VkSubmitInfo",
   "referenced_type" : "_ZTI12VkSubmitInfo",
   "self_type" : "_ZTI12VkSubmitInfo",
   "size" : 36,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI12VkXYColorEXT",
   "name" : "VkXYColorEXT",
   "referenced_type" : "_ZTI12VkXYColorEXT",
   "self_type" : "_ZTI12VkXYColorEXT",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "srcSubresource",
     "referenced_type" : "_ZTI24VkImageSubresourceLayers"
    },
    {
     "field_name" : "srcOffset",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10VkOffset3D"
    },
    {
     "field_name" : "dstSubresource",
     "field_offset" : 224,
     "referenced_type" : "_ZTI24VkImageSubresourceLayers"
    },
    {
     "field_name" : "dstOffset",
     "field_offset" : 352,
     "referenced_type" : "_ZTI10VkOffset3D"
    },
    {
     "field_name" : "extent",
     "field_offset" : 448,
     "referenced_type" : "_ZTI10VkExtent3D"
    }
   ],
   "linker_set_key" : "_ZTI14VkImageResolve",
   "name" : "VkImageResolve",
   "referenced_type" : "_ZTI14VkImageResolve",
   "self_type" : "_ZTI14VkImageResolve",
   "size" : 68,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "_ZTI10VkOffset2D"
    },
    {
     "field_name" : "extent",
     "field_offset" : 64,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "layer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14VkRectLayerKHR",
   "name" : "VkRectLayerKHR",
   "referenced_type" : "_ZTI14VkRectLayerKHR",
   "self_type" : "_ZTI14VkRectLayerKHR",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "srcAccessMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstAccessMask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15VkMemoryBarrier",
   "name" : "VkMemoryBarrier",
   "referenced_type" : "_ZTI15VkMemoryBarrier",
   "self_type" : "_ZTI15VkMemoryBarrier",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "waitSemaphoreCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pWaitSemaphores",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKy"
    },
    {
     "field_name" : "bufferBindCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pBufferBinds",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPK28VkSparseBufferMemoryBindInfo"
    },
    {
     "field_name" : "imageOpaqueBindCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pImageOpaqueBinds",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPK33VkSparseImageOpaqueMemoryBindInfo"
    },
    {
     "field_name" : "imageBindCount",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pImageBinds",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPK27VkSparseImageMemoryBindInfo"
    },
    {
     "field_name" : "signalSemaphoreCount",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSignalSemaphores",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPKy"
    }
   ],
   "linker_set_key" : "_ZTI16VkBindSparseInfo",
   "name" : "VkBindSparseInfo",
   "referenced_type" : "_ZTI16VkBindSparseInfo",
   "self_type" : "_ZTI16VkBindSparseInfo",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "aabbData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "numAABBs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stride",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI16VkGeometryAABBNV",
   "name" : "VkGeometryAABBNV",
   "referenced_type" : "_ZTI16VkGeometryAABBNV",
   "self_type" : "_ZTI16VkGeometryAABBNV",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "triangles",
     "referenced_type" : "_ZTI21VkGeometryTrianglesNV"
    },
    {
     "field_name" : "aabbs",
     "field_offset" : 704,
     "referenced_type" : "_ZTI16VkGeometryAABBNV"
    }
   ],
   "linker_set_key" : "_ZTI16VkGeometryDataNV",
   "name" : "VkGeometryDataNV",
   "referenced_type" : "_ZTI16VkGeometryDataNV",
   "self_type" : "_ZTI16VkGeometryDataNV",
   "size" : 120,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "displayPrimaryRed",
     "field_offset" : 64,
     "referenced_type" : "_ZTI12VkXYColorEXT"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 128,
     "referenced_type" : "_ZTI12VkXYColorEXT"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 192,
     "referenced_type" : "_ZTI12VkXYColorEXT"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 256,
     "referenced_type" : "_ZTI12VkXYColorEXT"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 352,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxContentLightLevel",
     "field_offset" : 384,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 416,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16VkHdrMetadataEXT",
   "name" : "VkHdrMetadataEXT",
   "referenced_type" : "_ZTI16VkHdrMetadataEXT",
   "self_type" : "_ZTI16VkHdrMetadataEXT",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "waitSemaphoreCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pWaitSemaphores",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKy"
    },
    {
     "field_name" : "swapchainCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSwapchains",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKy"
    },
    {
     "field_name" : "pImageIndices",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "pResults",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP8VkResult"
    }
   ],
   "linker_set_key" : "_ZTI16VkPresentInfoKHR",
   "name" : "VkPresentInfoKHR",
   "referenced_type" : "_ZTI16VkPresentInfoKHR",
   "self_type" : "_ZTI16VkPresentInfoKHR",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "failOp",
     "referenced_type" : "_ZTI11VkStencilOp"
    },
    {
     "field_name" : "passOp",
     "field_offset" : 32,
     "referenced_type" : "_ZTI11VkStencilOp"
    },
    {
     "field_name" : "depthFailOp",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11VkStencilOp"
    },
    {
     "field_name" : "compareOp",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11VkCompareOp"
    },
    {
     "field_name" : "compareMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "writeMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reference",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16VkStencilOpState",
   "name" : "VkStencilOpState",
   "referenced_type" : "_ZTI16VkStencilOpState",
   "self_type" : "_ZTI16VkStencilOpState",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "pApplicationName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "applicationVersion",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pEngineName",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "engineVersion",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "apiVersion",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17VkApplicationInfo",
   "name" : "VkApplicationInfo",
   "referenced_type" : "_ZTI17VkApplicationInfo",
   "self_type" : "_ZTI17VkApplicationInfo",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPK17VkBaseInStructure"
    }
   ],
   "linker_set_key" : "_ZTI17VkBaseInStructure",
   "name" : "VkBaseInStructure",
   "referenced_type" : "_ZTI17VkBaseInStructure",
   "self_type" : "_ZTI17VkBaseInStructure",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bufferOffset",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bufferRowLength",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bufferImageHeight",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imageSubresource",
     "field_offset" : 128,
     "referenced_type" : "_ZTI24VkImageSubresourceLayers"
    },
    {
     "field_name" : "imageOffset",
     "field_offset" : 256,
     "referenced_type" : "_ZTI10VkOffset3D"
    },
    {
     "field_name" : "imageExtent",
     "field_offset" : 352,
     "referenced_type" : "_ZTI10VkExtent3D"
    }
   ],
   "linker_set_key" : "_ZTI17VkBufferImageCopy",
   "name" : "VkBufferImageCopy",
   "referenced_type" : "_ZTI17VkBufferImageCopy",
   "self_type" : "_ZTI17VkBufferImageCopy",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aspectMask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "colorAttachment",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "clearValue",
     "field_offset" : 64,
     "referenced_type" : "_ZTI12VkClearValue"
    }
   ],
   "linker_set_key" : "_ZTI17VkClearAttachment",
   "name" : "VkClearAttachment",
   "referenced_type" : "_ZTI17VkClearAttachment",
   "self_type" : "_ZTI17VkClearAttachment",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "float32",
     "referenced_type" : "_ZTIA4_f"
    },
    {
     "field_name" : "int32",
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "uint32",
     "referenced_type" : "_ZTIA4_j"
    }
   ],
   "linker_set_key" : "_ZTI17VkClearColorValue",
   "name" : "VkClearColorValue",
   "record_kind" : "union",
   "referenced_type" : "_ZTI17VkClearColorValue",
   "self_type" : "_ZTI17VkClearColorValue",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17VkEventCreateInfo",
   "name" : "VkEventCreateInfo",
   "referenced_type" : "_ZTI17VkEventCreateInfo",
   "self_type" : "_ZTI17VkEventCreateInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17VkFenceCreateInfo",
   "name" : "VkFenceCreateInfo",
   "referenced_type" : "_ZTI17VkFenceCreateInfo",
   "self_type" : "_ZTI17VkFenceCreateInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imageType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11VkImageType"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "extent",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10VkExtent3D"
    },
    {
     "field_name" : "mipLevels",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arrayLayers",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samples",
     "field_offset" : 320,
     "referenced_type" : "_ZTI21VkSampleCountFlagBits"
    },
    {
     "field_name" : "tiling",
     "field_offset" : 352,
     "referenced_type" : "_ZTI13VkImageTiling"
    },
    {
     "field_name" : "usage",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sharingMode",
     "field_offset" : 416,
     "referenced_type" : "_ZTI13VkSharingMode"
    },
    {
     "field_name" : "queueFamilyIndexCount",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pQueueFamilyIndices",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "initialLayout",
     "field_offset" : 512,
     "referenced_type" : "_ZTI13VkImageLayout"
    }
   ],
   "linker_set_key" : "_ZTI17VkImageCreateInfo",
   "name" : "VkImageCreateInfo",
   "referenced_type" : "_ZTI17VkImageCreateInfo",
   "self_type" : "_ZTI17VkImageCreateInfo",
   "size" : 68,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layerName",
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "specVersion",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "implementationVersion",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "description",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI17VkLayerProperties",
   "name" : "VkLayerProperties",
   "referenced_type" : "_ZTI17VkLayerProperties",
   "self_type" : "_ZTI17VkLayerProperties",
   "size" : 520,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "pipeline",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI17VkPipelineInfoKHR",
   "name" : "VkPipelineInfoKHR",
   "referenced_type" : "_ZTI17VkPipelineInfoKHR",
   "self_type" : "_ZTI17VkPipelineInfoKHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP18VkBaseOutStructure"
    }
   ],
   "linker_set_key" : "_ZTI18VkBaseOutStructure",
   "name" : "VkBaseOutStructure",
   "referenced_type" : "_ZTI18VkBaseOutStructure",
   "self_type" : "_ZTI18VkBaseOutStructure",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "usage",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sharingMode",
     "field_offset" : 224,
     "referenced_type" : "_ZTI13VkSharingMode"
    },
    {
     "field_name" : "queueFamilyIndexCount",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pQueueFamilyIndices",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPKj"
    }
   ],
   "linker_set_key" : "_ZTI18VkBufferCreateInfo",
   "name" : "VkBufferCreateInfo",
   "referenced_type" : "_ZTI18VkBufferCreateInfo",
   "self_type" : "_ZTI18VkBufferCreateInfo",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stage",
     "field_offset" : 64,
     "referenced_type" : "_ZTI23VkPipelineStageFlagBits"
    },
    {
     "field_name" : "pCheckpointMarker",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI18VkCheckpointDataNV",
   "name" : "VkCheckpointDataNV",
   "referenced_type" : "_ZTI18VkCheckpointDataNV",
   "self_type" : "_ZTI18VkCheckpointDataNV",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTI18VkComponentSwizzle"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "_ZTI18VkComponentSwizzle"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "_ZTI18VkComponentSwizzle"
    },
    {
     "field_name" : "a",
     "field_offset" : 96,
     "referenced_type" : "_ZTI18VkComponentSwizzle"
    }
   ],
   "linker_set_key" : "_ZTI18VkComponentMapping",
   "name" : "VkComponentMapping",
   "referenced_type" : "_ZTI18VkComponentMapping",
   "self_type" : "_ZTI18VkComponentMapping",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queueCreateInfoCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pQueueCreateInfos",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK23VkDeviceQueueCreateInfo"
    },
    {
     "field_name" : "enabledLayerCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ppEnabledLayerNames",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKPKc"
    },
    {
     "field_name" : "enabledExtensionCount",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ppEnabledExtensionNames",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPKPKc"
    },
    {
     "field_name" : "pEnabledFeatures",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPK24VkPhysicalDeviceFeatures"
    }
   ],
   "linker_set_key" : "_ZTI18VkDeviceCreateInfo",
   "name" : "VkDeviceCreateInfo",
   "referenced_type" : "_ZTI18VkDeviceCreateInfo",
   "self_type" : "_ZTI18VkDeviceCreateInfo",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queueFamilyIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queueIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18VkDeviceQueueInfo2",
   "name" : "VkDeviceQueueInfo2",
   "referenced_type" : "_ZTI18VkDeviceQueueInfo2",
   "self_type" : "_ZTI18VkDeviceQueueInfo2",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "linearTilingFeatures",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "optimalTilingFeatures",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bufferFeatures",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18VkFormatProperties",
   "name" : "VkFormatProperties",
   "referenced_type" : "_ZTI18VkFormatProperties",
   "self_type" : "_ZTI18VkFormatProperties",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aspectMask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mipLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arrayLayer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18VkImageSubresource",
   "name" : "VkImageSubresource",
   "referenced_type" : "_ZTI18VkImageSubresource",
   "self_type" : "_ZTI18VkImageSubresource",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rectangleCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pRectangles",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPK14VkRectLayerKHR"
    }
   ],
   "linker_set_key" : "_ZTI18VkPresentRegionKHR",
   "name" : "VkPresentRegionKHR",
   "referenced_type" : "_ZTI18VkPresentRegionKHR",
   "self_type" : "_ZTI18VkPresentRegionKHR",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "resourceOffset",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "memory",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "memoryOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18VkSparseMemoryBind",
   "name" : "VkSparseMemoryBind",
   "referenced_type" : "_ZTI18VkSparseMemoryBind",
   "self_type" : "_ZTI18VkSparseMemoryBind",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "colorSpace",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15VkColorSpaceKHR"
    }
   ],
   "linker_set_key" : "_ZTI18VkSurfaceFormatKHR",
   "name" : "VkSurfaceFormatKHR",
   "referenced_type" : "_ZTI18VkSurfaceFormatKHR",
   "self_type" : "_ZTI18VkSurfaceFormatKHR",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "srcSet",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "srcBinding",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "srcArrayElement",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstSet",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dstBinding",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstArrayElement",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "descriptorCount",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19VkCopyDescriptorSet",
   "name" : "VkCopyDescriptorSet",
   "referenced_type" : "_ZTI19VkCopyDescriptorSet",
   "self_type" : "_ZTI19VkCopyDescriptorSet",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "fence",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI33VkExternalFenceHandleTypeFlagBits"
    }
   ],
   "linker_set_key" : "_ZTI19VkFenceGetFdInfoKHR",
   "name" : "VkFenceGetFdInfoKHR",
   "referenced_type" : "_ZTI19VkFenceGetFdInfoKHR",
   "self_type" : "_ZTI19VkFenceGetFdInfoKHR",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "formatProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI18VkFormatProperties"
    }
   ],
   "linker_set_key" : "_ZTI19VkFormatProperties2",
   "name" : "VkFormatProperties2",
   "referenced_type" : "_ZTI19VkFormatProperties2",
   "self_type" : "_ZTI19VkFormatProperties2",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "memory",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI19VkMappedMemoryRange",
   "name" : "VkMappedMemoryRange",
   "referenced_type" : "_ZTI19VkMappedMemoryRange",
   "self_type" : "_ZTI19VkMappedMemoryRange",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "swapchainCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pRegions",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK18VkPresentRegionKHR"
    }
   ],
   "linker_set_key" : "_ZTI19VkPresentRegionsKHR",
   "name" : "VkPresentRegionsKHR",
   "referenced_type" : "_ZTI19VkPresentRegionsKHR",
   "self_type" : "_ZTI19VkPresentRegionsKHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "presentID",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "desiredPresentTime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI19VkPresentTimeGOOGLE",
   "name" : "VkPresentTimeGOOGLE",
   "referenced_type" : "_ZTI19VkPresentTimeGOOGLE",
   "self_type" : "_ZTI19VkPresentTimeGOOGLE",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stageFlags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19VkPushConstantRange",
   "name" : "VkPushConstantRange",
   "referenced_type" : "_ZTI19VkPushConstantRange",
   "self_type" : "_ZTI19VkPushConstantRange",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI19VkSampleLocationEXT",
   "name" : "VkSampleLocationEXT",
   "referenced_type" : "_ZTI19VkSampleLocationEXT",
   "self_type" : "_ZTI19VkSampleLocationEXT",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "magFilter",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8VkFilter"
    },
    {
     "field_name" : "minFilter",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8VkFilter"
    },
    {
     "field_name" : "mipmapMode",
     "field_offset" : 160,
     "referenced_type" : "_ZTI19VkSamplerMipmapMode"
    },
    {
     "field_name" : "addressModeU",
     "field_offset" : 192,
     "referenced_type" : "_ZTI20VkSamplerAddressMode"
    },
    {
     "field_name" : "addressModeV",
     "field_offset" : 224,
     "referenced_type" : "_ZTI20VkSamplerAddressMode"
    },
    {
     "field_name" : "addressModeW",
     "field_offset" : 256,
     "referenced_type" : "_ZTI20VkSamplerAddressMode"
    },
    {
     "field_name" : "mipLodBias",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "anisotropyEnable",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxAnisotropy",
     "field_offset" : 352,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "compareEnable",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "compareOp",
     "field_offset" : 416,
     "referenced_type" : "_ZTI11VkCompareOp"
    },
    {
     "field_name" : "minLod",
     "field_offset" : 448,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxLod",
     "field_offset" : 480,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "borderColor",
     "field_offset" : 512,
     "referenced_type" : "_ZTI13VkBorderColor"
    },
    {
     "field_name" : "unnormalizedCoordinates",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19VkSamplerCreateInfo",
   "name" : "VkSamplerCreateInfo",
   "referenced_type" : "_ZTI19VkSamplerCreateInfo",
   "self_type" : "_ZTI19VkSamplerCreateInfo",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "srcSubpass",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstSubpass",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "srcStageMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstStageMask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "srcAccessMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstAccessMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dependencyFlags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI19VkSubpassDependency",
   "name" : "VkSubpassDependency",
   "referenced_type" : "_ZTI19VkSubpassDependency",
   "self_type" : "_ZTI19VkSubpassDependency",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTI19VkSubpassEndInfoKHR",
   "name" : "VkSubpassEndInfoKHR",
   "referenced_type" : "_ZTI19VkSubpassEndInfoKHR",
   "self_type" : "_ZTI19VkSubpassEndInfoKHR",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rowPitch",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "arrayPitch",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "depthPitch",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI19VkSubresourceLayout",
   "name" : "VkSubresourceLayout",
   "referenced_type" : "_ZTI19VkSubresourceLayout",
   "self_type" : "_ZTI19VkSubresourceLayout",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "surfaceFormat",
     "field_offset" : 64,
     "referenced_type" : "_ZTI18VkSurfaceFormatKHR"
    }
   ],
   "linker_set_key" : "_ZTI19VkSurfaceFormat2KHR",
   "name" : "VkSurfaceFormat2KHR",
   "referenced_type" : "_ZTI19VkSurfaceFormat2KHR",
   "self_type" : "_ZTI19VkSurfaceFormat2KHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTI29VkViewportCoordinateSwizzleNV"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTI29VkViewportCoordinateSwizzleNV"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTI29VkViewportCoordinateSwizzleNV"
    },
    {
     "field_name" : "w",
     "field_offset" : 96,
     "referenced_type" : "_ZTI29VkViewportCoordinateSwizzleNV"
    }
   ],
   "linker_set_key" : "_ZTI19VkViewportSwizzleNV",
   "name" : "VkViewportSwizzleNV",
   "referenced_type" : "_ZTI19VkViewportSwizzleNV",
   "self_type" : "_ZTI19VkViewportSwizzleNV",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "pLabelName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "color",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA4_f"
    }
   ],
   "linker_set_key" : "_ZTI20VkDebugUtilsLabelEXT",
   "name" : "VkDebugUtilsLabelEXT",
   "referenced_type" : "_ZTI20VkDebugUtilsLabelEXT",
   "self_type" : "_ZTI20VkDebugUtilsLabelEXT",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI16VkDescriptorType"
    },
    {
     "field_name" : "descriptorCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20VkDescriptorPoolSize",
   "name" : "VkDescriptorPoolSize",
   "referenced_type" : "_ZTI20VkDescriptorPoolSize",
   "self_type" : "_ZTI20VkDescriptorPoolSize",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "deviceEvent",
     "field_offset" : 64,
     "referenced_type" : "_ZTI20VkDeviceEventTypeEXT"
    }
   ],
   "linker_set_key" : "_ZTI20VkDeviceEventInfoEXT",
   "name" : "VkDeviceEventInfoEXT",
   "referenced_type" : "_ZTI20VkDeviceEventInfoEXT",
   "self_type" : "_ZTI20VkDeviceEventInfoEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "srcAccessMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstAccessMask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "oldLayout",
     "field_offset" : 128,
     "referenced_type" : "_ZTI13VkImageLayout"
    },
    {
     "field_name" : "newLayout",
     "field_offset" : 160,
     "referenced_type" : "_ZTI13VkImageLayout"
    },
    {
     "field_name" : "srcQueueFamilyIndex",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstQueueFamilyIndex",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "image",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "subresourceRange",
     "field_offset" : 320,
     "referenced_type" : "_ZTI23VkImageSubresourceRange"
    }
   ],
   "linker_set_key" : "_ZTI20VkImageMemoryBarrier",
   "name" : "VkImageMemoryBarrier",
   "referenced_type" : "_ZTI20VkImageMemoryBarrier",
   "self_type" : "_ZTI20VkImageMemoryBarrier",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pApplicationInfo",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK17VkApplicationInfo"
    },
    {
     "field_name" : "enabledLayerCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ppEnabledLayerNames",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKPKc"
    },
    {
     "field_name" : "enabledExtensionCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ppEnabledExtensionNames",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPKPKc"
    }
   ],
   "linker_set_key" : "_ZTI20VkInstanceCreateInfo",
   "name" : "VkInstanceCreateInfo",
   "referenced_type" : "_ZTI20VkInstanceCreateInfo",
   "self_type" : "_ZTI20VkInstanceCreateInfo",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "allocationSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "memoryTypeIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20VkMemoryAllocateInfo",
   "name" : "VkMemoryAllocateInfo",
   "referenced_type" : "_ZTI20VkMemoryAllocateInfo",
   "self_type" : "_ZTI20VkMemoryAllocateInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "memory",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI34VkExternalMemoryHandleTypeFlagBits"
    }
   ],
   "linker_set_key" : "_ZTI20VkMemoryGetFdInfoKHR",
   "name" : "VkMemoryGetFdInfoKHR",
   "referenced_type" : "_ZTI20VkMemoryGetFdInfoKHR",
   "self_type" : "_ZTI20VkMemoryGetFdInfoKHR",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "alignment",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "memoryTypeBits",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20VkMemoryRequirements",
   "name" : "VkMemoryRequirements",
   "referenced_type" : "_ZTI20VkMemoryRequirements",
   "self_type" : "_ZTI20VkMemoryRequirements",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mapEntryCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pMapEntries",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPK24VkSpecializationMapEntry"
    },
    {
     "field_name" : "dataSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pData",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTI20VkSpecializationInfo",
   "name" : "VkSpecializationInfo",
   "referenced_type" : "_ZTI20VkSpecializationInfo",
   "self_type" : "_ZTI20VkSpecializationInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pipelineBindPoint",
     "field_offset" : 32,
     "referenced_type" : "_ZTI19VkPipelineBindPoint"
    },
    {
     "field_name" : "inputAttachmentCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pInputAttachments",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK21VkAttachmentReference"
    },
    {
     "field_name" : "colorAttachmentCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pColorAttachments",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPK21VkAttachmentReference"
    },
    {
     "field_name" : "pResolveAttachments",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK21VkAttachmentReference"
    },
    {
     "field_name" : "pDepthStencilAttachment",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPK21VkAttachmentReference"
    },
    {
     "field_name" : "preserveAttachmentCount",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pPreserveAttachments",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPKj"
    }
   ],
   "linker_set_key" : "_ZTI20VkSubpassDescription",
   "name" : "VkSubpassDescription",
   "referenced_type" : "_ZTI20VkSubpassDescription",
   "self_type" : "_ZTI20VkSubpassDescription",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "disabledValidationCheckCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDisabledValidationChecks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK20VkValidationCheckEXT"
    }
   ],
   "linker_set_key" : "_ZTI20VkValidationFlagsEXT",
   "name" : "VkValidationFlagsEXT",
   "referenced_type" : "_ZTI20VkValidationFlagsEXT",
   "self_type" : "_ZTI20VkValidationFlagsEXT",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "xcoeff",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "ycoeff",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI20VkViewportWScalingNV",
   "name" : "VkViewportWScalingNV",
   "referenced_type" : "_ZTI20VkViewportWScalingNV",
   "self_type" : "_ZTI20VkViewportWScalingNV",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "dstSet",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dstBinding",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstArrayElement",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "descriptorCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "descriptorType",
     "field_offset" : 224,
     "referenced_type" : "_ZTI16VkDescriptorType"
    },
    {
     "field_name" : "pImageInfo",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK21VkDescriptorImageInfo"
    },
    {
     "field_name" : "pBufferInfo",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPK22VkDescriptorBufferInfo"
    },
    {
     "field_name" : "pTexelBufferView",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKy"
    }
   ],
   "linker_set_key" : "_ZTI20VkWriteDescriptorSet",
   "name" : "VkWriteDescriptorSet",
   "referenced_type" : "_ZTI20VkWriteDescriptorSet",
   "self_type" : "_ZTI20VkWriteDescriptorSet",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pUserData",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pfnAllocation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFPvS_jj23VkSystemAllocationScopeE"
    },
    {
     "field_name" : "pfnReallocation",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFPvS_S_jj23VkSystemAllocationScopeE"
    },
    {
     "field_name" : "pfnFree",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "pfnInternalAllocation",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvPvj24VkInternalAllocationType23VkSystemAllocationScopeE"
    },
    {
     "field_name" : "pfnInternalFree",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFvPvj24VkInternalAllocationType23VkSystemAllocationScopeE"
    }
   ],
   "linker_set_key" : "_ZTI21VkAllocationCallbacks",
   "name" : "VkAllocationCallbacks",
   "referenced_type" : "_ZTI21VkAllocationCallbacks",
   "self_type" : "_ZTI21VkAllocationCallbacks",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "attachment",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layout",
     "field_offset" : 32,
     "referenced_type" : "_ZTI13VkImageLayout"
    }
   ],
   "linker_set_key" : "_ZTI21VkAttachmentReference",
   "name" : "VkAttachmentReference",
   "referenced_type" : "_ZTI21VkAttachmentReference",
   "self_type" : "_ZTI21VkAttachmentReference",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "image",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "memory",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "memoryOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI21VkBindImageMemoryInfo",
   "name" : "VkBindImageMemoryInfo",
   "referenced_type" : "_ZTI21VkBindImageMemoryInfo",
   "self_type" : "_ZTI21VkBindImageMemoryInfo",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "srcAccessMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstAccessMask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "srcQueueFamilyIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstQueueFamilyIndex",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "offset",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI21VkBufferMemoryBarrier",
   "name" : "VkBufferMemoryBarrier",
   "referenced_type" : "_ZTI21VkBufferMemoryBarrier",
   "self_type" : "_ZTI21VkBufferMemoryBarrier",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampler",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "imageView",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "imageLayout",
     "field_offset" : 128,
     "referenced_type" : "_ZTI13VkImageLayout"
    }
   ],
   "linker_set_key" : "_ZTI21VkDescriptorImageInfo",
   "name" : "VkDescriptorImageInfo",
   "referenced_type" : "_ZTI21VkDescriptorImageInfo",
   "self_type" : "_ZTI21VkDescriptorImageInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "displayEvent",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21VkDisplayEventTypeEXT"
    }
   ],
   "linker_set_key" : "_ZTI21VkDisplayEventInfoEXT",
   "name" : "VkDisplayEventInfoEXT",
   "referenced_type" : "_ZTI21VkDisplayEventInfoEXT",
   "self_type" : "_ZTI21VkDisplayEventInfoEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "powerState",
     "field_offset" : 64,
     "referenced_type" : "_ZTI22VkDisplayPowerStateEXT"
    }
   ],
   "linker_set_key" : "_ZTI21VkDisplayPowerInfoEXT",
   "name" : "VkDisplayPowerInfoEXT",
   "referenced_type" : "_ZTI21VkDisplayPowerInfoEXT",
   "self_type" : "_ZTI21VkDisplayPowerInfoEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vertexCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "instanceCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "firstVertex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "firstInstance",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21VkDrawIndirectCommand",
   "name" : "VkDrawIndirectCommand",
   "referenced_type" : "_ZTI21VkDrawIndirectCommand",
   "self_type" : "_ZTI21VkDrawIndirectCommand",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "extensionName",
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "specVersion",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21VkExtensionProperties",
   "name" : "VkExtensionProperties",
   "referenced_type" : "_ZTI21VkExtensionProperties",
   "self_type" : "_ZTI21VkExtensionProperties",
   "size" : 260,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "vertexData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "vertexOffset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "vertexCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vertexStride",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "vertexFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "indexData",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indexOffset",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indexCount",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "indexType",
     "field_offset" : 544,
     "referenced_type" : "_ZTI11VkIndexType"
    },
    {
     "field_name" : "transformData",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "transformOffset",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI21VkGeometryTrianglesNV",
   "name" : "VkGeometryTrianglesNV",
   "referenced_type" : "_ZTI21VkGeometryTrianglesNV",
   "self_type" : "_ZTI21VkGeometryTrianglesNV",
   "size" : 88,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "image",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "viewType",
     "field_offset" : 192,
     "referenced_type" : "_ZTI15VkImageViewType"
    },
    {
     "field_name" : "format",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "components",
     "field_offset" : 256,
     "referenced_type" : "_ZTI18VkComponentMapping"
    },
    {
     "field_name" : "subresourceRange",
     "field_offset" : 384,
     "referenced_type" : "_ZTI23VkImageSubresourceRange"
    }
   ],
   "linker_set_key" : "_ZTI21VkImageViewCreateInfo",
   "name" : "VkImageViewCreateInfo",
   "referenced_type" : "_ZTI21VkImageViewCreateInfo",
   "self_type" : "_ZTI21VkImageViewCreateInfo",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "memoryRequirements",
     "field_offset" : 64,
     "referenced_type" : "_ZTI20VkMemoryRequirements"
    }
   ],
   "linker_set_key" : "_ZTI21VkMemoryRequirements2",
   "name" : "VkMemoryRequirements2",
   "referenced_type" : "_ZTI21VkMemoryRequirements2",
   "self_type" : "_ZTI21VkMemoryRequirements2",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI20VkObjectEntryTypeNVX"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21VkObjectTableEntryNVX",
   "name" : "VkObjectTableEntryNVX",
   "referenced_type" : "_ZTI21VkObjectTableEntryNVX",
   "self_type" : "_ZTI21VkObjectTableEntryNVX",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "protectedSubmit",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21VkProtectedSubmitInfo",
   "name" : "VkProtectedSubmitInfo",
   "referenced_type" : "_ZTI21VkProtectedSubmitInfo",
   "self_type" : "_ZTI21VkProtectedSubmitInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queryType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11VkQueryType"
    },
    {
     "field_name" : "queryCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pipelineStatistics",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21VkQueryPoolCreateInfo",
   "name" : "VkQueryPoolCreateInfo",
   "referenced_type" : "_ZTI21VkQueryPoolCreateInfo",
   "self_type" : "_ZTI21VkQueryPoolCreateInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "renderPass",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "framebuffer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "renderArea",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8VkRect2D"
    },
    {
     "field_name" : "clearValueCount",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pClearValues",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPK12VkClearValue"
    }
   ],
   "linker_set_key" : "_ZTI21VkRenderPassBeginInfo",
   "name" : "VkRenderPassBeginInfo",
   "referenced_type" : "_ZTI21VkRenderPassBeginInfo",
   "self_type" : "_ZTI21VkRenderPassBeginInfo",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21VkSemaphoreCreateInfo",
   "name" : "VkSemaphoreCreateInfo",
   "referenced_type" : "_ZTI21VkSemaphoreCreateInfo",
   "self_type" : "_ZTI21VkSemaphoreCreateInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "contents",
     "field_offset" : 64,
     "referenced_type" : "_ZTI17VkSubpassContents"
    }
   ],
   "linker_set_key" : "_ZTI21VkSubpassBeginInfoKHR",
   "name" : "VkSubpassBeginInfoKHR",
   "referenced_type" : "_ZTI21VkSubpassBeginInfoKHR",
   "self_type" : "_ZTI21VkSubpassBeginInfoKHR",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "memory",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "memoryOffset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI22VkBindBufferMemoryInfo",
   "name" : "VkBindBufferMemoryInfo",
   "referenced_type" : "_ZTI22VkBindBufferMemoryInfo",
   "self_type" : "_ZTI22VkBindBufferMemoryInfo",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "offset",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "range",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI22VkBufferViewCreateInfo",
   "name" : "VkBufferViewCreateInfo",
   "referenced_type" : "_ZTI22VkBufferViewCreateInfo",
   "self_type" : "_ZTI22VkBufferViewCreateInfo",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "range",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI22VkDescriptorBufferInfo",
   "name" : "VkDescriptorBufferInfo",
   "referenced_type" : "_ZTI22VkDescriptorBufferInfo",
   "self_type" : "_ZTI22VkDescriptorBufferInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "mode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "planeIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22VkDisplayPlaneInfo2KHR",
   "name" : "VkDisplayPlaneInfo2KHR",
   "referenced_type" : "_ZTI22VkDisplayPlaneInfo2KHR",
   "self_type" : "_ZTI22VkDisplayPlaneInfo2KHR",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "displayName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "physicalDimensions",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "physicalResolution",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "supportedTransforms",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planeReorderPossible",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "persistentContent",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22VkDisplayPropertiesKHR",
   "name" : "VkDisplayPropertiesKHR",
   "referenced_type" : "_ZTI22VkDisplayPropertiesKHR",
   "self_type" : "_ZTI22VkDisplayPropertiesKHR",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "fence",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 160,
     "referenced_type" : "_ZTI33VkExternalFenceHandleTypeFlagBits"
    },
    {
     "field_name" : "fd",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI22VkImportFenceFdInfoKHR",
   "name" : "VkImportFenceFdInfoKHR",
   "referenced_type" : "_ZTI22VkImportFenceFdInfoKHR",
   "self_type" : "_ZTI22VkImportFenceFdInfoKHR",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "maxImageDimension1D",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxImageDimension2D",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxImageDimension3D",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxImageDimensionCube",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxImageArrayLayers",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxTexelBufferElements",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxUniformBufferRange",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxStorageBufferRange",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxPushConstantsSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxMemoryAllocationCount",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSamplerAllocationCount",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bufferImageGranularity",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sparseAddressSpaceSize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "maxBoundDescriptorSets",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxPerStageDescriptorSamplers",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxPerStageDescriptorUniformBuffers",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxPerStageDescriptorStorageBuffers",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxPerStageDescriptorSampledImages",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxPerStageDescriptorStorageImages",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxPerStageDescriptorInputAttachments",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxPerStageResources",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDescriptorSetSamplers",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDescriptorSetUniformBuffers",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDescriptorSetUniformBuffersDynamic",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDescriptorSetStorageBuffers",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDescriptorSetStorageBuffersDynamic",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDescriptorSetSampledImages",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDescriptorSetStorageImages",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDescriptorSetInputAttachments",
     "field_offset" : 992,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxVertexInputAttributes",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxVertexInputBindings",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxVertexInputAttributeOffset",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxVertexInputBindingStride",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxVertexOutputComponents",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxTessellationGenerationLevel",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxTessellationPatchSize",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxTessellationControlPerVertexInputComponents",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxTessellationControlPerVertexOutputComponents",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxTessellationControlPerPatchOutputComponents",
     "field_offset" : 1312,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxTessellationControlTotalOutputComponents",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxTessellationEvaluationInputComponents",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxTessellationEvaluationOutputComponents",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxGeometryShaderInvocations",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxGeometryInputComponents",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxGeometryOutputComponents",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxGeometryOutputVertices",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxGeometryTotalOutputComponents",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFragmentInputComponents",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFragmentOutputAttachments",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFragmentDualSrcAttachments",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFragmentCombinedOutputResources",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxComputeSharedMemorySize",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxComputeWorkGroupCount",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIA3_j"
    },
    {
     "field_name" : "maxComputeWorkGroupInvocations",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxComputeWorkGroupSize",
     "field_offset" : 1888,
     "referenced_type" : "_ZTIA3_j"
    },
    {
     "field_name" : "subPixelPrecisionBits",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "subTexelPrecisionBits",
     "field_offset" : 2016,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mipmapPrecisionBits",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDrawIndexedIndexValue",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxDrawIndirectCount",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSamplerLodBias",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxSamplerAnisotropy",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxViewports",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxViewportDimensions",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIA2_j"
    },
    {
     "field_name" : "viewportBoundsRange",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA2_f"
    },
    {
     "field_name" : "viewportSubPixelBits",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minMemoryMapAlignment",
     "field_offset" : 2400,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minTexelBufferOffsetAlignment",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "minUniformBufferOffsetAlignment",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "minStorageBufferOffsetAlignment",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "minTexelOffset",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxTexelOffset",
     "field_offset" : 2656,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minTexelGatherOffset",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxTexelGatherOffset",
     "field_offset" : 2720,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minInterpolationOffset",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxInterpolationOffset",
     "field_offset" : 2784,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "subPixelInterpolationOffsetBits",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFramebufferWidth",
     "field_offset" : 2848,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFramebufferHeight",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxFramebufferLayers",
     "field_offset" : 2912,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "framebufferColorSampleCounts",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "framebufferDepthSampleCounts",
     "field_offset" : 2976,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "framebufferStencilSampleCounts",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "framebufferNoAttachmentsSampleCounts",
     "field_offset" : 3040,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxColorAttachments",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampledImageColorSampleCounts",
     "field_offset" : 3104,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampledImageIntegerSampleCounts",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampledImageDepthSampleCounts",
     "field_offset" : 3168,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampledImageStencilSampleCounts",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "storageImageSampleCounts",
     "field_offset" : 3232,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSampleMaskWords",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "timestampComputeAndGraphics",
     "field_offset" : 3296,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "timestampPeriod",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxClipDistances",
     "field_offset" : 3360,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxCullDistances",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxCombinedClipAndCullDistances",
     "field_offset" : 3424,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "discreteQueuePriorities",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pointSizeRange",
     "field_offset" : 3488,
     "referenced_type" : "_ZTIA2_f"
    },
    {
     "field_name" : "lineWidthRange",
     "field_offset" : 3552,
     "referenced_type" : "_ZTIA2_f"
    },
    {
     "field_name" : "pointSizeGranularity",
     "field_offset" : 3616,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "lineWidthGranularity",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "strictLines",
     "field_offset" : 3680,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "standardSampleLocations",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "optimalBufferCopyOffsetAlignment",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "optimalBufferCopyRowPitchAlignment",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "nonCoherentAtomSize",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI22VkPhysicalDeviceLimits",
   "name" : "VkPhysicalDeviceLimits",
   "referenced_type" : "_ZTI22VkPhysicalDeviceLimits",
   "self_type" : "_ZTI22VkPhysicalDeviceLimits",
   "size" : 496,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "attachmentCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAttachments",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK23VkAttachmentDescription"
    },
    {
     "field_name" : "subpassCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSubpasses",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK20VkSubpassDescription"
    },
    {
     "field_name" : "dependencyCount",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDependencies",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK19VkSubpassDependency"
    }
   ],
   "linker_set_key" : "_ZTI22VkRenderPassCreateInfo",
   "name" : "VkRenderPassCreateInfo",
   "referenced_type" : "_ZTI22VkRenderPassCreateInfo",
   "self_type" : "_ZTI22VkRenderPassCreateInfo",
   "size" : 36,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shadingRatePaletteEntryCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pShadingRatePaletteEntries",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPK27VkShadingRatePaletteEntryNV"
    }
   ],
   "linker_set_key" : "_ZTI22VkShadingRatePaletteNV",
   "name" : "VkShadingRatePaletteNV",
   "referenced_type" : "_ZTI22VkShadingRatePaletteNV",
   "self_type" : "_ZTI22VkShadingRatePaletteNV",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "samples",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21VkSampleCountFlagBits"
    },
    {
     "field_name" : "loadOp",
     "field_offset" : 96,
     "referenced_type" : "_ZTI18VkAttachmentLoadOp"
    },
    {
     "field_name" : "storeOp",
     "field_offset" : 128,
     "referenced_type" : "_ZTI19VkAttachmentStoreOp"
    },
    {
     "field_name" : "stencilLoadOp",
     "field_offset" : 160,
     "referenced_type" : "_ZTI18VkAttachmentLoadOp"
    },
    {
     "field_name" : "stencilStoreOp",
     "field_offset" : 192,
     "referenced_type" : "_ZTI19VkAttachmentStoreOp"
    },
    {
     "field_name" : "initialLayout",
     "field_offset" : 224,
     "referenced_type" : "_ZTI13VkImageLayout"
    },
    {
     "field_name" : "finalLayout",
     "field_offset" : 256,
     "referenced_type" : "_ZTI13VkImageLayout"
    }
   ],
   "linker_set_key" : "_ZTI23VkAttachmentDescription",
   "name" : "VkAttachmentDescription",
   "referenced_type" : "_ZTI23VkAttachmentDescription",
   "self_type" : "_ZTI23VkAttachmentDescription",
   "size" : 36,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queueFamilyIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23VkCommandPoolCreateInfo",
   "name" : "VkCommandPoolCreateInfo",
   "referenced_type" : "_ZTI23VkCommandPoolCreateInfo",
   "self_type" : "_ZTI23VkCommandPoolCreateInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "major",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "minor",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "subminor",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "patch",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI23VkConformanceVersionKHR",
   "name" : "VkConformanceVersionKHR",
   "referenced_type" : "_ZTI23VkConformanceVersionKHR",
   "self_type" : "_ZTI23VkConformanceVersionKHR",
   "size" : 4,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "waitSemaphoreCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pWaitSemaphoreDeviceIndices",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "commandBufferCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pCommandBufferDeviceMasks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "signalSemaphoreCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSignalSemaphoreDeviceIndices",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPKj"
    }
   ],
   "linker_set_key" : "_ZTI23VkDeviceGroupSubmitInfo",
   "name" : "VkDeviceGroupSubmitInfo",
   "referenced_type" : "_ZTI23VkDeviceGroupSubmitInfo",
   "self_type" : "_ZTI23VkDeviceGroupSubmitInfo",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queueFamilyIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queueCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pQueuePriorities",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKf"
    }
   ],
   "linker_set_key" : "_ZTI23VkDeviceQueueCreateInfo",
   "name" : "VkDeviceQueueCreateInfo",
   "referenced_type" : "_ZTI23VkDeviceQueueCreateInfo",
   "self_type" : "_ZTI23VkDeviceQueueCreateInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "srcRect",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8VkRect2D"
    },
    {
     "field_name" : "dstRect",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8VkRect2D"
    },
    {
     "field_name" : "persistent",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23VkDisplayPresentInfoKHR",
   "name" : "VkDisplayPresentInfoKHR",
   "referenced_type" : "_ZTI23VkDisplayPresentInfoKHR",
   "self_type" : "_ZTI23VkDisplayPresentInfoKHR",
   "size" : 44,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "displayProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI22VkDisplayPropertiesKHR"
    }
   ],
   "linker_set_key" : "_ZTI23VkDisplayProperties2KHR",
   "name" : "VkDisplayProperties2KHR",
   "referenced_type" : "_ZTI23VkDisplayProperties2KHR",
   "self_type" : "_ZTI23VkDisplayProperties2KHR",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23VkExportFenceCreateInfo",
   "name" : "VkExportFenceCreateInfo",
   "referenced_type" : "_ZTI23VkExportFenceCreateInfo",
   "self_type" : "_ZTI23VkExportFenceCreateInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "externalFormat",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI23VkExternalFormatANDROID",
   "name" : "VkExternalFormatANDROID",
   "referenced_type" : "_ZTI23VkExternalFormatANDROID",
   "self_type" : "_ZTI23VkExternalFormatANDROID",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "renderPass",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "attachmentCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAttachments",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPKy"
    },
    {
     "field_name" : "width",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layers",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23VkFramebufferCreateInfo",
   "name" : "VkFramebufferCreateInfo",
   "referenced_type" : "_ZTI23VkFramebufferCreateInfo",
   "self_type" : "_ZTI23VkFramebufferCreateInfo",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "maxExtent",
     "referenced_type" : "_ZTI10VkExtent3D"
    },
    {
     "field_name" : "maxMipLevels",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxArrayLayers",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampleCounts",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxResourceSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI23VkImageFormatProperties",
   "name" : "VkImageFormatProperties",
   "referenced_type" : "_ZTI23VkImageFormatProperties",
   "self_type" : "_ZTI23VkImageFormatProperties",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aspectMask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "baseMipLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "levelCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "baseArrayLayer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23VkImageSubresourceRange",
   "name" : "VkImageSubresourceRange",
   "referenced_type" : "_ZTI23VkImageSubresourceRange",
   "self_type" : "_ZTI23VkImageSubresourceRange",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI34VkExternalMemoryHandleTypeFlagBits"
    },
    {
     "field_name" : "fd",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23VkImportMemoryFdInfoKHR",
   "name" : "VkImportMemoryFdInfoKHR",
   "referenced_type" : "_ZTI23VkImportMemoryFdInfoKHR",
   "self_type" : "_ZTI23VkImportMemoryFdInfoKHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "memoryTypeBits",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23VkMemoryFdPropertiesKHR",
   "name" : "VkMemoryFdPropertiesKHR",
   "referenced_type" : "_ZTI23VkMemoryFdPropertiesKHR",
   "self_type" : "_ZTI23VkMemoryFdPropertiesKHR",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI27VkPerformanceValueTypeINTEL"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTI27VkPerformanceValueDataINTEL"
    }
   ],
   "linker_set_key" : "_ZTI23VkPerformanceValueINTEL",
   "name" : "VkPerformanceValueINTEL",
   "referenced_type" : "_ZTI23VkPerformanceValueINTEL",
   "self_type" : "_ZTI23VkPerformanceValueINTEL",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "queueFlags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queueCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "timestampValidBits",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minImageTransferGranularity",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10VkExtent3D"
    }
   ],
   "linker_set_key" : "_ZTI23VkQueueFamilyProperties",
   "name" : "VkQueueFamilyProperties",
   "referenced_type" : "_ZTI23VkQueueFamilyProperties",
   "self_type" : "_ZTI23VkQueueFamilyProperties",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "semaphore",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI37VkExternalSemaphoreHandleTypeFlagBits"
    }
   ],
   "linker_set_key" : "_ZTI23VkSemaphoreGetFdInfoKHR",
   "name" : "VkSemaphoreGetFdInfoKHR",
   "referenced_type" : "_ZTI23VkSemaphoreGetFdInfoKHR",
   "self_type" : "_ZTI23VkSemaphoreGetFdInfoKHR",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "subresource",
     "referenced_type" : "_ZTI18VkImageSubresource"
    },
    {
     "field_name" : "offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10VkOffset3D"
    },
    {
     "field_name" : "extent",
     "field_offset" : 192,
     "referenced_type" : "_ZTI10VkExtent3D"
    },
    {
     "field_name" : "memory",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "memoryOffset",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23VkSparseImageMemoryBind",
   "name" : "VkSparseImageMemoryBind",
   "referenced_type" : "_ZTI23VkSparseImageMemoryBind",
   "self_type" : "_ZTI23VkSparseImageMemoryBind",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "srcSubpass",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstSubpass",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "srcStageMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstStageMask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "srcAccessMask",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstAccessMask",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dependencyFlags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "viewOffset",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23VkSubpassDependency2KHR",
   "name" : "VkSubpassDependency2KHR",
   "referenced_type" : "_ZTI23VkSubpassDependency2KHR",
   "self_type" : "_ZTI23VkSubpassDependency2KHR",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "enabledValidationFeatureCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pEnabledValidationFeatures",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK28VkValidationFeatureEnableEXT"
    },
    {
     "field_name" : "disabledValidationFeatureCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDisabledValidationFeatures",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPK29VkValidationFeatureDisableEXT"
    }
   ],
   "linker_set_key" : "_ZTI23VkValidationFeaturesEXT",
   "name" : "VkValidationFeaturesEXT",
   "referenced_type" : "_ZTI23VkValidationFeaturesEXT",
   "self_type" : "_ZTI23VkValidationFeaturesEXT",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "depth",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "stencil",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24VkClearDepthStencilValue",
   "name" : "VkClearDepthStencilValue",
   "referenced_type" : "_ZTI24VkClearDepthStencilValue",
   "self_type" : "_ZTI24VkClearDepthStencilValue",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pixelX",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pixelY",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sample",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24VkCoarseSampleLocationNV",
   "name" : "VkCoarseSampleLocationNV",
   "referenced_type" : "_ZTI24VkCoarseSampleLocationNV",
   "self_type" : "_ZTI24VkCoarseSampleLocationNV",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pInheritanceInfo",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK30VkCommandBufferInheritanceInfo"
    }
   ],
   "linker_set_key" : "_ZTI24VkCommandBufferBeginInfo",
   "name" : "VkCommandBufferBeginInfo",
   "referenced_type" : "_ZTI24VkCommandBufferBeginInfo",
   "self_type" : "_ZTI24VkCommandBufferBeginInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "imageFormatProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI23VkImageFormatProperties"
    }
   ],
   "linker_set_key" : "_ZTI24VkImageFormatProperties2",
   "name" : "VkImageFormatProperties2",
   "referenced_type" : "_ZTI24VkImageFormatProperties2",
   "self_type" : "_ZTI24VkImageFormatProperties2",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aspectMask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mipLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "baseArrayLayer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24VkImageSubresourceLayers",
   "name" : "VkImageSubresourceLayers",
   "referenced_type" : "_ZTI24VkImageSubresourceLayers",
   "self_type" : "_ZTI24VkImageSubresourceLayers",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "imageView",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "descriptorType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16VkDescriptorType"
    },
    {
     "field_name" : "sampler",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI24VkImageViewHandleInfoNVX",
   "name" : "VkImageViewHandleInfoNVX",
   "referenced_type" : "_ZTI24VkImageViewHandleInfoNVX",
   "self_type" : "_ZTI24VkImageViewHandleInfoNVX",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "robustBufferAccess",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fullDrawIndexUint32",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imageCubeArray",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "independentBlend",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "geometryShader",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tessellationShader",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampleRateShading",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dualSrcBlend",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "logicOp",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "multiDrawIndirect",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "drawIndirectFirstInstance",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthClamp",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthBiasClamp",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fillModeNonSolid",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthBounds",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "wideLines",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "largePoints",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alphaToOne",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "multiViewport",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplerAnisotropy",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "textureCompressionETC2",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "textureCompressionASTC_LDR",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "textureCompressionBC",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "occlusionQueryPrecise",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pipelineStatisticsQuery",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vertexPipelineStoresAndAtomics",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fragmentStoresAndAtomics",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderTessellationAndGeometryPointSize",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderImageGatherExtended",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderStorageImageExtendedFormats",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderStorageImageMultisample",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderStorageImageReadWithoutFormat",
     "field_offset" : 992,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderStorageImageWriteWithoutFormat",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderUniformBufferArrayDynamicIndexing",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderSampledImageArrayDynamicIndexing",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderStorageBufferArrayDynamicIndexing",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderStorageImageArrayDynamicIndexing",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderClipDistance",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderCullDistance",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderFloat64",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderInt64",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderInt16",
     "field_offset" : 1312,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderResourceResidency",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shaderResourceMinLod",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sparseBinding",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sparseResidencyBuffer",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sparseResidencyImage2D",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sparseResidencyImage3D",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sparseResidency2Samples",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sparseResidency4Samples",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sparseResidency8Samples",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sparseResidency16Samples",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sparseResidencyAliased",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "variableMultisampleRate",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "inheritedQueries",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24VkPhysicalDeviceFeatures",
   "name" : "VkPhysicalDeviceFeatures",
   "referenced_type" : "_ZTI24VkPhysicalDeviceFeatures",
   "self_type" : "_ZTI24VkPhysicalDeviceFeatures",
   "size" : 220,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "swapchainCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pTimes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK19VkPresentTimeGOOGLE"
    }
   ],
   "linker_set_key" : "_ZTI24VkPresentTimesInfoGOOGLE",
   "name" : "VkPresentTimesInfoGOOGLE",
   "referenced_type" : "_ZTI24VkPresentTimesInfoGOOGLE",
   "self_type" : "_ZTI24VkPresentTimesInfoGOOGLE",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "queueFamilyProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI23VkQueueFamilyProperties"
    }
   ],
   "linker_set_key" : "_ZTI24VkQueueFamilyProperties2",
   "name" : "VkQueueFamilyProperties2",
   "referenced_type" : "_ZTI24VkQueueFamilyProperties2",
   "self_type" : "_ZTI24VkQueueFamilyProperties2",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "sampleLocationsPerPixel",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21VkSampleCountFlagBits"
    },
    {
     "field_name" : "sampleLocationGridSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "sampleLocationsCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSampleLocations",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK19VkSampleLocationEXT"
    }
   ],
   "linker_set_key" : "_ZTI24VkSampleLocationsInfoEXT",
   "name" : "VkSampleLocationsInfoEXT",
   "referenced_type" : "_ZTI24VkSampleLocationsInfoEXT",
   "self_type" : "_ZTI24VkSampleLocationsInfoEXT",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "codeSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pCode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKj"
    }
   ],
   "linker_set_key" : "_ZTI24VkShaderModuleCreateInfo",
   "name" : "VkShaderModuleCreateInfo",
   "referenced_type" : "_ZTI24VkShaderModuleCreateInfo",
   "self_type" : "_ZTI24VkShaderModuleCreateInfo",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numUsedVgprs",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numUsedSgprs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ldsSizePerLocalWorkGroup",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ldsUsageSizeInBytes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "scratchMemUsageInBytes",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24VkShaderResourceUsageAMD",
   "name" : "VkShaderResourceUsageAMD",
   "referenced_type" : "_ZTI24VkShaderResourceUsageAMD",
   "self_type" : "_ZTI24VkShaderResourceUsageAMD",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "constantID",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24VkSpecializationMapEntry",
   "name" : "VkSpecializationMapEntry",
   "referenced_type" : "_ZTI24VkSpecializationMapEntry",
   "self_type" : "_ZTI24VkSpecializationMapEntry",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pipelineBindPoint",
     "field_offset" : 96,
     "referenced_type" : "_ZTI19VkPipelineBindPoint"
    },
    {
     "field_name" : "viewMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "inputAttachmentCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pInputAttachments",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK25VkAttachmentReference2KHR"
    },
    {
     "field_name" : "colorAttachmentCount",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pColorAttachments",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK25VkAttachmentReference2KHR"
    },
    {
     "field_name" : "pResolveAttachments",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPK25VkAttachmentReference2KHR"
    },
    {
     "field_name" : "pDepthStencilAttachment",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPK25VkAttachmentReference2KHR"
    },
    {
     "field_name" : "preserveAttachmentCount",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pPreserveAttachments",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKj"
    }
   ],
   "linker_set_key" : "_ZTI24VkSubpassDescription2KHR",
   "name" : "VkSubpassDescription2KHR",
   "referenced_type" : "_ZTI24VkSubpassDescription2KHR",
   "self_type" : "_ZTI24VkSubpassDescription2KHR",
   "size" : 52,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "minImageCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxImageCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "currentExtent",
     "field_offset" : 64,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "minImageExtent",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "maxImageExtent",
     "field_offset" : 192,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "maxImageArrayLayers",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "supportedTransforms",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "currentTransform",
     "field_offset" : 320,
     "referenced_type" : "_ZTI29VkSurfaceTransformFlagBitsKHR"
    },
    {
     "field_name" : "supportedCompositeAlpha",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "supportedUsageFlags",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI24VkSurfaceCapabilitiesKHR",
   "name" : "VkSurfaceCapabilitiesKHR",
   "referenced_type" : "_ZTI24VkSurfaceCapabilitiesKHR",
   "self_type" : "_ZTI24VkSurfaceCapabilitiesKHR",
   "size" : 52,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "surface",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "minImageCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imageFormat",
     "field_offset" : 224,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "imageColorSpace",
     "field_offset" : 256,
     "referenced_type" : "_ZTI15VkColorSpaceKHR"
    },
    {
     "field_name" : "imageExtent",
     "field_offset" : 288,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "imageArrayLayers",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imageUsage",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imageSharingMode",
     "field_offset" : 416,
     "referenced_type" : "_ZTI13VkSharingMode"
    },
    {
     "field_name" : "queueFamilyIndexCount",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pQueueFamilyIndices",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "preTransform",
     "field_offset" : 512,
     "referenced_type" : "_ZTI29VkSurfaceTransformFlagBitsKHR"
    },
    {
     "field_name" : "compositeAlpha",
     "field_offset" : 544,
     "referenced_type" : "_ZTI27VkCompositeAlphaFlagBitsKHR"
    },
    {
     "field_name" : "presentMode",
     "field_offset" : 576,
     "referenced_type" : "_ZTI16VkPresentModeKHR"
    },
    {
     "field_name" : "clipped",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "oldSwapchain",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI24VkSwapchainCreateInfoKHR",
   "name" : "VkSwapchainCreateInfoKHR",
   "referenced_type" : "_ZTI24VkSwapchainCreateInfoKHR",
   "self_type" : "_ZTI24VkSwapchainCreateInfoKHR",
   "size" : 88,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "swapchain",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "timeout",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "semaphore",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "fence",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "deviceMask",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25VkAcquireNextImageInfoKHR",
   "name" : "VkAcquireNextImageInfoKHR",
   "referenced_type" : "_ZTI25VkAcquireNextImageInfoKHR",
   "self_type" : "_ZTI25VkAcquireNextImageInfoKHR",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "attachment",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layout",
     "field_offset" : 96,
     "referenced_type" : "_ZTI13VkImageLayout"
    },
    {
     "field_name" : "aspectMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25VkAttachmentReference2KHR",
   "name" : "VkAttachmentReference2KHR",
   "referenced_type" : "_ZTI25VkAttachmentReference2KHR",
   "self_type" : "_ZTI25VkAttachmentReference2KHR",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25VkDispatchIndirectCommand",
   "name" : "VkDispatchIndirectCommand",
   "referenced_type" : "_ZTI25VkDispatchIndirectCommand",
   "self_type" : "_ZTI25VkDispatchIndirectCommand",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "exportFromImportedHandleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "compatibleHandleTypes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "externalFenceFeatures",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25VkExternalFenceProperties",
   "name" : "VkExternalFenceProperties",
   "referenced_type" : "_ZTI25VkExternalFenceProperties",
   "self_type" : "_ZTI25VkExternalFenceProperties",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "deviceMask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25VkMemoryAllocateFlagsInfo",
   "name" : "VkMemoryAllocateFlagsInfo",
   "referenced_type" : "_ZTI25VkMemoryAllocateFlagsInfo",
   "self_type" : "_ZTI25VkMemoryAllocateFlagsInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "features",
     "field_offset" : 64,
     "referenced_type" : "_ZTI24VkPhysicalDeviceFeatures"
    }
   ],
   "linker_set_key" : "_ZTI25VkPhysicalDeviceFeatures2",
   "name" : "VkPhysicalDeviceFeatures2",
   "referenced_type" : "_ZTI25VkPhysicalDeviceFeatures2",
   "self_type" : "_ZTI25VkPhysicalDeviceFeatures2",
   "size" : 228,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "initialDataSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pInitialData",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTI25VkPipelineCacheCreateInfo",
   "name" : "VkPipelineCacheCreateInfo",
   "referenced_type" : "_ZTI25VkPipelineCacheCreateInfo",
   "self_type" : "_ZTI25VkPipelineCacheCreateInfo",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shaderStageMask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "resourceUsage",
     "field_offset" : 32,
     "referenced_type" : "_ZTI24VkShaderResourceUsageAMD"
    },
    {
     "field_name" : "numPhysicalVgprs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numPhysicalSgprs",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numAvailableVgprs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "numAvailableSgprs",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "computeWorkGroupSize",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI25VkShaderStatisticsInfoAMD",
   "name" : "VkShaderStatisticsInfoAMD",
   "referenced_type" : "_ZTI25VkShaderStatisticsInfoAMD",
   "self_type" : "_ZTI25VkShaderStatisticsInfoAMD",
   "size" : 52,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "minImageCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxImageCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "currentExtent",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "minImageExtent",
     "field_offset" : 192,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "maxImageExtent",
     "field_offset" : 256,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "maxImageArrayLayers",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "supportedTransforms",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "currentTransform",
     "field_offset" : 384,
     "referenced_type" : "_ZTI29VkSurfaceTransformFlagBitsKHR"
    },
    {
     "field_name" : "supportedCompositeAlpha",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "supportedUsageFlags",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "supportedSurfaceCounters",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25VkSurfaceCapabilities2EXT",
   "name" : "VkSurfaceCapabilities2EXT",
   "referenced_type" : "_ZTI25VkSurfaceCapabilities2EXT",
   "self_type" : "_ZTI25VkSurfaceCapabilities2EXT",
   "size" : 64,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "surfaceCapabilities",
     "field_offset" : 64,
     "referenced_type" : "_ZTI24VkSurfaceCapabilitiesKHR"
    }
   ],
   "linker_set_key" : "_ZTI25VkSurfaceCapabilities2KHR",
   "name" : "VkSurfaceCapabilities2KHR",
   "referenced_type" : "_ZTI25VkSurfaceCapabilities2KHR",
   "self_type" : "_ZTI25VkSurfaceCapabilities2KHR",
   "size" : 60,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "planeAspect",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21VkImageAspectFlagBits"
    }
   ],
   "linker_set_key" : "_ZTI26VkBindImagePlaneMemoryInfo",
   "name" : "VkBindImagePlaneMemoryInfo",
   "referenced_type" : "_ZTI26VkBindImagePlaneMemoryInfo",
   "self_type" : "_ZTI26VkBindImagePlaneMemoryInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "pMarkerName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "color",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA4_f"
    }
   ],
   "linker_set_key" : "_ZTI26VkDebugMarkerMarkerInfoEXT",
   "name" : "VkDebugMarkerMarkerInfoEXT",
   "referenced_type" : "_ZTI26VkDebugMarkerMarkerInfoEXT",
   "self_type" : "_ZTI26VkDebugMarkerMarkerInfoEXT",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSets",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "poolSizeCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pPoolSizes",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPK20VkDescriptorPoolSize"
    }
   ],
   "linker_set_key" : "_ZTI26VkDescriptorPoolCreateInfo",
   "name" : "VkDescriptorPoolCreateInfo",
   "referenced_type" : "_ZTI26VkDescriptorPoolCreateInfo",
   "self_type" : "_ZTI26VkDescriptorPoolCreateInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "parameters",
     "field_offset" : 96,
     "referenced_type" : "_ZTI26VkDisplayModeParametersKHR"
    }
   ],
   "linker_set_key" : "_ZTI26VkDisplayModeCreateInfoKHR",
   "name" : "VkDisplayModeCreateInfoKHR",
   "referenced_type" : "_ZTI26VkDisplayModeCreateInfoKHR",
   "self_type" : "_ZTI26VkDisplayModeCreateInfoKHR",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "visibleRegion",
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "refreshRate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26VkDisplayModeParametersKHR",
   "name" : "VkDisplayModeParametersKHR",
   "referenced_type" : "_ZTI26VkDisplayModeParametersKHR",
   "self_type" : "_ZTI26VkDisplayModeParametersKHR",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "displayMode",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parameters",
     "field_offset" : 64,
     "referenced_type" : "_ZTI26VkDisplayModeParametersKHR"
    }
   ],
   "linker_set_key" : "_ZTI26VkDisplayModePropertiesKHR",
   "name" : "VkDisplayModePropertiesKHR",
   "referenced_type" : "_ZTI26VkDisplayModePropertiesKHR",
   "self_type" : "_ZTI26VkDisplayModePropertiesKHR",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26VkExportMemoryAllocateInfo",
   "name" : "VkExportMemoryAllocateInfo",
   "referenced_type" : "_ZTI26VkExportMemoryAllocateInfo",
   "self_type" : "_ZTI26VkExportMemoryAllocateInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "externalMemoryProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI26VkExternalMemoryProperties"
    }
   ],
   "linker_set_key" : "_ZTI26VkExternalBufferProperties",
   "name" : "VkExternalBufferProperties",
   "referenced_type" : "_ZTI26VkExternalBufferProperties",
   "self_type" : "_ZTI26VkExternalBufferProperties",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "externalMemoryFeatures",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exportFromImportedHandleTypes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "compatibleHandleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26VkExternalMemoryProperties",
   "name" : "VkExternalMemoryProperties",
   "referenced_type" : "_ZTI26VkExternalMemoryProperties",
   "self_type" : "_ZTI26VkExternalMemoryProperties",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "usage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26VkImageViewUsageCreateInfo",
   "name" : "VkImageViewUsageCreateInfo",
   "referenced_type" : "_ZTI26VkImageViewUsageCreateInfo",
   "self_type" : "_ZTI26VkImageViewUsageCreateInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "semaphore",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 160,
     "referenced_type" : "_ZTI37VkExternalSemaphoreHandleTypeFlagBits"
    },
    {
     "field_name" : "fd",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI26VkImportSemaphoreFdInfoKHR",
   "name" : "VkImportSemaphoreFdInfoKHR",
   "referenced_type" : "_ZTI26VkImportSemaphoreFdInfoKHR",
   "self_type" : "_ZTI26VkImportSemaphoreFdInfoKHR",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tokenType",
     "referenced_type" : "_ZTI30VkIndirectCommandsTokenTypeNVX"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI26VkIndirectCommandsTokenNVX",
   "name" : "VkIndirectCommandsTokenNVX",
   "referenced_type" : "_ZTI26VkIndirectCommandsTokenNVX",
   "self_type" : "_ZTI26VkIndirectCommandsTokenNVX",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "maxSampleLocationGridSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTI10VkExtent2D"
    }
   ],
   "linker_set_key" : "_ZTI26VkMultisamplePropertiesEXT",
   "name" : "VkMultisamplePropertiesEXT",
   "referenced_type" : "_ZTI26VkMultisamplePropertiesEXT",
   "self_type" : "_ZTI26VkMultisamplePropertiesEXT",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "objectCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pObjectEntryTypes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK20VkObjectEntryTypeNVX"
    },
    {
     "field_name" : "pObjectEntryCounts",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "pObjectEntryUsageFlags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "maxUniformBuffersPerDescriptor",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxStorageBuffersPerDescriptor",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxStorageImagesPerDescriptor",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxSampledImagesPerDescriptor",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxPipelineLayouts",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI26VkObjectTableCreateInfoNVX",
   "name" : "VkObjectTableCreateInfoNVX",
   "referenced_type" : "_ZTI26VkObjectTableCreateInfoNVX",
   "self_type" : "_ZTI26VkObjectTableCreateInfoNVX",
   "size" : 44,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "apiVersion",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "driverVersion",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vendorID",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "deviceID",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "deviceType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20VkPhysicalDeviceType"
    },
    {
     "field_name" : "deviceName",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "pipelineCacheUUID",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "limits",
     "field_offset" : 2368,
     "referenced_type" : "_ZTI22VkPhysicalDeviceLimits"
    },
    {
     "field_name" : "sparseProperties",
     "field_offset" : 6336,
     "referenced_type" : "_ZTI32VkPhysicalDeviceSparseProperties"
    }
   ],
   "linker_set_key" : "_ZTI26VkPhysicalDeviceProperties",
   "name" : "VkPhysicalDeviceProperties",
   "referenced_type" : "_ZTI26VkPhysicalDeviceProperties",
   "self_type" : "_ZTI26VkPhysicalDeviceProperties",
   "size" : 816,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "setLayoutCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSetLayouts",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKy"
    },
    {
     "field_name" : "pushConstantRangeCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pPushConstantRanges",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK19VkPushConstantRange"
    }
   ],
   "linker_set_key" : "_ZTI26VkPipelineLayoutCreateInfo",
   "name" : "VkPipelineLayoutCreateInfo",
   "referenced_type" : "_ZTI26VkPipelineLayoutCreateInfo",
   "self_type" : "_ZTI26VkPipelineLayoutCreateInfo",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "performanceCountersSampling",
     "field_offset" : 64,
     "referenced_type" : "_ZTI28VkQueryPoolSamplingModeINTEL"
    }
   ],
   "linker_set_key" : "_ZTI26VkQueryPoolCreateInfoINTEL",
   "name" : "VkQueryPoolCreateInfoINTEL",
   "referenced_type" : "_ZTI26VkQueryPoolCreateInfoINTEL",
   "self_type" : "_ZTI26VkQueryPoolCreateInfoINTEL",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "attachmentCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAttachments",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK27VkAttachmentDescription2KHR"
    },
    {
     "field_name" : "subpassCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSubpasses",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK24VkSubpassDescription2KHR"
    },
    {
     "field_name" : "dependencyCount",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDependencies",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK23VkSubpassDependency2KHR"
    },
    {
     "field_name" : "correlatedViewMaskCount",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pCorrelatedViewMasks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKj"
    }
   ],
   "linker_set_key" : "_ZTI26VkRenderPassCreateInfo2KHR",
   "name" : "VkRenderPassCreateInfo2KHR",
   "referenced_type" : "_ZTI26VkRenderPassCreateInfo2KHR",
   "self_type" : "_ZTI26VkRenderPassCreateInfo2KHR",
   "size" : 44,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "samples",
     "field_offset" : 128,
     "referenced_type" : "_ZTI21VkSampleCountFlagBits"
    },
    {
     "field_name" : "loadOp",
     "field_offset" : 160,
     "referenced_type" : "_ZTI18VkAttachmentLoadOp"
    },
    {
     "field_name" : "storeOp",
     "field_offset" : 192,
     "referenced_type" : "_ZTI19VkAttachmentStoreOp"
    },
    {
     "field_name" : "stencilLoadOp",
     "field_offset" : 224,
     "referenced_type" : "_ZTI18VkAttachmentLoadOp"
    },
    {
     "field_name" : "stencilStoreOp",
     "field_offset" : 256,
     "referenced_type" : "_ZTI19VkAttachmentStoreOp"
    },
    {
     "field_name" : "initialLayout",
     "field_offset" : 288,
     "referenced_type" : "_ZTI13VkImageLayout"
    },
    {
     "field_name" : "finalLayout",
     "field_offset" : 320,
     "referenced_type" : "_ZTI13VkImageLayout"
    }
   ],
   "linker_set_key" : "_ZTI27VkAttachmentDescription2KHR",
   "name" : "VkAttachmentDescription2KHR",
   "referenced_type" : "_ZTI27VkAttachmentDescription2KHR",
   "self_type" : "_ZTI27VkAttachmentDescription2KHR",
   "size" : 44,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "objectTable",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indirectCommandsLayout",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indirectCommandsTokenCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pIndirectCommandsTokens",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPK26VkIndirectCommandsTokenNVX"
    },
    {
     "field_name" : "maxSequencesCount",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "targetCommandBuffer",
     "field_offset" : 288,
     "referenced_type" : "_ZTIP17VkCommandBuffer_T"
    },
    {
     "field_name" : "sequencesCountBuffer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sequencesCountOffset",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sequencesIndexBuffer",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sequencesIndexOffset",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI27VkCmdProcessCommandsInfoNVX",
   "name" : "VkCmdProcessCommandsInfoNVX",
   "referenced_type" : "_ZTI27VkCmdProcessCommandsInfoNVX",
   "self_type" : "_ZTI27VkCmdProcessCommandsInfoNVX",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shadingRate",
     "referenced_type" : "_ZTI27VkShadingRatePaletteEntryNV"
    },
    {
     "field_name" : "sampleCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampleLocationCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSampleLocations",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK24VkCoarseSampleLocationNV"
    }
   ],
   "linker_set_key" : "_ZTI27VkCoarseSampleOrderCustomNV",
   "name" : "VkCoarseSampleOrderCustomNV",
   "referenced_type" : "_ZTI27VkCoarseSampleOrderCustomNV",
   "self_type" : "_ZTI27VkCoarseSampleOrderCustomNV",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "commandPool",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "level",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20VkCommandBufferLevel"
    },
    {
     "field_name" : "commandBufferCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27VkCommandBufferAllocateInfo",
   "name" : "VkCommandBufferAllocateInfo",
   "referenced_type" : "_ZTI27VkCommandBufferAllocateInfo",
   "self_type" : "_ZTI27VkCommandBufferAllocateInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stage",
     "field_offset" : 128,
     "referenced_type" : "_ZTI31VkPipelineShaderStageCreateInfo"
    },
    {
     "field_name" : "layout",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "basePipelineHandle",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "basePipelineIndex",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI27VkComputePipelineCreateInfo",
   "name" : "VkComputePipelineCreateInfo",
   "referenced_type" : "_ZTI27VkComputePipelineCreateInfo",
   "self_type" : "_ZTI27VkComputePipelineCreateInfo",
   "size" : 72,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "descriptorPool",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "descriptorSetCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSetLayouts",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKy"
    }
   ],
   "linker_set_key" : "_ZTI27VkDescriptorSetAllocateInfo",
   "name" : "VkDescriptorSetAllocateInfo",
   "referenced_type" : "_ZTI27VkDescriptorSetAllocateInfo",
   "self_type" : "_ZTI27VkDescriptorSetAllocateInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "resourceDeviceIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "memoryDeviceIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27VkDeviceGroupBindSparseInfo",
   "name" : "VkDeviceGroupBindSparseInfo",
   "referenced_type" : "_ZTI27VkDeviceGroupBindSparseInfo",
   "self_type" : "_ZTI27VkDeviceGroupBindSparseInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "swapchainCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDeviceMasks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTI35VkDeviceGroupPresentModeFlagBitsKHR"
    }
   ],
   "linker_set_key" : "_ZTI27VkDeviceGroupPresentInfoKHR",
   "name" : "VkDeviceGroupPresentInfoKHR",
   "referenced_type" : "_ZTI27VkDeviceGroupPresentInfoKHR",
   "self_type" : "_ZTI27VkDeviceGroupPresentInfoKHR",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "displayModeProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI26VkDisplayModePropertiesKHR"
    }
   ],
   "linker_set_key" : "_ZTI27VkDisplayModeProperties2KHR",
   "name" : "VkDisplayModeProperties2KHR",
   "referenced_type" : "_ZTI27VkDisplayModeProperties2KHR",
   "self_type" : "_ZTI27VkDisplayModeProperties2KHR",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "currentDisplay",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "currentStackIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27VkDisplayPlanePropertiesKHR",
   "name" : "VkDisplayPlanePropertiesKHR",
   "referenced_type" : "_ZTI27VkDisplayPlanePropertiesKHR",
   "self_type" : "_ZTI27VkDisplayPlanePropertiesKHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27VkExportSemaphoreCreateInfo",
   "name" : "VkExportSemaphoreCreateInfo",
   "referenced_type" : "_ZTI27VkExportSemaphoreCreateInfo",
   "self_type" : "_ZTI27VkExportSemaphoreCreateInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value32",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "value64",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "valueFloat",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "valueBool",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "valueString",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI27VkPerformanceValueDataINTEL",
   "name" : "VkPerformanceValueDataINTEL",
   "record_kind" : "union",
   "referenced_type" : "_ZTI27VkPerformanceValueDataINTEL",
   "self_type" : "_ZTI27VkPerformanceValueDataINTEL",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "properties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI26VkPhysicalDeviceProperties"
    }
   ],
   "linker_set_key" : "_ZTI27VkPhysicalDeviceProperties2",
   "name" : "VkPhysicalDeviceProperties2",
   "referenced_type" : "_ZTI27VkPhysicalDeviceProperties2",
   "self_type" : "_ZTI27VkPhysicalDeviceProperties2",
   "size" : 824,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "pipeline",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "executableIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI27VkPipelineExecutableInfoKHR",
   "name" : "VkPipelineExecutableInfoKHR",
   "referenced_type" : "_ZTI27VkPipelineExecutableInfoKHR",
   "self_type" : "_ZTI27VkPipelineExecutableInfoKHR",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "image",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bindCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pBinds",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK23VkSparseImageMemoryBind"
    }
   ],
   "linker_set_key" : "_ZTI27VkSparseImageMemoryBindInfo",
   "name" : "VkSparseImageMemoryBindInfo",
   "referenced_type" : "_ZTI27VkSparseImageMemoryBindInfo",
   "self_type" : "_ZTI27VkSparseImageMemoryBindInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "subpassIndex",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampleLocationsInfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTI24VkSampleLocationsInfoEXT"
    }
   ],
   "linker_set_key" : "_ZTI27VkSubpassSampleLocationsEXT",
   "name" : "VkSubpassSampleLocationsEXT",
   "referenced_type" : "_ZTI27VkSubpassSampleLocationsEXT",
   "self_type" : "_ZTI27VkSubpassSampleLocationsEXT",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI28VkBufferDeviceAddressInfoEXT",
   "name" : "VkBufferDeviceAddressInfoEXT",
   "referenced_type" : "_ZTI28VkBufferDeviceAddressInfoEXT",
   "self_type" : "_ZTI28VkBufferDeviceAddressInfoEXT",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "timeDomain",
     "field_offset" : 64,
     "referenced_type" : "_ZTI15VkTimeDomainEXT"
    }
   ],
   "linker_set_key" : "_ZTI28VkCalibratedTimestampInfoEXT",
   "name" : "VkCalibratedTimestampInfoEXT",
   "referenced_type" : "_ZTI28VkCalibratedTimestampInfoEXT",
   "self_type" : "_ZTI28VkCalibratedTimestampInfoEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "objectType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI12VkObjectType"
    },
    {
     "field_name" : "objectHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tagName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tagSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pTag",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTI28VkDebugUtilsObjectTagInfoEXT",
   "name" : "VkDebugUtilsObjectTagInfoEXT",
   "referenced_type" : "_ZTI28VkDebugUtilsObjectTagInfoEXT",
   "self_type" : "_ZTI28VkDebugUtilsObjectTagInfoEXT",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binding",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "descriptorType",
     "field_offset" : 32,
     "referenced_type" : "_ZTI16VkDescriptorType"
    },
    {
     "field_name" : "descriptorCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stageFlags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pImmutableSamplers",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKy"
    }
   ],
   "linker_set_key" : "_ZTI28VkDescriptorSetLayoutBinding",
   "name" : "VkDescriptorSetLayoutBinding",
   "referenced_type" : "_ZTI28VkDescriptorSetLayoutBinding",
   "self_type" : "_ZTI28VkDescriptorSetLayoutBinding",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "supported",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28VkDescriptorSetLayoutSupport",
   "name" : "VkDescriptorSetLayoutSupport",
   "referenced_type" : "_ZTI28VkDescriptorSetLayoutSupport",
   "self_type" : "_ZTI28VkDescriptorSetLayoutSupport",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "displayPlaneProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI27VkDisplayPlanePropertiesKHR"
    }
   ],
   "linker_set_key" : "_ZTI28VkDisplayPlaneProperties2KHR",
   "name" : "VkDisplayPlaneProperties2KHR",
   "referenced_type" : "_ZTI28VkDisplayPlaneProperties2KHR",
   "self_type" : "_ZTI28VkDisplayPlaneProperties2KHR",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "indexCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "instanceCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "firstIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vertexOffset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "firstInstance",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28VkDrawIndexedIndirectCommand",
   "name" : "VkDrawIndexedIndirectCommand",
   "referenced_type" : "_ZTI28VkDrawIndexedIndirectCommand",
   "self_type" : "_ZTI28VkDrawIndexedIndirectCommand",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28VkExportMemoryAllocateInfoNV",
   "name" : "VkExportMemoryAllocateInfoNV",
   "referenced_type" : "_ZTI28VkExportMemoryAllocateInfoNV",
   "self_type" : "_ZTI28VkExportMemoryAllocateInfoNV",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stageCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pStages",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK31VkPipelineShaderStageCreateInfo"
    },
    {
     "field_name" : "pVertexInputState",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPK36VkPipelineVertexInputStateCreateInfo"
    },
    {
     "field_name" : "pInputAssemblyState",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK38VkPipelineInputAssemblyStateCreateInfo"
    },
    {
     "field_name" : "pTessellationState",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPK37VkPipelineTessellationStateCreateInfo"
    },
    {
     "field_name" : "pViewportState",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK33VkPipelineViewportStateCreateInfo"
    },
    {
     "field_name" : "pRasterizationState",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPK38VkPipelineRasterizationStateCreateInfo"
    },
    {
     "field_name" : "pMultisampleState",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPK36VkPipelineMultisampleStateCreateInfo"
    },
    {
     "field_name" : "pDepthStencilState",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPK37VkPipelineDepthStencilStateCreateInfo"
    },
    {
     "field_name" : "pColorBlendState",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPK35VkPipelineColorBlendStateCreateInfo"
    },
    {
     "field_name" : "pDynamicState",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPK32VkPipelineDynamicStateCreateInfo"
    },
    {
     "field_name" : "layout",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "renderPass",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "subpass",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "basePipelineHandle",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "basePipelineIndex",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI28VkGraphicsPipelineCreateInfo",
   "name" : "VkGraphicsPipelineCreateInfo",
   "referenced_type" : "_ZTI28VkGraphicsPipelineCreateInfo",
   "self_type" : "_ZTI28VkGraphicsPipelineCreateInfo",
   "size" : 96,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "decodeMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8VkFormat"
    }
   ],
   "linker_set_key" : "_ZTI28VkImageViewASTCDecodeModeEXT",
   "name" : "VkImageViewASTCDecodeModeEXT",
   "referenced_type" : "_ZTI28VkImageViewASTCDecodeModeEXT",
   "self_type" : "_ZTI28VkImageViewASTCDecodeModeEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "marker",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI28VkPerformanceMarkerInfoINTEL",
   "name" : "VkPerformanceMarkerInfoINTEL",
   "referenced_type" : "_ZTI28VkPerformanceMarkerInfoINTEL",
   "self_type" : "_ZTI28VkPerformanceMarkerInfoINTEL",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "deviceUUID",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "driverUUID",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "deviceLUID",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "deviceNodeMask",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "deviceLUIDValid",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI28VkPhysicalDeviceIDProperties",
   "name" : "VkPhysicalDeviceIDProperties",
   "referenced_type" : "_ZTI28VkPhysicalDeviceIDProperties",
   "self_type" : "_ZTI28VkPhysicalDeviceIDProperties",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "refreshDuration",
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI28VkRefreshCycleDurationGOOGLE",
   "name" : "VkRefreshCycleDurationGOOGLE",
   "referenced_type" : "_ZTI28VkRefreshCycleDurationGOOGLE",
   "self_type" : "_ZTI28VkRefreshCycleDurationGOOGLE",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "conversion",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI28VkSamplerYcbcrConversionInfo",
   "name" : "VkSamplerYcbcrConversionInfo",
   "referenced_type" : "_ZTI28VkSamplerYcbcrConversionInfo",
   "self_type" : "_ZTI28VkSamplerYcbcrConversionInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bindCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pBinds",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK18VkSparseMemoryBind"
    }
   ],
   "linker_set_key" : "_ZTI28VkSparseBufferMemoryBindInfo",
   "name" : "VkSparseBufferMemoryBindInfo",
   "referenced_type" : "_ZTI28VkSparseBufferMemoryBindInfo",
   "self_type" : "_ZTI28VkSparseBufferMemoryBindInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI29VkAccelerationStructureTypeNV"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "instanceCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "geometryCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pGeometries",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK12VkGeometryNV"
    }
   ],
   "linker_set_key" : "_ZTI29VkAccelerationStructureInfoNV",
   "name" : "VkAccelerationStructureInfoNV",
   "referenced_type" : "_ZTI29VkAccelerationStructureInfoNV",
   "self_type" : "_ZTI29VkAccelerationStructureInfoNV",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "window",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP13ANativeWindow"
    }
   ],
   "linker_set_key" : "_ZTI29VkAndroidSurfaceCreateInfoKHR",
   "name" : "VkAndroidSurfaceCreateInfoKHR",
   "referenced_type" : "_ZTI29VkAndroidSurfaceCreateInfoKHR",
   "self_type" : "_ZTI29VkAndroidSurfaceCreateInfoKHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "objectType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI26VkDebugReportObjectTypeEXT"
    },
    {
     "field_name" : "object",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tagName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tagSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pTag",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTI29VkDebugMarkerObjectTagInfoEXT",
   "name" : "VkDebugMarkerObjectTagInfoEXT",
   "referenced_type" : "_ZTI29VkDebugMarkerObjectTagInfoEXT",
   "self_type" : "_ZTI29VkDebugMarkerObjectTagInfoEXT",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "objectType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI12VkObjectType"
    },
    {
     "field_name" : "objectHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pObjectName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI29VkDebugUtilsObjectNameInfoEXT",
   "name" : "VkDebugUtilsObjectNameInfoEXT",
   "referenced_type" : "_ZTI29VkDebugUtilsObjectNameInfoEXT",
   "self_type" : "_ZTI29VkDebugUtilsObjectNameInfoEXT",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "physicalDeviceCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pPhysicalDevices",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKP18VkPhysicalDevice_T"
    }
   ],
   "linker_set_key" : "_ZTI29VkDeviceGroupDeviceCreateInfo",
   "name" : "VkDeviceGroupDeviceCreateInfo",
   "referenced_type" : "_ZTI29VkDeviceGroupDeviceCreateInfo",
   "self_type" : "_ZTI29VkDeviceGroupDeviceCreateInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "supportedAlpha",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSrcPosition",
     "field_offset" : 32,
     "referenced_type" : "_ZTI10VkOffset2D"
    },
    {
     "field_name" : "maxSrcPosition",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10VkOffset2D"
    },
    {
     "field_name" : "minSrcExtent",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "maxSrcExtent",
     "field_offset" : 224,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "minDstPosition",
     "field_offset" : 288,
     "referenced_type" : "_ZTI10VkOffset2D"
    },
    {
     "field_name" : "maxDstPosition",
     "field_offset" : 352,
     "referenced_type" : "_ZTI10VkOffset2D"
    },
    {
     "field_name" : "minDstExtent",
     "field_offset" : 416,
     "referenced_type" : "_ZTI10VkExtent2D"
    },
    {
     "field_name" : "maxDstExtent",
     "field_offset" : 480,
     "referenced_type" : "_ZTI10VkExtent2D"
    }
   ],
   "linker_set_key" : "_ZTI29VkDisplayPlaneCapabilitiesKHR",
   "name" : "VkDisplayPlaneCapabilitiesKHR",
   "referenced_type" : "_ZTI29VkDisplayPlaneCapabilitiesKHR",
   "self_type" : "_ZTI29VkDisplayPlaneCapabilitiesKHR",
   "size" : 68,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "displayMode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "planeIndex",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planeStackIndex",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "transform",
     "field_offset" : 256,
     "referenced_type" : "_ZTI29VkSurfaceTransformFlagBitsKHR"
    },
    {
     "field_name" : "globalAlpha",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "alphaMode",
     "field_offset" : 320,
     "referenced_type" : "_ZTI30VkDisplayPlaneAlphaFlagBitsKHR"
    },
    {
     "field_name" : "imageExtent",
     "field_offset" : 352,
     "referenced_type" : "_ZTI10VkExtent2D"
    }
   ],
   "linker_set_key" : "_ZTI29VkDisplaySurfaceCreateInfoKHR",
   "name" : "VkDisplaySurfaceCreateInfoKHR",
   "referenced_type" : "_ZTI29VkDisplaySurfaceCreateInfoKHR",
   "self_type" : "_ZTI29VkDisplaySurfaceCreateInfoKHR",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "exportFromImportedHandleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "compatibleHandleTypes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "externalSemaphoreFeatures",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI29VkExternalSemaphoreProperties",
   "name" : "VkExternalSemaphoreProperties",
   "referenced_type" : "_ZTI29VkExternalSemaphoreProperties",
   "self_type" : "_ZTI29VkExternalSemaphoreProperties",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "swapchain",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI29VkImageSwapchainCreateInfoKHR",
   "name" : "VkImageSwapchainCreateInfoKHR",
   "referenced_type" : "_ZTI29VkImageSwapchainCreateInfoKHR",
   "self_type" : "_ZTI29VkImageSwapchainCreateInfoKHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "image",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI29VkMemoryDedicatedAllocateInfo",
   "name" : "VkMemoryDedicatedAllocateInfo",
   "referenced_type" : "_ZTI29VkMemoryDedicatedAllocateInfo",
   "self_type" : "_ZTI29VkMemoryDedicatedAllocateInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "prefersDedicatedAllocation",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "requiresDedicatedAllocation",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI29VkMemoryDedicatedRequirements",
   "name" : "VkMemoryDedicatedRequirements",
   "referenced_type" : "_ZTI29VkMemoryDedicatedRequirements",
   "self_type" : "_ZTI29VkMemoryDedicatedRequirements",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI20VkObjectEntryTypeNVX"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pipeline",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI29VkObjectTablePipelineEntryNVX",
   "name" : "VkObjectTablePipelineEntryNVX",
   "referenced_type" : "_ZTI29VkObjectTablePipelineEntryNVX",
   "self_type" : "_ZTI29VkObjectTablePipelineEntryNVX",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "duration",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI29VkPipelineCreationFeedbackEXT",
   "name" : "VkPipelineCreationFeedbackEXT",
   "referenced_type" : "_ZTI29VkPipelineCreationFeedbackEXT",
   "self_type" : "_ZTI29VkPipelineCreationFeedbackEXT",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "aspectMask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imageGranularity",
     "field_offset" : 32,
     "referenced_type" : "_ZTI10VkExtent3D"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI29VkSparseImageFormatProperties",
   "name" : "VkSparseImageFormatProperties",
   "referenced_type" : "_ZTI29VkSparseImageFormatProperties",
   "self_type" : "_ZTI29VkSparseImageFormatProperties",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "attachmentIndex",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sampleLocationsInfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTI24VkSampleLocationsInfoEXT"
    }
   ],
   "linker_set_key" : "_ZTI30VkAttachmentSampleLocationsEXT",
   "name" : "VkAttachmentSampleLocationsEXT",
   "referenced_type" : "_ZTI30VkAttachmentSampleLocationsEXT",
   "self_type" : "_ZTI30VkAttachmentSampleLocationsEXT",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "renderPass",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "subpass",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "framebuffer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "occlusionQueryEnable",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "queryFlags",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pipelineStatistics",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI30VkCommandBufferInheritanceInfo",
   "name" : "VkCommandBufferInheritanceInfo",
   "referenced_type" : "_ZTI30VkCommandBufferInheritanceInfo",
   "self_type" : "_ZTI30VkCommandBufferInheritanceInfo",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "objectType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI26VkDebugReportObjectTypeEXT"
    },
    {
     "field_name" : "object",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pObjectName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI30VkDebugMarkerObjectNameInfoEXT",
   "name" : "VkDebugMarkerObjectNameInfoEXT",
   "referenced_type" : "_ZTI30VkDebugMarkerObjectNameInfoEXT",
   "self_type" : "_ZTI30VkDebugMarkerObjectNameInfoEXT",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "capabilities",
     "field_offset" : 64,
     "referenced_type" : "_ZTI29VkDisplayPlaneCapabilitiesKHR"
    }
   ],
   "linker_set_key" : "_ZTI30VkDisplayPlaneCapabilities2KHR",
   "name" : "VkDisplayPlaneCapabilities2KHR",
   "referenced_type" : "_ZTI30VkDisplayPlaneCapabilities2KHR",
   "self_type" : "_ZTI30VkDisplayPlaneCapabilities2KHR",
   "size" : 76,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI30VkHeadlessSurfaceCreateInfoEXT",
   "name" : "VkHeadlessSurfaceCreateInfoEXT",
   "referenced_type" : "_ZTI30VkHeadlessSurfaceCreateInfoEXT",
   "self_type" : "_ZTI30VkHeadlessSurfaceCreateInfoEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "viewFormatCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pViewFormats",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK8VkFormat"
    }
   ],
   "linker_set_key" : "_ZTI30VkImageFormatListCreateInfoKHR",
   "name" : "VkImageFormatListCreateInfoKHR",
   "referenced_type" : "_ZTI30VkImageFormatListCreateInfoKHR",
   "self_type" : "_ZTI30VkImageFormatListCreateInfoKHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "image",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI30VkImageMemoryRequirementsInfo2",
   "name" : "VkImageMemoryRequirementsInfo2",
   "referenced_type" : "_ZTI30VkImageMemoryRequirementsInfo2",
   "self_type" : "_ZTI30VkImageMemoryRequirementsInfo2",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "presentID",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "desiredPresentTime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "actualPresentTime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "earliestPresentTime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "presentMargin",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI30VkPastPresentationTimingGOOGLE",
   "name" : "VkPastPresentationTimingGOOGLE",
   "referenced_type" : "_ZTI30VkPastPresentationTimingGOOGLE",
   "self_type" : "_ZTI30VkPastPresentationTimingGOOGLE",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI30VkPerformanceOverrideTypeINTEL"
    },
    {
     "field_name" : "enable",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "parameter",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI30VkPerformanceOverrideInfoINTEL",
   "name" : "VkPerformanceOverrideInfoINTEL",
   "referenced_type" : "_ZTI30VkPerformanceOverrideInfoINTEL",
   "self_type" : "_ZTI30VkPerformanceOverrideInfoINTEL",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "properties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI29VkSparseImageFormatProperties"
    }
   ],
   "linker_set_key" : "_ZTI30VkSparseImageFormatProperties2",
   "name" : "VkSparseImageFormatProperties2",
   "referenced_type" : "_ZTI30VkSparseImageFormatProperties2",
   "self_type" : "_ZTI30VkSparseImageFormatProperties2",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "initialDataSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pInitialData",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTI30VkValidationCacheCreateInfoEXT",
   "name" : "VkValidationCacheCreateInfoEXT",
   "referenced_type" : "_ZTI30VkValidationCacheCreateInfoEXT",
   "self_type" : "_ZTI30VkValidationCacheCreateInfoEXT",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI31VkBufferMemoryRequirementsInfo2",
   "name" : "VkBufferMemoryRequirementsInfo2",
   "referenced_type" : "_ZTI31VkBufferMemoryRequirementsInfo2",
   "self_type" : "_ZTI31VkBufferMemoryRequirementsInfo2",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "MSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "NSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "KSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "AType",
     "field_offset" : 160,
     "referenced_type" : "_ZTI17VkComponentTypeNV"
    },
    {
     "field_name" : "BType",
     "field_offset" : 192,
     "referenced_type" : "_ZTI17VkComponentTypeNV"
    },
    {
     "field_name" : "CType",
     "field_offset" : 224,
     "referenced_type" : "_ZTI17VkComponentTypeNV"
    },
    {
     "field_name" : "DType",
     "field_offset" : 256,
     "referenced_type" : "_ZTI17VkComponentTypeNV"
    },
    {
     "field_name" : "scope",
     "field_offset" : 288,
     "referenced_type" : "_ZTI9VkScopeNV"
    }
   ],
   "linker_set_key" : "_ZTI31VkCooperativeMatrixPropertiesNV",
   "name" : "VkCooperativeMatrixPropertiesNV",
   "referenced_type" : "_ZTI31VkCooperativeMatrixPropertiesNV",
   "self_type" : "_ZTI31VkCooperativeMatrixPropertiesNV",
   "size" : 40,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "bindingCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pBindings",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK28VkDescriptorSetLayoutBinding"
    }
   ],
   "linker_set_key" : "_ZTI31VkDescriptorSetLayoutCreateInfo",
   "name" : "VkDescriptorSetLayoutCreateInfo",
   "referenced_type" : "_ZTI31VkDescriptorSetLayoutCreateInfo",
   "self_type" : "_ZTI31VkDescriptorSetLayoutCreateInfo",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dstBinding",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dstArrayElement",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "descriptorCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "descriptorType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI16VkDescriptorType"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stride",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI31VkDescriptorUpdateTemplateEntry",
   "name" : "VkDescriptorUpdateTemplateEntry",
   "referenced_type" : "_ZTI31VkDescriptorUpdateTemplateEntry",
   "self_type" : "_ZTI31VkDescriptorUpdateTemplateEntry",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "externalMemoryProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI26VkExternalMemoryProperties"
    }
   ],
   "linker_set_key" : "_ZTI31VkExternalImageFormatProperties",
   "name" : "VkExternalImageFormatProperties",
   "referenced_type" : "_ZTI31VkExternalImageFormatProperties",
   "self_type" : "_ZTI31VkExternalImageFormatProperties",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI31VkExternalMemoryImageCreateInfo",
   "name" : "VkExternalMemoryImageCreateInfo",
   "referenced_type" : "_ZTI31VkExternalMemoryImageCreateInfo",
   "self_type" : "_ZTI31VkExternalMemoryImageCreateInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI31VkMemoryPriorityAllocateInfoEXT",
   "name" : "VkMemoryPriorityAllocateInfoEXT",
   "referenced_type" : "_ZTI31VkMemoryPriorityAllocateInfoEXT",
   "self_type" : "_ZTI31VkMemoryPriorityAllocateInfoEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "physicalDeviceCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "physicalDevices",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA32_P18VkPhysicalDevice_T"
    },
    {
     "field_name" : "subsetAllocation",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI31VkPhysicalDeviceGroupProperties",
   "name" : "VkPhysicalDeviceGroupProperties",
   "referenced_type" : "_ZTI31VkPhysicalDeviceGroupProperties",
   "self_type" : "_ZTI31VkPhysicalDeviceGroupProperties",
   "size" : 144,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "surface",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI31VkPhysicalDeviceSurfaceInfo2KHR",
   "name" : "VkPhysicalDeviceSurfaceInfo2KHR",
   "referenced_type" : "_ZTI31VkPhysicalDeviceSurfaceInfo2KHR",
   "self_type" : "_ZTI31VkPhysicalDeviceSurfaceInfo2KHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stage",
     "field_offset" : 96,
     "referenced_type" : "_ZTI21VkShaderStageFlagBits"
    },
    {
     "field_name" : "module",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "pSpecializationInfo",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPK20VkSpecializationInfo"
    }
   ],
   "linker_set_key" : "_ZTI31VkPipelineShaderStageCreateInfo",
   "name" : "VkPipelineShaderStageCreateInfo",
   "referenced_type" : "_ZTI31VkPipelineShaderStageCreateInfo",
   "self_type" : "_ZTI31VkPipelineShaderStageCreateInfo",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "subpassCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pViewMasks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "dependencyCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pViewOffsets",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKi"
    },
    {
     "field_name" : "correlationMaskCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pCorrelationMasks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPKj"
    }
   ],
   "linker_set_key" : "_ZTI31VkRenderPassMultiviewCreateInfo",
   "name" : "VkRenderPassMultiviewCreateInfo",
   "referenced_type" : "_ZTI31VkRenderPassMultiviewCreateInfo",
   "self_type" : "_ZTI31VkRenderPassMultiviewCreateInfo",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "formatProperties",
     "referenced_type" : "_ZTI29VkSparseImageFormatProperties"
    },
    {
     "field_name" : "imageMipTailFirstLod",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imageMipTailSize",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "imageMipTailOffset",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "imageMipTailStride",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI31VkSparseImageMemoryRequirements",
   "name" : "VkSparseImageMemoryRequirements",
   "referenced_type" : "_ZTI31VkSparseImageMemoryRequirements",
   "self_type" : "_ZTI31VkSparseImageMemoryRequirements",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "surfaceCounters",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI31VkSwapchainCounterCreateInfoEXT",
   "name" : "VkSwapchainCounterCreateInfoEXT",
   "referenced_type" : "_ZTI31VkSwapchainCounterCreateInfoEXT",
   "self_type" : "_ZTI31VkSwapchainCounterCreateInfoEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binding",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stride",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "inputRate",
     "field_offset" : 64,
     "referenced_type" : "_ZTI17VkVertexInputRate"
    }
   ],
   "linker_set_key" : "_ZTI31VkVertexInputBindingDescription",
   "name" : "VkVertexInputBindingDescription",
   "referenced_type" : "_ZTI31VkVertexInputBindingDescription",
   "self_type" : "_ZTI31VkVertexInputBindingDescription",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "deviceIndexCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDeviceIndices",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "splitInstanceBindRegionCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pSplitInstanceBindRegions",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPK8VkRect2D"
    }
   ],
   "linker_set_key" : "_ZTI32VkBindImageMemoryDeviceGroupInfo",
   "name" : "VkBindImageMemoryDeviceGroupInfo",
   "referenced_type" : "_ZTI32VkBindImageMemoryDeviceGroupInfo",
   "self_type" : "_ZTI32VkBindImageMemoryDeviceGroupInfo",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "deviceMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "deviceRenderAreaCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDeviceRenderAreas",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK8VkRect2D"
    }
   ],
   "linker_set_key" : "_ZTI32VkDeviceGroupRenderPassBeginInfo",
   "name" : "VkDeviceGroupRenderPassBeginInfo",
   "referenced_type" : "_ZTI32VkDeviceGroupRenderPassBeginInfo",
   "self_type" : "_ZTI32VkDeviceGroupRenderPassBeginInfo",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "taskCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "firstTask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32VkDrawMeshTasksIndirectCommandNV",
   "name" : "VkDrawMeshTasksIndirectCommandNV",
   "referenced_type" : "_ZTI32VkDrawMeshTasksIndirectCommandNV",
   "self_type" : "_ZTI32VkDrawMeshTasksIndirectCommandNV",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "drmFormatModifier",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "drmFormatModifierPlaneCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "drmFormatModifierTilingFeatures",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32VkDrmFormatModifierPropertiesEXT",
   "name" : "VkDrmFormatModifierPropertiesEXT",
   "referenced_type" : "_ZTI32VkDrmFormatModifierPropertiesEXT",
   "self_type" : "_ZTI32VkDrmFormatModifierPropertiesEXT",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32VkExternalMemoryBufferCreateInfo",
   "name" : "VkExternalMemoryBufferCreateInfo",
   "referenced_type" : "_ZTI32VkExternalMemoryBufferCreateInfo",
   "self_type" : "_ZTI32VkExternalMemoryBufferCreateInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "stencilUsage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32VkImageStencilUsageCreateInfoEXT",
   "name" : "VkImageStencilUsageCreateInfoEXT",
   "referenced_type" : "_ZTI32VkImageStencilUsageCreateInfoEXT",
   "self_type" : "_ZTI32VkImageStencilUsageCreateInfoEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI34VkExternalMemoryHandleTypeFlagBits"
    },
    {
     "field_name" : "pHostPointer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI32VkImportMemoryHostPointerInfoEXT",
   "name" : "VkImportMemoryHostPointerInfoEXT",
   "referenced_type" : "_ZTI32VkImportMemoryHostPointerInfoEXT",
   "self_type" : "_ZTI32VkImportMemoryHostPointerInfoEXT",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tokenType",
     "referenced_type" : "_ZTI30VkIndirectCommandsTokenTypeNVX"
    },
    {
     "field_name" : "bindingUnit",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dynamicCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "divisor",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32VkIndirectCommandsLayoutTokenNVX",
   "name" : "VkIndirectCommandsLayoutTokenNVX",
   "referenced_type" : "_ZTI32VkIndirectCommandsLayoutTokenNVX",
   "self_type" : "_ZTI32VkIndirectCommandsLayoutTokenNVX",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "subpass",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "inputAttachmentIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "aspectMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32VkInputAttachmentAspectReference",
   "name" : "VkInputAttachmentAspectReference",
   "referenced_type" : "_ZTI32VkInputAttachmentAspectReference",
   "self_type" : "_ZTI32VkInputAttachmentAspectReference",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "memoryTypeBits",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32VkMemoryHostPointerPropertiesEXT",
   "name" : "VkMemoryHostPointerPropertiesEXT",
   "referenced_type" : "_ZTI32VkMemoryHostPointerPropertiesEXT",
   "self_type" : "_ZTI32VkMemoryHostPointerPropertiesEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI20VkObjectEntryTypeNVX"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indexType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11VkIndexType"
    }
   ],
   "linker_set_key" : "_ZTI32VkObjectTableIndexBufferEntryNVX",
   "name" : "VkObjectTableIndexBufferEntryNVX",
   "referenced_type" : "_ZTI32VkObjectTableIndexBufferEntryNVX",
   "self_type" : "_ZTI32VkObjectTableIndexBufferEntryNVX",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "type",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11VkImageType"
    },
    {
     "field_name" : "tiling",
     "field_offset" : 128,
     "referenced_type" : "_ZTI13VkImageTiling"
    },
    {
     "field_name" : "usage",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32VkPhysicalDeviceImageFormatInfo2",
   "name" : "VkPhysicalDeviceImageFormatInfo2",
   "referenced_type" : "_ZTI32VkPhysicalDeviceImageFormatInfo2",
   "self_type" : "_ZTI32VkPhysicalDeviceImageFormatInfo2",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "memoryTypeCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "memoryTypes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA32_12VkMemoryType"
    },
    {
     "field_name" : "memoryHeapCount",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "memoryHeaps",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIA16_12VkMemoryHeap"
    }
   ],
   "linker_set_key" : "_ZTI32VkPhysicalDeviceMemoryProperties",
   "name" : "VkPhysicalDeviceMemoryProperties",
   "referenced_type" : "_ZTI32VkPhysicalDeviceMemoryProperties",
   "self_type" : "_ZTI32VkPhysicalDeviceMemoryProperties",
   "size" : 520,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "residencyStandard2DBlockShape",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "residencyStandard2DMultisampleBlockShape",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "residencyStandard3DBlockShape",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "residencyAlignedMipSize",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "residencyNonResidentStrict",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI32VkPhysicalDeviceSparseProperties",
   "name" : "VkPhysicalDeviceSparseProperties",
   "referenced_type" : "_ZTI32VkPhysicalDeviceSparseProperties",
   "self_type" : "_ZTI32VkPhysicalDeviceSparseProperties",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dynamicStateCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDynamicStates",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK14VkDynamicState"
    }
   ],
   "linker_set_key" : "_ZTI32VkPipelineDynamicStateCreateInfo",
   "name" : "VkPipelineDynamicStateCreateInfo",
   "referenced_type" : "_ZTI32VkPipelineDynamicStateCreateInfo",
   "self_type" : "_ZTI32VkPipelineDynamicStateCreateInfo",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "description",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "format",
     "field_offset" : 4160,
     "referenced_type" : "_ZTI38VkPipelineExecutableStatisticFormatKHR"
    },
    {
     "field_name" : "value",
     "field_offset" : 4224,
     "referenced_type" : "_ZTI37VkPipelineExecutableStatisticValueKHR"
    }
   ],
   "linker_set_key" : "_ZTI32VkPipelineExecutableStatisticKHR",
   "name" : "VkPipelineExecutableStatisticKHR",
   "referenced_type" : "_ZTI32VkPipelineExecutableStatisticKHR",
   "self_type" : "_ZTI32VkPipelineExecutableStatisticKHR",
   "size" : 536,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stageCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pStages",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK31VkPipelineShaderStageCreateInfo"
    },
    {
     "field_name" : "groupCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pGroups",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK35VkRayTracingShaderGroupCreateInfoNV"
    },
    {
     "field_name" : "maxRecursionDepth",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layout",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "basePipelineHandle",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "basePipelineIndex",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI32VkRayTracingPipelineCreateInfoNV",
   "name" : "VkRayTracingPipelineCreateInfoNV",
   "referenced_type" : "_ZTI32VkRayTracingPipelineCreateInfoNV",
   "self_type" : "_ZTI32VkRayTracingPipelineCreateInfoNV",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "memoryRequirements",
     "field_offset" : 64,
     "referenced_type" : "_ZTI31VkSparseImageMemoryRequirements"
    }
   ],
   "linker_set_key" : "_ZTI32VkSparseImageMemoryRequirements2",
   "name" : "VkSparseImageMemoryRequirements2",
   "referenced_type" : "_ZTI32VkSparseImageMemoryRequirements2",
   "self_type" : "_ZTI32VkSparseImageMemoryRequirements2",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "deviceIndexCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDeviceIndices",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKj"
    }
   ],
   "linker_set_key" : "_ZTI33VkBindBufferMemoryDeviceGroupInfo",
   "name" : "VkBindBufferMemoryDeviceGroupInfo",
   "referenced_type" : "_ZTI33VkBindBufferMemoryDeviceGroupInfo",
   "self_type" : "_ZTI33VkBindBufferMemoryDeviceGroupInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "swapchain",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "imageIndex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33VkBindImageMemorySwapchainInfoKHR",
   "name" : "VkBindImageMemorySwapchainInfoKHR",
   "referenced_type" : "_ZTI33VkBindImageMemorySwapchainInfoKHR",
   "self_type" : "_ZTI33VkBindImageMemorySwapchainInfoKHR",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "imageFormatProperties",
     "referenced_type" : "_ZTI23VkImageFormatProperties"
    },
    {
     "field_name" : "externalMemoryFeatures",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exportFromImportedHandleTypes",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "compatibleHandleTypes",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33VkExternalImageFormatPropertiesNV",
   "name" : "VkExternalImageFormatPropertiesNV",
   "referenced_type" : "_ZTI33VkExternalImageFormatPropertiesNV",
   "self_type" : "_ZTI33VkExternalImageFormatPropertiesNV",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleTypes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33VkExternalMemoryImageCreateInfoNV",
   "name" : "VkExternalMemoryImageCreateInfoNV",
   "referenced_type" : "_ZTI33VkExternalMemoryImageCreateInfoNV",
   "self_type" : "_ZTI33VkExternalMemoryImageCreateInfoNV",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI20VkObjectEntryTypeNVX"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pipelineLayout",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stageFlags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33VkObjectTablePushConstantEntryNVX",
   "name" : "VkObjectTablePushConstantEntryNVX",
   "referenced_type" : "_ZTI33VkObjectTablePushConstantEntryNVX",
   "self_type" : "_ZTI33VkObjectTablePushConstantEntryNVX",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI20VkObjectEntryTypeNVX"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI33VkObjectTableVertexBufferEntryNVX",
   "name" : "VkObjectTableVertexBufferEntryNVX",
   "referenced_type" : "_ZTI33VkObjectTableVertexBufferEntryNVX",
   "self_type" : "_ZTI33VkObjectTableVertexBufferEntryNVX",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI33VkExternalFenceHandleTypeFlagBits"
    }
   ],
   "linker_set_key" : "_ZTI33VkPhysicalDeviceExternalFenceInfo",
   "name" : "VkPhysicalDeviceExternalFenceInfo",
   "referenced_type" : "_ZTI33VkPhysicalDeviceExternalFenceInfo",
   "self_type" : "_ZTI33VkPhysicalDeviceExternalFenceInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "memoryProperties",
     "field_offset" : 64,
     "referenced_type" : "_ZTI32VkPhysicalDeviceMemoryProperties"
    }
   ],
   "linker_set_key" : "_ZTI33VkPhysicalDeviceMemoryProperties2",
   "name" : "VkPhysicalDeviceMemoryProperties2",
   "referenced_type" : "_ZTI33VkPhysicalDeviceMemoryProperties2",
   "self_type" : "_ZTI33VkPhysicalDeviceMemoryProperties2",
   "size" : 528,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "multiview",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "multiviewGeometryShader",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "multiviewTessellationShader",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33VkPhysicalDeviceMultiviewFeatures",
   "name" : "VkPhysicalDeviceMultiviewFeatures",
   "referenced_type" : "_ZTI33VkPhysicalDeviceMultiviewFeatures",
   "self_type" : "_ZTI33VkPhysicalDeviceMultiviewFeatures",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stages",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "description",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "subgroupSize",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33VkPipelineExecutablePropertiesKHR",
   "name" : "VkPipelineExecutablePropertiesKHR",
   "referenced_type" : "_ZTI33VkPipelineExecutablePropertiesKHR",
   "self_type" : "_ZTI33VkPipelineExecutablePropertiesKHR",
   "size" : 528,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "viewportCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pViewports",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK10VkViewport"
    },
    {
     "field_name" : "scissorCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pScissors",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK8VkRect2D"
    }
   ],
   "linker_set_key" : "_ZTI33VkPipelineViewportStateCreateInfo",
   "name" : "VkPipelineViewportStateCreateInfo",
   "referenced_type" : "_ZTI33VkPipelineViewportStateCreateInfo",
   "self_type" : "_ZTI33VkPipelineViewportStateCreateInfo",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "image",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bindCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pBinds",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK18VkSparseMemoryBind"
    }
   ],
   "linker_set_key" : "_ZTI33VkSparseImageOpaqueMemoryBindInfo",
   "name" : "VkSparseImageOpaqueMemoryBindInfo",
   "referenced_type" : "_ZTI33VkSparseImageOpaqueMemoryBindInfo",
   "self_type" : "_ZTI33VkSparseImageOpaqueMemoryBindInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "supportsProtected",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33VkSurfaceProtectedCapabilitiesKHR",
   "name" : "VkSurfaceProtectedCapabilitiesKHR",
   "referenced_type" : "_ZTI33VkSurfaceProtectedCapabilitiesKHR",
   "self_type" : "_ZTI33VkSurfaceProtectedCapabilitiesKHR",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "location",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "binding",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI33VkVertexInputAttributeDescription",
   "name" : "VkVertexInputAttributeDescription",
   "referenced_type" : "_ZTI33VkVertexInputAttributeDescription",
   "self_type" : "_ZTI33VkVertexInputAttributeDescription",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "deviceAddress",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI34VkBufferDeviceAddressCreateInfoEXT",
   "name" : "VkBufferDeviceAddressCreateInfoEXT",
   "referenced_type" : "_ZTI34VkBufferDeviceAddressCreateInfoEXT",
   "self_type" : "_ZTI34VkBufferDeviceAddressCreateInfoEXT",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI34VkConditionalRenderingBeginInfoEXT",
   "name" : "VkConditionalRenderingBeginInfoEXT",
   "referenced_type" : "_ZTI34VkConditionalRenderingBeginInfoEXT",
   "self_type" : "_ZTI34VkConditionalRenderingBeginInfoEXT",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pfnCallback",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFjj26VkDebugReportObjectTypeEXTyjiPKcS1_PvE"
    },
    {
     "field_name" : "pUserData",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI34VkDebugReportCallbackCreateInfoEXT",
   "name" : "VkDebugReportCallbackCreateInfoEXT",
   "referenced_type" : "_ZTI34VkDebugReportCallbackCreateInfoEXT",
   "self_type" : "_ZTI34VkDebugReportCallbackCreateInfoEXT",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "messageSeverity",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "messageType",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pfnUserCallback",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFj38VkDebugUtilsMessageSeverityFlagBitsEXTjPK36VkDebugUtilsMessengerCallbackDataEXTPvE"
    },
    {
     "field_name" : "pUserData",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI34VkDebugUtilsMessengerCreateInfoEXT",
   "name" : "VkDebugUtilsMessengerCreateInfoEXT",
   "referenced_type" : "_ZTI34VkDebugUtilsMessengerCreateInfoEXT",
   "self_type" : "_ZTI34VkDebugUtilsMessengerCreateInfoEXT",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "maxIndirectCommandsLayoutTokenCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxObjectEntryCounts",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSequenceCountBufferOffsetAlignment",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSequenceIndexBufferOffsetAlignment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minCommandsTokenBufferOffsetAlignment",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI34VkDeviceGeneratedCommandsLimitsNVX",
   "name" : "VkDeviceGeneratedCommandsLimitsNVX",
   "referenced_type" : "_ZTI34VkDeviceGeneratedCommandsLimitsNVX",
   "self_type" : "_ZTI34VkDeviceGeneratedCommandsLimitsNVX",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "planeAspect",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21VkImageAspectFlagBits"
    }
   ],
   "linker_set_key" : "_ZTI34VkImagePlaneMemoryRequirementsInfo",
   "name" : "VkImagePlaneMemoryRequirementsInfo",
   "referenced_type" : "_ZTI34VkImagePlaneMemoryRequirementsInfo",
   "self_type" : "_ZTI34VkImagePlaneMemoryRequirementsInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTI20VkObjectEntryTypeNVX"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pipelineLayout",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "descriptorSet",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI34VkObjectTableDescriptorSetEntryNVX",
   "name" : "VkObjectTableDescriptorSetEntryNVX",
   "referenced_type" : "_ZTI34VkObjectTableDescriptorSetEntryNVX",
   "self_type" : "_ZTI34VkObjectTableDescriptorSetEntryNVX",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "marker",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI34VkPerformanceStreamMarkerInfoINTEL",
   "name" : "VkPerformanceStreamMarkerInfoINTEL",
   "referenced_type" : "_ZTI34VkPerformanceStreamMarkerInfoINTEL",
   "self_type" : "_ZTI34VkPerformanceStreamMarkerInfoINTEL",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usage",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI34VkExternalMemoryHandleTypeFlagBits"
    }
   ],
   "linker_set_key" : "_ZTI34VkPhysicalDeviceExternalBufferInfo",
   "name" : "VkPhysicalDeviceExternalBufferInfo",
   "referenced_type" : "_ZTI34VkPhysicalDeviceExternalBufferInfo",
   "self_type" : "_ZTI34VkPhysicalDeviceExternalBufferInfo",
   "size" : 20,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "subgroupSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "supportedStages",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "supportedOperations",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "quadOperationsInAllStages",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI34VkPhysicalDeviceSubgroupProperties",
   "name" : "VkPhysicalDeviceSubgroupProperties",
   "referenced_type" : "_ZTI34VkPhysicalDeviceSubgroupProperties",
   "self_type" : "_ZTI34VkPhysicalDeviceSubgroupProperties",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "attachmentCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAttachments",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKy"
    }
   ],
   "linker_set_key" : "_ZTI34VkRenderPassAttachmentBeginInfoKHR",
   "name" : "VkRenderPassAttachmentBeginInfoKHR",
   "referenced_type" : "_ZTI34VkRenderPassAttachmentBeginInfoKHR",
   "self_type" : "_ZTI34VkRenderPassAttachmentBeginInfoKHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8VkFormat"
    },
    {
     "field_name" : "ycbcrModel",
     "field_offset" : 96,
     "referenced_type" : "_ZTI29VkSamplerYcbcrModelConversion"
    },
    {
     "field_name" : "ycbcrRange",
     "field_offset" : 128,
     "referenced_type" : "_ZTI19VkSamplerYcbcrRange"
    },
    {
     "field_name" : "components",
     "field_offset" : 160,
     "referenced_type" : "_ZTI18VkComponentMapping"
    },
    {
     "field_name" : "xChromaOffset",
     "field_offset" : 288,
     "referenced_type" : "_ZTI16VkChromaLocation"
    },
    {
     "field_name" : "yChromaOffset",
     "field_offset" : 320,
     "referenced_type" : "_ZTI16VkChromaLocation"
    },
    {
     "field_name" : "chromaFilter",
     "field_offset" : 352,
     "referenced_type" : "_ZTI8VkFilter"
    },
    {
     "field_name" : "forceExplicitReconstruction",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI34VkSamplerYcbcrConversionCreateInfo",
   "name" : "VkSamplerYcbcrConversionCreateInfo",
   "referenced_type" : "_ZTI34VkSamplerYcbcrConversionCreateInfo",
   "self_type" : "_ZTI34VkSamplerYcbcrConversionCreateInfo",
   "size" : 52,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "compactedSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "info",
     "field_offset" : 128,
     "referenced_type" : "_ZTI29VkAccelerationStructureInfoNV"
    }
   ],
   "linker_set_key" : "_ZTI35VkAccelerationStructureCreateInfoNV",
   "name" : "VkAccelerationStructureCreateInfoNV",
   "referenced_type" : "_ZTI35VkAccelerationStructureCreateInfoNV",
   "self_type" : "_ZTI35VkAccelerationStructureCreateInfoNV",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "androidHardwareBufferUsage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI35VkAndroidHardwareBufferUsageANDROID",
   "name" : "VkAndroidHardwareBufferUsageANDROID",
   "referenced_type" : "_ZTI35VkAndroidHardwareBufferUsageANDROID",
   "self_type" : "_ZTI35VkAndroidHardwareBufferUsageANDROID",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_android.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "objectTable",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "indirectCommandsLayout",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "maxSequencesCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35VkCmdReserveSpaceForCommandsInfoNVX",
   "name" : "VkCmdReserveSpaceForCommandsInfoNVX",
   "referenced_type" : "_ZTI35VkCmdReserveSpaceForCommandsInfoNVX",
   "self_type" : "_ZTI35VkCmdReserveSpaceForCommandsInfoNVX",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "deviceMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35VkDeviceGroupCommandBufferBeginInfo",
   "name" : "VkDeviceGroupCommandBufferBeginInfo",
   "referenced_type" : "_ZTI35VkDeviceGroupCommandBufferBeginInfo",
   "self_type" : "_ZTI35VkDeviceGroupCommandBufferBeginInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "presentMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "field_name" : "modes",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35VkDeviceGroupPresentCapabilitiesKHR",
   "name" : "VkDeviceGroupPresentCapabilitiesKHR",
   "referenced_type" : "_ZTI35VkDeviceGroupPresentCapabilitiesKHR",
   "self_type" : "_ZTI35VkDeviceGroupPresentCapabilitiesKHR",
   "size" : 140,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "modes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35VkDeviceGroupSwapchainCreateInfoKHR",
   "name" : "VkDeviceGroupSwapchainCreateInfoKHR",
   "referenced_type" : "_ZTI35VkDeviceGroupSwapchainCreateInfoKHR",
   "self_type" : "_ZTI35VkDeviceGroupSwapchainCreateInfoKHR",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usage",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "width",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "viewFormatCount",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pViewFormats",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPK8VkFormat"
    }
   ],
   "linker_set_key" : "_ZTI35VkFramebufferAttachmentImageInfoKHR",
   "name" : "VkFramebufferAttachmentImageInfoKHR",
   "referenced_type" : "_ZTI35VkFramebufferAttachmentImageInfoKHR",
   "self_type" : "_ZTI35VkFramebufferAttachmentImageInfoKHR",
   "size" : 36,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "pUserData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI35VkInitializePerformanceApiInfoINTEL",
   "name" : "VkInitializePerformanceApiInfoINTEL",
   "referenced_type" : "_ZTI35VkInitializePerformanceApiInfoINTEL",
   "self_type" : "_ZTI35VkInitializePerformanceApiInfoINTEL",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "driverID",
     "field_offset" : 64,
     "referenced_type" : "_ZTI13VkDriverIdKHR"
    },
    {
     "field_name" : "driverName",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "driverInfo",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "field_name" : "conformanceVersion",
     "field_offset" : 4192,
     "referenced_type" : "_ZTI23VkConformanceVersionKHR"
    }
   ],
   "linker_set_key" : "_ZTI35VkPhysicalDeviceDriverPropertiesKHR",
   "name" : "VkPhysicalDeviceDriverPropertiesKHR",
   "referenced_type" : "_ZTI35VkPhysicalDeviceDriverPropertiesKHR",
   "self_type" : "_ZTI35VkPhysicalDeviceDriverPropertiesKHR",
   "size" : 528,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "maxMultiviewViewCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "maxMultiviewInstanceIndex",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35VkPhysicalDeviceMultiviewProperties",
   "name" : "VkPhysicalDeviceMultiviewProperties",
   "referenced_type" : "_ZTI35VkPhysicalDeviceMultiviewProperties",
   "self_type" : "_ZTI35VkPhysicalDeviceMultiviewProperties",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "blendEnable",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "srcColorBlendFactor",
     "field_offset" : 32,
     "referenced_type" : "_ZTI13VkBlendFactor"
    },
    {
     "field_name" : "dstColorBlendFactor",
     "field_offset" : 64,
     "referenced_type" : "_ZTI13VkBlendFactor"
    },
    {
     "field_name" : "colorBlendOp",
     "field_offset" : 96,
     "referenced_type" : "_ZTI9VkBlendOp"
    },
    {
     "field_name" : "srcAlphaBlendFactor",
     "field_offset" : 128,
     "referenced_type" : "_ZTI13VkBlendFactor"
    },
    {
     "field_name" : "dstAlphaBlendFactor",
     "field_offset" : 160,
     "referenced_type" : "_ZTI13VkBlendFactor"
    },
    {
     "field_name" : "alphaBlendOp",
     "field_offset" : 192,
     "referenced_type" : "_ZTI9VkBlendOp"
    },
    {
     "field_name" : "colorWriteMask",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35VkPipelineColorBlendAttachmentState",
   "name" : "VkPipelineColorBlendAttachmentState",
   "referenced_type" : "_ZTI35VkPipelineColorBlendAttachmentState",
   "self_type" : "_ZTI35VkPipelineColorBlendAttachmentState",
   "size" : 32,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "logicOpEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "logicOp",
     "field_offset" : 128,
     "referenced_type" : "_ZTI9VkLogicOp"
    },
    {
     "field_name" : "attachmentCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAttachments",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK35VkPipelineColorBlendAttachmentState"
    },
    {
     "field_name" : "blendConstants",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA4_f"
    }
   ],
   "linker_set_key" : "_ZTI35VkPipelineColorBlendStateCreateInfo",
   "name" : "VkPipelineColorBlendStateCreateInfo",
   "referenced_type" : "_ZTI35VkPipelineColorBlendStateCreateInfo",
   "self_type" : "_ZTI35VkPipelineColorBlendStateCreateInfo",
   "size" : 44,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "checkpointExecutionStageMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35VkQueueFamilyCheckpointPropertiesNV",
   "name" : "VkQueueFamilyCheckpointPropertiesNV",
   "referenced_type" : "_ZTI35VkQueueFamilyCheckpointPropertiesNV",
   "self_type" : "_ZTI35VkQueueFamilyCheckpointPropertiesNV",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI29VkRayTracingShaderGroupTypeNV"
    },
    {
     "field_name" : "generalShader",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "closestHitShader",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "anyHitShader",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "intersectionShader",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI35VkRayTracingShaderGroupCreateInfoNV",
   "name" : "VkRayTracingShaderGroupCreateInfoNV",
   "referenced_type" : "_ZTI35VkRayTracingShaderGroupCreateInfoNV",
   "self_type" : "_ZTI35VkRayTracingShaderGroupCreateInfoNV",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "reductionMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI25VkSamplerReductionModeEXT"
    }
   ],
   "linker_set_key" : "_ZTI35VkSamplerReductionModeCreateInfoEXT",
   "name" : "VkSamplerReductionModeCreateInfoEXT",
   "referenced_type" : "_ZTI35VkSamplerReductionModeCreateInfoEXT",
   "self_type" : "_ZTI35VkSamplerReductionModeCreateInfoEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pMessageIdName",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "messageIdNumber",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pMessage",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "queueLabelCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pQueueLabels",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPK20VkDebugUtilsLabelEXT"
    },
    {
     "field_name" : "cmdBufLabelCount",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pCmdBufLabels",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPK20VkDebugUtilsLabelEXT"
    },
    {
     "field_name" : "objectCount",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pObjects",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPK29VkDebugUtilsObjectNameInfoEXT"
    }
   ],
   "linker_set_key" : "_ZTI36VkDebugUtilsMessengerCallbackDataEXT",
   "name" : "VkDebugUtilsMessengerCallbackDataEXT",
   "referenced_type" : "_ZTI36VkDebugUtilsMessengerCallbackDataEXT",
   "self_type" : "_ZTI36VkDebugUtilsMessengerCallbackDataEXT",
   "size" : 48,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "descriptorUpdateEntryCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDescriptorUpdateEntries",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK31VkDescriptorUpdateTemplateEntry"
    },
    {
     "field_name" : "templateType",
     "field_offset" : 160,
     "referenced_type" : "_ZTI30VkDescriptorUpdateTemplateType"
    },
    {
     "field_name" : "descriptorSetLayout",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pipelineBindPoint",
     "field_offset" : 256,
     "referenced_type" : "_ZTI19VkPipelineBindPoint"
    },
    {
     "field_name" : "pipelineLayout",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI36VkDescriptorUpdateTemplateCreateInfo",
   "name" : "VkDescriptorUpdateTemplateCreateInfo",
   "referenced_type" : "_ZTI36VkDescriptorUpdateTemplateCreateInfo",
   "self_type" : "_ZTI36VkDescriptorUpdateTemplateCreateInfo",
   "size" : 56,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "computeBindingPointSupport",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI36VkDeviceGeneratedCommandsFeaturesNVX",
   "name" : "VkDeviceGeneratedCommandsFeaturesNVX",
   "referenced_type" : "_ZTI36VkDeviceGeneratedCommandsFeaturesNVX",
   "self_type" : "_ZTI36VkDeviceGeneratedCommandsFeaturesNVX",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "drmFormatModifierCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pDrmFormatModifierProperties",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP32VkDrmFormatModifierPropertiesEXT"
    }
   ],
   "linker_set_key" : "_ZTI36VkDrmFormatModifierPropertiesListEXT",
   "name" : "VkDrmFormatModifierPropertiesListEXT",
   "referenced_type" : "_ZTI36VkDrmFormatModifierPropertiesListEXT",
   "self_type" : "_ZTI36VkDrmFormatModifierPropertiesListEXT",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "image",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI36VkImageSparseMemoryRequirementsInfo2",
   "name" : "VkImageSparseMemoryRequirementsInfo2",
   "referenced_type" : "_ZTI36VkImageSparseMemoryRequirementsInfo2",
   "self_type" : "_ZTI36VkImageSparseMemoryRequirementsInfo2",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "storageBuffer16BitAccess",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uniformAndStorageBuffer16BitAccess",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "storagePushConstant16",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "storageInputOutput16",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI36VkPhysicalDevice16BitStorageFeatures",
   "name" : "VkPhysicalDevice16BitStorageFeatures",
   "referenced_type" : "_ZTI36VkPhysicalDevice16BitStorageFeatures",
   "self_type" : "_ZTI36VkPhysicalDevice16BitStorageFeatures",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "taskShader",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "meshShader",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI36VkPhysicalDeviceMeshShaderFeaturesNV",
   "name" : "VkPhysicalDeviceMeshShaderFeaturesNV",
   "referenced_type" : "_ZTI36VkPhysicalDeviceMeshShaderFeaturesNV",
   "self_type" : "_ZTI36VkPhysicalDeviceMeshShaderFeaturesNV",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rasterizationSamples",
     "field_offset" : 96,
     "referenced_type" : "_ZTI21VkSampleCountFlagBits"
    },
    {
     "field_name" : "sampleShadingEnable",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minSampleShading",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "pSampleMask",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKj"
    },
    {
     "field_name" : "alphaToCoverageEnable",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alphaToOneEnable",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI36VkPipelineMultisampleStateCreateInfo",
   "name" : "VkPipelineMultisampleStateCreateInfo",
   "referenced_type" : "_ZTI36VkPipelineMultisampleStateCreateInfo",
   "self_type" : "_ZTI36VkPipelineMultisampleStateCreateInfo",
   "size" : 36,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vertexBindingDescriptionCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pVertexBindingDescriptions",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK31VkVertexInputBindingDescription"
    },
    {
     "field_name" : "vertexAttributeDescriptionCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pVertexAttributeDescriptions",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK33VkVertexInputAttributeDescription"
    }
   ],
   "linker_set_key" : "_ZTI36VkPipelineVertexInputStateCreateInfo",
   "name" : "VkPipelineVertexInputStateCreateInfo",
   "referenced_type" : "_ZTI36VkPipelineVertexInputStateCreateInfo",
   "self_type" : "_ZTI36VkPipelineVertexInputStateCreateInfo",
   "size" : 28,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "attachmentImageInfoCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pAttachmentImageInfos",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPK35VkFramebufferAttachmentImageInfoKHR"
    }
   ],
   "linker_set_key" : "_ZTI37VkFramebufferAttachmentsCreateInfoKHR",
   "name" : "VkFramebufferAttachmentsCreateInfoKHR",
   "referenced_type" : "_ZTI37VkFramebufferAttachmentsCreateInfoKHR",
   "self_type" : "_ZTI37VkFramebufferAttachmentsCreateInfoKHR",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "drmFormatModifier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI37VkImageDrmFormatModifierPropertiesEXT",
   "name" : "VkImageDrmFormatModifierPropertiesEXT",
   "referenced_type" : "_ZTI37VkImageDrmFormatModifierPropertiesEXT",
   "self_type" : "_ZTI37VkImageDrmFormatModifierPropertiesEXT",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "pipelineBindPoint",
     "field_offset" : 64,
     "referenced_type" : "_ZTI19VkPipelineBindPoint"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tokenCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pTokens",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPK32VkIndirectCommandsLayoutTokenNVX"
    }
   ],
   "linker_set_key" : "_ZTI37VkIndirectCommandsLayoutCreateInfoNVX",
   "name" : "VkIndirectCommandsLayoutCreateInfoNVX",
   "referenced_type" : "_ZTI37VkIndirectCommandsLayoutCreateInfoNVX",
   "self_type" : "_ZTI37VkIndirectCommandsLayoutCreateInfoNVX",
   "size" : 24,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "decodeModeSharedExponent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI37VkPhysicalDeviceASTCDecodeFeaturesEXT",
   "name" : "VkPhysicalDeviceASTCDecodeFeaturesEXT",
   "referenced_type" : "_ZTI37VkPhysicalDeviceASTCDecodeFeaturesEXT",
   "self_type" : "_ZTI37VkPhysicalDeviceASTCDecodeFeaturesEXT",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "handleType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI37VkExternalSemaphoreHandleTypeFlagBits"
    }
   ],
   "linker_set_key" : "_ZTI37VkPhysicalDeviceExternalSemaphoreInfo",
   "name" : "VkPhysicalDeviceExternalSemaphoreInfo",
   "referenced_type" : "_ZTI37VkPhysicalDeviceExternalSemaphoreInfo",
   "self_type" : "_ZTI37VkPhysicalDeviceExternalSemaphoreInfo",
   "size" : 12,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthTestEnable",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthWriteEnable",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthCompareOp",
     "field_offset" : 160,
     "referenced_type" : "_ZTI11VkCompareOp"
    },
    {
     "field_name" : "depthBoundsTestEnable",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stencilTestEnable",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "front",
     "field_offset" : 256,
     "referenced_type" : "_ZTI16VkStencilOpState"
    },
    {
     "field_name" : "back",
     "field_offset" : 480,
     "referenced_type" : "_ZTI16VkStencilOpState"
    },
    {
     "field_name" : "minDepthBounds",
     "field_offset" : 704,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxDepthBounds",
     "field_offset" : 736,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI37VkPipelineDepthStencilStateCreateInfo",
   "name" : "VkPipelineDepthStencilStateCreateInfo",
   "referenced_type" : "_ZTI37VkPipelineDepthStencilStateCreateInfo",
   "self_type" : "_ZTI37VkPipelineDepthStencilStateCreateInfo",
   "size" : 96,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "b32",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "i64",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "u64",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "f64",
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTI37VkPipelineExecutableStatisticValueKHR",
   "name" : "VkPipelineExecutableStatisticValueKHR",
   "record_kind" : "union",
   "referenced_type" : "_ZTI37VkPipelineExecutableStatisticValueKHR",
   "self_type" : "_ZTI37VkPipelineExecutableStatisticValueKHR",
   "size" : 8,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sType",
     "referenced_type" : "_ZTI15VkStructureType"
    },
    {
     "field_name" : "pNext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "patchControlPoints",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI37VkPipelineTessellationStateCreateInfo",
   "name" : "VkPipelineTessellationStateCreateInfo",
   "referenced_type" : "_ZTI37VkPipelineTessellationStateCreateInfo",
   "self_type" : "_ZTI37VkPipelineTessellationStateCreateInfo",
   "size" : 16,
   "source_file" : "/external/vulkan-headers/include/vulkan/vulkan_core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
