{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-6",
   "self_type" : "type-5",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [10]",
   "name" : "char [10]",
   "referenced_type" : "type-6",
   "self_type" : "type-225",
   "size" : 10,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [11]",
   "name" : "char [11]",
   "referenced_type" : "type-6",
   "self_type" : "type-246",
   "size" : 11,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [12]",
   "name" : "char [12]",
   "referenced_type" : "type-6",
   "self_type" : "type-222",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [13]",
   "name" : "char [13]",
   "referenced_type" : "type-6",
   "self_type" : "type-219",
   "size" : 13,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "char [14]",
   "name" : "char [14]",
   "referenced_type" : "type-6",
   "self_type" : "type-266",
   "size" : 14,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 1,

   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-1976",
   "self_type" : "type-1975",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-2678",
   "self_type" : "type-2677",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-3020",
   "self_type" : "type-3019",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Value.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "name" : "const std::vector<unsigned char, std::allocator<unsigned char> >",
   "referenced_type" : "type-576",
   "self_type" : "type-575",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned long long, std::allocator<unsigned long long> >",
   "name" : "const std::vector<unsigned long long, std::allocator<unsigned long long> >",
   "referenced_type" : "type-1609",
   "self_type" : "type-1608",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned long long, std::allocator<unsigned long long> >",
   "name" : "const std::vector<unsigned long long, std::allocator<unsigned long long> >",
   "referenced_type" : "type-2696",
   "self_type" : "type-2695",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::vector<unsigned long long, std::allocator<unsigned long long> >",
   "name" : "const std::vector<unsigned long long, std::allocator<unsigned long long> >",
   "referenced_type" : "type-597",
   "self_type" : "type-596",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-62",
   "self_type" : "type-205",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned char *const",
   "name" : "const unsigned char *const",
   "referenced_type" : "type-204",
   "self_type" : "type-295",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-14",
   "self_type" : "type-15",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int *const",
   "name" : "const unsigned int *const",
   "referenced_type" : "type-298",
   "self_type" : "type-297",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-4",
   "self_type" : "type-207",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-33",
   "self_type" : "type-964",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-13",
   "self_type" : "type-162",
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const void *const",
   "name" : "const void *const",
   "referenced_type" : "type-161",
   "self_type" : "type-903",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-12",
   "self_type" : "type-237",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-181",
   "self_type" : "type-655",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-34",
   "self_type" : "type-196",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/BpBinder.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1032"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "d_",
     "field_offset" : 32,
     "referenced_type" : "type-1030"
    },
    {
     "access" : "private",
     "field_name" : "s_",
     "field_offset" : 64,
     "referenced_type" : "type-1031"
    }
   ],
   "linker_set_key" : "Renamer",
   "name" : "Renamer",
   "record_kind" : "class",
   "referenced_type" : "type-1029",
   "self_type" : "type-1029",
   "size" : 12,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSZN7android14ReferenceMover15move_referencesINS_18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS6_jE7Renamer",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIZN7android14ReferenceMover15move_referencesINS_18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS6_jE7Renamer"
    },
    {
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS6_jENK7RenamerclEj"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS6_jEN7RenamerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS6_jEN7RenamerD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-19"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 32,
     "referenced_type" : "type-113"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "android::BBinder",
   "name" : "android::BBinder",
   "record_kind" : "class",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 20,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android7BBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -12,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -12,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7BBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7BBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7BBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    },
    {
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IMemory>",
   "name" : "android::BnInterface<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "type-467",
   "self_type" : "type-467",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-52" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_7IMemoryEEE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPiPj"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    },
    {
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IMemoryHeap>",
   "name" : "android::BnInterface<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "type-485",
   "self_type" : "type-485",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-138"
    },
    {
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IResultReceiver>",
   "name" : "android::BnInterface<android::IResultReceiver>",
   "record_kind" : "class",
   "referenced_type" : "type-341",
   "self_type" : "type-341",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-138" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_15IResultReceiverEEE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_15IResultReceiverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IResultReceiver4sendEi"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IResultReceiverEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_15IResultReceiverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_15IResultReceiverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-418"
    },
    {
     "referenced_type" : "type-112"
    }
   ],
   "linker_set_key" : "android::BnInterface<android::IShellCallback>",
   "name" : "android::BnInterface<android::IShellCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-417",
   "self_type" : "type-417",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-418" ],
   "unique_id" : "_ZTSN7android11BnInterfaceINS_14IShellCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_14IShellCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IShellCallback8openFileERKNS_8String16ES3_S3_"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_14IShellCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_14IShellCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_14IShellCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-467"
    }
   ],
   "linker_set_key" : "android::BnMemory",
   "name" : "android::BnMemory",
   "record_kind" : "class",
   "referenced_type" : "type-466",
   "self_type" : "type-466",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "unique_id" : "_ZTSN7android8BnMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPiPj"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BnMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8BnMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8BnMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-485"
    }
   ],
   "linker_set_key" : "android::BnMemoryHeap",
   "name" : "android::BnMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "type-484",
   "self_type" : "type-484",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "unique_id" : "_ZTSN7android12BnMemoryHeapE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-341"
    }
   ],
   "linker_set_key" : "android::BnResultReceiver",
   "name" : "android::BnResultReceiver",
   "record_kind" : "class",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IResultReceiver.h",
   "unique_id" : "_ZTSN7android16BnResultReceiverE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16BnResultReceiverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16BnResultReceiverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16BnResultReceiverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_15IResultReceiverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IResultReceiver4sendEi"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android16BnResultReceiver10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16BnResultReceiverE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_15IResultReceiverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_15IResultReceiverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android16BnResultReceiverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android16BnResultReceiverD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android16BnResultReceiver10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16BnResultReceiverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android16BnResultReceiverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android16BnResultReceiverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-417"
    }
   ],
   "linker_set_key" : "android::BnShellCallback",
   "name" : "android::BnShellCallback",
   "record_kind" : "class",
   "referenced_type" : "type-439",
   "self_type" : "type-439",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IShellCallback.h",
   "unique_id" : "_ZTSN7android15BnShellCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15BnShellCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15BnShellCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15BnShellCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_14IShellCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IShellCallback8openFileERKNS_8String16ES3_S3_"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android15BnShellCallback10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15BnShellCallbackE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_14IShellCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_14IShellCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android15BnShellCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android15BnShellCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android15BnShellCallback10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15BnShellCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android15BnShellCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android15BnShellCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-19"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-350"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 64,
     "referenced_type" : "type-177"
    },
    {
     "access" : "private",
     "field_name" : "mAlive",
     "field_offset" : 96,
     "referenced_type" : "type-196"
    },
    {
     "access" : "private",
     "field_name" : "mObitsSent",
     "field_offset" : 128,
     "referenced_type" : "type-196"
    },
    {
     "access" : "private",
     "field_name" : "mObituaries",
     "field_offset" : 160,
     "referenced_type" : "type-351"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 192,
     "referenced_type" : "type-353"
    },
    {
     "access" : "private",
     "field_name" : "mConstantData",
     "field_offset" : 352,
     "referenced_type" : "type-203"
    },
    {
     "access" : "private",
     "field_name" : "mDescriptorCache",
     "field_offset" : 384,
     "referenced_type" : "type-186"
    },
    {
     "access" : "private",
     "field_name" : "mTrackedUid",
     "field_offset" : 416,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "android::BpBinder",
   "name" : "android::BpBinder",
   "record_kind" : "class",
   "referenced_type" : "type-349",
   "self_type" : "type-349",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/binder/include/binder/BpBinder.h",
   "unique_id" : "_ZTSN7android8BpBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 56,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BpBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZNK7android8BpBinder22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android8BpBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8BpBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BpBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8BpBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8BpBinder20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -56,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8BpBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8BpBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8BpBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8BpBinder10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8BpBinder15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8BpBinder20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "recipient",
     "referenced_type" : "type-428"
    },
    {
     "field_name" : "cookie",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::BpBinder::Obituary",
   "name" : "android::BpBinder::Obituary",
   "referenced_type" : "type-687",
   "self_type" : "type-687",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/include/binder/BpBinder.h",
   "unique_id" : "_ZTSN7android8BpBinder8ObituaryE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mObjects",
     "referenced_type" : "type-354"
    }
   ],
   "linker_set_key" : "android::BpBinder::ObjectManager",
   "name" : "android::BpBinder::ObjectManager",
   "record_kind" : "class",
   "referenced_type" : "type-353",
   "self_type" : "type-353",
   "size" : 20,
   "source_file" : "/frameworks/native/libs/binder/include/binder/BpBinder.h",
   "unique_id" : "_ZTSN7android8BpBinder13ObjectManagerE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "object",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "cleanupCookie",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "func",
     "field_offset" : 64,
     "referenced_type" : "type-356"
    }
   ],
   "linker_set_key" : "android::BpBinder::ObjectManager::entry_t",
   "name" : "android::BpBinder::ObjectManager::entry_t",
   "referenced_type" : "type-355",
   "self_type" : "type-355",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/BpBinder.h",
   "unique_id" : "_ZTSN7android8BpBinder13ObjectManager7entry_tE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IMemory>",
   "name" : "android::BpInterface<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "type-1126",
   "self_type" : "type-1126",
   "size" : 28,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-52" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_7IMemoryEEE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7IMemory22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPiPj"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IMemoryHeap>",
   "name" : "android::BpInterface<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "type-1124",
   "self_type" : "type-1124",
   "size" : 28,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_11IMemoryHeapEEE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11IMemoryHeap22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-138"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IResultReceiver>",
   "name" : "android::BpInterface<android::IResultReceiver>",
   "record_kind" : "class",
   "referenced_type" : "type-360",
   "self_type" : "type-360",
   "size" : 28,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-138" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_15IResultReceiverEEE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IResultReceiverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android15IResultReceiver22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IResultReceiver4sendEi"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-385"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IServiceManager>",
   "name" : "android::BpInterface<android::IServiceManager>",
   "record_kind" : "class",
   "referenced_type" : "type-384",
   "self_type" : "type-384",
   "size" : 28,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-385" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_15IServiceManagerEEE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IServiceManagerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IServiceManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IServiceManagerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IServiceManagerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android15IServiceManager22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IServiceManager10getServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IServiceManager12checkServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager10addServiceERKNS_8String16ERKNS_2spINS_7IBinderEEEbi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager12listServicesEi"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IServiceManagerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_15IServiceManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_15IServiceManagerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IServiceManagerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_15IServiceManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_15IServiceManagerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-418"
    },
    {
     "referenced_type" : "type-361"
    }
   ],
   "linker_set_key" : "android::BpInterface<android::IShellCallback>",
   "name" : "android::BpInterface<android::IShellCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 28,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-418" ],
   "unique_id" : "_ZTSN7android11BpInterfaceINS_14IShellCallbackEEE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_14IShellCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14IShellCallback22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IShellCallback8openFileERKNS_8String16ES3_S3_"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 32,
     "referenced_type" : "type-362"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-24"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 96,
     "referenced_type" : "type-363"
    }
   ],
   "linker_set_key" : "android::BpRefBase",
   "name" : "android::BpRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-361",
   "self_type" : "type-361",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Binder.h",
   "unique_id" : "_ZTSN7android9BpRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android9BpRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android9BpRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android9BpRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-997"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mSeq",
     "field_offset" : 64,
     "referenced_type" : "type-350"
    },
    {
     "access" : "private",
     "field_name" : "mIndex",
     "field_offset" : 96,
     "referenced_type" : "type-350"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 128,
     "referenced_type" : "type-177"
    },
    {
     "access" : "private",
     "field_name" : "mGlobalState",
     "field_offset" : 160,
     "referenced_type" : "type-993"
    }
   ],
   "linker_set_key" : "android::BufferedTextOutput",
   "name" : "android::BufferedTextOutput",
   "record_kind" : "class",
   "referenced_type" : "type-1033",
   "self_type" : "type-1033",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/BufferedTextOutput.h",
   "unique_id" : "_ZTSN7android18BufferedTextOutputE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android18BufferedTextOutputE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android18BufferedTextOutputD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android18BufferedTextOutputD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android18BufferedTextOutput5printEPKcj"
    },
    {
     "mangled_component_name" : "_ZN7android18BufferedTextOutput10moveIndentEi"
    },
    {
     "mangled_component_name" : "_ZN7android18BufferedTextOutput10pushBundleEv"
    },
    {
     "mangled_component_name" : "_ZN7android18BufferedTextOutput9popBundleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android18BufferedTextOutput10writeLinesERK5iovecj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFrameLines",
     "referenced_type" : "type-154"
    }
   ],
   "linker_set_key" : "android::CallStack",
   "name" : "android::CallStack",
   "record_kind" : "class",
   "referenced_type" : "type-307",
   "self_type" : "type-307",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/CallStack.h",
   "unique_id" : "_ZTSN7android9CallStackE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CallStack::StackDeleter",
   "name" : "android::CallStack::StackDeleter",
   "referenced_type" : "type-311",
   "self_type" : "type-311",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/CallStack.h",
   "unique_id" : "_ZTSN7android9CallStack12StackDeleterE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::CompileTimeAssert<true>",
   "name" : "android::CompileTimeAssert<true>",
   "referenced_type" : "type-814",
   "self_type" : "type-814",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Debug.h",
   "unique_id" : "_ZTSN7android17CompileTimeAssertILb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-542"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-541",
   "self_type" : "type-541",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::FlattenableUtils",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-815",
   "self_type" : "type-815",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "unique_id" : "_ZTSN7android16FlattenableUtilsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-161"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mBytesPerLine",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mSingleLineCutoff",
     "field_offset" : 96,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mAlignment",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mCArrayStyle",
     "field_offset" : 160,
     "referenced_type" : "type-181"
    }
   ],
   "linker_set_key" : "android::HexDump",
   "name" : "android::HexDump",
   "record_kind" : "class",
   "referenced_type" : "type-1009",
   "self_type" : "type-1009",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h",
   "unique_id" : "_ZTSN7android7HexDumpE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::IBinder",
   "name" : "android::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder13isBinderAliveEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder10pingBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder11linkToDeathERKNS_2spINS0_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder13unlinkToDeathERKNS_2wpINS0_14DeathRecipientEEEPvjPS3_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::IBinder::DeathRecipient",
   "name" : "android::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-430",
   "self_type" : "type-430",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipient10binderDiedERKNS_2wpIS0_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "android::IInterface",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "unique_id" : "_ZTSN7android10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "android::IMemory",
   "name" : "android::IMemory",
   "record_kind" : "class",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "unique_id" : "_ZTSN7android7IMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7IMemory22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPiPj"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android7IMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "android::IMemoryHeap",
   "name" : "android::IMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "unique_id" : "_ZTSN7android11IMemoryHeapE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11IMemoryHeap22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11IMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mProcess",
     "referenced_type" : "type-170"
    },
    {
     "access" : "private",
     "field_name" : "mPendingStrongDerefs",
     "field_offset" : 32,
     "referenced_type" : "type-140"
    },
    {
     "access" : "private",
     "field_name" : "mPendingWeakDerefs",
     "field_offset" : 192,
     "referenced_type" : "type-145"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteStrongDerefs",
     "field_offset" : 352,
     "referenced_type" : "type-150"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteWeakDerefs",
     "field_offset" : 512,
     "referenced_type" : "type-145"
    },
    {
     "access" : "private",
     "field_name" : "mIn",
     "field_offset" : 672,
     "referenced_type" : "type-198"
    },
    {
     "access" : "private",
     "field_name" : "mOut",
     "field_offset" : 1152,
     "referenced_type" : "type-198"
    },
    {
     "access" : "private",
     "field_name" : "mLastError",
     "field_offset" : 1632,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mCallingPid",
     "field_offset" : 1664,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mCallingSid",
     "field_offset" : 1696,
     "referenced_type" : "type-156"
    },
    {
     "access" : "private",
     "field_name" : "mCallingUid",
     "field_offset" : 1728,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mWorkSource",
     "field_offset" : 1760,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mPropagateWorkSource",
     "field_offset" : 1792,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mStrictModePolicy",
     "field_offset" : 1824,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mLastTransactionBinderFlags",
     "field_offset" : 1856,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mIPCThreadStateBase",
     "field_offset" : 1888,
     "referenced_type" : "type-208"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 1920,
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "android::IPCThreadState",
   "name" : "android::IPCThreadState",
   "record_kind" : "class",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 244,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IPCThreadState.h",
   "unique_id" : "_ZTSN7android14IPCThreadStateE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "android::IResultReceiver",
   "name" : "android::IResultReceiver",
   "record_kind" : "class",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IResultReceiver.h",
   "unique_id" : "_ZTSN7android15IResultReceiverE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IResultReceiverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IResultReceiverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IResultReceiverD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android15IResultReceiver22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IResultReceiver4sendEi"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IResultReceiverE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android15IResultReceiverD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android15IResultReceiverD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "android::IServiceManager",
   "name" : "android::IServiceManager",
   "record_kind" : "class",
   "referenced_type" : "type-385",
   "self_type" : "type-385",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IServiceManager.h",
   "unique_id" : "_ZTSN7android15IServiceManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IServiceManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android15IServiceManager22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IServiceManager10getServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IServiceManager12checkServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager10addServiceERKNS_8String16ERKNS_2spINS_7IBinderEEEbi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager12listServicesEi"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android15IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android15IServiceManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "android::IShellCallback",
   "name" : "android::IShellCallback",
   "record_kind" : "class",
   "referenced_type" : "type-418",
   "self_type" : "type-418",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IShellCallback.h",
   "unique_id" : "_ZTSN7android14IShellCallbackE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14IShellCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14IShellCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14IShellCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14IShellCallback22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IShellCallback8openFileERKNS_8String16ES3_S3_"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14IShellCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14IShellCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14IShellCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-194"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-186", "type-192" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::wp<android::IBinder>, android::HeapCache::heap_info_t>",
   "name" : "android::KeyedVector<android::wp<android::IBinder>, android::HeapCache::heap_info_t>",
   "record_kind" : "class",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-17", "type-28" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-216"
    }
   ],
   "linker_set_key" : "android::KeyedVector<const void *, android::BpBinder::ObjectManager::entry_t>",
   "name" : "android::KeyedVector<const void *, android::BpBinder::ObjectManager::entry_t>",
   "record_kind" : "class",
   "referenced_type" : "type-354",
   "self_type" : "type-354",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-161", "type-355" ],
   "unique_id" : "_ZTSN7android11KeyedVectorIPKvNS_8BpBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-466"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mOffset",
     "field_offset" : 160,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mHeap",
     "field_offset" : 192,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "android::MemoryBase",
   "name" : "android::MemoryBase",
   "record_kind" : "class",
   "referenced_type" : "type-465",
   "self_type" : "type-465",
   "size" : 36,
   "source_file" : "/frameworks/native/libs/binder/include/binder/MemoryBase.h",
   "unique_id" : "_ZTSN7android10MemoryBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 28,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10MemoryBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10MemoryBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10MemoryBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android10MemoryBase9getMemoryEPiPj"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10MemoryBaseE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10MemoryBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10MemoryBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10MemoryBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10MemoryBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10MemoryBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHeap",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 96,
     "referenced_type" : "type-487"
    }
   ],
   "linker_set_key" : "android::MemoryDealer",
   "name" : "android::MemoryDealer",
   "record_kind" : "class",
   "referenced_type" : "type-490",
   "self_type" : "type-490",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/include/binder/MemoryDealer.h",
   "unique_id" : "_ZTSN7android12MemoryDealerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12MemoryDealerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12MemoryDealerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12MemoryDealerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android12MemoryDealer8allocateEj"
    },
    {
     "mangled_component_name" : "_ZN7android12MemoryDealer10deallocateEj"
    },
    {
     "mangled_component_name" : "_ZNK7android12MemoryDealer4dumpEPKc"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-484"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFD",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mBase",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mDevice",
     "field_offset" : 160,
     "referenced_type" : "type-156"
    },
    {
     "access" : "private",
     "field_name" : "mNeedUnmap",
     "field_offset" : 192,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mOffset",
     "field_offset" : 224,
     "referenced_type" : "type-483"
    }
   ],
   "linker_set_key" : "android::MemoryHeapBase",
   "name" : "android::MemoryHeapBase",
   "record_kind" : "class",
   "referenced_type" : "type-482",
   "self_type" : "type-482",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/MemoryHeapBase.h",
   "unique_id" : "_ZTSN7android14MemoryHeapBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase9getHeapIDEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase7getBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase7getSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase8getFlagsEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase9getOffsetEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 4,
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n16_N7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n16_N7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n28_NK7android14MemoryHeapBase9getHeapIDEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_NK7android14MemoryHeapBase7getBaseEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n36_NK7android14MemoryHeapBase7getSizeEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_NK7android14MemoryHeapBase8getFlagsEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n44_NK7android14MemoryHeapBase9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTvn4_n16_N7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTvn4_n16_N7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-178"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-464"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-463",
   "self_type" : "type-463",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mError",
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 32,
     "referenced_type" : "type-199"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 160,
     "referenced_type" : "type-200"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 192,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 224,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 256,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSorted",
     "field_offset" : 288,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mRequestHeaderPresent",
     "field_offset" : 296,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mWorkSourceRequestHeaderPosition",
     "field_offset" : 320,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 352,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 360,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 368,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 384,
     "referenced_type" : "type-201"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 416,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mOpenAshmemSize",
     "field_offset" : 448,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::Parcel",
   "name" : "android::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 60,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFd",
     "referenced_type" : "type-34"
    },
    {
     "access" : "protected",
     "field_name" : "mData",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "access" : "protected",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "access" : "protected",
     "field_name" : "mMutable",
     "field_offset" : 96,
     "referenced_type" : "type-181"
    }
   ],
   "linker_set_key" : "android::Parcel::Blob",
   "name" : "android::Parcel::Blob",
   "record_kind" : "class",
   "referenced_type" : "type-765",
   "self_type" : "type-765",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel4BlobE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "linker_set_key" : "android::Parcel::FlattenableHelperInterface",
   "name" : "android::Parcel::FlattenableHelperInterface",
   "record_kind" : "class",
   "referenced_type" : "type-767",
   "self_type" : "type-767",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel26FlattenableHelperInterfaceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6Parcel26FlattenableHelperInterfaceE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface16getFlattenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface10getFdCountEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android6Parcel26FlattenableHelperInterface7flattenEPvjPij"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Parcel26FlattenableHelperInterface9unflattenEPKvjPKij"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-765"
    }
   ],
   "linker_set_key" : "android::Parcel::ReadableBlob",
   "name" : "android::Parcel::ReadableBlob",
   "record_kind" : "class",
   "referenced_type" : "type-828",
   "self_type" : "type-828",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel12ReadableBlobE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-765"
    }
   ],
   "linker_set_key" : "android::Parcel::WritableBlob",
   "name" : "android::Parcel::WritableBlob",
   "record_kind" : "class",
   "referenced_type" : "type-832",
   "self_type" : "type-832",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h",
   "unique_id" : "_ZTSN7android6Parcel12WritableBlobE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::Parcelable",
   "name" : "android::Parcelable",
   "record_kind" : "class",
   "referenced_type" : "type-753",
   "self_type" : "type-753",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcelable.h",
   "unique_id" : "_ZTSN7android10ParcelableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10ParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverName",
     "field_offset" : 32,
     "referenced_type" : "type-155"
    },
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 128,
     "referenced_type" : "type-174"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 160,
     "referenced_type" : "type-175"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 192,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 224,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 256,
     "referenced_type" : "type-176"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 320,
     "referenced_type" : "type-177"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 352,
     "referenced_type" : "type-179"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 512,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 544,
     "referenced_type" : "type-182"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 576,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 608,
     "referenced_type" : "type-193"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 768,
     "referenced_type" : "type-155"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 800,
     "referenced_type" : "type-181"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 832,
     "referenced_type" : "type-196"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 864,
     "referenced_type" : "type-197"
    }
   ],
   "linker_set_key" : "android::ProcessState",
   "name" : "android::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 120,
   "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
   "unique_id" : "_ZTSN7android12ProcessStateE",
   "vtable_components" :
   [
    {
     "component_value" : 112,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -112,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -112,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "refs",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::ProcessState::handle_entry",
   "name" : "android::ProcessState::handle_entry",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
   "unique_id" : "_ZTSN7android12ProcessState12handle_entryE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-594"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-593",
   "self_type" : "type-593",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-594"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-634",
   "self_type" : "type-634",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-1078",
   "self_type" : "type-1078",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-1032",
   "self_type" : "type-1032",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-195" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEE10do_compareEPKvS9_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "name" : "android::SortedVector<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "record_kind" : "class",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-217" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEE7do_copyEPvS3_j"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEE8do_splatEPvS3_j"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEE15do_move_forwardEPvS3_j"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEE16do_move_backwardEPvS3_j"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEE10do_compareES3_S3_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-187"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-156"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::TextOutput",
   "name" : "android::TextOutput",
   "record_kind" : "class",
   "referenced_type" : "type-997",
   "self_type" : "type-997",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h",
   "unique_id" : "_ZTSN7android10TextOutputE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10TextOutputE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10TextOutputD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10TextOutputD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput5printEPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput10moveIndentEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput10pushBundleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput9popBundleEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTO",
     "referenced_type" : "type-999"
    }
   ],
   "linker_set_key" : "android::TextOutput::Bundle",
   "name" : "android::TextOutput::Bundle",
   "record_kind" : "class",
   "referenced_type" : "type-998",
   "self_type" : "type-998",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h",
   "unique_id" : "_ZTSN7android10TextOutput6BundleE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-20"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "type-845"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-177"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "type-541"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "type-655"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "type-655"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "type-842"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-844",
   "self_type" : "type-844",
   "size" : 44,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCode",
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::TypeCode",
   "name" : "android::TypeCode",
   "record_kind" : "class",
   "referenced_type" : "type-1005",
   "self_type" : "type-1005",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/TextOutput.h",
   "unique_id" : "_ZTSN7android8TypeCodeE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<android::BBinder *>",
   "name" : "android::Vector<android::BBinder *>",
   "record_kind" : "class",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-111" ],
   "unique_id" : "_ZTSN7android6VectorIPNS_7BBinderEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_7BBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7BBinderEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7BBinderEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7BBinderEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7BBinderEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7BBinderEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7BBinderEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7BBinderEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7BBinderEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<android::BpBinder::Obituary>",
   "name" : "android::Vector<android::BpBinder::Obituary>",
   "record_kind" : "class",
   "referenced_type" : "type-937",
   "self_type" : "type-937",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android6VectorINS_8BpBinder8ObituaryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8BpBinder8ObituaryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8BpBinder8ObituaryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8BpBinder8ObituaryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8BpBinder8ObituaryEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8BpBinder8ObituaryEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8BpBinder8ObituaryEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8BpBinder8ObituaryEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8BpBinder8ObituaryEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8BpBinder8ObituaryEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<android::ProcessState::handle_entry>",
   "name" : "android::Vector<android::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android6VectorINS_12ProcessState12handle_entryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_12ProcessState12handle_entryEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_12ProcessState12handle_entryEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_12ProcessState12handle_entryEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_12ProcessState12handle_entryEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_12ProcessState12handle_entryEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_12ProcessState12handle_entryEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<android::RefBase *>",
   "name" : "android::Vector<android::RefBase *>",
   "record_kind" : "class",
   "referenced_type" : "type-150",
   "self_type" : "type-150",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-116" ],
   "unique_id" : "_ZTSN7android6VectorIPNS_7RefBaseEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_7RefBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<android::RefBase::weakref_type *>",
   "name" : "android::Vector<android::RefBase::weakref_type *>",
   "record_kind" : "class",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android6VectorIPNS_7RefBase12weakref_typeEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_7RefBase12weakref_typeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBase12weakref_typeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBase12weakref_typeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<android::String16>",
   "name" : "android::Vector<android::String16>",
   "record_kind" : "class",
   "referenced_type" : "type-236",
   "self_type" : "type-236",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-186" ],
   "unique_id" : "_ZTSN7android6VectorINS_8String16EEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8String16EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8String16EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8String16EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8String16EE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8String16EE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8String16EE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8String16EE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8String16EE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8String16EE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<android::String8>",
   "name" : "android::Vector<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-155" ],
   "unique_id" : "_ZTSN7android6VectorINS_7String8EEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<android::sp<android::BufferedTextOutput::BufferState> >",
   "name" : "android::Vector<android::sp<android::BufferedTextOutput::BufferState> >",
   "record_kind" : "class",
   "referenced_type" : "type-1049",
   "self_type" : "type-1049",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-992" ],
   "unique_id" : "_ZTSN7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_18BufferedTextOutput11BufferStateEEEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<int>",
   "name" : "android::Vector<int>",
   "record_kind" : "class",
   "referenced_type" : "type-1043",
   "self_type" : "type-1043",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN7android6VectorIiEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIiEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIiED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIiED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::Vector<unsigned int>",
   "name" : "android::Vector<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-932",
   "self_type" : "type-932",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android6VectorIjEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIjEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIjED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIjED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIjE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIjE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIjE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIjE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIjE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIjE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 20,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<android::String16, android::sp<android::IBinder> >",
   "name" : "android::aggregate_traits<android::String16, android::sp<android::IBinder> >",
   "referenced_type" : "type-1934",
   "self_type" : "type-1934",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-186", "type-192" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsINS_8String16ENS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<android::wp<android::IBinder>, android::HeapCache::heap_info_t>",
   "name" : "android::aggregate_traits<android::wp<android::IBinder>, android::HeapCache::heap_info_t>",
   "referenced_type" : "type-105",
   "self_type" : "type-105",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17", "type-106" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<const void *, android::BpBinder::ObjectManager::entry_t>",
   "name" : "android::aggregate_traits<const void *, android::BpBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-990",
   "self_type" : "type-990",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-161", "type-355" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsIPKvNS_8BpBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::base::DefaultCloser",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "type-545",
   "self_type" : "type-545",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "unique_id" : "_ZTSN7android4base13DefaultCloserE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "type-545" ],
   "unique_id" : "_ZTSN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-155"
    }
   ],
   "linker_set_key" : "android::binder::Status",
   "name" : "android::binder::Status",
   "record_kind" : "class",
   "referenced_type" : "type-772",
   "self_type" : "type-772",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Status.h",
   "unique_id" : "_ZTSN7android6binder6StatusE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mContent",
     "field_offset" : 32,
     "referenced_type" : "type-647"
    }
   ],
   "linker_set_key" : "android::binder::Value",
   "name" : "android::binder::Value",
   "record_kind" : "class",
   "referenced_type" : "type-646",
   "self_type" : "type-646",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Value.h",
   "unique_id" : "_ZTSN7android6binder5ValueE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6binder5ValueE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6binder5ValueD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6binder5ValueD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-186"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "type-192"
    }
   ],
   "linker_set_key" : "android::key_value_pair_t<android::String16, android::sp<android::IBinder> >",
   "name" : "android::key_value_pair_t<android::String16, android::sp<android::IBinder> >",
   "referenced_type" : "type-1870",
   "self_type" : "type-1870",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-186", "type-192" ],
   "unique_id" : "_ZTSN7android16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t>",
   "name" : "android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t>",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17", "type-27" ],
   "unique_id" : "_ZTSN7android16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-161"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "type-355"
    }
   ],
   "linker_set_key" : "android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t>",
   "name" : "android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-901",
   "self_type" : "type-901",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-161", "type-355" ],
   "unique_id" : "_ZTSN7android16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-753"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFd",
     "field_offset" : 32,
     "referenced_type" : "type-544"
    }
   ],
   "linker_set_key" : "android::os::ParcelFileDescriptor",
   "name" : "android::os::ParcelFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "type-1815",
   "self_type" : "type-1815",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/ParcelFileDescriptor.h",
   "unique_id" : "_ZTSN7android2os20ParcelFileDescriptorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android2os20ParcelFileDescriptorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android2os20ParcelFileDescriptorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android2os20ParcelFileDescriptorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android2os20ParcelFileDescriptor13writeToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android2os20ParcelFileDescriptor14readFromParcelEPKNS_6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-753"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBoolMap",
     "field_offset" : 32,
     "referenced_type" : "type-794"
    },
    {
     "access" : "private",
     "field_name" : "mIntMap",
     "field_offset" : 128,
     "referenced_type" : "type-795"
    },
    {
     "access" : "private",
     "field_name" : "mLongMap",
     "field_offset" : 224,
     "referenced_type" : "type-796"
    },
    {
     "access" : "private",
     "field_name" : "mDoubleMap",
     "field_offset" : 320,
     "referenced_type" : "type-797"
    },
    {
     "access" : "private",
     "field_name" : "mStringMap",
     "field_offset" : 416,
     "referenced_type" : "type-798"
    },
    {
     "access" : "private",
     "field_name" : "mBoolVectorMap",
     "field_offset" : 512,
     "referenced_type" : "type-799"
    },
    {
     "access" : "private",
     "field_name" : "mIntVectorMap",
     "field_offset" : 608,
     "referenced_type" : "type-800"
    },
    {
     "access" : "private",
     "field_name" : "mLongVectorMap",
     "field_offset" : 704,
     "referenced_type" : "type-801"
    },
    {
     "access" : "private",
     "field_name" : "mDoubleVectorMap",
     "field_offset" : 800,
     "referenced_type" : "type-802"
    },
    {
     "access" : "private",
     "field_name" : "mStringVectorMap",
     "field_offset" : 896,
     "referenced_type" : "type-803"
    },
    {
     "access" : "private",
     "field_name" : "mPersistableBundleMap",
     "field_offset" : 992,
     "referenced_type" : "type-804"
    }
   ],
   "linker_set_key" : "android::os::PersistableBundle",
   "name" : "android::os::PersistableBundle",
   "record_kind" : "class",
   "referenced_type" : "type-793",
   "self_type" : "type-793",
   "size" : 136,
   "source_file" : "/frameworks/native/libs/binder/include/binder/PersistableBundle.h",
   "unique_id" : "_ZTSN7android2os17PersistableBundleE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android2os17PersistableBundleE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android2os17PersistableBundleD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android2os17PersistableBundleD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android2os17PersistableBundle13writeToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android2os17PersistableBundle14readFromParcelEPKNS_6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "android::sp<android::BBinder>",
   "name" : "android::sp<android::BBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-112" ],
   "unique_id" : "_ZTSN7android2spINS_7BBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "android::sp<android::BpMemoryHeap>",
   "name" : "android::sp<android::BpMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-75" ],
   "unique_id" : "_ZTSN7android2spINS_12BpMemoryHeapEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-993"
    }
   ],
   "linker_set_key" : "android::sp<android::BufferedTextOutput::BufferState>",
   "name" : "android::sp<android::BufferedTextOutput::BufferState>",
   "record_kind" : "class",
   "referenced_type" : "type-992",
   "self_type" : "type-992",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-995" ],
   "unique_id" : "_ZTSN7android2spINS_18BufferedTextOutput11BufferStateEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "android::sp<android::HeapCache>",
   "name" : "android::sp<android::HeapCache>",
   "record_kind" : "class",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-70" ],
   "unique_id" : "_ZTSN7android2spINS_9HeapCacheEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-429"
    }
   ],
   "linker_set_key" : "android::sp<android::IBinder::DeathRecipient>",
   "name" : "android::sp<android::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-925",
   "self_type" : "type-925",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-430" ],
   "unique_id" : "_ZTSN7android2spINS_7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "android::sp<android::IBinder>",
   "name" : "android::sp<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN7android2spINS_7IBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-426"
    }
   ],
   "linker_set_key" : "android::sp<android::IInterface>",
   "name" : "android::sp<android::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-40" ],
   "unique_id" : "_ZTSN7android2spINS_10IInterfaceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-51"
    }
   ],
   "linker_set_key" : "android::sp<android::IMemory>",
   "name" : "android::sp<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-52" ],
   "unique_id" : "_ZTSN7android2spINS_7IMemoryEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "android::sp<android::IMemoryHeap>",
   "name" : "android::sp<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSN7android2spINS_11IMemoryHeapEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-137"
    }
   ],
   "linker_set_key" : "android::sp<android::IResultReceiver>",
   "name" : "android::sp<android::IResultReceiver>",
   "record_kind" : "class",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-138" ],
   "unique_id" : "_ZTSN7android2spINS_15IResultReceiverEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-397"
    }
   ],
   "linker_set_key" : "android::sp<android::IServiceManager>",
   "name" : "android::sp<android::IServiceManager>",
   "record_kind" : "class",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-385" ],
   "unique_id" : "_ZTSN7android2spINS_15IServiceManagerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-452"
    }
   ],
   "linker_set_key" : "android::sp<android::IShellCallback>",
   "name" : "android::sp<android::IShellCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-451",
   "self_type" : "type-451",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-418" ],
   "unique_id" : "_ZTSN7android2spINS_14IShellCallbackEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-510"
    }
   ],
   "linker_set_key" : "android::sp<android::MemoryDealer>",
   "name" : "android::sp<android::MemoryDealer>",
   "record_kind" : "class",
   "referenced_type" : "type-509",
   "self_type" : "type-509",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-490" ],
   "unique_id" : "_ZTSN7android2spINS_12MemoryDealerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "android::sp<android::ProcessState>",
   "name" : "android::sp<android::ProcessState>",
   "record_kind" : "class",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-173" ],
   "unique_id" : "_ZTSN7android2spINS_12ProcessStateEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-843"
    }
   ],
   "linker_set_key" : "android::sp<android::Thread>",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "type-842",
   "self_type" : "type-842",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-844" ],
   "unique_id" : "_ZTSN7android2spINS_6ThreadEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::BBinder *>",
   "name" : "android::trait_pointer<android::BBinder *>",
   "referenced_type" : "type-331",
   "self_type" : "type-331",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-111" ],
   "unique_id" : "_ZTSN7android13trait_pointerIPNS_7BBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::BpBinder::Obituary>",
   "name" : "android::trait_pointer<android::BpBinder::Obituary>",
   "referenced_type" : "type-985",
   "self_type" : "type-985",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_8BpBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::BpBinder::ObjectManager::entry_t>",
   "name" : "android::trait_pointer<android::BpBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-984",
   "self_type" : "type-984",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-355" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_8BpBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::HeapCache::heap_info_t>",
   "name" : "android::trait_pointer<android::HeapCache::heap_info_t>",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-99" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_9HeapCache11heap_info_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::ProcessState::handle_entry>",
   "name" : "android::trait_pointer<android::ProcessState::handle_entry>",
   "referenced_type" : "type-1928",
   "self_type" : "type-1928",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::RefBase *>",
   "name" : "android::trait_pointer<android::RefBase *>",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-116" ],
   "unique_id" : "_ZTSN7android13trait_pointerIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::RefBase::weakref_type *>",
   "name" : "android::trait_pointer<android::RefBase::weakref_type *>",
   "referenced_type" : "type-332",
   "self_type" : "type-332",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android13trait_pointerIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::String16>",
   "name" : "android::trait_pointer<android::String16>",
   "referenced_type" : "type-849",
   "self_type" : "type-849",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-186" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "referenced_type" : "type-1929",
   "self_type" : "type-1929",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1870" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "referenced_type" : "type-96",
   "self_type" : "type-96",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_pointer<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-982",
   "self_type" : "type-982",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-901" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::sp<android::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_pointer<android::sp<android::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-1058",
   "self_type" : "type-1058",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-992" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_2spINS_18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::sp<android::IBinder> >",
   "name" : "android::trait_pointer<android::sp<android::IBinder> >",
   "referenced_type" : "type-1930",
   "self_type" : "type-1930",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-192" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::wp<android::IBinder> >",
   "name" : "android::trait_pointer<android::wp<android::IBinder> >",
   "referenced_type" : "type-97",
   "self_type" : "type-97",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_2wpINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<const void *>",
   "name" : "android::trait_pointer<const void *>",
   "referenced_type" : "type-983",
   "self_type" : "type-983",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-161" ],
   "unique_id" : "_ZTSN7android13trait_pointerIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<int>",
   "name" : "android::trait_pointer<int>",
   "referenced_type" : "type-1951",
   "self_type" : "type-1951",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN7android13trait_pointerIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::BBinder *>",
   "name" : "android::trait_trivial_copy<android::BBinder *>",
   "referenced_type" : "type-324",
   "self_type" : "type-324",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-111" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIPNS_7BBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::BpBinder::Obituary>",
   "name" : "android::trait_trivial_copy<android::BpBinder::Obituary>",
   "referenced_type" : "type-977",
   "self_type" : "type-977",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_8BpBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::BpBinder::ObjectManager::entry_t>",
   "name" : "android::trait_trivial_copy<android::BpBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-974",
   "self_type" : "type-974",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-355" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_8BpBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::HeapCache::heap_info_t>",
   "name" : "android::trait_trivial_copy<android::HeapCache::heap_info_t>",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-89" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_9HeapCache11heap_info_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::ProcessState::handle_entry>",
   "name" : "android::trait_trivial_copy<android::ProcessState::handle_entry>",
   "referenced_type" : "type-1922",
   "self_type" : "type-1922",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::RefBase *>",
   "name" : "android::trait_trivial_copy<android::RefBase *>",
   "referenced_type" : "type-326",
   "self_type" : "type-326",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-116" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::RefBase::weakref_type *>",
   "name" : "android::trait_trivial_copy<android::RefBase::weakref_type *>",
   "referenced_type" : "type-325",
   "self_type" : "type-325",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::String16>",
   "name" : "android::trait_trivial_copy<android::String16>",
   "referenced_type" : "type-848",
   "self_type" : "type-848",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-186" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "referenced_type" : "type-1924",
   "self_type" : "type-1924",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1870" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-976",
   "self_type" : "type-976",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-901" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::sp<android::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_trivial_copy<android::sp<android::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-1056",
   "self_type" : "type-1056",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-992" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_2spINS_18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::sp<android::IBinder> >",
   "name" : "android::trait_trivial_copy<android::sp<android::IBinder> >",
   "referenced_type" : "type-1923",
   "self_type" : "type-1923",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-192" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::wp<android::IBinder> >",
   "name" : "android::trait_trivial_copy<android::wp<android::IBinder> >",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_2wpINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-859",
   "self_type" : "type-859",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-181" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-864",
   "self_type" : "type-864",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<const void *>",
   "name" : "android::trait_trivial_copy<const void *>",
   "referenced_type" : "type-973",
   "self_type" : "type-973",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-161" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-852",
   "self_type" : "type-852",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-675" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-749",
   "self_type" : "type-749",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-347" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-882",
   "self_type" : "type-882",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-1019",
   "self_type" : "type-1019",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-176" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-890",
   "self_type" : "type-890",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-483" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-873",
   "self_type" : "type-873",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-871" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-868",
   "self_type" : "type-868",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-62" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-886",
   "self_type" : "type-886",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-895",
   "self_type" : "type-895",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-893" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-878",
   "self_type" : "type-878",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-855",
   "self_type" : "type-855",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::BBinder *>",
   "name" : "android::trait_trivial_ctor<android::BBinder *>",
   "referenced_type" : "type-318",
   "self_type" : "type-318",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-111" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIPNS_7BBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::BpBinder::Obituary>",
   "name" : "android::trait_trivial_ctor<android::BpBinder::Obituary>",
   "referenced_type" : "type-968",
   "self_type" : "type-968",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_8BpBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::BpBinder::ObjectManager::entry_t>",
   "name" : "android::trait_trivial_ctor<android::BpBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-967",
   "self_type" : "type-967",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-355" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_8BpBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::HeapCache::heap_info_t>",
   "name" : "android::trait_trivial_ctor<android::HeapCache::heap_info_t>",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_9HeapCache11heap_info_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::ProcessState::handle_entry>",
   "name" : "android::trait_trivial_ctor<android::ProcessState::handle_entry>",
   "referenced_type" : "type-1916",
   "self_type" : "type-1916",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::RefBase *>",
   "name" : "android::trait_trivial_ctor<android::RefBase *>",
   "referenced_type" : "type-320",
   "self_type" : "type-320",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-116" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::RefBase::weakref_type *>",
   "name" : "android::trait_trivial_ctor<android::RefBase::weakref_type *>",
   "referenced_type" : "type-319",
   "self_type" : "type-319",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::String16>",
   "name" : "android::trait_trivial_ctor<android::String16>",
   "referenced_type" : "type-846",
   "self_type" : "type-846",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-186" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "referenced_type" : "type-1917",
   "self_type" : "type-1917",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1870" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-965",
   "self_type" : "type-965",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-901" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::sp<android::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_trivial_ctor<android::sp<android::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-991",
   "self_type" : "type-991",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-992" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_2spINS_18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::sp<android::IBinder> >",
   "name" : "android::trait_trivial_ctor<android::sp<android::IBinder> >",
   "referenced_type" : "type-1918",
   "self_type" : "type-1918",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-192" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::wp<android::IBinder> >",
   "name" : "android::trait_trivial_ctor<android::wp<android::IBinder> >",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_2wpINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-857",
   "self_type" : "type-857",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-181" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-861",
   "self_type" : "type-861",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<const void *>",
   "name" : "android::trait_trivial_ctor<const void *>",
   "referenced_type" : "type-966",
   "self_type" : "type-966",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-161" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-820",
   "self_type" : "type-820",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-675" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-346",
   "self_type" : "type-346",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-347" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-880",
   "self_type" : "type-880",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-897",
   "self_type" : "type-897",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-176" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-888",
   "self_type" : "type-888",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-483" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-870",
   "self_type" : "type-870",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-871" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-866",
   "self_type" : "type-866",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-62" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-884",
   "self_type" : "type-884",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-1111",
   "self_type" : "type-1111",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-892",
   "self_type" : "type-892",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-893" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-876",
   "self_type" : "type-876",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-851",
   "self_type" : "type-851",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::BBinder *>",
   "name" : "android::trait_trivial_dtor<android::BBinder *>",
   "referenced_type" : "type-321",
   "self_type" : "type-321",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-111" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIPNS_7BBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::BpBinder::Obituary>",
   "name" : "android::trait_trivial_dtor<android::BpBinder::Obituary>",
   "referenced_type" : "type-972",
   "self_type" : "type-972",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_8BpBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::BpBinder::ObjectManager::entry_t>",
   "name" : "android::trait_trivial_dtor<android::BpBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-970",
   "self_type" : "type-970",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-355" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_8BpBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::HeapCache::heap_info_t>",
   "name" : "android::trait_trivial_dtor<android::HeapCache::heap_info_t>",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-85" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_9HeapCache11heap_info_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::ProcessState::handle_entry>",
   "name" : "android::trait_trivial_dtor<android::ProcessState::handle_entry>",
   "referenced_type" : "type-1919",
   "self_type" : "type-1919",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::RefBase *>",
   "name" : "android::trait_trivial_dtor<android::RefBase *>",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-116" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::RefBase::weakref_type *>",
   "name" : "android::trait_trivial_dtor<android::RefBase::weakref_type *>",
   "referenced_type" : "type-322",
   "self_type" : "type-322",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::String16>",
   "name" : "android::trait_trivial_dtor<android::String16>",
   "referenced_type" : "type-847",
   "self_type" : "type-847",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-186" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "referenced_type" : "type-1921",
   "self_type" : "type-1921",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1870" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "referenced_type" : "type-86",
   "self_type" : "type-86",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-971",
   "self_type" : "type-971",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-901" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::sp<android::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_trivial_dtor<android::sp<android::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-1055",
   "self_type" : "type-1055",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-992" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_2spINS_18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::sp<android::IBinder> >",
   "name" : "android::trait_trivial_dtor<android::sp<android::IBinder> >",
   "referenced_type" : "type-1920",
   "self_type" : "type-1920",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-192" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::wp<android::IBinder> >",
   "name" : "android::trait_trivial_dtor<android::wp<android::IBinder> >",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_2wpINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-858",
   "self_type" : "type-858",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-181" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-862",
   "self_type" : "type-862",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<const void *>",
   "name" : "android::trait_trivial_dtor<const void *>",
   "referenced_type" : "type-969",
   "self_type" : "type-969",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-161" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-840",
   "self_type" : "type-840",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-675" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-394",
   "self_type" : "type-394",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-347" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-881",
   "self_type" : "type-881",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-898",
   "self_type" : "type-898",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-176" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-889",
   "self_type" : "type-889",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-483" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-872",
   "self_type" : "type-872",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-871" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-867",
   "self_type" : "type-867",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-62" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-885",
   "self_type" : "type-885",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-894",
   "self_type" : "type-894",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-893" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-877",
   "self_type" : "type-877",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-854",
   "self_type" : "type-854",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::BBinder *>",
   "name" : "android::trait_trivial_move<android::BBinder *>",
   "referenced_type" : "type-327",
   "self_type" : "type-327",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-111" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIPNS_7BBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::BpBinder::Obituary>",
   "name" : "android::trait_trivial_move<android::BpBinder::Obituary>",
   "referenced_type" : "type-981",
   "self_type" : "type-981",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8BpBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::BpBinder::ObjectManager::entry_t>",
   "name" : "android::trait_trivial_move<android::BpBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-979",
   "self_type" : "type-979",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-355" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8BpBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::HeapCache::heap_info_t>",
   "name" : "android::trait_trivial_move<android::HeapCache::heap_info_t>",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-93" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_9HeapCache11heap_info_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::ProcessState::handle_entry>",
   "name" : "android::trait_trivial_move<android::ProcessState::handle_entry>",
   "referenced_type" : "type-1925",
   "self_type" : "type-1925",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::RefBase *>",
   "name" : "android::trait_trivial_move<android::RefBase *>",
   "referenced_type" : "type-330",
   "self_type" : "type-330",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-116" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::RefBase::weakref_type *>",
   "name" : "android::trait_trivial_move<android::RefBase::weakref_type *>",
   "referenced_type" : "type-328",
   "self_type" : "type-328",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String16>",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "type-1127",
   "self_type" : "type-1127",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "template_args" : [ "type-186" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String8>",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "type-1113",
   "self_type" : "type-1113",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "type-155" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_7String8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "referenced_type" : "type-1927",
   "self_type" : "type-1927",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1870" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-980",
   "self_type" : "type-980",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-901" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::sp<android::BufferedTextOutput::BufferState> >",
   "name" : "android::trait_trivial_move<android::sp<android::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-1057",
   "self_type" : "type-1057",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-992" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_2spINS_18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::sp<android::IBinder> >",
   "name" : "android::trait_trivial_move<android::sp<android::IBinder> >",
   "referenced_type" : "type-1926",
   "self_type" : "type-1926",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-192" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::wp<android::IBinder> >",
   "name" : "android::trait_trivial_move<android::wp<android::IBinder> >",
   "referenced_type" : "type-91",
   "self_type" : "type-91",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_2wpINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-860",
   "self_type" : "type-860",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-181" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-865",
   "self_type" : "type-865",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<const void *>",
   "name" : "android::trait_trivial_move<const void *>",
   "referenced_type" : "type-978",
   "self_type" : "type-978",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-161" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-863",
   "self_type" : "type-863",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-675" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-813",
   "self_type" : "type-813",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-347" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-883",
   "self_type" : "type-883",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-1079",
   "self_type" : "type-1079",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-176" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-891",
   "self_type" : "type-891",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-483" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-874",
   "self_type" : "type-874",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-871" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-869",
   "self_type" : "type-869",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-62" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-887",
   "self_type" : "type-887",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-14" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-280",
   "self_type" : "type-280",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-896",
   "self_type" : "type-896",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-893" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-879",
   "self_type" : "type-879",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-856",
   "self_type" : "type-856",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::BBinder *>",
   "name" : "android::traits<android::BBinder *>",
   "referenced_type" : "type-336",
   "self_type" : "type-336",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-111" ],
   "unique_id" : "_ZTSN7android6traitsIPNS_7BBinderEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::BpBinder::Obituary>",
   "name" : "android::traits<android::BpBinder::Obituary>",
   "referenced_type" : "type-989",
   "self_type" : "type-989",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android6traitsINS_8BpBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::BpBinder::ObjectManager::entry_t>",
   "name" : "android::traits<android::BpBinder::ObjectManager::entry_t>",
   "referenced_type" : "type-988",
   "self_type" : "type-988",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-355" ],
   "unique_id" : "_ZTSN7android6traitsINS_8BpBinder13ObjectManager7entry_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::HeapCache::heap_info_t>",
   "name" : "android::traits<android::HeapCache::heap_info_t>",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-103" ],
   "unique_id" : "_ZTSN7android6traitsINS_9HeapCache11heap_info_tEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::ProcessState::handle_entry>",
   "name" : "android::traits<android::ProcessState::handle_entry>",
   "referenced_type" : "type-1931",
   "self_type" : "type-1931",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android6traitsINS_12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::RefBase *>",
   "name" : "android::traits<android::RefBase *>",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-116" ],
   "unique_id" : "_ZTSN7android6traitsIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::RefBase::weakref_type *>",
   "name" : "android::traits<android::RefBase::weakref_type *>",
   "referenced_type" : "type-337",
   "self_type" : "type-337",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android6traitsIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::String16>",
   "name" : "android::traits<android::String16>",
   "referenced_type" : "type-850",
   "self_type" : "type-850",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-186" ],
   "unique_id" : "_ZTSN7android6traitsINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "name" : "android::traits<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "referenced_type" : "type-1932",
   "self_type" : "type-1932",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1870" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "name" : "android::traits<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "referenced_type" : "type-100",
   "self_type" : "type-100",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "name" : "android::traits<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-986",
   "self_type" : "type-986",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-901" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::sp<android::BufferedTextOutput::BufferState> >",
   "name" : "android::traits<android::sp<android::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-1060",
   "self_type" : "type-1060",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-992" ],
   "unique_id" : "_ZTSN7android6traitsINS_2spINS_18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::sp<android::IBinder> >",
   "name" : "android::traits<android::sp<android::IBinder> >",
   "referenced_type" : "type-1933",
   "self_type" : "type-1933",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-192" ],
   "unique_id" : "_ZTSN7android6traitsINS_2spINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::wp<android::IBinder> >",
   "name" : "android::traits<android::wp<android::IBinder> >",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android6traitsINS_2wpINS_7IBinderEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<const void *>",
   "name" : "android::traits<const void *>",
   "referenced_type" : "type-987",
   "self_type" : "type-987",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-161" ],
   "unique_id" : "_ZTSN7android6traitsIPKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<int>",
   "name" : "android::traits<int>",
   "referenced_type" : "type-1952",
   "self_type" : "type-1952",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN7android6traitsIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-126"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::BBinder *>",
   "name" : "android::use_trivial_move<android::BBinder *>",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-111" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIPNS_7BBinderEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-913"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::BpBinder::Obituary>",
   "name" : "android::use_trivial_move<android::BpBinder::Obituary>",
   "referenced_type" : "type-912",
   "self_type" : "type-912",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-687" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_8BpBinder8ObituaryEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1878"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::ProcessState::handle_entry>",
   "name" : "android::use_trivial_move<android::ProcessState::handle_entry>",
   "referenced_type" : "type-1877",
   "self_type" : "type-1877",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-180" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_12ProcessState12handle_entryEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-130"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::RefBase *>",
   "name" : "android::use_trivial_move<android::RefBase *>",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-116" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIPNS_7RefBaseEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-128"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::RefBase::weakref_type *>",
   "name" : "android::use_trivial_move<android::RefBase::weakref_type *>",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-24" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIPNS_7RefBase12weakref_typeEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::String16>",
   "name" : "android::use_trivial_move<android::String16>",
   "referenced_type" : "type-918",
   "self_type" : "type-918",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-186" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_8String16EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1880"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "name" : "android::use_trivial_move<android::key_value_pair_t<android::String16, android::sp<android::IBinder> > >",
   "referenced_type" : "type-1879",
   "self_type" : "type-1879",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1870" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_16key_value_pair_tINS_8String16ENS_2spINS_7IBinderEEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1098"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "name" : "android::use_trivial_move<android::key_value_pair_t<android::wp<android::IBinder>, android::HeapCache::heap_info_t> >",
   "referenced_type" : "type-1097",
   "self_type" : "type-1097",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-16" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_16key_value_pair_tINS_2wpINS_7IBinderEEENS_9HeapCache11heap_info_tEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-911"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "name" : "android::use_trivial_move<android::key_value_pair_t<const void *, android::BpBinder::ObjectManager::entry_t> >",
   "referenced_type" : "type-910",
   "self_type" : "type-910",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-901" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_16key_value_pair_tIPKvNS_8BpBinder13ObjectManager7entry_tEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1062"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<android::sp<android::BufferedTextOutput::BufferState> >",
   "name" : "android::use_trivial_move<android::sp<android::BufferedTextOutput::BufferState> >",
   "referenced_type" : "type-1061",
   "self_type" : "type-1061",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-992" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveINS_2spINS_18BufferedTextOutput11BufferStateEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1936"
    }
   ],
   "linker_set_key" : "android::use_trivial_move<int>",
   "name" : "android::use_trivial_move<int>",
   "referenced_type" : "type-1935",
   "self_type" : "type-1935",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN7android16use_trivial_moveIiEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-429"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::wp<android::IBinder::DeathRecipient>",
   "name" : "android::wp<android::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-430" ],
   "unique_id" : "_ZTSN7android2wpINS_7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-18"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "android::wp<android::IBinder>",
   "name" : "android::wp<android::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-19" ],
   "unique_id" : "_ZTSN7android2wpINS_7IBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-347"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-347"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-535",
   "self_type" : "type-535",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-516"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-529"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-528",
   "self_type" : "type-528",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-523"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-527"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 12,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-199"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-521",
   "self_type" : "type-521",
   "size" : 32,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-530"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-530"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-530"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-530"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-347"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-347"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-534",
   "self_type" : "type-534",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-347"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-347"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-530",
   "self_type" : "type-530",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "type-516"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-515",
   "self_type" : "type-515",
   "size" : 56,
   "source_file" : "/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-63"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-1145",
   "self_type" : "type-1145",
   "size" : 8,
   "source_file" : "/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-659"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-658",
   "self_type" : "type-658",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lock",
     "referenced_type" : "type-1041"
    },
    {
     "field_name" : "has_tls",
     "field_offset" : 32,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "tls",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "thread_store_t",
   "name" : "thread_store_t",
   "referenced_type" : "type-1040",
   "self_type" : "type-1040",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/threads.h",
   "unique_id" : "thread_store_t"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "referenced_type" : "type-544",
   "self_type" : "type-805",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::binder::Status &&",
   "name" : "android::binder::Status &&",
   "referenced_type" : "type-772",
   "self_type" : "type-777",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Status.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::os::ParcelFileDescriptor &&",
   "name" : "android::os::ParcelFileDescriptor &&",
   "referenced_type" : "type-1815",
   "self_type" : "type-1817",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/binder/include/binder/ParcelFileDescriptor.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::IBinder::DeathRecipient> &&",
   "name" : "android::sp<android::IBinder::DeathRecipient> &&",
   "referenced_type" : "type-925",
   "self_type" : "type-954",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::IBinder> &&",
   "name" : "android::sp<android::IBinder> &&",
   "referenced_type" : "type-192",
   "self_type" : "type-383",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::IMemory> &&",
   "name" : "android::sp<android::IMemory> &&",
   "referenced_type" : "type-50",
   "self_type" : "type-54",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::IMemoryHeap> &&",
   "name" : "android::sp<android::IMemoryHeap> &&",
   "referenced_type" : "type-37",
   "self_type" : "type-1144",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::IResultReceiver> &&",
   "name" : "android::sp<android::IResultReceiver> &&",
   "referenced_type" : "type-136",
   "self_type" : "type-376",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::IServiceManager> &&",
   "name" : "android::sp<android::IServiceManager> &&",
   "referenced_type" : "type-396",
   "self_type" : "type-403",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::sp<android::IShellCallback> &&",
   "name" : "android::sp<android::IShellCallback> &&",
   "referenced_type" : "type-451",
   "self_type" : "type-450",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
  }
 ]
}
