{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [2]",
   "name" : "ASN1_TEMPLATE_st [2]",
   "referenced_type" : "type-1091",
   "self_type" : "type-1090",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/wrapped_key.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [2]",
   "name" : "ASN1_TEMPLATE_st [2]",
   "referenced_type" : "type-353",
   "self_type" : "type-352",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/wrapped_key.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",
   "referenced_type" : "type-336",
   "self_type" : "type-335",
   "size" : 720,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [36]",
   "name" : "ASN1_TEMPLATE_st [36]",
   "referenced_type" : "type-964",
   "self_type" : "type-963",
   "size" : 720,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [3]",
   "name" : "ASN1_TEMPLATE_st [3]",
   "referenced_type" : "type-329",
   "self_type" : "type-328",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "ASN1_TEMPLATE_st [3]",
   "name" : "ASN1_TEMPLATE_st [3]",

   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_tag_t",
   "name" : "const keymaster_tag_t",
   "referenced_type" : "type-582",
   "self_type" : "type-581",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_tag_t",
   "name" : "const keymaster_tag_t",
   "referenced_type" : "type-73",
   "self_type" : "type-72",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const keymaster_tag_t",
   "name" : "const keymaster_tag_t",
   "referenced_type" : "type-99",
   "self_type" : "type-98",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const nullptr_t",
   "name" : "const nullptr_t",
   "referenced_type" : "type-565",
   "self_type" : "type-564",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-1135",
   "self_type" : "type-1134",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-186",
   "self_type" : "type-185",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-209",
   "self_type" : "type-208",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-230",
   "self_type" : "type-229",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-369",
   "self_type" : "type-368",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-462",
   "self_type" : "type-461",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-466",
   "self_type" : "type-465",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-783",
   "self_type" : "type-782",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-1",
   "self_type" : "type-839",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned char *const",
   "name" : "const unsigned char *const",
   "referenced_type" : "type-848",
   "self_type" : "type-1054",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-136",
   "self_type" : "type-1139",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-74",
   "self_type" : "type-890",
   "source_file" : "/system/keymaster/include/keymaster/serializable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_algorithm_t const[4]",
   "name" : "keymaster_algorithm_t const[4]",
   "referenced_type" : "type-266",
   "self_type" : "type-265",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "keymaster_algorithm_t const[4]",
   "name" : "keymaster_algorithm_t const[4]",
   "referenced_type" : "type-521",
   "self_type" : "type-520",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::ASN1_STRING_Delete",
   "name" : "keymaster::ASN1_STRING_Delete",
   "referenced_type" : "type-942",
   "self_type" : "type-942",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster18ASN1_STRING_DeleteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::ASN1_TYPE_Delete",
   "name" : "keymaster::ASN1_TYPE_Delete",
   "referenced_type" : "type-946",
   "self_type" : "type-946",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster16ASN1_TYPE_DeleteE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "keymaster::AbortOperationRequest",
   "name" : "keymaster::AbortOperationRequest",
   "referenced_type" : "type-804",
   "self_type" : "type-804",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21AbortOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21AbortOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21AbortOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21AbortOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21AbortOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "keymaster::AbortOperationResponse",
   "name" : "keymaster::AbortOperationResponse",
   "referenced_type" : "type-810",
   "self_type" : "type-810",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22AbortOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22AbortOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22AbortOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22AbortOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22AbortOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "random_data",
     "field_offset" : 64,
     "referenced_type" : "type-795"
    }
   ],
   "linker_set_key" : "keymaster::AddEntropyRequest",
   "name" : "keymaster::AddEntropyRequest",
   "referenced_type" : "type-814",
   "self_type" : "type-814",
   "size" : 28,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17AddEntropyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17AddEntropyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AddEntropyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AddEntropyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17AddEntropyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "keymaster::AddEntropyResponse",
   "name" : "keymaster::AddEntropyResponse",
   "referenced_type" : "type-817",
   "self_type" : "type-817",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18AddEntropyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18AddEntropyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18AddEntropyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18AddEntropyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18AddEntropyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1030"
    }
   ],
   "linker_set_key" : "keymaster::AesKey",
   "name" : "keymaster::AesKey",
   "record_kind" : "class",
   "referenced_type" : "type-1039",
   "self_type" : "type-1039",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/aes_key.h",
   "unique_id" : "_ZTSN9keymaster6AesKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6AesKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6AesKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6AesKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1023"
    }
   ],
   "linker_set_key" : "keymaster::AesKeyFactory",
   "name" : "keymaster::AesKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1035",
   "self_type" : "type-1035",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/aes_key.h",
   "unique_id" : "_ZTSN9keymaster13AesKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13AesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AesKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory18key_size_supportedEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory14key_size_bytesEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory13key_size_bitsEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AesKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13AesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster13AesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster13AesKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_",
     "referenced_type" : "type-45"
    },
    {
     "access" : "private",
     "field_name" : "end_",
     "field_offset" : 32,
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "keymaster::ArrayWrapper<keymaster::HmacSharingParameters>",
   "name" : "keymaster::ArrayWrapper<keymaster::HmacSharingParameters>",
   "record_kind" : "class",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSN9keymaster12ArrayWrapperINS_21HmacSharingParametersEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-487"
    }
   ],
   "linker_set_key" : "keymaster::AsymmetricKey",
   "name" : "keymaster::AsymmetricKey",
   "record_kind" : "class",
   "referenced_type" : "type-1041",
   "self_type" : "type-1041",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/asymmetric_key.h",
   "unique_id" : "_ZTSN9keymaster13AsymmetricKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13AsymmetricKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AsymmetricKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13AsymmetricKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster13AsymmetricKey13InternalToEvpEP11evp_pkey_st"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster13AsymmetricKey13EvpToInternalEPK11evp_pkey_st"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-493"
    }
   ],
   "linker_set_key" : "keymaster::AsymmetricKeyFactory",
   "name" : "keymaster::AsymmetricKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1049",
   "self_type" : "type-1049",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/asymmetric_key_factory.h",
   "unique_id" : "_ZTSN9keymaster20AsymmetricKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20AsymmetricKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20AsymmetricKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20AsymmetricKeyFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory18keymaster_key_typeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory12evp_key_typeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-863"
    },
    {
     "field_name" : "attest_params",
     "field_offset" : 128,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::AttestKeyRequest",
   "name" : "keymaster::AttestKeyRequest",
   "referenced_type" : "type-862",
   "self_type" : "type-862",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16AttestKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AttestKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AttestKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AttestKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16AttestKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "certificate_chain",
     "field_offset" : 96,
     "referenced_type" : "type-866"
    }
   ],
   "linker_set_key" : "keymaster::AttestKeyResponse",
   "name" : "keymaster::AttestKeyResponse",
   "referenced_type" : "type-865",
   "self_type" : "type-865",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17AttestKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17AttestKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AttestKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17AttestKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17AttestKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::AttestationRecordContext",
   "name" : "keymaster::AttestationRecordContext",
   "record_kind" : "class",
   "referenced_type" : "type-972",
   "self_type" : "type-972",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster24AttestationRecordContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24AttestationRecordContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24AttestationRecordContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24AttestationRecordContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GetSecurityLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext22VerifyAndCopyDeviceIdsERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GenerateUniqueIdEyRK16keymaster_blob_tbPNS_6BufferE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext21GetVerifiedBootParamsEP16keymaster_blob_tP25keymaster_verified_boot_tPb"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "hw_enforced_",
     "referenced_type" : "type-540"
    },
    {
     "access" : "private",
     "field_name" : "sw_enforced_",
     "field_offset" : 32,
     "referenced_type" : "type-540"
    }
   ],
   "linker_set_key" : "keymaster::AuthProxy",
   "name" : "keymaster::AuthProxy",
   "record_kind" : "class",
   "referenced_type" : "type-716",
   "self_type" : "type-716",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster9AuthProxyE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pos_",
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "auth_set1_",
     "field_offset" : 32,
     "referenced_type" : "type-586"
    },
    {
     "access" : "private",
     "field_name" : "auth_set2_",
     "field_offset" : 64,
     "referenced_type" : "type-586"
    }
   ],
   "linker_set_key" : "keymaster::AuthProxyIterator",
   "name" : "keymaster::AuthProxyIterator",
   "record_kind" : "class",
   "referenced_type" : "type-646",
   "self_type" : "type-646",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster17AuthProxyIteratorE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-51"
    },
    {
     "referenced_type" : "type-149"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "elems_",
     "field_offset" : 96,
     "referenced_type" : "type-143"
    },
    {
     "access" : "private",
     "field_name" : "elems_size_",
     "field_offset" : 128,
     "referenced_type" : "type-146"
    },
    {
     "access" : "private",
     "field_name" : "elems_capacity_",
     "field_offset" : 160,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_",
     "field_offset" : 192,
     "referenced_type" : "type-147"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_size_",
     "field_offset" : 224,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "indirect_data_capacity_",
     "field_offset" : 256,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "error_",
     "field_offset" : 288,
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "keymaster::AuthorizationSet",
   "name" : "keymaster::AuthorizationSet",
   "record_kind" : "class",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster16AuthorizationSetE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16AuthorizationSetE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSetD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSetD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AuthorizationSet14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16AuthorizationSet9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16AuthorizationSet11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "set",
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::AuthorizationSetBuilder",
   "name" : "keymaster::AuthorizationSetBuilder",
   "record_kind" : "class",
   "referenced_type" : "type-593",
   "self_type" : "type-593",
   "size" : 40,
   "source_file" : "/system/keymaster/include/keymaster/authorization_set.h",
   "unique_id" : "_ZTSN9keymaster23AuthorizationSetBuilderE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "purpose",
     "field_offset" : 64,
     "referenced_type" : "type-789"
    },
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-790"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 160,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::BeginOperationRequest",
   "name" : "keymaster::BeginOperationRequest",
   "referenced_type" : "type-788",
   "self_type" : "type-788",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21BeginOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21BeginOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21BeginOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21BeginOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21BeginOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 128,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 192,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::BeginOperationResponse",
   "name" : "keymaster::BeginOperationResponse",
   "referenced_type" : "type-792",
   "self_type" : "type-792",
   "size" : 64,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22BeginOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22BeginOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22BeginOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22BeginOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22BeginOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-51"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "field_offset" : 32,
     "referenced_type" : "type-308"
    },
    {
     "access" : "private",
     "field_name" : "buffer_size_",
     "field_offset" : 64,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "read_position_",
     "field_offset" : 96,
     "referenced_type" : "type-136"
    },
    {
     "access" : "private",
     "field_name" : "write_position_",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::Buffer",
   "name" : "keymaster::Buffer",
   "record_kind" : "class",
   "referenced_type" : "type-795",
   "self_type" : "type-795",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h",
   "unique_id" : "_ZTSN9keymaster6BufferE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6BufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6BufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6BufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6Buffer14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster6Buffer9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster6Buffer11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::CertificateChainDelete",
   "name" : "keymaster::CertificateChainDelete",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster22CertificateChainDeleteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Characteristics_Delete",
   "name" : "keymaster::Characteristics_Delete",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster22Characteristics_DeleteE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params_array",
     "field_offset" : 64,
     "referenced_type" : "type-135"
    }
   ],
   "linker_set_key" : "keymaster::ComputeSharedHmacRequest",
   "name" : "keymaster::ComputeSharedHmacRequest",
   "referenced_type" : "type-893",
   "self_type" : "type-893",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24ComputeSharedHmacRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24ComputeSharedHmacRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ComputeSharedHmacRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ComputeSharedHmacRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24ComputeSharedHmacRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "sharing_check",
     "field_offset" : 96,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "keymaster::ComputeSharedHmacResponse",
   "name" : "keymaster::ComputeSharedHmacResponse",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster25ComputeSharedHmacResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster25ComputeSharedHmacResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25ComputeSharedHmacResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster25ComputeSharedHmacResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster25ComputeSharedHmacResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "os_version",
     "field_offset" : 64,
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "os_patchlevel",
     "field_offset" : 96,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::ConfigureRequest",
   "name" : "keymaster::ConfigureRequest",
   "referenced_type" : "type-874",
   "self_type" : "type-874",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ConfigureRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ConfigureRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ConfigureRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ConfigureRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ConfigureRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "keymaster::ConfigureResponse",
   "name" : "keymaster::ConfigureResponse",
   "referenced_type" : "type-879",
   "self_type" : "type-879",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ConfigureResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ConfigureResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ConfigureResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ConfigureResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ConfigureResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::Key>",
   "name" : "keymaster::DefaultDelete<keymaster::Key>",
   "referenced_type" : "type-486",
   "self_type" : "type-486",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-487" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_3KeyEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster::Operation>",
   "name" : "keymaster::DefaultDelete<keymaster::Operation>",
   "referenced_type" : "type-525",
   "self_type" : "type-525",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-526" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteINS_9OperationEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_algorithm_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_algorithm_t []>",
   "referenced_type" : "type-583",
   "self_type" : "type-583",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-584" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_21keymaster_algorithm_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_blob_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_blob_t []>",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-34" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_16keymaster_blob_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_block_mode_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_block_mode_t []>",
   "referenced_type" : "type-641",
   "self_type" : "type-641",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-642" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_22keymaster_block_mode_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_digest_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_digest_t []>",
   "referenced_type" : "type-754",
   "self_type" : "type-754",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-755" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_key_format_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_key_format_t []>",
   "referenced_type" : "type-836",
   "self_type" : "type-836",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-837" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_22keymaster_key_format_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<keymaster_padding_t []>",
   "name" : "keymaster::DefaultDelete<keymaster_padding_t []>",
   "referenced_type" : "type-681",
   "self_type" : "type-681",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-682" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::DefaultDelete<unsigned char []>",
   "name" : "keymaster::DefaultDelete<unsigned char []>",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN9keymaster13DefaultDeleteIA_hEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "linker_set_key" : "keymaster::DeleteAllKeysRequest",
   "name" : "keymaster::DeleteAllKeysRequest",
   "referenced_type" : "type-845",
   "self_type" : "type-845",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster20DeleteAllKeysRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20DeleteAllKeysRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20DeleteAllKeysRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20DeleteAllKeysRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster20DeleteAllKeysRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "keymaster::DeleteAllKeysResponse",
   "name" : "keymaster::DeleteAllKeysResponse",
   "referenced_type" : "type-850",
   "self_type" : "type-850",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21DeleteAllKeysResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21DeleteAllKeysResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21DeleteAllKeysResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21DeleteAllKeysResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21DeleteAllKeysResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-835"
    }
   ],
   "linker_set_key" : "keymaster::DeleteKeyRequest",
   "name" : "keymaster::DeleteKeyRequest",
   "referenced_type" : "type-834",
   "self_type" : "type-834",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16DeleteKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16DeleteKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16DeleteKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16DeleteKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16DeleteKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "keymaster::DeleteKeyResponse",
   "name" : "keymaster::DeleteKeyResponse",
   "referenced_type" : "type-841",
   "self_type" : "type-841",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17DeleteKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17DeleteKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17DeleteKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17DeleteKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17DeleteKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1049"
    },
    {
     "referenced_type" : "type-1000"
    }
   ],
   "linker_set_key" : "keymaster::EcKeyFactory",
   "name" : "keymaster::EcKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1050",
   "self_type" : "type-1050",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/ec_key_factory.h",
   "unique_id" : "_ZTSN9keymaster12EcKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12EcKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12EcKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12EcKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12EcKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12EcKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster12EcKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster12EcKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buf_",
     "referenced_type" : "type-147"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::Eraser",
   "name" : "keymaster::Eraser",
   "record_kind" : "class",
   "referenced_type" : "type-1031",
   "self_type" : "type-1031",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster6EraserE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx_",
     "referenced_type" : "type-1045"
    }
   ],
   "linker_set_key" : "keymaster::EvpMdCtxCleaner",
   "name" : "keymaster::EvpMdCtxCleaner",
   "record_kind" : "class",
   "referenced_type" : "type-1044",
   "self_type" : "type-1044",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "unique_id" : "_ZTSN9keymaster15EvpMdCtxCleanerE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "additional_params",
     "field_offset" : 64,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "key_format",
     "field_offset" : 384,
     "referenced_type" : "type-829"
    },
    {
     "field_name" : "key_blob",
     "field_offset" : 416,
     "referenced_type" : "type-830"
    }
   ],
   "linker_set_key" : "keymaster::ExportKeyRequest",
   "name" : "keymaster::ExportKeyRequest",
   "referenced_type" : "type-828",
   "self_type" : "type-828",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ExportKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ExportKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ExportKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ExportKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ExportKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_data",
     "field_offset" : 96,
     "referenced_type" : "type-147"
    },
    {
     "field_name" : "key_data_length",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::ExportKeyResponse",
   "name" : "keymaster::ExportKeyResponse",
   "referenced_type" : "type-832",
   "self_type" : "type-832",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ExportKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ExportKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ExportKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ExportKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ExportKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "input",
     "field_offset" : 128,
     "referenced_type" : "type-795"
    },
    {
     "field_name" : "signature",
     "field_offset" : 288,
     "referenced_type" : "type-795"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 448,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::FinishOperationRequest",
   "name" : "keymaster::FinishOperationRequest",
   "referenced_type" : "type-800",
   "self_type" : "type-800",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22FinishOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22FinishOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22FinishOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22FinishOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22FinishOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "output",
     "field_offset" : 96,
     "referenced_type" : "type-795"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 256,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::FinishOperationResponse",
   "name" : "keymaster::FinishOperationResponse",
   "referenced_type" : "type-802",
   "self_type" : "type-802",
   "size" : 72,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23FinishOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23FinishOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23FinishOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23FinishOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23FinishOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_description",
     "field_offset" : 64,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::GenerateKeyRequest",
   "name" : "keymaster::GenerateKeyRequest",
   "referenced_type" : "type-773",
   "self_type" : "type-773",
   "size" : 48,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18GenerateKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18GenerateKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GenerateKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GenerateKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18GenerateKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-778"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 160,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 480,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::GenerateKeyResponse",
   "name" : "keymaster::GenerateKeyResponse",
   "referenced_type" : "type-777",
   "self_type" : "type-777",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster19GenerateKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19GenerateKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19GenerateKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19GenerateKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster19GenerateKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params",
     "field_offset" : 96,
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "keymaster::GetHmacSharingParametersResponse",
   "name" : "keymaster::GetHmacSharingParametersResponse",
   "referenced_type" : "type-887",
   "self_type" : "type-887",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster32GetHmacSharingParametersResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster32GetHmacSharingParametersResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster32GetHmacSharingParametersResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster32GetHmacSharingParametersResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster32GetHmacSharingParametersResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-781"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 128,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::GetKeyCharacteristicsRequest",
   "name" : "keymaster::GetKeyCharacteristicsRequest",
   "referenced_type" : "type-780",
   "self_type" : "type-780",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster28GetKeyCharacteristicsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28GetKeyCharacteristicsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28GetKeyCharacteristicsRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster28GetKeyCharacteristicsRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster28GetKeyCharacteristicsRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "enforced",
     "field_offset" : 96,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 416,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::GetKeyCharacteristicsResponse",
   "name" : "keymaster::GetKeyCharacteristicsResponse",
   "referenced_type" : "type-786",
   "self_type" : "type-786",
   "size" : 92,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29GetKeyCharacteristicsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29GetKeyCharacteristicsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29GetKeyCharacteristicsResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster29GetKeyCharacteristicsResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster29GetKeyCharacteristicsResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "linker_set_key" : "keymaster::GetVersionRequest",
   "name" : "keymaster::GetVersionRequest",
   "referenced_type" : "type-854",
   "self_type" : "type-854",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17GetVersionRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17GetVersionRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17GetVersionRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17GetVersionRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17GetVersionRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "major_ver",
     "field_offset" : 96,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "minor_ver",
     "field_offset" : 104,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "subminor_ver",
     "field_offset" : 112,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "keymaster::GetVersionResponse",
   "name" : "keymaster::GetVersionResponse",
   "referenced_type" : "type-858",
   "self_type" : "type-858",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18GetVersionResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18GetVersionResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GetVersionResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18GetVersionResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18GetVersionResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-51"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "user_id",
     "field_offset" : 128,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "authenticator_id",
     "field_offset" : 192,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "authenticator_type",
     "field_offset" : 256,
     "referenced_type" : "type-151"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 320,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "mac",
     "field_offset" : 384,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "keymaster::HardwareAuthToken",
   "name" : "keymaster::HardwareAuthToken",
   "referenced_type" : "type-150",
   "self_type" : "type-150",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17HardwareAuthTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17HardwareAuthTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17HardwareAuthToken14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17HardwareAuthToken9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17HardwareAuthToken11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1030"
    }
   ],
   "linker_set_key" : "keymaster::HmacKey",
   "name" : "keymaster::HmacKey",
   "record_kind" : "class",
   "referenced_type" : "type-1060",
   "self_type" : "type-1060",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/hmac_key.h",
   "unique_id" : "_ZTSN9keymaster7HmacKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster7HmacKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster7HmacKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster7HmacKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1023"
    }
   ],
   "linker_set_key" : "keymaster::HmacKeyFactory",
   "name" : "keymaster::HmacKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1056",
   "self_type" : "type-1056",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/hmac_key.h",
   "unique_id" : "_ZTSN9keymaster14HmacKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster14HmacKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14HmacKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster14HmacKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory18key_size_supportedEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory14key_size_bytesEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory13key_size_bitsEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster14HmacKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster14HmacKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster14HmacKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster14HmacKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-51"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "seed",
     "field_offset" : 32,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "nonce",
     "field_offset" : 96,
     "referenced_type" : "type-50"
    }
   ],
   "linker_set_key" : "keymaster::HmacSharingParameters",
   "name" : "keymaster::HmacSharingParameters",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 44,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster21HmacSharingParametersE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster21HmacSharingParametersE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParametersD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParametersD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21HmacSharingParameters14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster21HmacSharingParameters9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster21HmacSharingParameters11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-51"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "params_array",
     "field_offset" : 32,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "num_params",
     "field_offset" : 64,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::HmacSharingParametersArray",
   "name" : "keymaster::HmacSharingParametersArray",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26HmacSharingParametersArrayE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26HmacSharingParametersArrayE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArrayD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArrayD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26HmacSharingParametersArray14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26HmacSharingParametersArray9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26HmacSharingParametersArray11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_description",
     "field_offset" : 64,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "key_format",
     "field_offset" : 384,
     "referenced_type" : "type-822"
    },
    {
     "field_name" : "key_data",
     "field_offset" : 416,
     "referenced_type" : "type-147"
    },
    {
     "field_name" : "key_data_length",
     "field_offset" : 448,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::ImportKeyRequest",
   "name" : "keymaster::ImportKeyRequest",
   "referenced_type" : "type-821",
   "self_type" : "type-821",
   "size" : 60,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16ImportKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16ImportKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ImportKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16ImportKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster16ImportKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-825"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 160,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 480,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::ImportKeyResponse",
   "name" : "keymaster::ImportKeyResponse",
   "referenced_type" : "type-824",
   "self_type" : "type-824",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17ImportKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17ImportKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ImportKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17ImportKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17ImportKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "wrapped_key",
     "field_offset" : 64,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "wrapping_key",
     "field_offset" : 128,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "masking_key",
     "field_offset" : 192,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 256,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "password_sid",
     "field_offset" : 576,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "biometric_sid",
     "field_offset" : 640,
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "keymaster::ImportWrappedKeyRequest",
   "name" : "keymaster::ImportWrappedKeyRequest",
   "referenced_type" : "type-898",
   "self_type" : "type-898",
   "size" : 88,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23ImportWrappedKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23ImportWrappedKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23ImportWrappedKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23ImportWrappedKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23ImportWrappedKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 96,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "enforced",
     "field_offset" : 160,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "unenforced",
     "field_offset" : 480,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::ImportWrappedKeyResponse",
   "name" : "keymaster::ImportWrappedKeyResponse",
   "referenced_type" : "type-900",
   "self_type" : "type-900",
   "size" : 100,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24ImportWrappedKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24ImportWrappedKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ImportWrappedKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24ImportWrappedKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24ImportWrappedKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "hw_enforced_",
     "field_offset" : 32,
     "referenced_type" : "type-142"
    },
    {
     "access" : "protected",
     "field_name" : "sw_enforced_",
     "field_offset" : 352,
     "referenced_type" : "type-142"
    },
    {
     "access" : "protected",
     "field_name" : "key_material_",
     "field_offset" : 672,
     "referenced_type" : "type-488"
    },
    {
     "access" : "protected",
     "field_name" : "key_factory_",
     "field_offset" : 736,
     "referenced_type" : "type-491"
    }
   ],
   "linker_set_key" : "keymaster::Key",
   "name" : "keymaster::Key",
   "record_kind" : "class",
   "referenced_type" : "type-487",
   "self_type" : "type-487",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/key.h",
   "unique_id" : "_ZTSN9keymaster3KeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster3KeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster3KeyD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster3Key22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::KeyFactory",
   "name" : "keymaster::KeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/key_factory.h",
   "unique_id" : "_ZTSN9keymaster10KeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster10KeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster10KeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster10KeyFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory22SupportedImportFormatsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory22SupportedExportFormatsEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::KeymasterContext",
   "name" : "keymaster::KeymasterContext",
   "record_kind" : "class",
   "referenced_type" : "type-932",
   "self_type" : "type-932",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_context.h",
   "unique_id" : "_ZTSN9keymaster16KeymasterContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16KeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterContextD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster16KeymasterContext16SetSystemVersionEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext16GetSystemVersionEPjS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext13GetKeyFactoryE21keymaster_algorithm_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext19GetOperationFactoryE21keymaster_algorithm_t19keymaster_purpose_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext22GetSupportedAlgorithmsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext14UpgradeKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPS3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext12ParseKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext9DeleteKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext13DeleteAllKeysEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext13AddRngEntropyEPKhj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster16KeymasterContext18enforcement_policyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext19GenerateAttestationERKNS_3KeyERKNS_16AuthorizationSetEPNS_9UniquePtrI22keymaster_cert_chain_tNS_22CertificateChainDeleteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16KeymasterContext9UnwrapKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEES5_RKNS_16AuthorizationSetES5_PS6_P22keymaster_key_format_tPS3_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "access_time_map_",
     "field_offset" : 32,
     "referenced_type" : "type-923"
    },
    {
     "access" : "private",
     "field_name" : "access_count_map_",
     "field_offset" : 64,
     "referenced_type" : "type-925"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterEnforcement",
   "name" : "keymaster::KeymasterEnforcement",
   "record_kind" : "class",
   "referenced_type" : "type-922",
   "self_type" : "type-922",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_enforcement.h",
   "unique_id" : "_ZTSN9keymaster20KeymasterEnforcementE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20KeymasterEnforcementE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcementD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcementD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement21activation_date_validEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement22expiration_date_passedEy"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement20auth_token_timed_outERK15hw_auth_token_tj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement19get_current_time_msEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement13SecurityLevelEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement22ValidateTokenSignatureERK15hw_auth_token_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcement24GetHmacSharingParametersEPNS_21HmacSharingParametersE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcement17ComputeSharedHmacERKNS_26HmacSharingParametersArrayEPNS_14TKeymasterBlobI16keymaster_blob_tEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster20KeymasterEnforcement19VerifyAuthorizationERKNS_26VerifyAuthorizationRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20KeymasterEnforcement11CreateKeyIdERK20keymaster_key_blob_tPy"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::KeymasterEnforcementContext",
   "name" : "keymaster::KeymasterEnforcementContext",
   "record_kind" : "class",
   "referenced_type" : "type-920",
   "self_type" : "type-920",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_enforcement.h",
   "unique_id" : "_ZTSN9keymaster27KeymasterEnforcementContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27KeymasterEnforcementContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27KeymasterEnforcementContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27KeymasterEnforcementContextD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-51"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "message_version",
     "field_offset" : 32,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterMessage",
   "name" : "keymaster::KeymasterMessage",
   "referenced_type" : "type-152",
   "self_type" : "type-152",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster16KeymasterMessageE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16KeymasterMessageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterMessageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16KeymasterMessageD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable14SerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable9SerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12Serializable11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "error",
     "field_offset" : 64,
     "referenced_type" : "type-562"
    }
   ],
   "linker_set_key" : "keymaster::KeymasterResponse",
   "name" : "keymaster::KeymasterResponse",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17KeymasterResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17KeymasterResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse22NonErrorSerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse17NonErrorSerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::Logger",
   "name" : "keymaster::Logger",
   "record_kind" : "class",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/logger.h",
   "unique_id" : "_ZTSN9keymaster6LoggerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster6LoggerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6LoggerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster6LoggerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster6Logger7log_msgENS0_8LogLevelEPKcSt9__va_list"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Malloc_Delete",
   "name" : "keymaster::Malloc_Delete",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "unique_id" : "_ZTSN9keymaster13Malloc_DeleteE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::OpenSslObjectDeleter<hmac_ctx_st, &HMAC_CTX_free>",
   "name" : "keymaster::OpenSslObjectDeleter<hmac_ctx_st, &HMAC_CTX_free>",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/openssl_utils.h",
   "template_args" : [ "type-159" ],
   "unique_id" : "_ZTSN9keymaster20OpenSslObjectDeleterI11hmac_ctx_stXadL_Z13HMAC_CTX_freeEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "operation_handle_",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    },
    {
     "access" : "private",
     "field_name" : "purpose_",
     "field_offset" : 128,
     "referenced_type" : "type-527"
    },
    {
     "access" : "private",
     "field_name" : "hw_enforced_",
     "field_offset" : 160,
     "referenced_type" : "type-142"
    },
    {
     "access" : "private",
     "field_name" : "sw_enforced_",
     "field_offset" : 480,
     "referenced_type" : "type-142"
    },
    {
     "access" : "private",
     "field_name" : "key_id_",
     "field_offset" : 832,
     "referenced_type" : "type-141"
    }
   ],
   "linker_set_key" : "keymaster::Operation",
   "name" : "keymaster::Operation",
   "record_kind" : "class",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 112,
   "source_file" : "/system/keymaster/include/keymaster/operation.h",
   "unique_id" : "_ZTSN9keymaster9OperationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster9OperationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster9OperationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster9OperationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster9Operation16operation_handleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation5BeginERKNS_16AuthorizationSetEPS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6UpdateERKNS_16AuthorizationSetERKNS_6BufferEPS1_PS4_Pj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation6FinishERKNS_16AuthorizationSetERKNS_6BufferES6_PS1_PS4_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster9Operation5AbortEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::OperationFactory",
   "name" : "keymaster::OperationFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1016",
   "self_type" : "type-1016",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/operation.h",
   "unique_id" : "_ZTSN9keymaster16OperationFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster16OperationFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16OperationFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster16OperationFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory12registry_keyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory15CreateOperationEONS_3KeyERKNS_16AuthorizationSetEP17keymaster_error_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory21SupportedPaddingModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory19SupportedBlockModesEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster16OperationFactory16SupportedDigestsEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "referenced_type" : "type-1078"
    },
    {
     "field_name" : "purpose",
     "field_offset" : 32,
     "referenced_type" : "type-1079"
    }
   ],
   "linker_set_key" : "keymaster::OperationFactory::KeyType",
   "name" : "keymaster::OperationFactory::KeyType",
   "referenced_type" : "type-1077",
   "self_type" : "type-1077",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/operation.h",
   "unique_id" : "_ZTSN9keymaster16OperationFactory7KeyTypeE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-932"
    },
    {
     "access" : "protected",
     "referenced_type" : "type-997"
    },
    {
     "access" : "private",
     "referenced_type" : "type-972"
    },
    {
     "access" : "private",
     "referenced_type" : "type-984"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "rsa_factory_",
     "field_offset" : 128,
     "referenced_type" : "type-1006"
    },
    {
     "access" : "protected",
     "field_name" : "ec_factory_",
     "field_offset" : 160,
     "referenced_type" : "type-1007"
    },
    {
     "access" : "protected",
     "field_name" : "aes_factory_",
     "field_offset" : 192,
     "referenced_type" : "type-1008"
    },
    {
     "access" : "protected",
     "field_name" : "tdes_factory_",
     "field_offset" : 224,
     "referenced_type" : "type-1009"
    },
    {
     "access" : "protected",
     "field_name" : "hmac_factory_",
     "field_offset" : 256,
     "referenced_type" : "type-1010"
    },
    {
     "access" : "protected",
     "field_name" : "os_version_",
     "field_offset" : 288,
     "referenced_type" : "type-136"
    },
    {
     "access" : "protected",
     "field_name" : "os_patchlevel_",
     "field_offset" : 320,
     "referenced_type" : "type-136"
    },
    {
     "access" : "protected",
     "field_name" : "soft_keymaster_enforcement_",
     "field_offset" : 352,
     "referenced_type" : "type-989"
    }
   ],
   "linker_set_key" : "keymaster::PureSoftKeymasterContext",
   "name" : "keymaster::PureSoftKeymasterContext",
   "record_kind" : "class",
   "referenced_type" : "type-1005",
   "self_type" : "type-1005",
   "size" : 112,
   "source_file" : "/system/keymaster/include/keymaster/contexts/pure_soft_keymaster_context.h",
   "unique_id" : "_ZTSN9keymaster24PureSoftKeymasterContextE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24PureSoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24PureSoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24PureSoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24PureSoftKeymasterContext16SetSystemVersionEjj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext16GetSystemVersionEPjS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext13GetKeyFactoryE21keymaster_algorithm_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext19GetOperationFactoryE21keymaster_algorithm_t19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext22GetSupportedAlgorithmsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext14UpgradeKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPS3_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext12ParseKeyBlobERKNS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEPNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext9DeleteKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext13DeleteAllKeysEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext13AddRngEntropyEPKhj"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24PureSoftKeymasterContext18enforcement_policyEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext19GenerateAttestationERKNS_3KeyERKNS_16AuthorizationSetEPNS_9UniquePtrI22keymaster_cert_chain_tNS_22CertificateChainDeleteEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext9UnwrapKeyERKNS_14TKeymasterBlobI20keymaster_key_blob_tEES5_RKNS_16AuthorizationSetES5_PS6_P22keymaster_key_format_tPS3_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24PureSoftKeymasterContext13CreateKeyBlobERKNS_16AuthorizationSetE22keymaster_key_origin_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24PureSoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster24PureSoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster24PureSoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_NK9keymaster24PureSoftKeymasterContext13CreateKeyBlobERKNS_16AuthorizationSetE22keymaster_key_origin_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24PureSoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster24PureSoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N9keymaster24PureSoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GetSecurityLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext22VerifyAndCopyDeviceIdsERKNS_16AuthorizationSetEPS1_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext16GenerateUniqueIdEyRK16keymaster_blob_tbPNS_6BufferE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24AttestationRecordContext21GetVerifiedBootParamsEP16keymaster_blob_tP25keymaster_verified_boot_tPb"
    },
    {
     "component_value" : -12,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24PureSoftKeymasterContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn12_N9keymaster24PureSoftKeymasterContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn12_N9keymaster24PureSoftKeymasterContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftwareRandomSource14GenerateRandomEPhj"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::RandomSource",
   "name" : "keymaster::RandomSource",
   "record_kind" : "class",
   "referenced_type" : "type-982",
   "self_type" : "type-982",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/random_source.h",
   "unique_id" : "_ZTSN9keymaster12RandomSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12RandomSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RandomSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12RandomSourceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12RandomSource14GenerateRandomEPhj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1049"
    },
    {
     "referenced_type" : "type-1000"
    }
   ],
   "linker_set_key" : "keymaster::RsaKeyFactory",
   "name" : "keymaster::RsaKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1064",
   "self_type" : "type-1064",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/rsa_key_factory.h",
   "unique_id" : "_ZTSN9keymaster13RsaKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13RsaKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13RsaKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster13RsaKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20AsymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory14CreateEmptyKeyEONS_16AuthorizationSetES2_PNS_9UniquePtrINS_13AsymmetricKeyENS_13DefaultDeleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory18keymaster_key_typeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster13RsaKeyFactory12evp_key_typeEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster13RsaKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster13RsaKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster13RsaKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::Serializable",
   "name" : "keymaster::Serializable",
   "record_kind" : "class",
   "referenced_type" : "type-51",
   "self_type" : "type-51",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/serializable.h",
   "unique_id" : "_ZTSN9keymaster12SerializableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12SerializableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SerializableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SerializableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable14SerializedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster12Serializable9SerializeEPhPKh"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9keymaster12Serializable11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "blob_maker_",
     "field_offset" : 32,
     "referenced_type" : "type-1001"
    }
   ],
   "linker_set_key" : "keymaster::SoftKeyFactoryMixin",
   "name" : "keymaster::SoftKeyFactoryMixin",
   "record_kind" : "class",
   "referenced_type" : "type-1000",
   "self_type" : "type-1000",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/soft_key_factory.h",
   "unique_id" : "_ZTSN9keymaster19SoftKeyFactoryMixinE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SoftKeyFactoryMixinE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeyFactoryMixinD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeyFactoryMixinD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-922"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "have_saved_params_",
     "field_offset" : 96,
     "referenced_type" : "type-909"
    },
    {
     "access" : "private",
     "field_name" : "saved_params_",
     "field_offset" : 128,
     "referenced_type" : "type-46"
    },
    {
     "access" : "private",
     "field_name" : "hmac_key_",
     "field_offset" : 480,
     "referenced_type" : "type-488"
    }
   ],
   "linker_set_key" : "keymaster::SoftKeymasterEnforcement",
   "name" : "keymaster::SoftKeymasterEnforcement",
   "record_kind" : "class",
   "referenced_type" : "type-989",
   "self_type" : "type-989",
   "size" : 68,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/soft_keymaster_enforcement.h",
   "unique_id" : "_ZTSN9keymaster24SoftKeymasterEnforcementE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24SoftKeymasterEnforcementE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcementD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcementD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement21activation_date_validEy"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement22expiration_date_passedEy"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement20auth_token_timed_outERK15hw_auth_token_tj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement19get_current_time_msEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement13SecurityLevelEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement22ValidateTokenSignatureERK15hw_auth_token_t"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcement24GetHmacSharingParametersEPNS_21HmacSharingParametersE"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcement17ComputeSharedHmacERKNS_26HmacSharingParametersArrayEPNS_14TKeymasterBlobI16keymaster_blob_tEE"
    },
    {
     "mangled_component_name" : "_ZN9keymaster24SoftKeymasterEnforcement19VerifyAuthorizationERKNS_26VerifyAuthorizationRequestE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster24SoftKeymasterEnforcement11CreateKeyIdERK20keymaster_key_blob_tPy"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "keymaster::SoftKeymasterLogger",
   "name" : "keymaster::SoftKeymasterLogger",
   "record_kind" : "class",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/soft_keymaster_logger.h",
   "unique_id" : "_ZTSN9keymaster19SoftKeymasterLoggerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SoftKeymasterLoggerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeymasterLoggerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SoftKeymasterLoggerD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SoftKeymasterLogger7log_msgENS_6Logger8LogLevelEPKcSt9__va_list"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "keymaster::SoftwareKeyBlobMaker",
   "name" : "keymaster::SoftwareKeyBlobMaker",
   "record_kind" : "class",
   "referenced_type" : "type-997",
   "self_type" : "type-997",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/soft_key_factory.h",
   "unique_id" : "_ZTSN9keymaster20SoftwareKeyBlobMakerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftwareKeyBlobMakerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareKeyBlobMakerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareKeyBlobMakerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster20SoftwareKeyBlobMaker13CreateKeyBlobERKNS_16AuthorizationSetE22keymaster_key_origin_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-982"
    }
   ],
   "linker_set_key" : "keymaster::SoftwareRandomSource",
   "name" : "keymaster::SoftwareRandomSource",
   "record_kind" : "class",
   "referenced_type" : "type-984",
   "self_type" : "type-984",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/software_random_source.h",
   "unique_id" : "_ZTSN9keymaster20SoftwareRandomSourceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster20SoftwareRandomSourceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareRandomSourceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster20SoftwareRandomSourceD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster20SoftwareRandomSource14GenerateRandomEPhj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::StaticAssert<true>",
   "name" : "keymaster::StaticAssert<true>",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12StaticAssertILb1EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "linker_set_key" : "keymaster::SupportedAlgorithmsRequest",
   "name" : "keymaster::SupportedAlgorithmsRequest",
   "referenced_type" : "type-692",
   "self_type" : "type-692",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26SupportedAlgorithmsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26SupportedAlgorithmsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26SupportedAlgorithmsRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26SupportedAlgorithmsRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26SupportedAlgorithmsRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-722"
    }
   ],
   "linker_set_key" : "keymaster::SupportedAlgorithmsResponse",
   "name" : "keymaster::SupportedAlgorithmsResponse",
   "referenced_type" : "type-759",
   "self_type" : "type-759",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedAlgorithmsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedAlgorithmsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedAlgorithmsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedAlgorithmsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-708"
    }
   ],
   "linker_set_key" : "keymaster::SupportedBlockModesRequest",
   "name" : "keymaster::SupportedBlockModesRequest",
   "referenced_type" : "type-714",
   "self_type" : "type-714",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26SupportedBlockModesRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26SupportedBlockModesRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedBlockModesRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26SupportedBlockModesRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-728"
    }
   ],
   "linker_set_key" : "keymaster::SupportedBlockModesResponse",
   "name" : "keymaster::SupportedBlockModesResponse",
   "referenced_type" : "type-762",
   "self_type" : "type-762",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedBlockModesResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedBlockModesResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedBlockModesResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedBlockModesResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "field_offset" : 64,
     "referenced_type" : "type-709"
    },
    {
     "field_name" : "purpose",
     "field_offset" : 96,
     "referenced_type" : "type-710"
    }
   ],
   "linker_set_key" : "keymaster::SupportedByAlgorithmAndPurposeRequest",
   "name" : "keymaster::SupportedByAlgorithmAndPurposeRequest",
   "referenced_type" : "type-708",
   "self_type" : "type-708",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster37SupportedByAlgorithmAndPurposeRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster37SupportedByAlgorithmAndPurposeRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "field_offset" : 64,
     "referenced_type" : "type-698"
    }
   ],
   "linker_set_key" : "keymaster::SupportedByAlgorithmRequest",
   "name" : "keymaster::SupportedByAlgorithmRequest",
   "referenced_type" : "type-697",
   "self_type" : "type-697",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27SupportedByAlgorithmRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27SupportedByAlgorithmRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-708"
    }
   ],
   "linker_set_key" : "keymaster::SupportedDigestsRequest",
   "name" : "keymaster::SupportedDigestsRequest",
   "referenced_type" : "type-720",
   "self_type" : "type-720",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23SupportedDigestsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23SupportedDigestsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23SupportedDigestsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23SupportedDigestsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-741"
    }
   ],
   "linker_set_key" : "keymaster::SupportedDigestsResponse",
   "name" : "keymaster::SupportedDigestsResponse",
   "referenced_type" : "type-766",
   "self_type" : "type-766",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster24SupportedDigestsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster24SupportedDigestsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SupportedDigestsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster24SupportedDigestsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-697"
    }
   ],
   "linker_set_key" : "keymaster::SupportedExportFormatsRequest",
   "name" : "keymaster::SupportedExportFormatsRequest",
   "referenced_type" : "type-706",
   "self_type" : "type-706",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedExportFormatsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedExportFormatsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedExportFormatsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedExportFormatsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-748"
    }
   ],
   "linker_set_key" : "keymaster::SupportedExportFormatsResponse",
   "name" : "keymaster::SupportedExportFormatsResponse",
   "referenced_type" : "type-770",
   "self_type" : "type-770",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster30SupportedExportFormatsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster30SupportedExportFormatsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedExportFormatsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedExportFormatsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-697"
    }
   ],
   "linker_set_key" : "keymaster::SupportedImportFormatsRequest",
   "name" : "keymaster::SupportedImportFormatsRequest",
   "referenced_type" : "type-702",
   "self_type" : "type-702",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedImportFormatsRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedImportFormatsRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedImportFormatsRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedImportFormatsRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27SupportedByAlgorithmRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27SupportedByAlgorithmRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-748"
    }
   ],
   "linker_set_key" : "keymaster::SupportedImportFormatsResponse",
   "name" : "keymaster::SupportedImportFormatsResponse",
   "referenced_type" : "type-768",
   "self_type" : "type-768",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster30SupportedImportFormatsResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster30SupportedImportFormatsResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedImportFormatsResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster30SupportedImportFormatsResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-708"
    }
   ],
   "linker_set_key" : "keymaster::SupportedPaddingModesRequest",
   "name" : "keymaster::SupportedPaddingModesRequest",
   "referenced_type" : "type-717",
   "self_type" : "type-717",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster28SupportedPaddingModesRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster28SupportedPaddingModesRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28SupportedPaddingModesRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster28SupportedPaddingModesRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster37SupportedByAlgorithmAndPurposeRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster37SupportedByAlgorithmAndPurposeRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-735"
    }
   ],
   "linker_set_key" : "keymaster::SupportedPaddingModesResponse",
   "name" : "keymaster::SupportedPaddingModesResponse",
   "referenced_type" : "type-764",
   "self_type" : "type-764",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster29SupportedPaddingModesResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster29SupportedPaddingModesResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedPaddingModesResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster29SupportedPaddingModesResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-573"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_algorithm_t>",
   "name" : "keymaster::SupportedResponse<keymaster_algorithm_t>",
   "referenced_type" : "type-722",
   "self_type" : "type-722",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-723" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI21keymaster_algorithm_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI21keymaster_algorithm_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI21keymaster_algorithm_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI21keymaster_algorithm_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-669"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_block_mode_t>",
   "name" : "keymaster::SupportedResponse<keymaster_block_mode_t>",
   "referenced_type" : "type-728",
   "self_type" : "type-728",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-729" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI22keymaster_block_mode_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI22keymaster_block_mode_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_block_mode_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_block_mode_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-742"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_digest_t>",
   "name" : "keymaster::SupportedResponse<keymaster_digest_t>",
   "referenced_type" : "type-741",
   "self_type" : "type-741",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-744" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI18keymaster_digest_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI18keymaster_digest_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI18keymaster_digest_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI18keymaster_digest_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-749"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_key_format_t>",
   "name" : "keymaster::SupportedResponse<keymaster_key_format_t>",
   "referenced_type" : "type-748",
   "self_type" : "type-748",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-751" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI22keymaster_key_format_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI22keymaster_key_format_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI22keymaster_key_format_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI22keymaster_key_format_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "results",
     "field_offset" : 96,
     "referenced_type" : "type-733"
    },
    {
     "field_name" : "results_length",
     "field_offset" : 128,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "keymaster::SupportedResponse<keymaster_padding_t>",
   "name" : "keymaster::SupportedResponse<keymaster_padding_t>",
   "referenced_type" : "type-735",
   "self_type" : "type-735",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "template_args" : [ "type-736" ],
   "unique_id" : "_ZTSN9keymaster17SupportedResponseI19keymaster_padding_tEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17SupportedResponseI19keymaster_padding_tEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17SupportedResponseI19keymaster_padding_tE17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17SupportedResponseI19keymaster_padding_tE19NonErrorDeserializeEPPKhS4_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-487"
    }
   ],
   "linker_set_key" : "keymaster::SymmetricKey",
   "name" : "keymaster::SymmetricKey",
   "record_kind" : "class",
   "referenced_type" : "type-1030",
   "self_type" : "type-1030",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/symmetric_key.h",
   "unique_id" : "_ZTSN9keymaster12SymmetricKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12SymmetricKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SymmetricKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12SymmetricKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-493"
    },
    {
     "referenced_type" : "type-1000"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "random_source_",
     "field_offset" : 96,
     "referenced_type" : "type-1024"
    }
   ],
   "linker_set_key" : "keymaster::SymmetricKeyFactory",
   "name" : "keymaster::SymmetricKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1023",
   "self_type" : "type-1023",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/symmetric_key.h",
   "unique_id" : "_ZTSN9keymaster19SymmetricKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SymmetricKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SymmetricKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19SymmetricKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster10KeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory18key_size_supportedEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory14key_size_bytesEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory13key_size_bitsEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19SymmetricKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster19SymmetricKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster19SymmetricKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "keymaster::TKeymasterBlob<keymaster_blob_t>",
   "name" : "keymaster::TKeymasterBlob<keymaster_blob_t>",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-49" ],
   "unique_id" : "_ZTSN9keymaster14TKeymasterBlobI16keymaster_blob_tEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-489"
    }
   ],
   "linker_set_key" : "keymaster::TKeymasterBlob<keymaster_key_blob_t>",
   "name" : "keymaster::TKeymasterBlob<keymaster_key_blob_t>",
   "referenced_type" : "type-488",
   "self_type" : "type-488",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-490" ],
   "unique_id" : "_ZTSN9keymaster14TKeymasterBlobI20keymaster_key_blob_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BIGNUM>",
   "name" : "keymaster::TagValueType<KM_BIGNUM>",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn2147483648EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BOOL>",
   "name" : "keymaster::TagValueType<KM_BOOL>",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1879048192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_BYTES>",
   "name" : "keymaster::TagValueType<KM_BYTES>",
   "referenced_type" : "type-123",
   "self_type" : "type-123",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn1879048192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_DATE>",
   "name" : "keymaster::TagValueType<KM_DATE>",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1610612736EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_INVALID>",
   "name" : "keymaster::TagValueType<KM_INVALID>",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_UINT>",
   "name" : "keymaster::TagValueType<KM_UINT>",
   "referenced_type" : "type-115",
   "self_type" : "type-115",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t805306368EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_UINT_REP>",
   "name" : "keymaster::TagValueType<KM_UINT_REP>",
   "referenced_type" : "type-118",
   "self_type" : "type-118",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1073741824EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_ULONG>",
   "name" : "keymaster::TagValueType<KM_ULONG>",
   "referenced_type" : "type-106",
   "self_type" : "type-106",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_t1342177280EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TagValueType<KM_ULONG_REP>",
   "name" : "keymaster::TagValueType<KM_ULONG_REP>",
   "referenced_type" : "type-111",
   "self_type" : "type-111",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster12TagValueTypeIL20keymaster_tag_type_tn1610612736EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1030"
    }
   ],
   "linker_set_key" : "keymaster::TripleDesKey",
   "name" : "keymaster::TripleDesKey",
   "record_kind" : "class",
   "referenced_type" : "type-1073",
   "self_type" : "type-1073",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/triple_des_key.h",
   "unique_id" : "_ZTSN9keymaster12TripleDesKeyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster12TripleDesKeyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12TripleDesKeyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster12TripleDesKeyD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster12SymmetricKey22formatted_key_materialE22keymaster_key_format_tPNS_9UniquePtrIA_hNS_13DefaultDeleteIS3_EEEEPj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1023"
    }
   ],
   "linker_set_key" : "keymaster::TripleDesKeyFactory",
   "name" : "keymaster::TripleDesKeyFactory",
   "record_kind" : "class",
   "referenced_type" : "type-1069",
   "self_type" : "type-1069",
   "size" : 16,
   "source_file" : "/system/keymaster/include/keymaster/km_openssl/triple_des_key.h",
   "unique_id" : "_ZTSN9keymaster19TripleDesKeyFactoryE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19TripleDesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19TripleDesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster19TripleDesKeyFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory11GenerateKeyERKNS_16AuthorizationSetEPNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS1_S8_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory9ImportKeyERKNS_16AuthorizationSetE22keymaster_key_format_tRKNS_14TKeymasterBlobI20keymaster_key_blob_tEEPS7_PS1_SB_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory7LoadKeyEONS_14TKeymasterBlobI20keymaster_key_blob_tEERKNS_16AuthorizationSetEOS5_S8_PNS_9UniquePtrINS_3KeyENS_13DefaultDeleteISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory19GetOperationFactoryE19keymaster_purpose_t"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedImportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19SymmetricKeyFactory22SupportedExportFormatsEPj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory18key_size_supportedEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory14key_size_bytesEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory13key_size_bitsEj"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster19TripleDesKeyFactory42validate_algorithm_specific_new_key_paramsERKNS_16AuthorizationSetE"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster19TripleDesKeyFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster19TripleDesKeyFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N9keymaster19TripleDesKeyFactoryD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t>",
   "record_kind" : "class",
   "referenced_type" : "type-205",
   "self_type" : "type-205",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-206" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435458E21keymaster_algorithm_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_EC_CURVE, keymaster_ec_curve_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_EC_CURVE, keymaster_ec_curve_t>",
   "record_kind" : "class",
   "referenced_type" : "type-660",
   "self_type" : "type-660",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-661" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435466E20keymaster_ec_curve_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ORIGIN, keymaster_key_origin_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ORIGIN, keymaster_key_origin_t>",
   "record_kind" : "class",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-651" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268436158E22keymaster_key_origin_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_USER_AUTH_TYPE, hw_authenticator_type_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM, KM_TAG_USER_AUTH_TYPE, hw_authenticator_type_t>",
   "record_kind" : "class",
   "referenced_type" : "type-654",
   "self_type" : "type-654",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-655" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435960E23hw_authenticator_type_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_BLOCK_MODE, keymaster_block_mode_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_BLOCK_MODE, keymaster_block_mode_t>",
   "record_kind" : "class",
   "referenced_type" : "type-392",
   "self_type" : "type-392",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-393" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870916E22keymaster_block_mode_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_DIGEST, keymaster_digest_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_DIGEST, keymaster_digest_t>",
   "record_kind" : "class",
   "referenced_type" : "type-673",
   "self_type" : "type-673",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-674" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870917E18keymaster_digest_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_KDF, keymaster_kdf_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_KDF, keymaster_kdf_t>",
   "record_kind" : "class",
   "referenced_type" : "type-657",
   "self_type" : "type-657",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-658" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870921E15keymaster_kdf_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PADDING, keymaster_padding_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PADDING, keymaster_padding_t>",
   "record_kind" : "class",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-4" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870918E19keymaster_padding_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PURPOSE, keymaster_purpose_t>",
   "name" : "keymaster::TypedEnumTag<KM_ENUM_REP, KM_TAG_PURPOSE, keymaster_purpose_t>",
   "record_kind" : "class",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "template_args" : [ "type-193" ],
   "unique_id" : "_ZTSN9keymaster12TypedEnumTagIL20keymaster_tag_type_t536870912EL15keymaster_tag_t536870913E19keymaster_purpose_tEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALLOW_WHILE_ON_BODY>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALLOW_WHILE_ON_BODY>",
   "record_kind" : "class",
   "referenced_type" : "type-605",
   "self_type" : "type-605",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048698EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_APPLICATIONS>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ALL_APPLICATIONS>",
   "record_kind" : "class",
   "referenced_type" : "type-609",
   "self_type" : "type-609",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048792EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_CALLER_NONCE>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_CALLER_NONCE>",
   "record_kind" : "class",
   "referenced_type" : "type-589",
   "self_type" : "type-589",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048199EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_NO_AUTH_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_NO_AUTH_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-600",
   "self_type" : "type-600",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048695EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ROLLBACK_RESISTANT>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_ROLLBACK_RESISTANT>",
   "record_kind" : "class",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048895EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BOOL, KM_TAG_UNLOCKED_DEVICE_REQUIRED>",
   "name" : "keymaster::TypedTag<KM_BOOL, KM_TAG_UNLOCKED_DEVICE_REQUIRED>",
   "record_kind" : "class",
   "referenced_type" : "type-607",
   "self_type" : "type-607",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1879048192EL15keymaster_tag_t1879048701EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_APPLICATION_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-612",
   "self_type" : "type-612",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047591EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ASSOCIATED_DATA>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ASSOCIATED_DATA>",
   "record_kind" : "class",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047192EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_APPLICATION_ID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_APPLICATION_ID>",
   "record_kind" : "class",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047483EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_BRAND>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_BRAND>",
   "record_kind" : "class",
   "referenced_type" : "type-629",
   "self_type" : "type-629",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047482EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_DEVICE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_DEVICE>",
   "record_kind" : "class",
   "referenced_type" : "type-631",
   "self_type" : "type-631",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047481EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_IMEI>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_IMEI>",
   "record_kind" : "class",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047478EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MANUFACTURER>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MANUFACTURER>",
   "record_kind" : "class",
   "referenced_type" : "type-645",
   "self_type" : "type-645",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047476EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MEID>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MEID>",
   "record_kind" : "class",
   "referenced_type" : "type-640",
   "self_type" : "type-640",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047477EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MODEL>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_MODEL>",
   "record_kind" : "class",
   "referenced_type" : "type-648",
   "self_type" : "type-648",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047475EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_PRODUCT>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_PRODUCT>",
   "record_kind" : "class",
   "referenced_type" : "type-633",
   "self_type" : "type-633",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047480EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_SERIAL>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ATTESTATION_ID_SERIAL>",
   "record_kind" : "class",
   "referenced_type" : "type-636",
   "self_type" : "type-636",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047479EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_NONCE>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_NONCE>",
   "record_kind" : "class",
   "referenced_type" : "type-624",
   "self_type" : "type-624",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047191EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ROOT_OF_TRUST>",
   "name" : "keymaster::TypedTag<KM_BYTES, KM_TAG_ROOT_OF_TRUST>",
   "record_kind" : "class",
   "referenced_type" : "type-619",
   "self_type" : "type-619",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_tn1879048192EL15keymaster_tag_tn1879047488EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_ACTIVE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_ACTIVE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-594",
   "self_type" : "type-594",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613136EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_CREATION_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_CREATION_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613437EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_ORIGINATION_EXPIRE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_ORIGINATION_EXPIRE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-596",
   "self_type" : "type-596",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613137EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_DATE, KM_TAG_USAGE_EXPIRE_DATETIME>",
   "name" : "keymaster::TypedTag<KM_DATE, KM_TAG_USAGE_EXPIRE_DATETIME>",
   "record_kind" : "class",
   "referenced_type" : "type-598",
   "self_type" : "type-598",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1610612736EL15keymaster_tag_t1610613138EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_AUTH_TIMEOUT>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_AUTH_TIMEOUT>",
   "record_kind" : "class",
   "referenced_type" : "type-602",
   "self_type" : "type-602",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306873EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_KEY_SIZE>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_KEY_SIZE>",
   "record_kind" : "class",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306371EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAC_LENGTH>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MAC_LENGTH>",
   "record_kind" : "class",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307371EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_MAC_LENGTH>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_MIN_MAC_LENGTH>",
   "record_kind" : "class",
   "referenced_type" : "type-591",
   "self_type" : "type-591",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805306376EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_PATCHLEVEL>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_PATCHLEVEL>",
   "record_kind" : "class",
   "referenced_type" : "type-182",
   "self_type" : "type-182",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307074EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_VERSION>",
   "name" : "keymaster::TypedTag<KM_UINT, KM_TAG_OS_VERSION>",
   "record_kind" : "class",
   "referenced_type" : "type-170",
   "self_type" : "type-170",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t805306368EL15keymaster_tag_t805307073EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::TypedTag<KM_ULONG, KM_TAG_RSA_PUBLIC_EXPONENT>",
   "name" : "keymaster::TypedTag<KM_ULONG, KM_TAG_RSA_PUBLIC_EXPONENT>",
   "record_kind" : "class",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster8TypedTagIL20keymaster_tag_type_t1342177280EL15keymaster_tag_t1342177480EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-162"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<hmac_ctx_st, keymaster::OpenSslObjectDeleter<hmac_ctx_st, &HMAC_CTX_free> >",
   "name" : "keymaster::UniquePtr<hmac_ctx_st, keymaster::OpenSslObjectDeleter<hmac_ctx_st, &HMAC_CTX_free> >",
   "record_kind" : "class",
   "referenced_type" : "type-161",
   "self_type" : "type-161",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-164", "type-158" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI11hmac_ctx_stNS_20OpenSslObjectDeleterIS1_XadL_Z13HMAC_CTX_freeEEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-519"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::Key, keymaster::DefaultDelete<keymaster::Key> >",
   "name" : "keymaster::UniquePtr<keymaster::Key, keymaster::DefaultDelete<keymaster::Key> >",
   "record_kind" : "class",
   "referenced_type" : "type-1034",
   "self_type" : "type-1034",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-487", "type-486" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_3KeyENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-578"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster::Operation, keymaster::DefaultDelete<keymaster::Operation> >",
   "name" : "keymaster::UniquePtr<keymaster::Operation, keymaster::DefaultDelete<keymaster::Operation> >",
   "record_kind" : "class",
   "referenced_type" : "type-1095",
   "self_type" : "type-1095",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-526", "type-525" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrINS_9OperationENS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-573"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_algorithm_t [], keymaster::DefaultDelete<keymaster_algorithm_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_algorithm_t [], keymaster::DefaultDelete<keymaster_algorithm_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-1102",
   "self_type" : "type-1102",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-584", "type-583" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_21keymaster_algorithm_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_blob_t [], keymaster::DefaultDelete<keymaster_blob_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_blob_t [], keymaster::DefaultDelete<keymaster_blob_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-168",
   "self_type" : "type-168",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-34", "type-33" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_16keymaster_blob_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-669"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_block_mode_t [], keymaster::DefaultDelete<keymaster_block_mode_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_block_mode_t [], keymaster::DefaultDelete<keymaster_block_mode_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-1108",
   "self_type" : "type-1108",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-642", "type-641" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_22keymaster_block_mode_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-986"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_cert_chain_t, keymaster::CertificateChainDelete>",
   "name" : "keymaster::UniquePtr<keymaster_cert_chain_t, keymaster::CertificateChainDelete>",
   "record_kind" : "class",
   "referenced_type" : "type-985",
   "self_type" : "type-985",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-988", "type-78" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrI22keymaster_cert_chain_tNS_22CertificateChainDeleteEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-742"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_digest_t [], keymaster::DefaultDelete<keymaster_digest_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_digest_t [], keymaster::DefaultDelete<keymaster_digest_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-1121",
   "self_type" : "type-1121",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-755", "type-754" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_18keymaster_digest_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-749"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_key_format_t [], keymaster::DefaultDelete<keymaster_key_format_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_key_format_t [], keymaster::DefaultDelete<keymaster_key_format_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-1128",
   "self_type" : "type-1128",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-837", "type-836" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_22keymaster_key_format_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-733"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<keymaster_padding_t [], keymaster::DefaultDelete<keymaster_padding_t []> >",
   "name" : "keymaster::UniquePtr<keymaster_padding_t [], keymaster::DefaultDelete<keymaster_padding_t []> >",
   "record_kind" : "class",
   "referenced_type" : "type-1114",
   "self_type" : "type-1114",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-682", "type-681" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_19keymaster_padding_tNS_13DefaultDeleteIS2_EEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPtr",
     "referenced_type" : "type-147"
    }
   ],
   "linker_set_key" : "keymaster::UniquePtr<unsigned char [], keymaster::DefaultDelete<unsigned char []> >",
   "name" : "keymaster::UniquePtr<unsigned char [], keymaster::DefaultDelete<unsigned char []> >",
   "record_kind" : "class",
   "referenced_type" : "type-308",
   "self_type" : "type-308",
   "size" : 4,
   "source_file" : "/system/keymaster/include/keymaster/UniquePtr.h",
   "template_args" : [ "type-110", "type-109" ],
   "unique_id" : "_ZTSN9keymaster9UniquePtrIA_hNS_13DefaultDeleteIS1_EEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "op_handle",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "input",
     "field_offset" : 128,
     "referenced_type" : "type-795"
    },
    {
     "field_name" : "additional_params",
     "field_offset" : 288,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::UpdateOperationRequest",
   "name" : "keymaster::UpdateOperationRequest",
   "referenced_type" : "type-794",
   "self_type" : "type-794",
   "size" : 80,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster22UpdateOperationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster22UpdateOperationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22UpdateOperationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster22UpdateOperationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster22UpdateOperationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "output",
     "field_offset" : 96,
     "referenced_type" : "type-795"
    },
    {
     "field_name" : "input_consumed",
     "field_offset" : 256,
     "referenced_type" : "type-136"
    },
    {
     "field_name" : "output_params",
     "field_offset" : 288,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::UpdateOperationResponse",
   "name" : "keymaster::UpdateOperationResponse",
   "referenced_type" : "type-798",
   "self_type" : "type-798",
   "size" : 76,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster23UpdateOperationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster23UpdateOperationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23UpdateOperationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster23UpdateOperationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster23UpdateOperationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "key_blob",
     "field_offset" : 64,
     "referenced_type" : "type-869"
    },
    {
     "field_name" : "upgrade_params",
     "field_offset" : 128,
     "referenced_type" : "type-142"
    }
   ],
   "linker_set_key" : "keymaster::UpgradeKeyRequest",
   "name" : "keymaster::UpgradeKeyRequest",
   "referenced_type" : "type-868",
   "self_type" : "type-868",
   "size" : 56,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17UpgradeKeyRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17UpgradeKeyRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17UpgradeKeyRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17UpgradeKeyRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17UpgradeKeyRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "upgraded_key",
     "field_offset" : 96,
     "referenced_type" : "type-872"
    }
   ],
   "linker_set_key" : "keymaster::UpgradeKeyResponse",
   "name" : "keymaster::UpgradeKeyResponse",
   "referenced_type" : "type-871",
   "self_type" : "type-871",
   "size" : 20,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster18UpgradeKeyResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster18UpgradeKeyResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18UpgradeKeyResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster18UpgradeKeyResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster18UpgradeKeyResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-51"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 128,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "parameters_verified",
     "field_offset" : 192,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "security_level",
     "field_offset" : 512,
     "referenced_type" : "type-906"
    },
    {
     "field_name" : "mac",
     "field_offset" : 544,
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "keymaster::VerificationToken",
   "name" : "keymaster::VerificationToken",
   "referenced_type" : "type-905",
   "self_type" : "type-905",
   "size" : 80,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster17VerificationTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster17VerificationTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17VerificationTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster17VerificationTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17VerificationToken14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17VerificationToken9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17VerificationToken11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-152"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "challenge",
     "field_offset" : 64,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "parameters_to_verify",
     "field_offset" : 128,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "auth_token",
     "field_offset" : 448,
     "referenced_type" : "type-150"
    }
   ],
   "linker_set_key" : "keymaster::VerifyAuthorizationRequest",
   "name" : "keymaster::VerifyAuthorizationRequest",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 112,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster26VerifyAuthorizationRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster26VerifyAuthorizationRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26VerifyAuthorizationRequest14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster26VerifyAuthorizationRequest9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster26VerifyAuthorizationRequest11DeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-561"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "error",
     "field_offset" : 96,
     "referenced_type" : "type-914"
    },
    {
     "field_name" : "token",
     "field_offset" : 128,
     "referenced_type" : "type-905"
    }
   ],
   "linker_set_key" : "keymaster::VerifyAuthorizationResponse",
   "name" : "keymaster::VerifyAuthorizationResponse",
   "referenced_type" : "type-913",
   "self_type" : "type-913",
   "size" : 96,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_messages.h",
   "unique_id" : "_ZTSN9keymaster27VerifyAuthorizationResponseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9keymaster27VerifyAuthorizationResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse14SerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster17KeymasterResponse9SerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster17KeymasterResponse11DeserializeEPPKhS2_"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27VerifyAuthorizationResponse22NonErrorSerializedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK9keymaster27VerifyAuthorizationResponse17NonErrorSerializeEPhPKh"
    },
    {
     "mangled_component_name" : "_ZN9keymaster27VerifyAuthorizationResponse19NonErrorDeserializeEPPKhS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::Void",
   "name" : "keymaster::Void",
   "record_kind" : "class",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/keymaster_tags.h",
   "unique_id" : "_ZTSN9keymaster4VoidE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "purpose",
     "referenced_type" : "type-960"
    },
    {
     "field_name" : "algorithm",
     "field_offset" : 32,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "key_size",
     "field_offset" : 64,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "block_mode",
     "field_offset" : 96,
     "referenced_type" : "type-960"
    },
    {
     "field_name" : "digest",
     "field_offset" : 128,
     "referenced_type" : "type-960"
    },
    {
     "field_name" : "padding",
     "field_offset" : 160,
     "referenced_type" : "type-960"
    },
    {
     "field_name" : "caller_nonce",
     "field_offset" : 192,
     "referenced_type" : "type-952"
    },
    {
     "field_name" : "min_mac_length",
     "field_offset" : 224,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "kdf",
     "field_offset" : 256,
     "referenced_type" : "type-960"
    },
    {
     "field_name" : "ec_curve",
     "field_offset" : 288,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "rsa_public_exponent",
     "field_offset" : 320,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "active_date_time",
     "field_offset" : 352,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "origination_expire_date_time",
     "field_offset" : 384,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "usage_expire_date_time",
     "field_offset" : 416,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "no_auth_required",
     "field_offset" : 448,
     "referenced_type" : "type-952"
    },
    {
     "field_name" : "user_auth_type",
     "field_offset" : 480,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "auth_timeout",
     "field_offset" : 512,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "allow_while_on_body",
     "field_offset" : 544,
     "referenced_type" : "type-952"
    },
    {
     "field_name" : "trusted_confirmation_required",
     "field_offset" : 576,
     "referenced_type" : "type-952"
    },
    {
     "field_name" : "unlocked_device_required",
     "field_offset" : 608,
     "referenced_type" : "type-952"
    },
    {
     "field_name" : "all_applications",
     "field_offset" : 640,
     "referenced_type" : "type-952"
    },
    {
     "field_name" : "application_id",
     "field_offset" : 672,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "creation_date_time",
     "field_offset" : 704,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "origin",
     "field_offset" : 736,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "rollback_resistant",
     "field_offset" : 768,
     "referenced_type" : "type-952"
    },
    {
     "field_name" : "root_of_trust",
     "field_offset" : 800,
     "referenced_type" : "type-962"
    },
    {
     "field_name" : "os_version",
     "field_offset" : 832,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "os_patchlevel",
     "field_offset" : 864,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_application_id",
     "field_offset" : 896,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_id_brand",
     "field_offset" : 928,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_id_device",
     "field_offset" : 960,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_id_product",
     "field_offset" : 992,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_id_serial",
     "field_offset" : 1024,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_id_imei",
     "field_offset" : 1056,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_id_meid",
     "field_offset" : 1088,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_id_manufacturer",
     "field_offset" : 1120,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_id_model",
     "field_offset" : 1152,
     "referenced_type" : "type-944"
    }
   ],
   "linker_set_key" : "keymaster::km_auth_list",
   "name" : "keymaster::km_auth_list",
   "referenced_type" : "type-959",
   "self_type" : "type-959",
   "size" : 148,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster12km_auth_listE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "attestation_version",
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_security_level",
     "field_offset" : 32,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "keymaster_version",
     "field_offset" : 64,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "keymaster_security_level",
     "field_offset" : 96,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "attestation_challenge",
     "field_offset" : 128,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "software_enforced",
     "field_offset" : 160,
     "referenced_type" : "type-967"
    },
    {
     "field_name" : "tee_enforced",
     "field_offset" : 192,
     "referenced_type" : "type-967"
    },
    {
     "field_name" : "unique_id",
     "field_offset" : 224,
     "referenced_type" : "type-944"
    }
   ],
   "linker_set_key" : "keymaster::km_key_description",
   "name" : "keymaster::km_key_description",
   "referenced_type" : "type-966",
   "self_type" : "type-966",
   "size" : 32,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster18km_key_descriptionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "verified_boot_key",
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "device_locked",
     "field_offset" : 32,
     "referenced_type" : "type-952"
    },
    {
     "field_name" : "verified_boot_state",
     "field_offset" : 64,
     "referenced_type" : "type-944"
    }
   ],
   "linker_set_key" : "keymaster::km_root_of_trust",
   "name" : "keymaster::km_root_of_trust",
   "referenced_type" : "type-951",
   "self_type" : "type-951",
   "size" : 12,
   "source_file" : "/system/keymaster/include/keymaster/attestation_record.h",
   "unique_id" : "_ZTSN9keymaster16km_root_of_trustE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "transit_key",
     "field_offset" : 32,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "iv",
     "field_offset" : 64,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "wrapped_key_description",
     "field_offset" : 96,
     "referenced_type" : "type-1094"
    },
    {
     "field_name" : "secure_key",
     "field_offset" : 128,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "tag",
     "field_offset" : 160,
     "referenced_type" : "type-944"
    }
   ],
   "linker_set_key" : "keymaster::km_wrapped_key",
   "name" : "keymaster::km_wrapped_key",
   "referenced_type" : "type-1093",
   "self_type" : "type-1093",
   "size" : 24,
   "source_file" : "/system/keymaster/include/keymaster/wrapped_key.h",
   "unique_id" : "_ZTSN9keymaster14km_wrapped_keyE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key_format",
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "auth_list",
     "field_offset" : 32,
     "referenced_type" : "type-967"
    }
   ],
   "linker_set_key" : "keymaster::km_wrapped_key_description",
   "name" : "keymaster::km_wrapped_key_description",
   "referenced_type" : "type-1089",
   "self_type" : "type-1089",
   "size" : 8,
   "source_file" : "/system/keymaster/include/keymaster/wrapped_key.h",
   "unique_id" : "_ZTSN9keymaster26km_wrapped_key_descriptionE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::AuthorizationSet &>",
   "name" : "keymaster::remove_reference<keymaster::AuthorizationSet &>",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-557" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_16AuthorizationSetEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::ComputeSharedHmacResponse &>",
   "name" : "keymaster::remove_reference<keymaster::ComputeSharedHmacResponse &>",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-559" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_25ComputeSharedHmacResponseEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::HmacSharingParameters &>",
   "name" : "keymaster::remove_reference<keymaster::HmacSharingParameters &>",
   "referenced_type" : "type-555",
   "self_type" : "type-555",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_21HmacSharingParametersEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::Key &>",
   "name" : "keymaster::remove_reference<keymaster::Key &>",
   "referenced_type" : "type-568",
   "self_type" : "type-568",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-569" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_3KeyEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::TKeymasterBlob<keymaster_blob_t> &>",
   "name" : "keymaster::remove_reference<keymaster::TKeymasterBlob<keymaster_blob_t> &>",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-544" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_14TKeymasterBlobI16keymaster_blob_tEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::TKeymasterBlob<keymaster_key_blob_t> &>",
   "name" : "keymaster::remove_reference<keymaster::TKeymasterBlob<keymaster_key_blob_t> &>",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-548" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_14TKeymasterBlobI20keymaster_key_blob_tEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "keymaster::remove_reference<keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t> &>",
   "name" : "keymaster::remove_reference<keymaster::TypedEnumTag<KM_ENUM, KM_TAG_ALGORITHM, keymaster_algorithm_t> &>",
   "referenced_type" : "type-570",
   "self_type" : "type-570",
   "size" : 1,
   "source_file" : "/system/keymaster/include/keymaster/android_keymaster_utils.h",
   "template_args" : [ "type-571" ],
   "unique_id" : "_ZTSN9keymaster16remove_referenceIRNS_12TypedEnumTagIL20keymaster_tag_type_t268435456EL15keymaster_tag_t268435458E21keymaster_algorithm_tEEEE"
  },
  {
   "alignment" : 1,
