{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "AHardwareBuffer_Plane [4]",
   "name" : "AHardwareBuffer_Plane [4]",
   "referenced_type" : "type-25",
   "self_type" : "type-24",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [4]",
   "name" : "int [4]",
   "referenced_type" : "type-2",
   "self_type" : "type-66",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [6]",
   "name" : "unsigned int [6]",
   "referenced_type" : "type-4",
   "self_type" : "type-60",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/native_window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *[1]",
   "name" : "void *[1]",
   "referenced_type" : "type-20",
   "self_type" : "type-39",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *[4]",
   "name" : "void *[4]",
   "referenced_type" : "type-20",
   "self_type" : "type-33",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *[6]",
   "name" : "void *[6]",
   "referenced_type" : "type-20",
   "self_type" : "type-40",
   "size" : 24,

   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int (*)(ANativeWindow *, int)",
   "name" : "int (*)(ANativeWindow *, int)",
   "referenced_type" : "type-68",
   "self_type" : "type-67",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int (*)(ANativeWindow *, int, ...)",
   "name" : "int (*)(ANativeWindow *, int, ...)",
   "referenced_type" : "type-80",
   "self_type" : "type-79",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int (*)(const ANativeWindow *, int, int *)",
   "name" : "int (*)(const ANativeWindow *, int, int *)",
   "referenced_type" : "type-76",
   "self_type" : "type-75",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int *",
   "name" : "int *",
   "referenced_type" : "type-2",
   "self_type" : "type-26",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void (*)(android_native_base_t *)",
   "name" : "void (*)(android_native_base_t *)",
   "referenced_type" : "type-35",
   "self_type" : "type-34",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *",
   "name" : "void *",
   "referenced_type" : "type-21",
   "self_type" : "type-20",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void **",
   "name" : "void **",
   "referenced_type" : "type-20",
   "self_type" : "type-19",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "const AHardwareBuffer",
   "name" : "const AHardwareBuffer",
   "referenced_type" : "type-14",
   "self_type" : "type-13",
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AHardwareBuffer_Desc",
   "name" : "const AHardwareBuffer_Desc",
   "referenced_type" : "type-3",
   "self_type" : "type-9",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const ANativeWindow",
   "name" : "const ANativeWindow",
   "referenced_type" : "type-61",
   "self_type" : "type-78",
   "size" : 108,
   "source_file" : "/frameworks/native/libs/nativewindow/include/vndk/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const ANativeWindowBuffer",
   "name" : "const ANativeWindowBuffer",
   "referenced_type" : "type-38",
   "self_type" : "type-42",
   "size" : 96,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const ARect",
   "name" : "const ARect",
   "referenced_type" : "type-1",
   "self_type" : "type-17",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::GraphicBuffer",
   "name" : "const android::GraphicBuffer",
   "referenced_type" : "type-49",
   "self_type" : "type-48",
   "size" : 156,
   "source_file" : "/frameworks/native/libs/nativewindow/include-private/private/android/AHardwareBufferHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const float",
   "name" : "const float",
   "referenced_type" : "type-65",
   "self_type" : "type-64",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const int",
   "name" : "const int",
   "referenced_type" : "type-2",
   "self_type" : "type-63",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const long long",
   "name" : "const long long",
   "referenced_type" : "type-7",
   "self_type" : "type-6",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const native_handle",
   "name" : "const native_handle",
   "referenced_type" : "type-29",
   "self_type" : "type-28",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/nativewindow/include/vndk/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const native_handle",
   "name" : "const native_handle",
   "referenced_type" : "type-54",
   "self_type" : "type-53",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-4",
   "self_type" : "type-62",
   "size" : 4,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-21",
   "self_type" : "type-44",
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Desc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 12,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "planes",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 52,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h",
   "unique_id" : "AHardwareBuffer_Planes"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "minSwapInterval",
     "field_offset" : 288,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "maxSwapInterval",
     "field_offset" : 320,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "xdpi",
     "field_offset" : 352,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "ydpi",
     "field_offset" : 384,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "oem",
     "field_offset" : 416,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "setSwapInterval",
     "field_offset" : 544,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "dequeueBuffer_DEPRECATED",
     "field_offset" : 576,
     "referenced_type" : "type-70"
    },
    {
     "field_name" : "lockBuffer_DEPRECATED",
     "field_offset" : 608,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "queueBuffer_DEPRECATED",
     "field_offset" : 640,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "query",
     "field_offset" : 672,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "perform",
     "field_offset" : 704,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "cancelBuffer_DEPRECATED",
     "field_offset" : 736,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "dequeueBuffer",
     "field_offset" : 768,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "queueBuffer",
     "field_offset" : 800,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "cancelBuffer",
     "field_offset" : 832,
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "ANativeWindow",
   "name" : "ANativeWindow",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 108,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h",
   "unique_id" : "ANativeWindow"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "width",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stride",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 416,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 448,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "handle",
     "field_offset" : 480,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "usage",
     "field_offset" : 512,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 576,
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "type-38",
   "self_type" : "type-38",
   "size" : 96,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "ANativeWindowBuffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bits",
     "field_offset" : 128,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 160,
     "referenced_type" : "type-60"
    }
   ],
   "linker_set_key" : "ANativeWindow_Buffer",
   "name" : "ANativeWindow_Buffer",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 44,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/native_window.h",
   "unique_id" : "ANativeWindow_Buffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "ARect",
   "name" : "ARect",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h",
   "unique_id" : "ARect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "incRef",
     "field_offset" : 192,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "decRef",
     "field_offset" : 224,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "android_native_base_t",
   "name" : "android_native_base_t",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "android_native_base_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android_native_rect_t",
   "name" : "android_native_rect_t",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "android_native_rect_t"
  }
 ],
 "rvalue_reference_types" : []
}
